{"hyde-park-produce-chicago": {"rating": "4.5", "neighborhoods": ["Hyde Park"], "price": "$", "address": ["1226 E 53rd St"], "comments": {"02": {"date": [2014, 4, 2], "rating": "3", "description": "This is a really nice store and I enjoy the variety that is there however, the produce is not too consistent sometimes good and sometimes it's bad. When it comes to the other items in the grocery store they are kind of pricey...but I understand it's a small neighborhood store and I want to give back to small businesses. Customer service is nice. Overall they try to keep the store clean."}, "10": {"date": [2013, 11, 10], "rating": "3", "description": "This place is in a convenient area, and the inside looks a lot nicer than the outside leads you to believe. Produce section is actually pretty good and some of the prices in the veggie aisle are not too bad. The prices on the raw meat on the other hand? Atrocious. Place is pretty expensive for most things but there isn't much to choose from in the area with the lack of super markets and grocery stores. All in all, if you are too lazy to drive further or you don't mind spending a bit more coin, then this place is acceptable."}, "27": {"date": [2015, 10, 27], "rating": "4", "description": "Fresh produce at a decent price. Friendly cashiers. Cheese selection is astounding!Not good for packaged foods, unfortunately it's better to go to Treasure Island for that."}, "06": {"date": [2015, 1, 6], "rating": "4", "description": "So you probably shouldn't shop in the aisles Here because they obviously make their money by gouging you on grocery items. BUT! The produce is great here! And affordable! Found great deals on items that are hard to find: Serrano peppers, fennel, honeycrisp apples, and fresh herbs. Will definitely be back!"}, "14": {"date": [2014, 7, 14], "rating": "5", "description": "This place made my weekend! Having only been shopping on 55th's Treasure Island  and Open Produce, I really wanted to check out what Hyde Park Produce offers. Initially, I didn't even go in with a basket. I thought to myself I am just going to browse. However, as soon as I got in, I saw the $2.99/ lb Rainier cherries and the $1.49 for a 16oz. fresh organic strawberries. I had to read and re-read the signs to make sure I was reading correctly. I even waived down a customer service person to help me read the signs. So yes, things are cheap here. I quickly grabbed a basket thinking that I may only walk away with a few things.As I continued down the aisles, I found that the one drink that I have been looking for all summer last year in Maryland. The blueberry soda. OMG! This place carries it. I grabbed the last bottle and heard that they will stock it up again soon. So excited! So, yes this place offers really unique things. Another product that I got was the pink lady apple juice. I love pink lady apples, so we'll see how I like this drink.The deli/ cheese section is also very good. They have a good nice selection. The servers behind the counter are also very helpful and nice.I love, love this place!"}, "17": {"date": [2014, 9, 17], "rating": "4", "description": "Pros: -Large variety of produce, including carambolas (seasonal), heirloom tomatoes, dragonfruit on occasion, etc.-Most of the produce is pretty cheap, and certainly much cheaper than the chain groceries in Chicago-They have all of the basics. If you're cooking a meal from scratch, you'll likely be able to find every ingredient. -They carry some high end specialty products (e.g., non-wheat flours, stone ground matcha green tea powder, vanilla beans, gluten free cookies)-There are a few things that are better priced here than chain stores. For example, kerrygold reserve cheddar cheese is 4.29 here, but runs 5.00-8.50 at other grocery stores. Organic milk and free range omega 3 eggs are also cheaper than what you'd expect at a chain.-The staff is ALWAYS nice-They carry bread from Medici, a local bakery/restaurantCons:-It's a neighborhood market, and they don't carry a lot of national brands. If you're trying to get Cheerios and Coca Cola, you'll have to head next door to CVS-Sometimes the produce available is ready to be eaten THAT day. Just make sure you look at what you're getting and feel it for its consistency-It's a little bit small and can get crowded on weekends or after work. I avoid peak hours-There are a few products that seem more expensive here than elsewhere, such as rice. It could also be that they're selling a different quality of rice, but I'm usually just looking for cheap when it comes to rice-I once saw a block of cheese in the deli specialty cheese section that was expired. If it's a food that doesn't see a lot of turnover, check the expiration date-Meat is expensive. Then again, this has helped me keep my meat consumption down.Overall, this is my favorite place to shop in Hyde Park. For the few items that they don't carry, I can usually get them at CVS right next door."}, "16": {"date": [2013, 10, 16], "rating": "1", "description": "Horrid. What a cluster F***. Impossible to find what you need and they don't carry most regular products that you'd need. Wanted to try them out but left with more then half my list not done. Waste of time.Have to update my review. Cut open a red potato to find it ROTTEN in the middle. Totally black and disgusting. Open my shredded cheese today and it had MOLD in it. It said best by Jan 2014. I WILL NEVER GO TO THIS DISGUSTING PLACE AGAIN. I should get my money back!!!"}, "24": {"date": [2015, 3, 24], "rating": "2", "description": "This place has the tiniest selection of goods I have ever seen. You want a bag of chips, here is one brand that makes  4 different varieties. Same with the selection of cereal, dairy products, etc.  It is really only good for the necessities like eggs and milk.  Plus it is always crowded since the store is small and it is hard to find what you are looking for."}, "09": {"date": [2015, 8, 9], "rating": "3", "description": "I shop here because of convenience and nothing more. Produce quality is inconsistent and grocery items are incredibly overpriced. I'm sure the owners feel they can charge for such convenience and having such a captive audience. One of the things that bothers me the most is that many of the cashiers wear rubber food service gloves while handling money. The gloves look dirty, many have holes in them, so they are not changed out (magic gloves, if you will). Then they are handling my produce, groceries, bags etc. I get it, money is gross...but CHANGE YOUR GLOVES. Dirty gloves do not help anyone I adore supporting local businesses, but for my grocery needs, I am counting the days until Whole Foods opens down the street. Better product, more variety and definitely more helpful and customer focused staff. Also, salad bar.I will be sorry to see a local neighborhood grocery store go out of business when a large corporate vendor moves in down the street, but I feel you brought it on yourself."}, "29": {"date": [2014, 8, 29], "rating": "4", "description": "Yesssss I love hyde park produce!If you want a really unassuming, good sandwich, the deli is fresh and the staff is friendly. You also get a piece of fruit with your lunch!The produce is super cheap, but the packaged goods are really pricey. I always get my pita bread from here though--only like two bucks.THE TRAIL MIX IS JUST SO GOOD THOUGH. Seriously. I hate raisins but I love the raisins in this trail mix. I dream about these nuts and berries."}, "19": {"date": [2014, 9, 19], "rating": "5", "description": "Love this place! I zip through and get everything I need at great prices, pay the total bill plus  $3 and voila! My groceries are delivered to my top-storey walk-up!"}, "01": {"date": [2015, 1, 1], "rating": "5", "description": "I love HPP! Great produce at great prices. And the staff is helpful and pleasant."}, "30": {"date": [2015, 8, 30], "rating": "2", "description": "Huh, really surprised by the good reviews. Overall impression from shopping here all the time (due to proximity) is that while the produce section might be cheaper than the other closest grocery store in the area (Treasure Island), the quality is lacking. Fruits (esp. apples) often appear to have gone through some rough times in transport as a lot of them are bruised and scarred. Vegetables noticeably age a lot faster than produce from Treasure Island (esp. herbs). The one thing I really like is that they have Valentina Sauce, my absolute favorite Mexican salsa picante. Almost tempted to up one star, but will refrain from biased reviews."}, "15": {"date": [2014, 10, 15], "rating": "4", "description": "I LOVE Hyde Park Produce!! This small, neighborhood produce market offers fresh quality produce and a decent size selection of health foods and international foods. The staff is friendly and approachable and the prices are JUST RIGHT. They also have a nice hot bar and cold bar. Each day they have fresh sushi provided by The SitDown (next door) so you can get your quick sushi fish and KNOW that its fresh and yummy. Hyde Park Produce may not be \"as good as it gets,\" but its pretty darn close!"}, "07": {"date": [2014, 2, 7], "rating": "4", "description": "Convenient if you're just picking up a staple or something you forgot at the real grocery store. Prices seem high and they don't seem to have much outside the produce section, which is the largest part of the store. Hot bar is pretty good if you catch them early before the plantains dry out. Good service from the workers back there though. They always prompt me to try them first if they think they look a little dry. 1/3 times they were edible and delicious. Store is a navigational nightmare though."}}, "times": {"Wed": ["8:00 am", "8:00 pm"], "Sun": ["8:00 am", "6:00 pm"], "Fri": ["8:00 am", "8:00 pm"], "Tue": ["8:00 am", "8:00 pm"], "Mon": ["8:00 am", "8:00 pm"], "Thu": ["8:00 am", "8:00 pm"], "Sat": ["8:00 am", "8:00 pm"]}, "number_of_reviews": "188", "Bike Parking": "Yes", "longitude": -87.5954072695776, "Parking": "Street, Private Lot", "latitude": 41.7998676162039, "Accepts Credit Cards": "Yes", "categories": [["Fruits & Veggies", "markets"], ["Grocery", "grocery"]], "Wheelchair Accessible": "Yes"}, "greenline-coffee-chicago": {"rating": "4.5", "Wi-Fi": "Free", "neighborhoods": ["Woodlawn"], "price": "$", "Good for Working": "Yes", "comments": {"11": {"date": [2014, 8, 11], "rating": "5", "description": "The atmosphere at Greenline Coffee is wonderful. On nice days it opens up to the street, and there's a lot of wood and brick, giving it a super comforting feel. More importantly, the fare is fantastic! I had a lemon bar and a fresh-brewed iced tea, both of which were delicious, and I stole a bite of their signature waffles from a friend. They were AMAZING. The waffles are super doughy and fresh-off-the-iron warm, and I've never had anything so melt-in-your-mouth before. Over all, highly recommend the place.A total plus: I had a chat with the owners, and they make a point of hiring local kids from the Woodlawn area, as well as supporting local entrepreneurship. Love it. A++"}, "03": {"date": [2015, 1, 3], "rating": "5", "description": "Clean, spacious, excellent seating, delicious hot chocolate and a breakfast sandwich on a croissant. I'm going to be camping out here very often."}, "26": {"date": [2015, 10, 26], "rating": "4", "description": "Atmosphere - 5 Stars: The atmosphere in the cafe is great. A lot of creative people and entrepreneurs. Felt like I was at home. Food - 5 Stars: I had the chicken and steak tacos and they were delicious. The ingredients used were  extremely fresh and everything tasted homemade.Staff - 5 Stars: The staff were really nice and pleasant. Service - 3 Stars: The service was SLOW, beyond slow. My friend and I didn't mind since we were having a great time with our conversation, but a \"quick bite\" turned into our entire afternoon. It was almost two hours all together. But I guess if everything is homemade and it tastes that good it is worth the wait!We will definitely be back."}, "27": {"date": [2016, 1, 27], "rating": "5", "description": "A nice and quiet spot on the south side. Went there and ordered a turkey sandwich. Not a lot of restaurants can make a good authentic one, as easy as it should be. Plus it's a good place to network seeing as though there's a business networking center next door. Good thing I'm not too far this place."}, "20": {"date": [2014, 11, 20], "rating": "5", "description": "The waffles are so good! I also got the soup, which was delicious. The staff seemed genuinely interested in our opinions (the soup was new on the menu) and super nice. Gorgeous cafe. Warm, inviting, neither too loud nor too quiet. I'll definitely be back!"}, "07": {"date": [2015, 10, 7], "rating": "5", "description": "This is a fantastic spot. Cinnamon nut coffee cake is sinfully good, and the chai latte is nice and spicy.  They even have  caramel sauce for your coffee in case you're wanting that extra little sweetness in your coffee to get you going on a monday morning! (Or any day).  The music is a tiny bit loud, but nice jazz/soul/RB. Service is super friendly. And atmosphere is great for relaxing or even for reading (if you can do this with music). Ample street parking.The south side deserves this gem. I will definitely be a regular, even though it is out of my way to work and home!"}, "22": {"date": [2014, 8, 22], "rating": "5", "description": "A picture is a worth a thousand words and I posted about six of them. Great place to study, great place to get a quality coffee drink without paying \"Sixbucks\", long hours, free parking, sandwiches, smoothies and waffles to keep the brain cells working and free wifi. What more you could ask for? Oh wait. There's more!The sugar waffles are to die for. The batter is imported from Belgium and if you've ever tried to recreate true Belgium street waffles you know they are NOTHING like the spongy mess you get at American pancake houses. And they include nearly impossible to find in the US ingredients like pearl sugar. Why are you still reading this? Come enjoy this gem of a neighborhood owned cafe!"}, "16": {"date": [2015, 9, 16], "rating": "5", "description": "Amazing sugar waffles! Great atmosphere, with free WiFi and solid customer service. Highly recommended."}, "18": {"date": [2016, 2, 18], "rating": "4", "description": "Great space, lovely staff, delicious coffee"}, "08": {"date": [2014, 12, 8], "rating": "5", "description": "This is a great coffee shop.  They have good drinks, good food, great staff, a clean and comfortable space, free wi-fi, and a small meeting room with dry erase wall.  What more could you want?I had a great hot chocolate, delicious sandwich, and delicious waffle. I would happily get all three again.  The sandwich is $6.25 and comes with salt & vinegar chips.  It is a good deal.  The waffle is great, and apparently the batter comes from Belgium.  The large hot chocolate is huge and comes with a good amount of whipped cream on top.The staff is so friendly and helpful.  They genuinely seem happy to be there, and happy to have their customers.  I like that the sandwiches come on real plates, and that they have real silverware to go with it.  There was a group selling spa products in the meeting space, and it really highlighted what a great space it was.  They were able to put notes about the company and prices on the dry erase wall.  They had plenty of space to set up, but they were separated enough from the main seating that it was not intrusive.  It's really nice to have a space like this!I will definitely be back!"}, "30": {"date": [2015, 5, 30], "rating": "2", "description": "Came here three time already and this is my review.Drinks all come out well enough.Food always takes too long to be prepared. Every time I go, they always are out of they're famous waffles. I was disappointed with their sandwiches."}, "28": {"date": [2015, 2, 28], "rating": "4", "description": "Most definitely a fan. It's a great coffee shop with a charming, modern vibe. Great Belgian waffles -- not too sweet and perfectly crispy. I came here with a large group, and it took an hour to get my waffles. It had just opened, and they weren't expecting dozens of UChicago students to come in, so it's understandable."}, "21": {"date": [2014, 11, 21], "rating": "5", "description": "They get 5 stars for offering me a ceramic mug for tea since I was dining in. Class! Also, this place is very affordable and offers a wide selection of breakfasty food options. It looks like a great place for informal group meetings. Only worry is as a University of Chicago student carrying laptop around, since there have been a rash of robberies in the neighborhood lately I worry about tramping around off-campus. It's right down the street from where I stay in the Cottage Grove/Green Line area, but I do not feel completely safe walking to it. I am saddened by the desperation of the impoverished people in this area that creates this dangerous atmosphere. Anyway, I highly recommend this coffee shop. Maybe just take the bus to it if you have your laptop with you?"}, "10": {"date": [2014, 11, 10], "rating": "4", "description": "The best about this place? The staff. Always charming, engaging and polite. I love live the decor. Simple CHICAGO. The windows open to the outdoors, which is great for spring and summers. Mist places miss this touch.I tried to replicate the White Cloud steamer from Currency Exchange Cafe (my go-to cafe). It didn't make the cut. On a second visit I had chocolate w/a pump of pumpkin spice. It's Fall. ;). Yum! Soon I'll return to try the food and will update my review. This is a simple, no frills place with a lot of everything you want - space, WiFi, sandwiches, waffles and COFFEE!"}, "24": {"date": [2015, 3, 24], "rating": "3", "description": "I am stopping at this shop as much as I can.  I want it to thrive!  The service is a bit slow and at times it seems disorganized.  I will continue to visit and hope I'm just hitting it at bad times."}, "06": {"date": [2014, 9, 6], "rating": "5", "description": "Sugar WAFFLES, the PERFECT compliment to quality, Chicago roasted Bridgeport coffee.  These Sugar waffles, ( I did have dark chocolate drizzle atop them), but I could tell that alone, these sugar waffles were tasty all by themselves. Think of those yummy funnel cakes at Six Flags. Well, this is like a yummy funnel cake, but classier and tastier!  Airy space, perfect for chatting or studying. Much needed in the area.  Forget Ihop, get your waffles and coffee here!"}, "23": {"date": [2015, 7, 23], "rating": "4", "description": "I'm a huge fan of Greenline Coffee..the only recommendation is the slow service.  The staff has no sense of urgency. When you're dealing with corporate and business people coming in to get in/get out...it shouldn't take 15 minutes after you ordered to get an ice latte and sandwich with no one waiting with you.Overall I love the place and don't want to second guess if I have time to wait...just want to get in and get out :)"}, "04": {"date": [2015, 9, 4], "rating": "5", "description": "Great food and great service. Even just when you walk in you can smell the deliciousness from the waffles and the coffee. I came in on a hot day and ordered a mango smoothie. Highly worth it. Others in my group ordered iced coffee and the green tea frappe, as well as some treats in the case. Everyone was happy. I will definitely come back."}}, "times": {"Wed": ["7:00 am", "8:00 pm"], "Sun": [], "Fri": ["7:00 am", "8:00 pm"], "Tue": ["7:00 am", "8:00 pm"], "Mon": ["7:00 am", "8:00 pm"], "Thu": ["7:00 am", "8:00 pm"], "Sat": ["7:00 am", "8:00 pm"]}, "number_of_reviews": "31", "Bike Parking": "Yes", "longitude": -87.6130551, "Outdoor Seating": "Yes", "Parking": "Street, Private Lot", "latitude": 41.783744, "address": ["501 E 61st St"], "Accepts Credit Cards": "Yes", "categories": [["Coffee & Tea", "coffee"]], "Wheelchair Accessible": "Yes"}}