{"taste-of-the-island-tropical-juice-and-salad-bar-chicago": {"comments": {"1": {"description": "The food, juices, and shakes are EXCELLENT. One of the workers attitude is EXTREMELY HORRIBLE for no reason no matter how pleasant you are. I know it's gonna be a wait on the food because it's cooked when ordered. I get that, I'm 100% patient, but I don't need her negative energy preparing what has to go in my mouth either. I spend way too much money for that type of rudeness. I hope she's replaced soon, then, I'll go back. Until then, I'll just venture around. She needs to work at a place like ED Debevic's. Her rude attitude fits their atmosphere perfectly.", "rating": "2", "date": [2015, 8, 30]}, "0": {"description": "This place has the best jerk salads. They are made to order the way you like. Because of that they are very slow so call ahead. But the food and smoothies are great. If your not in a rush or on a short lunch break this place is a must try.", "rating": "4", "date": [2014, 12, 15]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.7371389, "longitude": -87.585942, "rating": "3.0", "times": {"Mon": ["11:00 am", "6:30 pm"], "Thu": ["11:00 am", "6:30 pm"], "Sat": ["11:00 am", "7:30 pm"], "Wed": ["11:00 am", "6:30 pm"], "Tue": ["11:00 am", "6:30 pm"], "Sun": [], "Fri": ["11:00 am", "7:30 pm"]}, "price": "$$", "categories": [["Juice Bars & Smoothies", "juicebars"]], "address": ["1522 E  87th"], "attributes": {"Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "2"}, "j-and-j-fish-chicago-8": {"comments": {"3": {"description": "J and J's Fish is a pretty good fast fried food stand. It offers fish and shrimp, along with wings and other such goodies. J and J's is still going strong despite the closing of several of the local restaurants along Stony near 87th Street. It delivers a decent product with good portions.J and J's is good. It makes and serves good fish, shrimp and wings. It is one of a dwindling number of alternative places to find food near 87th and Stony Island.", "rating": "3", "date": [2011, 9, 26]}, "1": {"description": "I've been coming here since forever and now they moved to a lot across from their old spot and it's all high tech! The new spot has large l.e.d. screens that showed the menu so nice and clear like. No more handwritten signs with the fluctuating price of catfish. The service is great as usual, with the creepy man staring at me the whole time I'm there (I only come to this place once a year and the same man creepily stares at me every time). The fish is always fried just right, never overcooked, with just enough fries and bread...and my favorite, cole slaw. Mmmmmm, so happy to have a taste of this every time I come back to Chicago, but happy I can't eat this fried food all the time!", "rating": "4", "date": [2013, 7, 4]}, "2": {"description": "Stopped by today to pick up some wings. The store only had one customer waiting. I thought I would be in and out. Unfortunately I was there longer than expected. When the lady who came in after me got her food first, I was  a little irritated. When I inquired about my order the guy behind the counter  was less than friendly. I was not happy about his reaction. My first thought was never again. When i got home I was shocked. The chicken wings were fantastic. They were  seasoned perfectly and cooked just right. I can overlook the wait and the attitude for great food!!!", "rating": "5", "date": [2015, 2, 28]}, "5": {"description": "All I can say is Harolds better watch out.", "rating": "4", "date": [2010, 7, 4]}, "0": {"description": "I ordered the catfish dinner with French fries. The fish was fried golden brown and was very crisp and fresh. The wait time was short and the restaurant was clean. I will definitely be returning in the future.", "rating": "5", "date": [2015, 3, 14]}, "4": {"description": "Seriously, they have THE BEST chicken wings in the city! I will put them up against Harold's any day of the week! The wings are reasonably priced and the service is super quick. Call ahead and if they tell you it will be ready in 10  minutes - it's ready in 10 minutes.", "rating": "5", "date": [2010, 1, 2]}}, "latitude": 41.7402, "neighborhoods": ["Avalon Park"], "categories": [["Restaurants", "restaurants"]], "address": ["8508 S Stony Island Avenue"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Good for Kids": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Good for Groups": "Yes", "Takes Reservations": "No"}, "longitude": -87.58609, "rating": "4.5", "price": "$", "number_of_reviews": "6"}, "oury-hair-braiding-and-supplies-chicago": {"comments": {"1": {"description": "I set an appointment with them on Friday through Styleseat. I received a reminder message and was all set and excited to go. I arrived at 11:02 to find the shop dark and locked up. I called the shop 3 times I'm hopes that it would forward to a cell phone. After waiting for 20 minutes I left and found a shop a block away. As I am waiting to get my hair done at the new shop, Oury calls me and ask if I can return. No I cannot but thanks. This shop is a terrible waste of time and I will not be returning.", "rating": "1", "date": [2016, 1, 17]}, "0": {"description": "I bring my daughter here to get her hair braided once a month. They are very fast and the braids are very neat. The shop is very clean and the owner is very professional. There's a lot of hair braiding places in this area but I will always come here. I highly recommend them for any type of hair braiding.", "rating": "5", "date": [2015, 2, 13]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.7476043701172, "longitude": -87.5862350463867, "rating": "3.0", "times": {"Mon": ["9:00 am", "5:00 pm"], "Thu": ["8:00 am", "5:00 pm"], "Sat": ["8:00 am", "5:00 pm"], "Wed": ["8:00 am", "5:00 pm"], "Tue": ["8:00 am", "5:00 pm"], "Sun": ["10:00 am", "5:00 pm"], "Fri": ["8:00 am", "5:00 pm"]}, "price": "$$", "categories": [["Hair Stylists", "hairstylists"], ["Cosmetics & Beauty Supply", "cosmetics"], ["Hair Extensions", "hair_extensions"]], "address": ["8100 S Stony Island", "Unit H"], "attributes": {"Hair Types Specialized In": "African-American Hair, Extensions, Kids' Hair", "Parking": "Private Lot", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes", "Wheelchair Accessible": "Yes"}, "category": "Beauty", "number_of_reviews": "2"}, "the-glow-fairy-schaumburg-4": {"comments": {"3": {"description": "Such a great experience! I'm going on a cruise and recently had a bad spray tan done. She fixed me up really well and made the perfect tan for my very pale skin. She also talked about the spray being more naturals then others, and that it has an SPF of 15 which is always good to have! Nice price too!", "rating": "5", "date": [2014, 7, 6]}, "1": {"description": "This was my first time getting a spray tan ever and im beyond pale but needed color for my friends California wedding!  Ive only heard of bad things from tanning salons and I couldn't take a risk. I found Melissa and she worked me in perfectly with her and my schedule.  She was super quick and made the whole process very comfortable and professional.  My tan on this porcelain skin looks Ah-mazing! !! I will definitely be using her again. Can't wait to post pics once the tan fully sets!", "rating": "5", "date": [2014, 5, 21]}, "2": {"description": "VERY disappointed!!! Never showed up, I would have gone somewhere else. I was going out of town for a wedding. Never have had her out before, but saw the reviews online.l Figured I could have her come out before I left town, and was able to make the appointment about a week prior. Thought if I got the spray done close to when I was leaving it could set, and still last long enough on my trip. We texted back, and forth, came up with date, and time. she was supposed to come out at 8pm.  I worked that day, and rushed home showered got all ready for her and, no call, didn't answer texts, or voice mails. I consider that VERY UNPROFESSIONAL!! I just didn't want anyone else to to go through what I did. Most events that you want to look tan at are important ones. Don't take a chance on someone who won't show up, or even have the courtesy to call. Good luck on your search.", "rating": "1", "date": [2014, 9, 3]}, "5": {"description": "The Glow Fairy gives you a stunning tan without the orange! She's on call and makes time to come and spray you! It's fast, easy, and an excellent deal!! You won't be disappointed after your spray! Skip the orange and the burnt skin in the beds! Thank you Melissa for keeping us fabulous!", "rating": "5", "date": [2013, 8, 15]}, "6": {"description": "Melissa is the best glow fairy around!! She makes you feel totally comfortable and gives you a great color(any shade), with no streaks, and all from the comfort of your own home.  She is wonderful and I highly recommend her :)", "rating": "5", "date": [2013, 8, 15]}, "0": {"description": "What can I say that hasn't already been said? Melissa's the best. She immediately put me at ease, and made my first experience SO easy. She gave me great after-care tips, and even put up with me when I had a post-tan freakout (I'm very very pale, so being tan was very foreign to me). The end result- despite my moment of panic- was gorgeous. Fair warning- you may look a little darker immediately afterwards, but there's an instant bronzer in the spray that's the culprit. Once you shower, the tan is totally natural and soft.I've recommended Melissa to everybody I know. She was affordable, fun, and produced great results.", "rating": "5", "date": [2015, 4, 8]}, "4": {"description": "As someone who is paler then pale and stays out of the sun, I was a bit scared to get a spray tan.  Melissa did a fabulous job on me and made me feel completely comfortable!  The tan didn't look unnatural or fake at all, just the perfect glow for a summer vacay!  Best part is the reasonable price and that she comes to you!  I would highly recommend the glow fairy to any friend or family member.", "rating": "5", "date": [2013, 11, 4]}}, "categories": [["Spray Tanning", "spraytanning"]], "address": ["15 Portsmouth Ct"], "attributes": {"By Appointment Only": "Yes", "Wheelchair Accessible": "Yes", "Accepts Bitcoin": "No", "Accepts Credit Cards": "No"}, "times": {"Mon": [], "Thu": [], "Sat": [], "Wed": ["6:00 am", "12:00 am"], "Tue": [], "Sun": [], "Fri": ["6:00 am", "12:00 am"]}, "rating": "4.5", "price": "$", "number_of_reviews": "7"}, "flowers-unlimited-and-gifts-chicago": {"comments": {"3": {"description": "I was recommended by Leak funeral home to use this florist. They gave me the number. I spoke with a nice woman and ordered a hundred dollar arrangement. To my surprise the flowers never came to the wake or the funeral. The woman claimed they were delivered. No money back. No flowers to the right room at the funeral home. Disappointed.", "rating": "1", "date": [2015, 5, 5]}, "1": {"description": "I ordered flowers for same day delivery through fromyouflowers.com and the order was filled by Flowers Unlimited. I was very satisfied with them. The arrangement was fresh, the delivery was on time, and the arrangement was a good value for the price. They lose a star just because a few stems could have been better placed in the vase to get the arrangement to the next level. Otherwise, it was all good.", "rating": "4", "date": [2015, 1, 15]}, "2": {"description": "I had been doing a brisk business with this company for over 20 years. Each and every occasion I would plunk down my money for overpriced flowers for just about every occasion. In all fairness, many of the arrangements were beautiful and the delivery most of the time was when requested (I can think of only one instance out of many orders when delivery was not made).  I can not think of many times when I did not spend under $200.00 several times a year on different occasions. At any rate, I'd been telling all my friends and family to take their business there . . . that is until now.My daughter asked me to place a Mother's Day order for sunflowers as a special tribute to her mother, my wife, from her and her two siblings. My immediate thought was to place the order through Flowers Unlimited. She suggested that I place an order on line. I over-ruled her and went to the store in person to place the order. I placed three different orders, one of which was the sunflowers for my wife, the others to my mother-in-law and a special order from me of roses. They assured me that they would be delivered as requested, the arrangements I chose and on time (the day before Mother's Day). The children were excited and expecting their mother to get real enjoyment out of this arrangement. But, on Saturday morning I got a call on my cell from Flowers Unlimited at which time they informed me that they could not fill my order because they didn't actually have any sunflowers. I asked why they waited until the day before to let me know, and especially since I placed the order over a week prior. They had no answer or logical response.I drove to the store, expecting to either be reimbursed for the full charge of the sunflowers, or given some discount or consideration on another arrangement. Instead, they were less than apologetic and were seemingly reluctant to even provide me a refund. I decided to consider a different arrangement since time was running out and I saw another type that might be nice. The price they quoted (a half dozen roses) was even more expensive than the sunflowers. When I balked, they simply maintained they would remain at that price without any other consideration. I told them to process the refund.Meanwhile, my daughter who still wanted to try and buy the sunflowers for her mother, placed an order online. This order was as much as 20% more than the one I placed with Flowers Unlimited in person, but we just wanted to be sure we were able to get them. My daughter placed the on-line order and called the number offered, spoke with a representative - TWICE - who assured her that sunflowers were available from the store that they work with and that they would be delivered - same day.Well, they were delivered after a few hours. But the order delivered were NOT sunflowers. The delivering store: Flowers Unlimited. When I pointed this out to the delivery person they told me to call the store and speak to \"Tony\". Apparently they close down their \"customer service\" on certain days because the call was taken by a call-taker not at the store. I explained my problem to this individual who said no one could be contacted - at 4:00 pm on a Saturday - and I would have to wait until Sunday - Mother's Day. They claimed that it was essentially my fault because they didn't have any sunflowers and they substituted what they had, yet I PAID a premium price for an article I never received - even though I was assured - both in person and on the telephone. What's more, I paid more for a delivery I should have gotten in the first place at a much cheaper price.These people simply don't have a clue. It would make sense to check your inventory before you tell a customer that you have an item in stock. As soon as you discover a shortage, it should be incumbent upon the business to contact the customer so other arrangements could be made. The same goes for telephone/online transactions. In both cases it's like it was a \"bait and switch.\" I would never do business with these people again. Even their attitude toward the customer was essentially \"take it or leave it.\" There was no indication or concern about how this might affect the plans of the customers or the person for whom the flowers were intended. I'd rather go to the local Jewel's or some other established florist instead of these folks.Business people should be truthful with the customer - anything less is a business killer. Trust is an essential when it comes to something like this. I will now be about the business of warning my friends and family to NOT do business here again. It's not worth it.", "rating": "1", "date": [2014, 5, 11]}, "0": {"description": "I've been using Flowers Unlimited for years.They do a terrific job, even on short notice.Phone orders are taken accurately and they respect your financial requests as far as limits are concerned.  Deliveries are on time.This is the place to go (or call) as the case may be when you need good flowers that look great!  They also can provide a live plant if you prefer to send one of those.", "rating": "5", "date": [2012, 6, 21]}, "4": {"description": "Received a large candy basket for V Day from them, they left it at my neighbors house two doors down, which is weird since I live in an apt building and there were people at the apt building home..... Delivery on a Sunday, 8pm. No note saying who they were from, just my name, phone number and address. I called to find out who sent this and the person at the call center had no way of telling me anything about my candy basket. I have tried to call all day today and the two numbers have been busy.all.day.long. Signed, Frustrated.", "rating": "1", "date": [2011, 2, 14]}}, "latitude": 41.73783, "neighborhoods": ["Avalon Park"], "categories": [["Florists", "florists"], ["Wedding Planning", "wedding_planning"]], "address": ["8621 Stony Island Ave"], "attributes": {"Delivery": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.58542, "times": {"Mon": ["9:00 am", "6:00 pm"], "Thu": ["9:00 am", "6:00 pm"], "Sat": ["9:00 am", "5:00 pm"], "Wed": ["9:00 am", "6:00 pm"], "Tue": ["9:00 am", "6:00 pm"], "Sun": [], "Fri": ["9:00 am", "6:00 pm"]}, "rating": "2.5", "price": "$$", "number_of_reviews": "5"}, "ambitious-nails-and-lips-bar-chicago": {"comments": {"3": {"description": "I Had A O So Fab Time Mz. Shawneka Is Very Professional The Atmosphere Is Calm & Relaxing Overall A Wonderful Experience", "rating": "5", "date": [2011, 9, 11]}, "1": {"description": "Hmmmm, very unprofessional for a person to continuously be on her phone more than attending to her clients. She'll do a bit on ur nails, then go to texting, do a little more, then more texting.  Completely inappropriate.  Has anyone ever seen the guy in there do anyone's feet or nails?  He's just in there on twitter & fb & gossiping.  I was in there a few days ago & i got a waterless manicure when i asked for a water manicure so my nails can be properly done,  cuticles were not properly done,  etc.  Definitely won't be back.", "rating": "2", "date": [2015, 11, 13]}, "2": {"description": "I love Shawneka. She is professional, knowledgeable and cares about what she does. She's very nice too. She's good at what she does and I like that she won't do anything that she doesn't believe in just for the sake of a dollar. I just can't imagine letting anyone else do my manicures/pedicures anymore.", "rating": "4", "date": [2012, 10, 11]}, "0": {"description": "Shawneka also known as Shawn. Is an excellent nail tech she is licensed and a true professional in her craft!-Shawn is a true believer in healthy nails and healthy nail care (professional products, she will educate you on the products she is using no mystery bowls or chemicals here).-Shawn stands by her work, you will not leave her shop looking a mess, she cares about what you want and is not out to only take your money-Shawn is on time with her appts and will not treat you like a number as you see in asian nail shops.-Shawn has never nicked me or hurt my hands or feet, my pedicures last for almost a month and i I didn't have to get fill ins for my nails because they grow I could go almost a month with them as well.-Shawn has the freshest and seasonal OPI, Essie, Vegan, Morgan Taylor, etc nail polishes that are fresh and pretty new.- Shawn also does dry pedicures and manicures so that the color can stay even longer.-She makes lip sticks, glosses, brow kits that are of excellent pigment and quality -She does beautiful lash extensions that looks better that those cluster ones you get with the hard ass glue at the Asian nails shops. These lash extension actually look like the lashes are growing from your eye!Most people are afraid to try an African american owned and operated business, but I suggest you try Shawn she is so professional and he customer service is top notched, Trust me! Her services are top quality! and if you check her out tell her Mary a.k.a Butterfly sent you!Check out  her style seat to see her list and prices, pics!", "rating": "5", "date": [2015, 6, 19]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.7459480464458, "longitude": -87.5866978615522, "rating": "4.0", "times": {"Mon": [], "Thu": ["10:00 am", "7:00 pm"], "Sat": ["9:00 am", "7:00 pm"], "Wed": ["10:00 am", "7:00 pm"], "Tue": ["10:00 am", "7:00 pm"], "Sun": [], "Fri": ["9:00 am", "7:00 pm"]}, "price": "$$", "categories": [["Nail Salons", "othersalons"], ["Day Spas", "spas"]], "address": ["1545 E 82nd St"], "attributes": {"Parking": "Street", "By Appointment Only": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "4"}, "misunderstood-natural-chicago": {"comments": {"1": {"description": "One of the best natural hair care salons in Chicago. Ask for Jean, Alma or Cat. This team of hair artistry are reliable, friendly, professional and fast.  I'm never in the salon more than 2 hours. Jean is my loc specialists.  I have been his client for over 3 years.  My hair is vibrant, strong and healthy.  They give the best holiday nd anniversary parties.  Yummy drinks, yummy food and sexxy fun!", "rating": "5", "date": [2012, 7, 14]}, "0": {"description": "I love my cousins shop, it is very relaxing whenever I go there to get my locs done! I wouldn't go any where else. If you need your locs done and in done in a peaceful environment, go to Misunderstood Natural Hair Salon! Let's go!", "rating": "5", "date": [2015, 4, 17]}}, "neighborhoods": ["Chatham"], "latitude": 41.7444839477539, "longitude": -87.6046371459961, "rating": "5.0", "times": {"Mon": [], "Thu": ["9:00 am", "5:00 pm"], "Sat": ["9:00 am", "3:00 pm"], "Wed": ["9:00 am", "5:00 pm"], "Tue": ["9:00 am", "5:00 pm"], "Sun": [], "Fri": ["9:00 am", "5:00 pm"]}, "price": "$", "categories": [["Hair Salons", "hair"]], "address": ["8245 S Cottage Grove"], "attributes": {"By Appointment Only": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "2"}, "thats-a-burger-chicago-3": {"comments": {"3": {"description": "They have really good big juicy burger. The fries are very well season with alot of side's and house special. The only Problem it take about 25 to 30 Minutes for anything and they never have chili at the end of day.  But the burgers are worth the wait. It's a hand made Patty that remind you of home and fries are point. Awesome place to eat. But make sure to call your order in at 3o minutes early or you will wait.", "rating": "4", "date": [2016, 1, 22]}, "1": {"description": "Get ready to wait, get ready to wait! By the time I left, I thought to myself I will never return. No hot links and No MILD sauce... Yep NO MILD SAUCE! I had to ask Grandma in the window are we on the south side or nah? lol So I ordered two polishes and fries. Thinking ordering something so simple would cut my wait time... My oh my, I waited 35 mins for 2 polishes and fried!!! Never again. I will stick with the location on 71st.", "rating": "2", "date": [2016, 1, 12]}, "2": {"description": "My husband had a burger craving and a good idea! Let's go to \"That's a Burger\" he said! I am not really a burger eater but I gave in. I called to see what time they closed and the line stayed busy! Finally, there was a voice on the the phone ready to take my order. I had NO idea what we wanted so I just checked closing time which is at 8, but they take there last order at 7:30.My husband and I decided on single burgers with cheese, grilled onions and everything. I was able to call it in after a few more busy signals. Then, we headed out. Parking sucks and there was a line. A great aroma hits you as soon as you enter. It was very nice and clean and the servers were friendly. We waited about 12 minutes for our order.Stole a few fries out the bag on our way home. They were like grandma made. Real potatoes, skin on and lightly seasoned. Couldn't wait to sit down and enjoy the burger. As I placed our burgers on plates I noticed the weight. These babies were heavy! We were both happy that we chose singles! At first bite you could tell this was hand shaped; it was perfectly seasoned, juicy! Oh my........that's a burger!", "rating": "4", "date": [2015, 10, 28]}, "9": {"description": "Made to order food requires made to order time.  The only downfall to excellent food is waiting   in the area surrounding the Restaurant.  I recall last year I was in Chicago and craving a turkey burger and the city police were standing on the corner with AR-15 assault rifles as I was leaving the restaurant. For some reason that image has not left my head. I love their food at That's A Burger, but location, location, location. I would really like to see this company expand to other areas of the country. I believe people would really love this food even if they have to wait additional time.", "rating": "4", "date": [2015, 12, 31]}, "10": {"description": "I love food, but owner/female,?would not accept my gift card because it had no name. I've used at Walgreens, she'll, mobile, cvs, et alALWAYS EXPECT 30-45 minute wait. They don't answer phone when busy", "rating": "4", "date": [2015, 10, 9]}, "4": {"description": "I love the turkey burgers here, the woman who takes the orders was pleasant. My only complaint is that it takes forever to get your food, there's no point of calling it in either BUT it is well worth it, the food is always hot and consistently good. They also have a large range of other items but I have only had the turkey burgers.", "rating": "4", "date": [2015, 12, 31]}, "6": {"description": "This location replaces the previous one on 71st Street, off of Merrill. There's still a long lead time, but they have one of THE best turkey burgers around! It comes well-dressed with lettuce, onion (grilled or raw), ketchup, mustard, mayo,tomato (if you ask), and pickles. Cheese is extra. The French fries are fresh-cut, and delicious! I ask for them to make mine crispy, and it usually turns out well. Everything is made to order, so to circumvent the 25-40 minute wait, call ahead. See? Disaster avoided. All this juicy deliciousness can be yours for under $7!", "rating": "4", "date": [2015, 9, 9]}, "12": {"description": "I give them 5 stars because their burgers are the best in Chicago!! Each burger is handmade. They do not use frozen patties. My only complaint is that it would have taken them a man hour in a half to make my burger. The lady that takes the order will inform you so that you can make a decision if you want to wait or not. Too long to wait for a burger but so worth the bite. Just not today!!", "rating": "5", "date": [2015, 9, 5]}, "5": {"description": "Would be no stars if possible food is good but owner obviously thinks it's ok to run out of numerous products and condiments for burgers (get this) at a burger joint! Funny last time they will receive my money! I HIGHLY SUGGEST NEVER SPENDING MONEY HERE BECAUSE OF THE COCKINESS I RECEIVED THEY DONT CARE ABOUT EVERYBODY MONEY!", "rating": "1", "date": [2016, 2, 2]}, "13": {"description": "Best burgers in the city. Bar none! Better call ahead though. Takes  25-45 minutes on average but worth it when that juice is running out of it.The number is actually (773)721-6777.", "rating": "5", "date": [2015, 9, 29]}, "11": {"description": "You will not find a better place on the southside for turkey burgers. This is a family owned business and the customer service is great. Because the food is cooked to order,  you should call ahead. The wait time can exceed 25 minutes. Believe  me,  it's worth the wait.", "rating": "5", "date": [2015, 10, 21]}, "8": {"description": "Fire ass burgers hands down oh you gonna wait but a must have its definitely a burger to eat on the southside its an hour wait tho so i like to call it Thats-a-burger..... That will get your ass fired l", "rating": "5", "date": [2015, 8, 27]}, "0": {"description": "I have been a customer since there were located on 71st street. In my past review, I spoke about improving their signage so that they can attract more customers. I don't know if they read my review but this is a better location. The turkey burgers are excellent. The burgers are moist, juicy, and delicious! I ordered the double turkey burger with fries.My only complaint is the long  wait for the orders. I know that quality takes time. So be prepared to wait 30 minutes. It will be worth it.PS. Parking is an issue. My advice is to park on the side street so that you can get out quicker.", "rating": "4", "date": [2015, 11, 30]}, "7": {"description": "I love this place they never let me down an they added on lots of new stuff that all is so damn good", "rating": "5", "date": [2015, 10, 28]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.7440799, "longitude": -87.58499, "rating": "4.0", "times": {"Mon": ["11:00 am", "8:00 pm"], "Thu": ["11:00 am", "8:00 pm"], "Sat": ["11:00 am", "8:00 pm"], "Wed": ["11:00 am", "8:00 pm"], "Tue": ["11:00 am", "8:00 pm"], "Sun": [], "Fri": ["11:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Burgers", "burgers"]], "address": ["8301 S Stony Island Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "Yes", "Drive-Thru": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "14"}, "image-79-salon-chicago": {"comments": {"0": {"description": "Tia, still the best stylist ever!", "rating": "5", "date": [2012, 10, 19]}}, "latitude": 41.7509689, "neighborhoods": ["Chatham"], "categories": [["Hair Salons", "hair"]], "address": ["7911 S Cottage Grove Ave"], "attributes": {"By Appointment Only": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "longitude": -87.6050873, "category": "Beauty", "rating": "5.0", "price": "$", "number_of_reviews": "1"}, "christian-fields-style-bar-chicago": {"comments": {"1": {"description": "This is my favorite shop. They have vision and just overall good vibes and energy that lead to beyond amazing styles. They keep my hair healthy and as a result it's growing like crazy. The styles are so amazing that people stop me in the streets all the time and ask me where I get my hair done. The decor of the shop is superb and there is a kitchen in the back. Another great thing is that they are flexible. I tell Chris I have a job interview and what type of company and he comes up with the most beautiful but appropriate hair style for each interview.", "rating": "5", "date": [2015, 1, 8]}, "9": {"description": "My fiancee is getting ready for medical school, and wanted a place to maintain his locks and help them to start looking more \"professional\". Ive looked up maybe 10 different salons trying to find the perfect place for him to go. Our first time here was great other than his appointment being scheduled for 11 and not being seen until 12, we live in carol stream and after and hour trip waiting an hour to see a stylist is somewhat upsetting. Other than that we ate a great breakfast in the restaurant in the back, everybody is very professional, and the salon has a nice atmosphere. We'll be back for sure.", "rating": "4", "date": [2014, 9, 16]}, "23": {"description": "Okay okay I really like this salon :) So, Christian Fields called me at my office because he found out about the debaucle that happened last weekend. He made a special color for me and Larenzo gave me the most beautiful color oh my goodness. Nia washed my hair and curled it she was very sweet and funny. Christian Fields as an owner and Larenzo as a colorist are artists. Larenzo explained each step to me and literally painted the highlights and gradient color onto my hair LITERALLY. I got five star treatment and I loved it. I didn't realize this but they also have a shop downstairs that sells shea butter and frangrance oil as well as a delicious smelling cafe of sorts on the main floor that sells made to order turkey burgers and jerk chicken.I am fasting so I didn't taste the chicken but it smelled wonderful. I did buy some shea butter and incense from downstairs and I they are wonderful.", "rating": "5", "date": [2013, 1, 12]}, "5": {"description": "I love this place and my new hair cut! After my first big chop I was worried about styles but I've been here twice for a wash & style. Leaving with fabulous twist and coils  in my natural hair. Thanks M. J, my stylist & friend !!!", "rating": "5", "date": [2014, 5, 27]}, "25": {"description": "I no longer go to this salon since my stylist is at a new location and i didn't notice other stylists doing non-lock styles. If you have locks, it definitely seems like the place to be.  It's a clean, well kept salon.", "rating": "4", "date": [2011, 7, 30]}, "12": {"description": "Go check out my boy Lorenzo. He cool peoples n he does a phenomenal wash n retwist. Shoutout to Byron for the style", "rating": "5", "date": [2013, 11, 14]}, "21": {"description": "It is often said not to mix business with pleasure. At Christian Fields natural hair salon the opposite philosophy is practiced. Christian Fields Style Bar believes in giving you the best Salon experience. Clients are treated like family at the Cottage Grove salon. Christian wanted to choose an ordinary neighborhood to do extraordinary things. By bringing a richness to the Cottage Grove neighborhood in entreprenuership and quality service, Christian has maintained a wonderful rapport within the Southside community as a hardworker and dedicated owner of Christian Fields Style Bar Salon. Christian Fields is a cornucopia for new naturally intended folk, specializing in all styles of natural hair from locks, bantu knots, fades, tapers, strawsets, coils, relaxed styles and colors. The juicebar and style lounge is a nice space for lounging and grabbing a quick meal before your appointment.", "rating": "5", "date": [2013, 3, 7]}, "16": {"description": "Okay okay I really like this salon :) So, Christian Fields called me at my office because he found out about the debaucle that happened last weekend. He made a special color for me and Larenzo gave me the most beautiful color oh my goodness. Nia washed my hair and curled it she was very sweet and funny. Christian Fields as an owner and Larenzo as a colorist are artists. Larenzo explained each step to me and literally painted the highlights and gradient color onto my hair LITERALLY. I got five star treatment and I loved it. I didn't realize this but they also have a shop downstairs that sells shea butter and frangrance oil as well as a delicious smelling cafe of sorts on the main floor that sells made to order turkey burgers and jerk chicken.I am fasting so I didn't taste the chicken but it smelled wonderful. I did buy some shea butter and incense from downstairs and I they are wonderful.", "rating": "5", "date": [2013, 1, 12]}, "17": {"description": "They take good care of me here! Love the atmosphere, the stylists are really chill and the chef is good in the kitchen!", "rating": "5", "date": [2014, 3, 12]}, "10": {"description": "I always leave here feeling great!, thanks to my natural hair styling gene Chris Fields", "rating": "5", "date": [2015, 5, 14]}, "11": {"description": "I had my locs colored and styled last week... and my style still looks good. I have received so many compliments on my new color and style! The Style Bar has such a warm feeling, staff members are friendly and professional chic! I would have never selected the style Christian did for me, however I trusted him and it came out great! I highly recommend the Style Bar... you get what you pay for!", "rating": "5", "date": [2015, 4, 27]}, "26": {"description": "This shop is great for hair designs.  That's how I came to the shop.   When I saw people with a nice design they would say Christian Fields.  The style bar is nice as well.  This is the end of the positives.The negatives are:  TIME.  I would be in there all day.  It did not matter whether I had a scheduled appt or walked in.  I would get bumped.  Even after scheduling to be the first client they ended up scheduling someone before me.  The amount of time is a big turn off.As well I was on a regular appt but had death in the family.  I tried calling 3 times...they went over to an automated system.  Noone called back.  I have also emailed them.  Noone has called back.Third they put this heavy guck in your hair made by Christian.  It's okay but just a little over the top.  It takes me several of days and sleeping on a towel for that stuff to wear off some.Last the changeover in staff.  I have had various people work on my head because they are all supposedly trained by Chris.  They come and go, get training and go do their own thing.  So it's hard to build a relationship with one person.Trendy it is but as far as customer service AWFUL.", "rating": "3", "date": [2011, 3, 26]}, "27": {"description": "After frequenting Christian Fields on several occasions, I must say...I am pleased.  I am always treated with respect by Christian and his stylists, my appointments start on time, it is a very relaxed environment, and the loc services are superior.  I wish the salon the best success for many years to come.", "rating": "4", "date": [2010, 1, 12]}, "0": {"description": "I took my fiancée in for a surprise appointment. This was her first visit to a hair Salon in almost ten years! (She does her own hair usually and a great job too). The shop seems to specialize in locs but they also do natural hair styles and weaves. When I called to set up the appointment for her, I was greeted with a friendly woman who walked me through setting up the appointment and the stylist. When we arrived we were greeted with a lively but comfortable atmosphere. No stylist were upstairs at the time and we were directed down stairs. The shop looks well maintained both up and downstairs. When we got downstairs we found out that the stylist who was suppose to do her hair was not there yet. However, all of the other stylist were friendly and one even went an extra step to contact the stylist and see where she was and when she would be there.After the stylist arrived (kinda late due to some miscommunication on both the shop and my end) she was pleasant and very apologetic. Although I did not stay, my fiancée said the experience was amazing and she would def come back. Michelle was the stylist she saw and I must say, she did an amazing job! I guess they just gained a new customer.", "rating": "5", "date": [2015, 2, 12]}, "20": {"description": "My husband and I both have locs and Dustin is our stylist.  My oldest daughter has natural hair and Candryce is her stylist.  We all have different needs.  My husband usually goes first thing is the morning in by 7am or 8am and he is back at work by 10am.  I on the other hand,  usually like my locs in intricate styles especially when I have formal events.  I am very particular about my Bantu Knots. LOL !!  Dustin does a great job and always gives me exactly what I want.My daughter is in highschool and is still learning how to take care of her natural hair. Candryce does a wonderful job interacting with her and gives her fun vibrant styles.All the stylist at the shop are well-traned and function as a team.  The food in the cafe is excellent and made fresh daily. I highly recommend Christian Fields Style Bar.  If you are on the fence about starting locs. Take the leap an head over to 65th and Cottage Grove.", "rating": "5", "date": [2013, 4, 3]}, "19": {"description": "Why have I waited so long to sing the praises of my stylist, the best locktician in Chicago?  Shahid has been doing my hair for about 6 years, and he has clearly spoiled me because I have yet to find a salon home in Atlanta.  Whenever I go home, he is one of the first people I see.Positives: 1. PROFESSIONALISM: When you have a 2pm appointment with Shahid, you are in the shampoo bowl at 2pm.  This is a man who knows how to respect your time!  He works quickly and efficiently.  Also, he is a gentleman.  Shop talk is always positive, and he is never distracted.  In all these years, never a personal call, drama, or even remotely inappropriate comment.2. Skills and products: Organic, simple recipes: no mystery products.3. Atmosphere: I've followed Shahid to a few locations, and Christian Fields is the best so far.  It is clean, well lit, and spacious.  Only one negative: No parking.", "rating": "5", "date": [2012, 6, 21]}, "2": {"description": "I don't often write Yelp reviews, but I felt particularly strongly about writing one regarding my experience with Christian Fields Style Bar.I've been trying, to no avail, to make an appointment for color for over a week. I just wanted information of whether or not I needed to give a deposit, or perhaps go through a consultation appointment, but I can't even reach anyone to advise me. I have been told that I need to speak with one specific person who hasn't returned my calls, and who has not called me back after leaving my information for her with reception. It's one of the most frustrating experiences I've had with a business in quite awhile. If I were on a tight timeline, I would have been completely out of luck.Not sure if I'll ever be able to truly weigh to verify the all of wonderfulness that people sing CF Style Bar's praises for, but I will say this - they must be doing very well, as it doesn't seem at all that they are interested in/in need of new business. Wish me luck on my journey to find a loc colorist! (I'll apparently need it!)", "rating": "1", "date": [2015, 3, 30]}, "18": {"description": "It is often said not to mix business with pleasure. At Christian Fields natural hair salon the opposite philosophy is practiced. Christian Fields Style Bar believes in giving you the best Salon experience. Clients are treated like family at the Cottage Grove salon. Christian wanted to choose an ordinary neighborhood to do extraordinary things. By bringing a richness to the Cottage Grove neighborhood in entreprenuership and quality service, Christian has maintained a wonderful rapport within the Southside community as a hardworker and dedicated owner of Christian Fields Style Bar Salon. Christian Fields is a cornucopia for new naturally intended folk, specializing in all styles of natural hair from locks, bantu knots, fades, tapers, strawsets, coils, relaxed styles and colors. The juicebar and style lounge is a nice space for lounging and grabbing a quick meal before your appointment.", "rating": "5", "date": [2013, 3, 7]}, "13": {"description": "I have been taking my daughter here off and on for around two years now.  Candryce always has her looking beautiful when I pick her up.  My son gets his hair cut there now and then.  My children are young, 8 and 10, so I'm picky about where I take them.  Barbershops especially can be rated X(tra).  I always feel great about having my children in such a diverse setting.  The people who work there and the patrons seem to be very positive.  The salon is beautiful and clean.  I love the kitchen idea, I've purchased food for my children there on occasion.  As far as professionalism I've always been treated with respect and received great customer service from the front desk.  I am about to transition out of relaxes hair and I can guarantee you I will go to Christian Fields to stay stylish while I transition.  I am about to book another appointment right now!", "rating": "5", "date": [2014, 6, 24]}, "4": {"description": "Nice salon.", "rating": "4", "date": [2015, 8, 10]}, "24": {"description": "Why have I waited so long to sing the praises of my stylist, the best locktician in Chicago?  Shahid has been doing my hair for about 6 years, and he has clearly spoiled me because I have yet to find a salon home in Atlanta.  Whenever I go home, he is one of the first people I see.Positives: 1. PROFESSIONALISM: When you have a 2pm appointment with Shahid, you are in the shampoo bowl at 2pm.  This is a man who knows how to respect your time!  He works quickly and efficiently.  Also, he is a gentleman.  Shop talk is always positive, and he is never distracted.  In all these years, never a personal call, drama, or even remotely inappropriate comment.2. Skills and products: Organic, simple recipes: no mystery products.3. Atmosphere: I've followed Shahid to a few locations, and Christian Fields is the best so far.  It is clean, well lit, and spacious.  Only one negative: No parking.", "rating": "5", "date": [2012, 6, 21]}, "6": {"description": "This place is awesome. The customer service is on point. I have been here a few times and each time the experience is pleasurable. I have been getting my hair done at natural hair salons for years in multiple states, and this is definitely an experience I have never had before. There are plenty of staff members around , providng all types of hair services, and they all work together well.", "rating": "5", "date": [2015, 3, 10]}, "22": {"description": "My last review of the Christian Fields Style Bar was pretty rough because the customer service was so bad. But then... the owner, Christian Fields, caught wind of my wife's experience and worked really hard to fix it. He offered to provide the services for free or pay for her to go somewhere else. This gesture proved to me that he does not support bad customer service and values his patrons. Which for me makes all of the difference. She went back and got the red carpet treatment and loved it. Mr. Fields you are all right with me :-)  Everyone makes mistakes... its all about how you fix them.", "rating": "5", "date": [2013, 1, 13]}, "15": {"description": "My husband and I both have locs and Dustin is our stylist.  My oldest daughter has natural hair and Candryce is her stylist.  We all have different needs.  My husband usually goes first thing is the morning in by 7am or 8am and he is back at work by 10am.  I on the other hand,  usually like my locs in intricate styles especially when I have formal events.  I am very particular about my Bantu Knots. LOL !!  Dustin does a great job and always gives me exactly what I want.My daughter is in highschool and is still learning how to take care of her natural hair. Candryce does a wonderful job interacting with her and gives her fun vibrant styles.All the stylist at the shop are well-traned and function as a team.  The food in the cafe is excellent and made fresh daily. I highly recommend Christian Fields Style Bar.  If you are on the fence about starting locs. Take the leap an head over to 65th and Cottage Grove.", "rating": "5", "date": [2013, 4, 3]}, "7": {"description": "Excellent experience. My first visit was a loc start with Kerry who appeared to be very professional, neat and knowledgeable. He made the process a breeze. The clean cozy environment provided a lot of comfort for me as well. Also, the young lady who washed my hair, Ronnie, was extremely sweet and open for discussion. Her touch was GREAT. I felt a great sense of teamwork amongst these representatives. I truly admire that. Based on the interaction I shared with these 2 and the results I saw from the loc start, I WILL be returning once a month.", "rating": "5", "date": [2015, 1, 19]}, "8": {"description": "I moved to Chicago about a year ago and was in need of a salon.  I was so use to my hair stylist in DC and was nervous to try anyone else. I asked around and was given two salons names and one of the names was: Christian Fields Salon. I went to the salon for a visit for the first time and spoke to a gentleman named Shaheed. He was very nice, polite, patient and answered all of my questions pertaining to my hair.  I left feeling as though I would give them a try soon but was still hesitant. I went back to the salon a few months later and spoke to the owner, Christian Fields.  Chris was very professional and was very knowledgeable about hair. I was impressed with his knowledge of hair from the start. He actually informed me that the last stylist that styled and maintained my locs had actually damaged them. I was shocked! I had been going to this stylist for over 5 years. He immediately explained to me how my hair was damaged, went through a step by step process of how he would rebuild and strengthen my hair back to my natural state. Almost one year later and I am still going to Chris for loc maintenance. Chris is the real deal! He has several hair licenses and certificates. He is God sent. Please try Christian Fields if you want healthy locs, fantastic styles, professional atmosphere, healthy meals and the Christian Fields experience. I have gotten so many compliments from strangers and have referred so many people to this salon. Please try them!", "rating": "5", "date": [2015, 1, 14]}, "3": {"description": "I will highly recommend this shop to anyone. Christian is very knowledge and his expertise of natural hair is top notch. I was blown away by the customer service the staff also provides.", "rating": "5", "date": [2015, 4, 18]}, "14": {"description": "My last review of the Christian Fields Style Bar was pretty rough because the customer service was so bad. But then... the owner, Christian Fields, caught wind of my wife's experience and worked really hard to fix it. He offered to provide the services for free or pay for her to go somewhere else. This gesture proved to me that he does not support bad customer service and values his patrons. Which for me makes all of the difference. She went back and got the red carpet treatment and loved it. Mr. Fields you are all right with me :-)  Everyone makes mistakes... its all about how you fix them.", "rating": "5", "date": [2013, 1, 13]}}, "latitude": 41.775341, "neighborhoods": ["Woodlawn"], "categories": [["Hair Stylists", "hairstylists"]], "address": ["6550 S Cottage Grove Ave"], "attributes": {"Hair Types Specialized In": "African-American Hair, Curly Hair, Extensions, Coloring", "Parking": "Street", "By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "longitude": -87.6062164, "times": {"Mon": [], "Thu": ["8:00 am", "6:00 pm"], "Sat": ["7:00 am", "4:00 pm"], "Wed": ["8:00 am", "6:00 pm"], "Tue": ["8:00 am", "6:00 pm"], "Sun": [], "Fri": ["8:00 am", "6:00 pm"]}, "rating": "4.5", "price": "$$", "number_of_reviews": "28"}, "hoe-toy-chop-suey-chicago": {"comments": {"12": {"description": "It was just ok!! Gwon Lee is better and it's just down the street on 87th. It's across from Walgreens and next to the black owned health food store!", "rating": "2", "date": [2012, 3, 27]}, "7": {"description": "Some of the best Chinese food in Chi-Town. Shrimp fried rice and Mongolian Chicken are my favorite!", "rating": "4", "date": [2014, 7, 19]}, "3": {"description": "It's been a while since I've visited Hoe Toy, but the food was good.  This time I stopped and picked up duck with noodle, shrimp fried rice, and shrimp chop suey. I'm still looking for the shrimp that was supposed to be in the fried rice and chop suey.  I think if you list shrimp as an ingredient there should be at least a hint or flavor of shrimp. But there was NONE!! it's safe to say I will not try this restaurant again!!  I'm giving this one star because there's no option for zero stars.", "rating": "1", "date": [2015, 12, 13]}, "1": {"description": "Shanghai lo mein combo is my new favorite. I've been coming here for about six years now. Great service", "rating": "4", "date": [2015, 11, 6]}, "2": {"description": "I love Hoe Toy. Been coming here ever since I was a kid. Love the food. The best chicken wings and egg rolls.", "rating": "5", "date": [2015, 10, 12]}, "9": {"description": "Its my favorite neighborhood chinese spot.  They just don't take credit or debit. These folks are all about cash and don't have an ATM inside either. Come prepared if you want good food cause you have to resort back to paper money.", "rating": "4", "date": [2012, 11, 20]}, "10": {"description": "Good food and prices are average. Only thing I don't like from them is the crab ragoon (fishy taste) but other than that, it's all to the good!", "rating": "4", "date": [2013, 3, 7]}, "13": {"description": "I was in the neighborhood today and stopped in an old fav Hoe Toy. I ordered the Shrimp/Lobster Sause anad to my suprise, I received shrimp/ a small amt of lobster doppings in thick brown gravy. I guess that they figured that the AA community would not know better!! Shame on them, I am returning to Chinatown.", "rating": "1", "date": [2013, 1, 30]}, "16": {"description": "This is great Chinese food better than most. No tables because it is \"take out\" Which is cool because it's good and they give you so much of whatever rice you buy they have to force the top closed. The egg rolls are fat with plenty of pork, beef, shrimp, chicken, etc. Everything I've had has been great. I've been going there for 30 years and it is still the best!", "rating": "5", "date": [2012, 2, 26]}, "17": {"description": "No one has done a review for Hoe Toy?!?!  Well, I'll be the first then.  If you can overlook the fact that you have to order your food through a bulletproof window and that they only take cash, you're in for a real treat.  The food here is REALLY good.  Seriously some of the best Chinese food in the city.  It's a hidden gem because it's not in yuppieville.  They're open pretty late and it's carryout only.  Being that they have bulletproof glass, I'm guessing they don't want people sitting in there so there's no tables.  They give you a crapload of fortune cookies too.  That's gotta count for something.  And c'mon, everyone wants to say they've eaten at a restuarant with the word Ho in the title.", "rating": "5", "date": [2007, 12, 14]}, "15": {"description": "This is best Chinese food spot on the southeast side of Chicago. They have the best shrimp fried rice. They give you nice sized shrimp and the food is seasoned just right. They only except cash that the only minus they have. Its best to call in your order to avoid a wait on the weekend. There is plenty of street parking on Stony Island.  Everytime I go there the food has been consistent.", "rating": "5", "date": [2010, 3, 10]}, "0": {"description": "Haven't been here since I moved from South Chicago in 2011 but the food here was seriously good! Yeah, the place is a little \"hole in the wall\" but that's where you get the best food! It's small and there aren't any places to sit down but don't let that stop you from going. Get your food, get out and enjoy!", "rating": "4", "date": [2016, 1, 18]}, "5": {"description": "How I use to love this place until I had to file a missing report on my shrimps in my fried rice.  Being that finding a good Chinese Restaurant on the southside of Chicago is like finding a needle in a haystack, I have always opted for Hoe Toy...until they toyed with my food!I don't expect to find a shrimp fest in my fried rice, but I do expect \"some\" - more than 5 shrimps to reside in Fried Rice Town!!!However, the staff is always friendly - but I want my fried rice to be shrimp-friendly as well!  (Can you tell I feel some type of way about the disappearing shrimp? - lol)", "rating": "3", "date": [2014, 8, 3]}, "11": {"description": "Someone said to order from here and when I went to go pick up the food, I was absolutely disgusted by how dirty the entry door was and the inside was no better.  Filthy!  Not sure how anyone would feel comfortable eating from an establishment that has no signs of cleanliness - I certainly cannot. Try Kams on 83rd/Dan Ryan.  Clean establishment, good food (and tons of it) and friendly people.", "rating": "1", "date": [2013, 8, 17]}, "8": {"description": "Hoe Toy is a good Chinese food place to have around the corner. The prices make sense, and my favorite dishes are the Mongolian beef and shrimp and broccoli.  The people that work there are friendly, and the food doesn't take too long.  Downer cash only lol. Otherwise, if you're in the area get some Hoe Toy", "rating": "4", "date": [2014, 8, 3]}, "4": {"description": "For neighborhood Chinese food, this isnt bad at all. The prices are affordable and they give you a lot of food. I have no idea why they charge you for extra sauce packets, but whatever...everyone's gotta make a buck, I guess :) its best to call ahead as they take some time to get your order together. But i like having my food made to order as opposed to sitting on some heat lamp all day.", "rating": "4", "date": [2015, 4, 19]}, "14": {"description": "This is not the place it used to be in the 90's and early 2000's. The flavor of this food has gone completely down the drain. The shrimp fried rice used to be so flavorful with just enough oil. Now it's dry and flavorless. The orange chicken... ewe! It had too much of a tangy after taste and the pineapples do not mix well in the dish. The crab Rangoon was also disgusting. It was too chewy and it had a weird old fish taste in it. I miss the days when Hoe Toy trumped over all the Chinese restaurants on the south side. Those days are clearly over.", "rating": "1", "date": [2010, 12, 31]}, "6": {"description": "I thought this place had good chinese food. I had order from here several times in the last couple of months until one day when i ordered a large shrimp egg foo young my food was not all the way cooked through.  The egg was running in the inside of the patty. I returned it back to the restaurant and there was someone else was there with the same problem demanding their money back as well.  No more eating there for me.", "rating": "1", "date": [2014, 8, 15]}}, "latitude": 41.7392488, "neighborhoods": ["Avalon Park"], "categories": [["Restaurants", "restaurants"]], "address": ["8559 S Stony Island Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Quiet", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Ambience": "Casual", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Dinner, Late Night"}, "longitude": -87.5850853, "times": {"Mon": ["11:00 am", "11:00 pm"], "Thu": ["11:00 am", "11:00 pm"], "Sat": ["12:00 pm", "12:00 am"], "Wed": ["11:00 am", "11:00 pm"], "Tue": ["11:00 am", "11:00 pm"], "Sun": ["11:00 am", "11:00 pm"], "Fri": ["12:00 pm", "12:00 am"]}, "rating": "3.0", "price": "$", "number_of_reviews": "18"}, "glo-on-braids-and-natural-hairstyling-chicago": {"comments": {"3": {"description": "This is my first time reviewing the company. The people who run it are nice but this is about their business.I have only been to Glo On Braids twice and unfortunately I won't be returning because they are getting too expensive. Don't get me wrong, they do a good job on the hair but I am not made of money and at some point you have to question what you are really getting for your money. The first time I went the cost for mid back Senegalese twists was $200 in September or October of 2013. The cost for the same hair-do in February 2014 is $250 which is now really out of my price range. I understand that prices have to increase for inflation but a $50 increase is ridiculous. Now I don't have a lot of experience with getting my hair braided/twisted  and so I went with Glo On because they had really good reviews. Everyone seems to have an opinion of what makes a hair braider good and all I knew was that this place had good reviews and they weren't too difficult to get to. Something else that bugged me besides the price was willing to write off is the experience. When you have someone sitting in a chair for up to 6 hours and the client is paying you a lot of money I think it is courteous to offer them refreshments such as water and it also can't hurt to apologize if you are delayed by something.The last time I went I think that my spot was overbooked because at one point there were 3 people at once waiting to have there hair done including myself (though she did have an assistant). At some times I was left sitting waiting for long periods of time because she was working on other people. Shavon started doing my hair at 9:30 but I didn't get out of her office until 6pm. It is in the south loop off of Wabash and Roosevelt Road.I don't have a lot of experience with hair braiders so I thought I had found a winner that I would return to for years to come. That all changed when she increased her prices. I recently found an alternative that I can use next time who can do it for much cheaper for the same result.", "rating": "3", "date": [2014, 2, 19]}, "1": {"description": "I had a great experience at Glo On and will be returning to her for braids in the future. Shavon was pleasant and we had friendly conversation. I didn't get my hair washed and tried to blow dry it but I do wish it was blown out more because my hair (which is kinky curly) cam be seen through the braids. I know for next time to get it washed/blown out there.Other than that, I love my braids and the location is SUPER convenient, in the south loop. I'll be back!", "rating": "4", "date": [2015, 12, 18]}, "2": {"description": "I was happy to be in Shavon's chair again. I love my yarn twists. The atmosphere is peaceful and easy to relax in. Shavon truly works her magic and takes care of your hair.", "rating": "5", "date": [2015, 3, 8]}, "5": {"description": "My cousin has been natural for almost 10 years but never went to a professional stylist. She was getting married and I insisted that she have her hair done professionally. We went to 3 consultations. Glo On won hands down! They we're very patient during the free consult and used her hair to show samples of different styles they could achieve. Upon leaving they set up a tentative appointment with us in their computer system and said they would follow up to see what we decided. We had a horrible experience at another natural hair salon named Chatoo, which charged us a consultation fee knowing they wouldn't be available for the date we needed the hair done and the simple style we requested was going to cost a ridiculous amount. We hurriedly left and finally confirmed our appointment with Glo On. From that time on they were constantly in communication with us. They confirmed different hairstyles and hair accessories. The appointment they gave us started exactly on time and they finished 2 hours earlier than the initial estimate. But with the speed they did not sacrifice the quality. The hair turned out beautiful!! It was exactly like our vision and the price was so reasonable. Thank you Glo On for a wonderful experience. We will be back!", "rating": "5", "date": [2011, 9, 9]}, "6": {"description": "I had a great experience today. I moved from CA looking for someone to do loc maintenance with a latch hook for micro-locs and Glo On came to the rescue. The products smelled great, the conversation was friendly, and my hair looks great!", "rating": "5", "date": [2013, 1, 5]}, "7": {"description": "Customer service SUCKS!!!!! I had a consultation with Shavon and was very excited about getting my hair done...After the consultation, I got no response from her. I called and left a message on her VM then I reached out to her on Facebook - NO RESPONSE. What I found funny is, FB will let you know when a person reads your messages and needless to say she read my message 20 minutes after I reached out to her. I'm very glad that I didn't purchase the hair from her ($200), because I would be stuck in a rut being that she won't return calls. Good luck to anyone needing to get their hair done by her, I guess she's too busy for new clients.", "rating": "1", "date": [2013, 7, 29]}, "8": {"description": "I have been going to Glo on Braids for about 6 months now and will look no further for anyone else to care for my hair. Shavon is every efficient and works at a speedy rate. She braids very neat and does not pull tight. I have been consistently getting my hair braided for 6 months and still have strong healthy edges. Shavon does a beautiful job and I recommend her for natural hair care and styling services.", "rating": "5", "date": [2013, 2, 28]}, "0": {"description": "Shavon is my go to natural hair stylist because she is creative and gentle. She's the best around in my opinion.", "rating": "5", "date": [2015, 10, 18]}, "4": {"description": "\"I really enjoyed my visit to Glo On Braids. The environment was relaxing and my finished style looked great. My braids were neatly done but not too tight such as my past experiences with braided styles. I will be a returning customer. Thanks Shavon for a job well done!", "rating": "5", "date": [2013, 4, 15]}}, "neighborhoods": ["South Loop"], "latitude": 41.8683815, "longitude": -87.6263504, "rating": "4.0", "times": {"Mon": [], "Thu": ["9:00 am", "5:00 pm"], "Sat": ["7:00 am", "7:00 pm"], "Wed": ["9:00 am", "5:00 pm"], "Tue": ["9:00 am", "5:00 pm"], "Sun": [], "Fri": ["9:00 am", "5:00 pm"]}, "price": "$$", "categories": [["Hair Extensions", "hair_extensions"]], "address": ["1130 S Wabash"], "attributes": {"Hair Types Specialized In": "African-American Hair, Extensions", "Parking": "Street", "By Appointment Only": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "category": "Beauty", "number_of_reviews": "9"}, "jamaican-jerk-palace-chicago": {"comments": {"3": {"description": "If I could give zero stars I would.  I ordered oxtails and had high hopes they would be good.  Unfortunately they were scorched and pitch black in color.   I really wish I had checked my food before I left.  My destination was too far for me to go back with the food.      I don't understand how whoever prepared my food even gave out food in this condition.      I will NEVER go back.", "rating": "1", "date": [2015, 9, 29]}, "1": {"description": "Finally a jerk spot that is on point not named Jerk Villa. This is a Hidden gem on the south side of Stony!", "rating": "4", "date": [2016, 1, 24]}, "2": {"description": "Okay...... Now after Jamaican Jerk Villa 2 on State/Cermack burned down late last year I have been looking for a back-up!. Just can't get to 79th easily and keep hearing horror stories about the lines now......So a co-worker mentioned them to me and she compared it to good Ole Jamaican Jerk Villa (which I got her hooked on). She said they were very good and had just had them not too long ago. Well, I called it in and was told 15 minutes.  I gave it extra time as we know you have to especially working with Villa all these years!.I get there and it's ready, heavy and wrapped!!!!  I was VERY surprised, like WOW!.... Okay...great start. I get it home after a long ride home. I open it and it's PIPING HOT!!... \"Oh Snap\"!!.... (In my Carl voice)!.... Man LISTEN........ I tore  a freakin hole in that food. Dang NEAR gluttoned myself.... I was like, \"This taste like freakin Villa.\"I told my guy Tone about the place, him and his wife went.  They bof not \"both\" (B.O.F.) TORE THEIR'S UP!!.... So the next time I go, I get my order, everything goes the same way as last time. It's ready and I'm on-time. Upon leaving I see a bottle of Villa seasoning in the window. I was like, \"Yup, it's Villa\". The only difference is the how the chop their cabbage and the gravy for the rice and beans. The cabbage is still on-point. The gravy is a little different but still good.I paid them yet ANOTHER visit a couple of weeks ago and saw my man working. He used to grille the chicken at the original Villa. In fact Tone told me he seen him in the back when him and his wife came. He remembered me, I asked him about everybody at Villa and they are actually all family and STILL doing great. I recently sent my sister there for some catering.Outside of original Villa on 79th street and Cermak/State and forthcoming 22nd and Michigan Ave. THIS IS HANDS DOWN MY GO-TO!!.. Word-Is-Bond yo, it is a GO!.Goneee.............-JV", "rating": "5", "date": [2015, 6, 10]}, "5": {"description": "OMG...soooooo good!huge portions..friendly staff..great food..great prices..its 13 miles and 2 buses for me to get there and worth every minute! So Sorry, Mr. Browns Lounge...take lessons from Jamaican Jerk Palace !!", "rating": "5", "date": [2015, 8, 8]}, "0": {"description": "My husband was hesitant to try this place because he only goes to Jerk Villa and Uncle Joes, but it's close so we gave it a try. Love it!!!The food is good, they are pretty quick getting it out!", "rating": "4", "date": [2015, 11, 14]}, "4": {"description": "BEST jerk on the SouthSide!!!! Ordered a pan of chicken for a party recently and everybody wanted to know where I got it from. The price is right and the service has gotten faster since they opened.", "rating": "5", "date": [2015, 11, 12]}}, "latitude": 41.7392616, "neighborhoods": ["Avalon Park"], "categories": [["Caribbean", "caribbean"]], "address": ["8554 S Stony Island Ave"], "attributes": {"Take-out": "Yes", "Outdoor Seating": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.5858688, "category": "Restaurants", "rating": "4.0", "price": "$$", "number_of_reviews": "6"}, "d-fashion-nails-chicago": {"comments": {"3": {"description": "I really liked my experience here. I got an SNS dip manicure on Monday and it's still looking great (highly recommend these over no chip if you have thin nails). The tech was wonderful and fixed up one of my broken/cracked nails without having to put a tip on it and it's still holding up beautifully. It's not exactly the fanciest nail place, it is a little cluttered, they don't offer water, soft drinks, etc. but places that do SNS manicures are few and far between. I'm going to go in for a pedi tomorrow and see how it goes. I normally go to Cuticle in Uptown, a very impeccably clean, chic salon, but just moved to the south side and love dip manicures a lot more than no chip.", "rating": "4", "date": [2015, 10, 7]}, "1": {"description": "I was looking for a place in the area and noticed this spot from the street. I went in just to check out the environment and I can say I was happy that it was very inviting and above all clean. I would of loved to stay for a mani and pedi but I needed a quick manicure for an event in a few hours. I was seated immediately and they have an awesome selection of colors. I look forward to going back and making this my south/Eastside go to.", "rating": "4", "date": [2015, 11, 29]}, "2": {"description": "Nice salon. Has all the necessities with a great variety of services. The staff there is really friendly and their work has made me a loyal customer whenever I'm in town. I tried the SNS manicure for the first time and, again, I've been converted. It's remarkable. I highly recommend this salon. If you're in a rush, however, don't go on the weekend. They don't accept appointments Th-Sat and are quite busy.", "rating": "4", "date": [2016, 1, 1]}, "0": {"description": "I love this nail shop and it was my first time going there. It is very clean and you don't smell fumes at all. The shop is airy and bright. They use OPI products which are my favorite. Lyn did my nails and we discussed politics and Donald Trump. Lol. My nails are immaculate and not thick at the ends. Lyn gave me a card to fill up 10 times and then I would get a 10.00 discount. I hope I can add my pictures so that you can see for yourself what an excellent job she did. This is my new nail stop and I highly recommend you going there. Now you may wait a little bit but it's well worth it.", "rating": "5", "date": [2015, 11, 24]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.7475471496582, "longitude": -87.5862655639648, "rating": "4.5", "times": {"Mon": ["10:00 am", "7:30 pm"], "Thu": ["10:00 am", "7:30 pm"], "Sat": ["10:00 am", "7:30 pm"], "Wed": ["10:00 am", "7:30 pm"], "Tue": ["10:00 am", "7:30 pm"], "Sun": [], "Fri": ["10:00 am", "7:30 pm"]}, "price": "$$", "categories": [["Nail Salons", "othersalons"]], "address": ["8100 S Stony Island Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "4"}, "real-rootz-chicago-chicago": {"comments": {"3": {"description": "Overall, it was a great experience. I called the night before and was able to come in the next day. Kevin (owner) and Terrell, the loctician were friendly and very professional. I enjoyed the music and there are good places to eat close by, if you get hungry. I do plan on returning.", "rating": "5", "date": [2015, 9, 4]}, "1": {"description": "The staff here is very very friendly. The shop is also easy to find. I got my hair done but the twists were just way too small and my hair was a little on the greasy side. It also took hours to do my hair which isn't expected for two strand twists. All in all, I would still recommend this establishment to people.", "rating": "3", "date": [2016, 2, 15]}, "2": {"description": "My first experience was a great experience.  I called on a late Friday afternoon hoping (fingers crossed) that I would be able to get an appointment the same evening.  The owner, Kevin, was determined to get me seen and worked his magic!  Twenty minutes later, I was at the salon asking for Will.  Will did a fantastic loc maintenance and style for me. His technique is amazing.  It was also a pleasure speaking with him during my service.  Nice spot.  I will definitely return!", "rating": "4", "date": [2015, 9, 19]}, "0": {"description": "So far so good on my first visit. I spoke to the owner who was extremely helpful and friendly to get me an appointment with the loctician of my choice. The salon is warm and inviting with good music playing... Plus there is parking!!!! 4  stars so far... I'll review again after my Locs get some much needed love!!!!", "rating": "4", "date": [2015, 9, 20]}, "4": {"description": "I get my locs professionally done by Will Williams. A lot of these experienced locticians are Christian fields alumi's.Nice music , nice amosphere. Your locs will be reborn once you let Will hook you up.", "rating": "4", "date": [2014, 10, 17]}}, "neighborhoods": ["Grand Boulevard"], "latitude": 41.8094795197248, "longitude": -87.6136580854654, "rating": "4.0", "times": {"Mon": ["7:00 am", "9:00 pm"], "Thu": ["7:00 am", "3:00 am"], "Sat": ["7:00 am", "3:00 am"], "Wed": ["7:00 am", "3:00 am"], "Tue": ["7:00 am", "3:00 am"], "Sun": ["7:00 am", "3:00 am"], "Fri": ["7:00 am", "3:00 am"]}, "price": "$$", "categories": [["Hair Extensions", "hair_extensions"], ["Hair Stylists", "hairstylists"]], "address": ["500 E 47th St", "Ste 1N"], "attributes": {"Hair Types Specialized In": "African-American Hair, Curly Hair, Perms, Extensions", "Parking": "Street, Private Lot", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Accepts Bitcoin": "No", "Good for Kids": "Yes", "Wheelchair Accessible": "Yes"}, "category": "Beauty", "number_of_reviews": "5"}, "deluxe-tattoo-chicago": {"comments": {"58": {"description": "I got my tattoo here over a week ago by Zach Stuka. This was my very first tattoo and the only shop I checked out. Zach is really great and easy to work with! I didn't really have a picture in mind, I just told him what I wanted, how big, colors, etc. I didn't see the final design until the day of, but what he created was perfect and was exactly what I wanted! He was also very helpful with the aftercare process too. I had to wait about a month before I could get it done because he was all booked, but it definitely was worth the wait. Everyone here is so nice and approachable. Definitely the place to go to get a tattoo.", "rating": "5", "date": [2014, 9, 22]}, "56": {"description": "Before there were camera phones, before the iPad, before selfies, before hybrid cars, I won $200 on video poker slots (when they still paid out in change) and got my first tattoo.  Admittedly, it was a tramp stamp.  Admittedly, I did shots of tequila to give me liquid courage.   At that time, I fell for the \"tattoos are addicting\" and got another set of tattoos next to the first tattoo when I was at a tattoo convention.  I almost passed out in front of thousands of people.Needless to say, I was hesitant to get another because I didn't know what I wanted.   Fast forward 13 years, and I was ready.  I knew what I wanted, mostly on the where, and was recommended to Deluxe by a few people.  I initially had considered a different artist, but Troy was available when I wanted to go.  He was very patient with me while we worked out where it would go, how it was going to look, and what font I wanted to use, and was done within an hour.  I am very happy with my new tattoo and will going back to Troy for my next one.Why one less star?  Because I contacted the other artist via email, and needless to say, the response was a rather curt \"just call to set up a consultation.\"  I think it should be clearer on the website who needs consultations, what their hours are, etc.  Just a thought.", "rating": "4", "date": [2014, 10, 13]}, "29": {"description": "My current artist is Jason Longtin. He is the only artist who has worked on my ink at Deluxe Tattoo - and though I would trust almost every artist employed here given their excellent portfolios - I will continue to get my ink done by Mr. Longtin, for as long as I can. His sketching is phenomenal and his outline and shadowing work is unlike anything I've ever seen. His attention to detail is eerily fascinating and his dedication to the job is outstanding. For my second inking, he took up on a cover-up that (too) many shied away from - and has not only done amazing work, but surpassed all expectations as well. Furthermore, he is always more than willing to listen to your ideas and concerns and will brainstorm with you until his design meets his standards and yours. Thanks Deluxe for being my ink home in Chicago! 'Til next time.XoXo", "rating": "5", "date": [2015, 7, 18]}, "42": {"description": "I think a lot of ppl that comment saying they arent treated well, felt ignored and judged etc just have confidence and self esteem issues. Every time I walk in here at least 3 or 4 people greet me. Most tattoo artists have been working on their craft before tattoos were a mainstream phenomenon. I dont feel sorry for ppl following a craze that know nothing about the culture but think that they arent treated with the utmost respect. you dont know shit. Dont cry like a baby if you cant get exactly what you want. listen to the artists they know what they are talking about. Good tattoos are expensive. Dont be cheap tip 20% - 30% at the least.  ok on with the review.. best tattoo shop in Chicago I recommend ZACH STUKA who has tattooed me 4 times 2 coverups. Tons of talent here I would say check out the Instagram page to find which artist matches the style you want. Every 1 in here is cool I'm always cracking up listening to them. Awesome artwork everywhere. Clean as hell. great music and fair pricing. Go to Deluxe Tattoo.", "rating": "5", "date": [2015, 5, 4]}, "23": {"description": "Loved my experience. Went in with my friend yesterday for her appointment to see if they could take me as a walk in and they were very friendly and courteous. Troy did my tattoo and was so great. He's amazingly talented! I showed him one picture of the outline I was thinking and one of the type of shading I wanted. I wasn't too sure with my wording since it was my first tattoo. He took my simple suggestions and came back 10 mins later with exactly what I had in mind. He made sure I was completely satisfied with sizing, placement etc before he started. He made sure I was at ease and knew to breathe normally and whatnot. Again, this being my first tattoo I was extremely nervous and he was very nice about it and it was over before I knew it. He took his time and was very detailed and thorough with after care instructions. It was around 20-30 mins total. Overall the shop was organized, clean, and friendly. I'm absolutely thrilled with my first tattoo and think it turned out beautiful! I would definitely recommend the shop to anyone looking for a good quality tattoo and would absolutely go back to Troy for another one!", "rating": "5", "date": [2015, 8, 28]}, "47": {"description": "Awesome place to get a tattoo. Very friendly and professional staff. I worked with Jimmy and he was very patient in getting the tattoo aligned and sized just right.Highly recommend going here to get your tattoo.", "rating": "5", "date": [2015, 2, 9]}, "8": {"description": "My current artist is Jason Longtin. He is the only artist who has worked on my ink at Deluxe Tattoo - and though I would trust almost every artist employed here given their excellent portfolios - I will continue to get my ink done by Mr. Longtin, for as long as I can. His sketching is phenomenal and his outline and shadowing work is unlike anything I've ever seen. His attention to detail is eerily fascinating and his dedication to the job is outstanding. For my second inking, he took up on a cover-up that (too) many shied away from - and has not only done amazing work, but surpassed all expectations as well. Furthermore, he is always more than willing to listen to your ideas and concerns and will brainstorm with you until his design meets his standards and yours. Thanks Deluxe for being my ink home in Chicago! 'Til next time.XoXo", "rating": "5", "date": [2015, 7, 18]}, "31": {"description": "I got my first tattoo here and Troy Taylor did a great job of helping me to design exactly what I was looking for. I would recommend his work to anyone. Very professional.", "rating": "5", "date": [2015, 7, 7]}, "34": {"description": "This shop is wonderful.. Bunny was my artist and he did a phenomenal job.. With over 13 years of experience he is gentle handed , very professional down to earth, great at placement quick and talented..He listened  very  well to what I wanted and gave very professional  opinions. . I also like that he made fine lines to make my piece delicate to flow with my other tattoos. .His prices are very reasonable too. Everyone at deluxe was very friendly,seemed to like to be at work and busy.. The shop was very clean and the receptionist was friendly... I am very pleased with Bunny's work and will be back!! :) :)", "rating": "5", "date": [2015, 5, 18]}, "16": {"description": "My brother and I went in to get tattoos today. Everyone was extremely helpful. Jim was our artist he was a great listener and a talented artist. He had us in and out in no time. We both are extremely happy with our tattoo I would recommend Deluxe and Jim to anyone!", "rating": "5", "date": [2015, 11, 27]}, "13": {"description": "Got a tattoo here from Stephanie and had an awesome experience. The shop is clean and comfortable. Stephanie was easy going and accommodating from the day of the consultation. She worked with me very willingly on the design and the finished product looks absolutely gorgeous. I will absolutely be going back to her in the future.", "rating": "5", "date": [2015, 12, 5]}, "11": {"description": "I came here after the recommendation of some friends when my friend and I were planning to go get a tattoo. The staff were incredibly friendly and welcoming right as we walked in. I had an idea of what I wanted and came in with a few designs that I wanted to pull bits and pieces from for a new, original piece. My artist drew up a design and we got going. The whole process was easy and I felt very comfortable the entire time. Everything was super clean and all my needs were accommodated. It's been about a week and the tattoo is healing perfectly. Will definitely be back!", "rating": "5", "date": [2015, 12, 8]}, "39": {"description": "My last tattoo was about 8 years ago, in Savannah, GA. So when I decided it was time to get some new ink in this area, I asked some good friends where they acquired their fantastic ink. \"Deluxe Tattoo\" they said, and pointed me in the direction of the great Ben Wahhh. Ben was great to work with, from start to finish. Actually, I can't say that, because we're not finished, but... from start to mid point. =) I'll be coming back for more, don't worry. Anyway, we set up the initial consultation and I gave him my ideas, and we set a date some time in the future so I could save my pretty pennies for this piece. I am a woman with a budget, after all. Then, disaster struck, winter arrived and the annual furnace breakdown occurred. Ben was super understanding for my need to reschedule for, yet again, a date pretty far off in the future. By the time May rolled around, we had another consultation. For a minute I thought it had been so long that he had forgotten who I was and what I even wanted, but he had not! He even had my original pictures I had brought him 8 months earlier! We hammered out the details and I (impatiently) waited one week for the big day.  When I walked in the door, a walk in was going just ahead of me. Worry not, ladies and gents, because it was the fastest tattoo I've ever seen done, (and I assume it looked nice because the girl looked quite happy) and I was back in the chair in mere minutes. He showed me the amazing art he had drawn for my piece and I was blown away. Simply amazing. I'd show you a picture of it, but it's currently in that \"peely\" stage and I'm not going to let my skin healing mar Ben's reputation. Even in the state that it's in currently, (and also unfinished) I have gotten so many compliments on it. I know when it's completely colored in that I am going to have a piece that I will treasure always. You know because it's on my body permanently, but more importantly because it's fucking amazing. I had the chance to \"people watch\" the other artists and customers for the 3.5 hours I was in the chair, and all the artists seemed like cool people who would be able to give you a piece you're proud of. I watched one guy, whose name I didn't catch, pretty much freehand the most realistic elephant I have ever seen in my life.  This isn't to say Ben's not much for conversation, but I'm a socially awkward gal and totally suck at small talk, so I chose to spend my time checking out the art that covers the walls and  taking a peek at what other people were getting done. I guess I'm saying, unless you have any skills at running a conversation you're golden, but if you're a shy person like me, maybe it would behoove you to bring a book or something.I ramble. Anyway....check them out. Highly recommended.", "rating": "5", "date": [2015, 5, 5]}, "37": {"description": "I got my first tattoo done here a week ago. I did my research on tattoo shops in Chicago and from what I seen and heard, this is the place to go. I wasn't disappointed. Everyone was professional and really attentive. The shop was well managed and very pristine. Stephanie White worked on my tattoo and did a awesome job on the line work and blending. As an artist myself, I could tell she had a great eye for detail and really treated the piece as a work of art. This is the standard to which I will judge all other tattoo shops.", "rating": "5", "date": [2015, 5, 10]}, "0": {"description": "i'm old school in pretty much everything i do and i don't abide pretentiousness or hipster bull shit. since i've not been in a tattoo shop in more than 20 years i was concerned i'd be faced with exactly that. for me it was essential that i have an artist who was committed and had his own thing but who also understood that the old flash deserves as much respect and attention as any new designs do. my artist was ben wahhh. he filled the bill.my sailor jerry pin up girl was getting a little worse for wear and tear as she was done some decades back. ben suggested we refresh her as she would be right next to the new piece and we didn't want her looking tired by comparison. as i was batting around a few ideas for the new one he patiently helped me settle on a just the right classic. he took plenty of time helping me decide on placement and size. it seemed just as important to him as to me... good guy.the shop is big and clean and full of action and good vibes. the staff seemed to like each other and it was a very pleasurable couple of hours. i love my new tat and my refreshed pin up girl is better than new. way better.thanks ben!", "rating": "5", "date": [2016, 1, 26]}, "38": {"description": "Ben did an amazing job on my tat! The staff is friendly, the facilities are clean and flawless -  I wouldn't go anywhere else.", "rating": "5", "date": [2015, 5, 9]}, "51": {"description": "Best tattoo shop in Chicago hands down! I met with Ben a couple months ago for a consultation. He shot me straight and was very upfront with what he could and couldn't do. I find this refreshing, most places will always say yes and do what they can to take your cash. My tattoo was unique, Ben had to tattoo over some scar tissue from a long time ago. The design was executed flawlessly, it actually came out way better than I expected! The shop was in great condition and I loved the vibe between all the artist. It was an awesome distraction from the pain of the tattoo. This is the best place in Chicago without a doubt, I recommend everyone go to this shop!", "rating": "5", "date": [2015, 1, 9]}, "27": {"description": "Stephanie White was my artist. I sent her a rough sketch of what I wanted done and she cleaned it up and spent a lot of time on my idea making it perfect and I couldnt be happier with the final results. She is very nice and professional. I highly recommend this place to get your tattoos.", "rating": "5", "date": [2015, 8, 16]}, "32": {"description": "Bens done an amazing job of pulling together an A Team of tattoo professionals. The talent in the room was inspiring and my tattoo experience couldn't have been better.  Thanks Ben, see you again when I make it back to Chicago.", "rating": "5", "date": [2015, 7, 6]}, "54": {"description": "First make an appointment and send ideas of the work you want to the artist ahead of time.Got work done with Stephanie and she was amazing to deal with.  She did a great job on the line work, was awesome on making sure I was ok and at ease for my first tattoo.  I highly recommend Stephanie and I already booked my next appointment.", "rating": "5", "date": [2014, 12, 10]}, "48": {"description": "I had Jim Little for my first tattoo! And he was superb! He was nice and did a great job on my four inch writing quill tat. I had a nice convo with him during the process too and he was super awesome! Plan on coming back for another in the future :)", "rating": "5", "date": [2015, 2, 8]}, "44": {"description": "Me my family and my friends have been coming here for years and they do outstanding work.  Ben the owner and my artist always takes care of me and does awesome work.  Wherever I go I always get asked where I get my work done because it is very detailed and stands out.  When you walk in it is very clean and someone will always take care of you.  They also have many great artists as well.", "rating": "5", "date": [2015, 5, 3]}, "24": {"description": "I went to Stephanie White at Deluxe Tattoo for my first tattoo, a triple arm band around my forearm, and she did an absolutely amazing job! She was very professional and attentive to my requests, helped select the perfect shade of green from about dozen options she had on hand, and provided expert consultation on the thickness of the bands and black outline. She was incredibly patient and precise with the placement, which I very much appreciated because the bands are perfectly straight and even all around. The parlor itself is very clean and has an inclusive feel to it. The artists all seem to get along well, which makes for a nice atmosphere. Very clean, high attention to sanitary practices, and they provide free touch-ups after healing. I highly recommend this place, and Stephanie in particular!", "rating": "5", "date": [2015, 8, 27]}, "7": {"description": "Dustin is the man! He has done an amazing job on my boyfriends sleeve and we couldn't be more impressed. He's extremely popular, so I suggest you get into him as soon as you can. The parlor itself is very clean and on close inspection, it looks as if everybody here does a good job. We have been in here at least 4 times and I have yet to find someone that is dissatisfied with their art. Also, please keep in mind that you are not allowed behind the counter unless you are being worked on. I personally like this rule as I could see it posing problems as far as proper sterilization and also it alleviates random people walking around, potentially messing up someone's tat.", "rating": "5", "date": [2015, 8, 22]}, "49": {"description": "Hands down one of the best shops in Chicago. Stephanie White is super talented, friendly and easy going. Love the piece she did on my hand.", "rating": "5", "date": [2015, 2, 5]}, "40": {"description": "I came here to get my first tattoo last week. I walked in with an idea and walked out with a creation beyond my expectations. Jason Longtin was my artist and I cannot say enough about his work to truly give it justice. He really listened to what I wanted and designed a piece so beautiful. The placement and color of this piece really made my vision come to life. Jason's work speaks for its self and the cleanliness of the place was impeccable. I will go to Jason for any work I want done in the future, no matter where I live. When you go to Jason you are paying for true artistry and quality. Cannot wait for another!!!", "rating": "5", "date": [2015, 5, 5]}, "53": {"description": "Not a whole lot new to add, but I wanted to give Zach some more love. I went in this last weekend with my brother and sister to get our \"sibling tattoo\". Though it wasn't anything incredibly unique (feather with 3 birds), Zach took his time making sure it was what we wanted, but also, and this part I appreciated IMMENSELY, made sure we understood how it would look after 5 years. We wanted to add some writing, but to do so he needed to make it much larger than we had originally wanted, since the smaller writing would end up bleeding together after several years. I really appreciated that he made us realize that rather than letting us tattoo ourselves not fully evaluating the implications.I plan to go back and would recommend Deluxe, and Zach, to anyone!", "rating": "5", "date": [2015, 1, 8]}, "30": {"description": "Jason Vaughn is stellar. His work is perfect. He is a bit quiet but that is good. He works fast and is impeccable with his attention to detail and the colors he chooses.  Unfortunately he is relocating to LA in October. I will have to get in there for another before he leaves.", "rating": "5", "date": [2015, 7, 12]}, "46": {"description": "My experience at Deluxe was awesome! I got my first tattoo here with Stephanie and she was just wonderful. Really calmed my nerves and tended to all my needs. Not to mention her work alone was worth five stars for sure. The place was clean and smelled like a hospital. Which I guess is what you want from a tattoo shop. Only problem was the music....if you don't like metal bring your own tunes for sure! Otherwise I was superbly happy with my experience here.", "rating": "5", "date": [2015, 3, 21]}, "1": {"description": "Like others, I had a fantastic experience at Deluxe. I'd been thinking about getting this tattoo for a couple of years. When I decided to pull the trigger I did research and chose Stephanie based on the praise for her script work. Since this was going to be my first tattoo, I didn't even care what Stephanie was like as a person-- just that she delivered on my vision. Turns out, she's friendly, down-to-earth AND a great artist. I emailed back-and-forth with her for quite some time and finally chose a date. She was courtious the entire time and super responsive. She even emailed me when she had a cancellation so I could come in early. When the date came I was pretty nervous, even thought about turning around and going home. But once I walked into Deluxe I knew I'd chosen the right place. The studio itself is large, open and has a lot of natural light. In not so many words, it's comfortable. There were quite a few customers already waiting at noon (always a good sign) but even so, I was greeted immediately and never left waiting. My tattoo itself is small and only took about 5-10 minutes to complete. Stephanie took nearly an hour with me though to get the font, placement and overall aesthetic correct. She worked on it until the font was as I'd hoped, then let me bounce back-and-forth between the mirror, the bathroom and my friend. She never acted impatient; on the contrary, she encouraged me to take a multitude of looks at different angles. Once I was committed to placement she got to work. She made conversation almost the whole time and I was super comfortable with her. She even started tattooing for just a few seconds to show me how it would feel (just like a lot of little pinches, as others have said). I smiled ear to ear when I saw the finished product. All said and done, I love what she designed, how she worked and how everyone else in the studio treated me. (Even those waiting for tattoos in the front of the shop were super friendly and offered little tips of advice). I highly, HIGHLY recommend Stephanie and Deluxe, especially for first-timers like me. [Tip: It may take some time to secure an appointment with her, so book ahead if you're serious.]", "rating": "5", "date": [2015, 12, 20]}, "55": {"description": "I've had seven tattoos here. All by Zach. I drove three and a half hours each way to get them done. There will be more in the near future. I won't go anywhere else. The place is clinically clean. You'll know that came to the right place, immediately.", "rating": "5", "date": [2014, 11, 26]}, "9": {"description": "Jimmy Little Rocked my 2 new Tattoos.  First of all I would not go anywhere else.  The parlor is very clean, and the staff so nice and easy going.  I felt very comfortable there and informed as it was my first time.  There is talent oozing out from the walls in this place, so you are lucky to get any of these artists.  Jimmy Little was my artist, so patient, supportive and made sure I was 100% satisfied.  He drew my tattoos (Phoenix rising, script) so flawlessly there were no changes at all!  He and I were on the same page.  His free hand script is what blew me away....  feminine, strong, and unique.  He listened to my vision and delivered. Mu husband is excited to now get his!", "rating": "5", "date": [2015, 12, 22]}, "26": {"description": "Andy did an awesome job and finished up a big crow on my ribs in a little under an hour and a half. He was friendly, professional, and inks fantastic shading and clean lines! Highly recommended.", "rating": "5", "date": [2015, 8, 17]}, "25": {"description": "Dustin is the man! He has done an amazing job on my boyfriends sleeve and we couldn't be more impressed. He's extremely popular, so I suggest you get into him as soon as you can. The parlor itself is very clean and on close inspection, it looks as if everybody here does a good job. We have been in here at least 4 times and I have yet to find someone that is dissatisfied with their art. Also, please keep in mind that you are not allowed behind the counter unless you are being worked on. I personally like this rule as I could see it posing problems as far as proper sterilization and also it alleviates random people walking around, potentially messing up someone's tat.", "rating": "5", "date": [2015, 8, 22]}, "12": {"description": "Just got my first tattoo done by Bunny! I brought a rough idea of what I wanted and I said I want it more like this or like that, and Bunny did a sketch with which I was extremely happy and went with it! It's nothing intricate - just four words and a lip imprint - but I LOVE it.  Bunny was very professional, made me feel comfortable (guess he saw the fear in my eyes...) and made sure I was OK through out the process.  As for the price, since this is my first one, I don't have anything to compare to, but I thought $150 plus tip was a fair price for the experience, quality and service.  It helps that Bunny is a long haired, bearded eye candy!Thank you and I'll be back!!!", "rating": "5", "date": [2015, 9, 9]}, "59": {"description": "Got my second tattoo done here. It was small so it was done quickly and efficiently! I had Ryan, who was really nice and helped ease me nerves. I get nervous about pain, and he assured me that if I needed a break, he wouldn't mind taking one so I could feel better. I didn't need one though! He did a wonderful job with my tattoo. The price was excellent as well. My first tattoo was also small and was worth $80, way more than I thought it would be. But then I came here and got another tattoo of roughly the same size and it was $20 cheaper! The tattoo shop was also very clean, and the rest of the staff were extremely nice. I will definitely be coming back for a touch up (if and when I need them) or any future tattoos I want.", "rating": "5", "date": [2014, 9, 18]}, "21": {"description": "Just got my first tattoo done by Bunny! I brought a rough idea of what I wanted and I said I want it more like this or like that, and Bunny did a sketch with which I was extremely happy and went with it! It's nothing intricate - just four words and a lip imprint - but I LOVE it.  Bunny was very professional, made me feel comfortable (guess he saw the fear in my eyes...) and made sure I was OK through out the process.  As for the price, since this is my first one, I don't have anything to compare to, but I thought $150 plus tip was a fair price for the experience, quality and service.  It helps that Bunny is a long haired, bearded eye candy!Thank you and I'll be back!!!", "rating": "5", "date": [2015, 9, 9]}, "17": {"description": "I got my first tattoo done here a week ago. I did my research on tattoo shops in Chicago and from what I seen and heard, this is the place to go. I wasn't disappointed. Everyone was professional and really attentive. The shop was well managed and very pristine. Stephanie White worked on my tattoo and did a awesome job on the line work and blending. As an artist myself, I could tell she had a great eye for detail and really treated the piece as a work of art. This is the standard to which I will judge all other tattoo shops.", "rating": "5", "date": [2015, 5, 10]}, "10": {"description": "I had two of my tattoos done by Jim Little during Thanksgiving time. He is a talented artist and would actually listen to what tattoo you want then draw them up and give you different versions of it for you to pick. He is very patient and unlike other artists I've encountered, he is trustworthy and won't intimidate you if you are as timid as me. My friends think these two are the best tattoos I have (although I only have 3). Also the front desk's service is very nice and welcoming, and if you are a walk-in like me, the wait is not long at all, besides, it's totally worth it.  I'm definitely going back there.", "rating": "5", "date": [2015, 12, 21]}, "5": {"description": "Went in on Sunday, 12/20. Had an appointment with Dustin to add a few things to a previous tattoo I already have. Shop was super clean, staff were very nice and attentive, and Dustin is a great artist who knows his way around a tattoo machine. I have zero complaints about this place. I will go back again. Keep in mind they have a minimum of $100 dollars so make sure you are getting your moneys worth. If you're only looking for a small outline of your hamster you may want to go somewhere else. If you want that hamster to look like a badass and take up half your arm this is your place.", "rating": "5", "date": [2015, 12, 21]}, "3": {"description": "After looking up many places online to get my first tattoo at I chose this one for its great reviews.  They made the entire experience as quick and comforting as possible.  Very clean, friendly helpful staff.  I emailed in 2 designs before hand and when I got there my artist, Bunny, had drawn up a sketch mixing the 2 which I LOVED!!! He gave my sister and I perfect tattoos and we could not be happier.  Would 100% recommend to anyone getting a tattoo.", "rating": "5", "date": [2016, 2, 21]}, "35": {"description": "My husband and I are long-time clients of Ben Wahhh. Ben is no BS and straight to the point. He will work with you on any design you want, and is willing to try new things (in which he will succeed). But he specializes in biomech so take advantage of that if you can. He works very quickly and efficiently, and isn't heavy-handed like some artists are. His tattoos always heal crisp and quick (providing you don't skimp on the aftercare, but that goes for any tattoo). I have tried other artists here and there but always go back to Ben and will probably do so until I'm old and gray(er).", "rating": "5", "date": [2015, 5, 15]}, "19": {"description": "Professionally run operation.  I absolutely love my tattoo.  Thanks Troy.  I'll be back.", "rating": "5", "date": [2015, 10, 5]}, "28": {"description": "Bunny, my tat guy was fantastic. I gave him an idea of what i wanted , and within a week, he drew exactly what i wanted, with great artistic skills. Totally happy with my Bio-mechanical tattoo.  Also, the place is very clean, bright and totally professional.  5 stars, in my book", "rating": "5", "date": [2015, 8, 4]}, "45": {"description": "I can't even begin to express my displeasure with Deluxe Tattoo. I walked in to have a tattoo done and my friend was already there. We spoke for a quick minute and then I stood at the counter with my ID and drawing out and no one even acknowledged my presence. Not wanting to be a rude person, I waited patiently and still no one approached me for over 20 minutes, even after an artist finished and charged another patron for her tattoo. I then asked an artist if it was too late for a walk in and the guy said probably. He then asked what I wanted and I showed him a series of phrases that were already printed out and ready to be traced and he responded that he had bad handwriting and had been working all day so it was probably too late. Then when I asked to go back with my friend I was told I was not allowed even though I had done it before! I have never been more frustrated with a place of business or felt more passive aggressive rude behavior directed towards me. I will NEVER step foot in that establishment again nor consciously recommend someone get work done there. My first tattoo there was handled by a traveling artist which I suppose  is why my experience was totally positive. You people need a solid lesson in how to treat your customers.", "rating": "1", "date": [2015, 5, 1]}, "33": {"description": "I rarely write reviews and this one is well deserved. My tattoo artist is Zach his talent is beyond amazing. He took on a very challenging project and promised me that I will be satisfied with the outcome. He has since proven that to be true. Zach's ability with detail and color is incredible and with every session, I am more and more amazed at what he can do. I have been receiving many compliments on my tattoo and honestly it's turning out better than I ever imagined. Besides the quality of his work, Zach is very professional and I feel comfortable with him tattooing me. It's a bonus that he's funny because it makes the process more pleasant. As far as the shop, it is always very clean and the other artists seem cool. Shout-out to Steph for always being so friendly and nice, from what I've seen she also does a great job tattooing. I love that Zach and you work next to each other. Can't wait till my next session.", "rating": "5", "date": [2015, 5, 26]}, "43": {"description": "Deluxe Tattoo is home to amazing artists. Each artist is talented and does great work.  If you are getting your first tattoo or have many you will like the experience. I had an amazing experience from the first consultation through completing sleeves on both arms. Check out the work of my favorite artist, Jason Longtin.", "rating": "5", "date": [2015, 5, 3]}, "2": {"description": "I had to update my review and tell the Yelp world that Deluxe Tattoo is stacked with talented artists. When I found out the previous artist I had worked with no longer worked here, I still booked an appointment knowing I'd still get good service. Yes, best friend/matching tattoos are cliched, but no I don't care. My best friend of 10 years and I wanted cupcake tattoos in honor of my moving away. The day before our appointment I got a call that our artists' wife had had a baby so we could either reschedule with him or get someone new. Our new artist Zach stepped in and sketched an awesome looking tattoo. A few hours later we were done, full of pain, and looking awesome. Zach was great with his suggestions and took the time to explain placement from an artistic prospective. There's a reason my boyfriend hangs the art in our house, folks...I'm not one to have the full artsy vision others do. That's why Zach is awesome at what he does and I...am not a tattoo artist. Even though I no longer live in Chicago, I'd still make the trip here to get anything new. Why fix what isn't broken?", "rating": "5", "date": [2015, 12, 1]}, "18": {"description": "OUTRAGEOUS! ... In the best possible way. I can't even wait to write this review because Troy Taylor was that awesome. I just walked in today to get a tattoo I've been wanting for a while. After just letting Troy know what kind of flower I wanted and an example of a tattoo I saw that I thought was cool he got to drawing. We went thru a couple of drafts before figuring the perfect size for my arm. He was really patient about it though and just wanted to make sure I loved it. That was really encouraging because I didn't want to be annoying. Once we got the right one and he set up everything he asked me to make sure I liked the placement by checking it out in the mirror and directed me to the mirror. It was perfect, so he got to work. I was just amazed at how fast and efficiently he worked without losing any detail or quality. It seriously took him only 45 minutes from the moment he get got going. I am so impressed! Loved the place and experience, especially since I was a walk in and didn't know what to expect. Good job Troy and Deluxe Tattoo!", "rating": "5", "date": [2015, 10, 14]}, "41": {"description": "Out of all the tattoo shops in Chicago, this one came highly regarded and recommended by several people, among different groups of my friends. Walking into the shop, you will find a clean and sanitary studio with artists abound. They are customer service oriented and ensure that their guests are taken care of from the original consult to after care.My artist is Jason Vaughn. He has an amazing talent in art and tattooing and uses it well, creating exactly what you ask for using vibrant colors and careful precision. He is a very quick tattoo-giver, so you won't be spending extra money due to time. Now...when I get a tattoo, I know that I'm going to have this piece of art on my person for the rest of my life, so I greatly appreciate when my artist says it's time to stop. Additionally, I also understand that as much as I'd love to have my friends and family come back and sit there while needles are piercing my skin applying ink, well, besides being boring, it can be distracting to both me and the artist. In addition to being a health code thing, I appreciate the enforcement at the shop This is not your \"run-of-the-mill\" tattoo studio. This place is for the person that seriously understands what getting a tattoo means to them.The music playlist can use a bit of a make-over, however...but I tend to bring a pair of headphones and zone out to my own tunes...So, if you're looking for an amazing looking tattoo, you've found the right place - and Jason is your artist.", "rating": "5", "date": [2015, 5, 4]}, "52": {"description": "This was my fourth tattoo from here. I have one from Ben one from Dustin and two from Zach. There is a reason I've only gone to deluxe, they're amazing at what they do.", "rating": "5", "date": [2015, 1, 9]}, "50": {"description": "Stephanie White is phenomenal. She spent a lot of time fine tuning the tattoo I wanted. I wanted some words placed alongside of my tattoo I had emailed her in advance and after about an hour (and talking though the placement and the font) she came up with something I was really happy with. Plus, we used my handwriting so it made it even more personal. She was meticulous about the placement of it and making sure it was straight and in a place that later in life I would still like it. I picked her because I liked the way she had varying thickness of lines (different gauges of needles?) and the boldness of the color she used seemed to really pop in the photos she has online.  After sitting with her for 3.5 hours and learning more about what she completely does and how talented she is, she has some great water color tattoos. The bird she has posted is so good and completely different than what she has traditionally done. So, that in my mind is talent.  And, she started the water color tattoos because that's what her client had asked her for so I knew she would do my tattoo exactly the way I wanted. I knew she was fairly new to Deluxe Tattoo because I always check their site to see when Hannah was going to come back but when I saw her work I decided to go with her. I'm glad I did.", "rating": "5", "date": [2015, 1, 31]}, "4": {"description": "Troy Taylor did a masterful job with my compass shoulder cap. I sent two rough renderings of my ideas through the form on the Deluxe website and within hours, Troy emailed me back personally and said he would be taking on my piece. They have a modern and organized approach to setting up an appointment so when I got there, Troy already had a piece drawn up for me and was very opening to changes or modifications. But he pretty much nailed it on the first try. He was very professional, appropriately quick, super easy to get along with. I will definitely be going back for more ink from him and recommending to anyone and everyone to give him and Deluxe a visit. There's a reason they are so highly rated -- they live up to the reviews! (Also incredibly fairly and appropriately priced.)", "rating": "5", "date": [2015, 9, 21]}, "6": {"description": "Been tattooed there a number of times - highly recommended.   Outstanding artists,  fun Shop and great management.  I like the whole process and business.", "rating": "5", "date": [2016, 1, 22]}, "22": {"description": "Super easy. My first tattoo was on the top of my foot (small, solid black). It took about 7 minutes and barely hurt at all. Customer service was good and all of the artists are very friendly. I'll be going back for my next one soon!", "rating": "5", "date": [2015, 9, 5]}, "15": {"description": "Before there were camera phones, before the iPad, before selfies, before hybrid cars, I won $200 on video poker slots (when they still paid out in change) and got my first tattoo.  Admittedly, it was a tramp stamp.  Admittedly, I did shots of tequila to give me liquid courage.   At that time, I fell for the \"tattoos are addicting\" and got another set of tattoos next to the first tattoo when I was at a tattoo convention.  I almost passed out in front of thousands of people.Needless to say, I was hesitant to get another because I didn't know what I wanted.   Fast forward 13 years, and I was ready.  I knew what I wanted, mostly on the where, and was recommended to Deluxe by a few people.  I initially had considered a different artist, but Troy was available when I wanted to go.  He was very patient with me while we worked out where it would go, how it was going to look, and what font I wanted to use, and was done within an hour.  I am very happy with my new tattoo and will going back to Troy for my next one.Why one less star?  Because I contacted the other artist via email, and needless to say, the response was a rather curt \"just call to set up a consultation.\"  I think it should be clearer on the website who needs consultations, what their hours are, etc.  Just a thought.", "rating": "4", "date": [2014, 10, 13]}, "57": {"description": "This place is incredible. Clean, professional, efficient. You get what you pay for - their work is impeccable. I highly recommend jimmy.", "rating": "5", "date": [2014, 10, 11]}, "20": {"description": "Troy Taylor did a masterful job with my compass shoulder cap. I sent two rough renderings of my ideas through the form on the Deluxe website and within hours, Troy emailed me back personally and said he would be taking on my piece. They have a modern and organized approach to setting up an appointment so when I got there, Troy already had a piece drawn up for me and was very opening to changes or modifications. But he pretty much nailed it on the first try. He was very professional, appropriately quick, super easy to get along with. I will definitely be going back for more ink from him and recommending to anyone and everyone to give him and Deluxe a visit. There's a reason they are so highly rated -- they live up to the reviews! (Also incredibly fairly and appropriately priced.)", "rating": "5", "date": [2015, 9, 21]}, "36": {"description": "Traveled 2  1/2 hours each way for 3 sessions with Ben.  He was able to transform my different ideas into a tattoo. Super accessible and easy to work with. Great artist.  While getting tattooed, I could see Ryan, Jim Little, Stephanie, and Zach working.  From little to pig pieces, everything was impeccable within the different styles.  Their interactions with the clients were smooth and pleasant judging by the clients' happy faces with the job.  Even though I always had an appointment scheduled, by the minute I stepped in the shop someone was asking if I was already helped.  Loved the music, got myself \"headbanging\" at times.  Bottom line... Deluxe Tattoo is a welcoming environment with real artists that can put ideas and feelings into tattoos.  Will definitely come back for more.", "rating": "5", "date": [2015, 5, 14]}, "14": {"description": "Out of all the tattoo shops in Chicago, this one came highly regarded and recommended by several people, among different groups of my friends. Walking into the shop, you will find a clean and sanitary studio with artists abound. They are customer service oriented and ensure that their guests are taken care of from the original consult to after care.My artist is Jason Vaughn. He has an amazing talent in art and tattooing and uses it well, creating exactly what you ask for using vibrant colors and careful precision. He is a very quick tattoo-giver, so you won't be spending extra money due to time. Now...when I get a tattoo, I know that I'm going to have this piece of art on my person for the rest of my life, so I greatly appreciate when my artist says it's time to stop. Additionally, I also understand that as much as I'd love to have my friends and family come back and sit there while needles are piercing my skin applying ink, well, besides being boring, it can be distracting to both me and the artist. In addition to being a health code thing, I appreciate the enforcement at the shop This is not your \"run-of-the-mill\" tattoo studio. This place is for the person that seriously understands what getting a tattoo means to them.The music playlist can use a bit of a make-over, however...but I tend to bring a pair of headphones and zone out to my own tunes...So, if you're looking for an amazing looking tattoo, you've found the right place - and Jason is your artist.", "rating": "5", "date": [2015, 5, 4]}}, "neighborhoods": ["Lakeview"], "latitude": 41.9541851, "longitude": -87.6663949, "rating": "5.0", "times": {"Mon": ["12:00 pm", "8:00 pm"], "Thu": ["12:00 pm", "8:00 pm"], "Sat": ["12:00 pm", "8:00 pm"], "Wed": ["12:00 pm", "8:00 pm"], "Tue": ["12:00 pm", "8:00 pm"], "Sun": ["12:00 pm", "8:00 pm"], "Fri": ["12:00 pm", "8:00 pm"]}, "price": "$$", "categories": [["Tattoo", "tattoo"]], "address": ["1459 W Irving Park Rd"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "331"}, "southside-tattoos-and-body-piercing-chicago": {"comments": {"1": {"description": "There are two body piercers to my knowledge. The man I saw was inexperienced with lip piercings. The room was messy. The set up didn't look good. I sat there wondering why I didn't just get up and leave. He cleaned my face with what he said was witch hazel but I'm not sure. I don't know if he sanitized the clamps or not and I didn't see an autoclave at all. He marked the spot where the piercing would go. He pierced my lip and then took a very long time putting the ball on. He dropped the first ball and then tried to find it. It seemed like I waited forever for him to find it. Once he found it and put the ball on my lip was tender and it hurt. I was so glad to be done with the process I just got up and left. I won't be returning to south side tattoo for anymore services. The place needs a serious upgrade and the piercer I saw needs a lot more training.", "rating": "1", "date": [2015, 3, 4]}, "0": {"description": "From the moment you are buzzed in you feel welcomed!  I had many questions and the young lady had no problem answering them all!Now, I have been here before for my piercing and they did an excellent job!  Very proffessional and very clean!I mean when you are thinking of a Tat or a piercing you can't just go to anyone!  The Tats are a reasonalbe price and vary on the size, detail and coloring!The piercing I received was only 50 dollars when I received mine!So if you are thinking of a clean, reliable and friendly place to go to get your new Tat or a Tat in general  I would say this is a great place to go!!!If you want to get a piercing I would say the same thing especially since I have gotten 2 from here and I'm glad I did!!!", "rating": "5", "date": [2012, 10, 24]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.7390543, "longitude": -87.5860115, "rating": "3.0", "times": {"Mon": ["1:00 pm", "9:00 pm"], "Thu": ["1:00 pm", "9:00 pm"], "Sat": ["12:00 pm", "10:00 pm"], "Wed": ["1:00 pm", "9:00 pm"], "Tue": [], "Sun": [], "Fri": ["1:00 pm", "10:00 pm"]}, "price": "$$", "categories": [["Tattoo", "tattoo"], ["Piercing", "piercing"]], "address": ["8548 S Stony Island Ave"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "2"}, "stonys-palace-cafe-chicago": {"comments": {"3": {"description": "I wasn't feeling the decor but the food was decent.  They went for a urban chic look but obviously didn't use top grade materials or furnishing. The place looks like it could use better upkeep but it's not a dump either.I had the ribeye breakfast withe eggs and hash browns with toast. The steak was thin but very well seasoned. The eggs were just okay. They were not fluffy and obviously cook on the same griddle as everything else.The wife had the Creamy caramel pecan waffle. She loved it! Sweet, nutty and crisp waffles with great flavor and texture.", "rating": "3", "date": [2014, 9, 1]}, "1": {"description": "Terrible service, terrible flavorless food, I wish I could give no stars..we have to stop accepting whatever because it's available. Check out my tip for full rant & review", "rating": "1", "date": [2015, 12, 21]}, "2": {"description": "The service was really good. The food was great. They have added to their menu. They could extend the hours. I would recommend this place.", "rating": "5", "date": [2015, 9, 3]}, "9": {"description": "This place is a south side gem. Their waffles melt in your mouth there so good and they dont need syrup. My favorite i sthere Chicken and waffles. However I love there omeletes, salads and skillets. The inside has a very warm welcoming and trendy feel. The customer service and lemonade is also great. if you are ever in the area defly try them.", "rating": "4", "date": [2014, 8, 5]}, "10": {"description": "I really like this place!The staff is nice and food is great!  I love how they have WIFI and I can get about from my home office to work and or meet clients.Besides Avalon Park is an awesome community and we want to support our local business!  I'm going to start 100 Percent of the time tell clients to meet me here vs StarbucksSupport Local and don't be a hater.  LOLYolandra \"Faith\" MartinIllinois Real Estate BrokerCell 773-301-1091Voice Mail 773-977-8630Fax 312-962-4937MartinTheBroker@gmail.comView Apartment VIDEOS:  youtube.com/MartinTheBro…*SALES*LEASING*MANAGEMENT*CONSULTING", "rating": "4", "date": [2012, 12, 21]}, "4": {"description": "I am so glad to have found Stony's Palace Cafe! The cafe is charming and very comfortable. The service was fast and friendly. The food and coffee were delicious!!! I will be returning again soon!", "rating": "4", "date": [2015, 4, 20]}, "6": {"description": "I love the Jerk chicken tacos an my daughter had the steak tacos they were so delicious.  I can not wait to return back to this restaurant. We found this restaurant  just by going south bound on Stony Island and it was truly the best decision we made.", "rating": "5", "date": [2015, 7, 2]}, "12": {"description": "I've passed by this more times than i can count. I finally went in.  Decor: it must have been a lounge before or doubles as one because the velvet couches don't seem to say breakfast diner but I liked it.  Service: the two waitresses were very nice. Food: I ordered the ham&cheese breakfast with eggs fried hard with cheese, hash browns & a side of pancakes,  The ham was the best part.   The hash browns were typical &the pancakes were ok. I'll try the waffles next time.", "rating": "3", "date": [2013, 6, 19]}, "5": {"description": "Came here for Mother's Day Brunch.There was a large group of us and we waited a very long time to get our food. As a group we were not given our food around the same time either. We were all starving so this pissed people off. One person from our group actually refused her potential meal  & left because she ended up being the very last person who did not have her food. This is all after it had been an hour plus since we'd been seated.I ordered a patty melt and I guess I shouldn't have. I figure it's really hard to screw up a patty melt - but the meat tasted old and it made me quite sad. The fries that came with my food were really good though!I was too through when I found that as my infant daughter was chewing her micky mouse pancakes that there was a long hair sticking out of her mouth in her food.... It was evident that the hair did not match anyone at our table, so I had to hold myself back from flipping out. I didn't bother even complaining about it at the time because I don't ever picture myself coming back.Overall service was alright - not spectacular, but nothing to complain too much about in that department aside from our meals not being served at the same time. Menu pricing is decent as well.I give this place 2 stars instead of 1 because some people enjoyed their meals even though it took forever to come out. I was definitely not a camper though.", "rating": "2", "date": [2014, 5, 14]}, "13": {"description": "I am so rooting for this place to succeed.  The food is good, its pretty resaonable priced, and the undustrial city loft feeling and decor is AWESOME. Now for the BUT.  There is definately room for improvement in the SERVICE.  The first time that we went there, we walked in, and did not know that we were supposed to seat ourselves, and the server/bussers just walked by us. Finally someone acknowledged us and told us to seat ourselves.  The person that brought water to the table did say a word, and the server looked DEPRESSED.  I was like \"WHAT A SAD PLACE\".  so the other day, i decided to give the place another chance.  This time it was afraid that it was going to be the same experience.  The persoe that brought the water looked SO SAD and didnt say a word to us, and the server was just as SAD, but the food was AWESOME.  So when the server brought the chack and asked how things were, i decided to be honest and told her exactly what I thought, and she definately made an error to make a little conversation and even made a litte joke.  This is definately going to be my go to breakfast spot, but I am so hoping that it is successful.  With such a small and new spot,, If i were the manager/owner, i would definately make the rounds to the table to ask how things are and thank the customers for coming,   Just a thought.", "rating": "4", "date": [2011, 12, 15]}, "11": {"description": "The place is comfortable, the food is good but the service is slow for the price. I'm sitting here and had to ask the cook to make what I wanted :(", "rating": "2", "date": [2014, 2, 9]}, "8": {"description": "We've passed this place several times and finally got up early enough for breakfast this Sunday. If you want a waffle, you're okay. If you're hoping for anything else, go elsewhere. The turkey sausage was...I really don't know how else to describe it but wet and squishy. Although I ordered pork bacon, I'm pretty sure the pile of scraps that served as \"four strips of bacon\" was actually turkey bacon, deep fried and overcooked.  The inside is pretty dimly lit, but it appeared they had some patio seating out back, but it was too cold for that. Might be good for a hangover, but I don't feel like we'll be going back. I feel like I'm possibly being over critical, but I think I just had my hopes up for a good soul food breakfast, and it just didn't happen.", "rating": "2", "date": [2013, 10, 7]}, "0": {"description": "Great food and they are now doing party rentals. I  look forward to having my next event here.", "rating": "4", "date": [2015, 12, 3]}, "7": {"description": "I've been here about 3-4 times. The very first time it was for Mother's Day and it was a group of us. My mom and I had a dirty fork so they went to go get clean ones. Then they toke forever to give us all our food since it was a large group. The second visit me and my sister went in cause we just wanted pancakes and eggs. So we ordered, sat at the table to wait and get our food, we sit and the table is stuck all over. I'm like what?!?!?! It was so gross. So we went to another table and that one was sticky too. I couldn't believe it. The third time we kept having to repeat our order and they messed up my order. Then for the drinks this guy I don't know if he was deaf but we had to point to what drink we want. They need someone to do the orders that you don't have to worry about doing that. I'm not going back there. I love the food but it's not worth it", "rating": "1", "date": [2015, 3, 14]}}, "latitude": 41.7474782466888, "neighborhoods": ["Avalon Park"], "categories": [["Cafes", "cafes"], ["Internet Cafes", "internetcafe"]], "address": ["8114 S Stony Island Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Ambience": "Casual", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Breakfast"}, "longitude": -87.5859220325947, "category": "Food", "rating": "3.0", "price": "$", "number_of_reviews": "14"}, "honey-baked-ham-chicago-2": {"comments": {"0": {"description": "We normally order a ham for every holiday well our thanksgiving ham didn't have any honey glaze on it... So we take ham back and they put some on it... Nope won't get no more of our business... Pay too much for a Honey Baked ham to be treated like this... I will tell everyone near and far go to the other honey baked. This is the first and last time you mistreat my family... No more support we will spend our money elsewhere!", "rating": "1", "date": [2012, 11, 24]}}, "latitude": 41.73825, "neighborhoods": ["Avalon Park"], "categories": [["Meat Shops", "meats"]], "address": ["8615 S Stony Island Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.58487, "rating": "1.0", "price": "$$", "number_of_reviews": "1"}, "stony-sub-chicago": {"comments": {"12": {"description": "Great food, great service! I now know why they call it a gym shoe.", "rating": "5", "date": [2014, 5, 23]}, "7": {"description": "Love that they are open 24 hours!! They take cash only and they are newly remodeled!!! The Italian beef sandwiches are so good and a huge portion! They come with fries and a drink as well. Another good thing is that they have mild sauce and they aren't stingy with it like most places !!!", "rating": "5", "date": [2015, 8, 30]}, "3": {"description": "I have seen this place for years but I never thought about walking in and taking a look at their menu because it just seemed like a hole in the wall...so why bother!!!Well boy o boy I was wrong...you know the saying don't judge a book by its cover, well I should have listened.The place was clean and had a pleasant smell in the air and that doesn't happen often when you go into some of these greasy spoons.This is also a CASH ONLY restaurant so leave your credit and debit cards at home because your plastic won't work there.They are open 24 hours a day and had a steady of people coming into the restaurant but they still seem to keep up with the orders...That's a plus in my mind!They had a variety of Choices from Breakfast to Dinner and everything in between.Breakfast is served 6am to 6pm at very low prices.  I don't know to many places where you can get an omelet for under 6 dollars and it still comes with hash browns.  I will most definitely come back and try it out!The young lady behind the counter that took the order was smiling the entire time...another Plus in my book.I had the Jim Shoe sandwich which is jammed packed with meat(gyro, Italian beef and corn beef) it also had lettuce, tomatoes, onions, hot peppers, sweet peppers, mayo and gyro sauce and cheese.  Yes it is a heart attract on a bun but I enjoyed every bite and it's not like I am going to eat it everyday...lol It was a moment of splurging!!!  The price was pretty reasonable as well...I want to say about $7.81 and it came with fries and a pop!!!  I have to say too that I loved the mild sauce on my fries it didn't have that funny after taste that some places have when you get the mild sauce.This place is a hidden gem that I was looking at for years but never took the time to explore...Everything was fresh and truly changed what I use to think of this place.  If my next visit is as good as this one...They will have a loyal customer for life.So if you are in that neck of the woods and you don't want to break your budget on buying something to eat and you want something good and fresh you have to stop at Stony Sub...I don't think you will be disappointed...I know I wasn't!!!Enjoy!!!", "rating": "5", "date": [2015, 5, 29]}, "1": {"description": "After having a conversation with a coworker about the Jim shoe and what it is and how it's made, and it's origins I decided to try it. And why not go to the place where everyone says it's best. So even though I don't live anywhere near this particular restaurant I took the journey here to try this sandwich I hear so much about. And I made an excellent choice. Upon entering this restaurant I'm greeted by a friendly woman, who took the time to actually talk a bit with me before taking my order. And never got irritated at my many questions, which I had quite a few. She even gave suggestions on what is good as well as what not to bother with. Which I think was refreshing because most times they just ring you up for whatever you ask for, knowing once you receive it you won't be satisfied.After a short wait she let me know my order was ready.  I took my order and left, eating my fries as I traveled to my destination. I consider myself a french fries conosuer, and these did not disappoint. And as one other reviewer stated their mild sauce tasted just right. Once I reached my location I opened my sandwich ready to take a bite, let me tell you this sandwich I very large, and they don't skimp on the meat either. It comes with roast beef, gyro meat, and corned beef, topped with  lettuce, tomatoes, sweet and hot peppers, mayo,  tzaziki sauce, and cheese. I skipped the mayo and sweet peppers, and got everything else. I am not sure who thought to put this combination of meats together, nor why they work so well together. But I am glad that I did try, if your wondering if you should try it, I say go for it.", "rating": "5", "date": [2015, 5, 2]}, "2": {"description": "There's only one real reason to come to Stony Sub, and that's the Jim Shoe Sandwich. I, too, had heard whispering of this audacious sandwich, which dared to challenge the limitations of Chicago sandwichness as we know it.  But sadly, for too long I wimped out; always saying it was \"too far\" or the merit of such a trip being \"too unknown.\"  Well friends. I am proud to state that I DID make that triumphant march to Stony Sub, and yes: the legends that have spake the name JIM SHOE are true! The sandwich is a meat-lovers dream, with enough giardinera peppers to satisfy heat seekers and gives each bite a satisfactory crunch.  The bread--I'm guessing a Turano italian?--is good in that it helps soak up the juices but doesn't fight the flavor of your meat party.  TIPS: there is no parking here, so you have to do street. Also, at night you have some guys trying to sell bootleg DVDs--pay them no mind and don't let them keep you from enjoying your Chicago legendary sub. OH! And you're going to want to do takeout here, as there just a couple of chairs and no tables.", "rating": "5", "date": [2015, 8, 3]}, "9": {"description": "The 'gym shoe' sandwich is quite possibly the best sub I've ever had. The sweet peppers and mayo add a tangy surprise to this heavyweight, meat-filled delight. The 12 Incher can easily feed a family of 4 for a month (added for effect), The place itself is a tiny yellow shack with the cashier behind what looks like bullet resistant glass. But since I've been taught not to judge a book by its Amazon reviews, I decided to jump in anyway, and needless to say, I was pleasantly surprised. 5 stars for this institution.", "rating": "5", "date": [2015, 2, 5]}, "10": {"description": "The gym shoe is the bomb..and service is great..always get great food here..always i just got my whole family gym shoes today..we all enjoyed the hot tasty and delicious food..thx stony sub..", "rating": "5", "date": [2014, 10, 18]}, "13": {"description": "Stopped in to get an Italian beef. The meat was nice and tender and the service was quick. I thought the prices were a little bit on the high side,  but I guess thats because they are open 24 hours. The mild sauce was nice and tangy. I recommend you check it out.", "rating": "4", "date": [2014, 9, 1]}, "16": {"description": "I have been coming here for years but stopped when the gyro meat fell off hard. it took a girl from hs to post their super steak taco on Instagram. It looked so good I had to get one. I was not disappointed. I also had to try the gym shoe/Jim shoe (corned beef, gyro meat, roast beef, hot & mild peppers, cheese, tomato) it was good too. Mild sauce on the fries. Open 24 hours. If you don't want to wait...phone first. Cash only..fyi", "rating": "4", "date": [2013, 11, 30]}, "17": {"description": "Good food. You gotta love true Southside grease from time to time.They got it all, from breakfast to midnight munchies", "rating": "4", "date": [2011, 3, 8]}, "15": {"description": "Great in the hood spot. Been eating here since the early 90s. The Italian beef has went down. The gyro is alright. But the Philly steak is a banger. A lot of people like the gym shoe, it not for me. That's too much going on for one sandwich for me. Like the gyro burger. Either I'm gonna get a gyro or a burger...they also give you fries and pop with most meals. The mild sauce is good, considering I don't like mild sauce.", "rating": "5", "date": [2013, 8, 7]}, "0": {"description": "I've been coming to stony sub for many years. I was around when they had a location on 87th. I love everything about their establishment except they don't take credit cards...but I understand. The food is ALWAYS where it should be. Jim shoe, chicken wings and tacos....my top favs.", "rating": "5", "date": [2015, 9, 3]}, "5": {"description": "Not for the faint of heart. The meat options are par-for-the-course but the team at Stony Sub has taken hot sandwiches to the next frontier. I am of course referring to the enigmatic gym-shoe. I rode my bike 17 miles, in the rain, just to eat this mythical meat-pile. Also know there wasn't a good place to really lock up my bike. But now to the sandwich. The legends are true, folks. My flavor buds exploded in exaltation within the first bite. The flavors swim together rhythmically like Louis Armstrong headed into a crescendo. I ate the entire king size sandwich. That's right, will you accept that challenge?Also, I want to mention that everyone in he restaurant was friendly and eager to chat about Southside attractions. Be prepared to make a mess eating your gym-shoe because there are no tables at Stony's.Also, they offer an array of fry flavoring which I haven't seen done before, so kudos for going the extra mile, Stony's.", "rating": "4", "date": [2015, 6, 16]}, "11": {"description": "Get the gym shoe, thats all I can say. Make sure you just get a regular though, if you have a big appetite, get the king. I feel like now that I know about this south side gem, soon everyone will and they will be coming in mass droves all of a sudden. Really great. Very greasy. Plan to feel great after. I never went in the place, but we got some gym shoes to go, amazing.", "rating": "5", "date": [2013, 7, 28]}, "8": {"description": "Best hood stop out south, hands down! Service on point always. Food on point, always! My fiance and I have been going here for about 5 years now and love it, especially when we want some shoestring fries with mild sauce, salt and pepper on them. The woman who takes the orders always remembers our order and other returning customers, hell the cooks do too. Its just a quality hood joint! Open 24 with breakfast til 6pm!!!!!!!!!", "rating": "5", "date": [2015, 8, 19]}, "4": {"description": "OK...I went to Stony Sub.. The service was quite good. The young lady was kind & helpful. Let me first say that I was raised in Philly. The Gym/Jim Shoe is only a Steak Hoagie with Sweet Peppers. That's what I had...with Fries It was \"A'ight\" I've had better. Honestly, I enjoyed my steaks at Montis', AND Phillys BEST much more. I had a Pop/Soda.. Not much to report, just a good sandwich with above average. I had a \"Gyro\" Puff as well. It's a Pizza puff with Gyro meat, as a filling. It was also \"A'ight\". I was disappointed because it was my first time trying this. I've had a Pizza puff B4. So the food was OK.. The service was \"above\" average. That's my honest critique.", "rating": "3", "date": [2015, 8, 19]}, "14": {"description": "This place has so much to choose from ! It's so good jus call your order in a head of time", "rating": "4", "date": [2013, 12, 6]}, "6": {"description": "Jim/Gym Shoe is the best! I love tzatziki (white cucumber gyro) sauce, so I always pay for extra on the side. I also add feta cheese once I get it home (they do not have any). It sets the sandwich off the chain for me!", "rating": "4", "date": [2015, 9, 11]}}, "latitude": 41.74111, "neighborhoods": ["Avalon Park"], "categories": [["Sandwiches", "sandwiches"], ["Fast Food", "hotdogs"]], "address": ["8440 S Stony Island Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Good For": "Lunch", "Attire": "Casual", "Ambience": "Divey", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Drive-Thru": "No", "Good for Kids": "Yes"}, "longitude": -87.58607, "category": "Restaurants", "rating": "4.5", "price": "$", "number_of_reviews": "18"}, "natures-way-health-food-store-chicago": {"comments": {"0": {"description": "Reasonable price for colonics and very educated staff.", "rating": "5", "date": [2012, 10, 9]}}, "attributes": null, "neighborhoods": ["Avalon Park"], "categories": [["Health Markets", "healthmarkets"]], "address": ["8504 S Stony Island Avenue"], "latitude": 41.7403254657984, "longitude": -87.5857832282782, "rating": "5.0", "price": "$$", "number_of_reviews": "1"}, "beggars-pizza-chicago-7": {"comments": {"1": {"description": "I'm only giving a 1 because I couldn't tap and none were shaved in. Today is Sunday 11-29-2015, my morning started off well, I was able to schedule my daughter Dj for a hair appointment today which is a day the Salon Oury isn't open. So I dropped her off at 12:30 today on 81st Stony Island for hair appointment. I saw a Beggars pizza shop a few stores down, so I decided to walk in. The young lady said hello, and I asked did they have slices. She replied yes, so I ordered a thin sausage and a thin pepperoni, and she asked for a name with the order, I said Carmah'. I got 2 slices in 2 separate boxes and a plastic bag. I love love hot food and to say the least Pizza is my favorite food, so I took a bite in the car as I was driving, and I took a 2nd bite, that's when something stuck me in my tongue, it was so hard my tongue started to bleed, then I spit it out in my hand. I was chewing on Packing Staples, it was at least 5 that landed in my hand. So I placed the pizza and the staples in a napkin. I drove back to Beggars on 81st and Stony Island, told the front cashier what happened and I asked for a manager, she called Demetrius and he came up and said I can give you another slice. I said no thank you I would just like my money back & what if that slice has staples in it, so you'll just keep giving me another slice Mr? Demetrius the acting manager on duty said, it says it on the receipt that we don't do refunds. I asked is it policy that if a customer has something in their food like staples or hair you tell them you don't do refunds? I reply who's over you? Demetrius said I'm the only one here with an attitude, acting like he was deaf, asking me the same thing (what you say, what you say?) I said I'm sure they have phones (& you can call them), I have to come back later so I can leave my number on the receipt for you to call me. I'am very upset that you wouldn't give me back my money when your company is at fault and my damn tongue is bleeding. He walked out of my sight, and a young guy walks in and ask for change for a $20, the young lady cashier said I can't give you change and then Demetrius said hold on I got you. Wait wait wait, I'm a customer with an issue that your policy will push to the side, but you can assists a non paying customer with change. Are you serious demetrius? I said excuse me I want my money back now, he said ok here is your $7 and some odd change (he kinda threw it at me). I have never been to an establishment and felt this way. I honestly can't believe that I was eating packing staples in a slice of Beggars Pizza and the manager refused to issue me a refund for one of the cooks baking a sausage pizza with packing staples. I'm not certain if I even ate them as when I noticed the staples it was my second bite. I would NEVER ORDER ANYTHING FROM THIS BUSINESS. If you ask me Demetrius needs to be fired for his lack of professionalism and disrespect of a customers issued caused by the business. They also need better policies!!! ZERO STARS FOR BEGGARS ON 81st Stony Island", "rating": "1", "date": [2015, 11, 29]}, "9": {"description": "Terrible. Just terrible. The service is bad, pizza isn't that good, and didn't even give me my military discount. I'd advise you not to go there.", "rating": "1", "date": [2014, 7, 19]}, "23": {"description": "I have been to this location several times it might be behind plexiglass but the pizza isn't lacking!! I wish they had football pizzas!", "rating": "5", "date": [2012, 3, 27]}, "5": {"description": "I live in the area, and instead of traveling 4 blocks to come here for pizza I would rather drive 6 miles. THE SERVICE IS THAT BAD! They will ruin your order or just not make it at all. They have bunch of disrespectful teenagers working behind the counter who have on almost every occasion screwed up my order, then are reluctant to refund your money.Don't waste your time, go to another Beggars.", "rating": "1", "date": [2015, 3, 7]}, "25": {"description": "I don't know why everyone is hating on this location. I've been a constant customer since they opened and really havent had any issues with my pizza. I do agree that the prices seem higher than the other chains, but other than that no complaints. I love beggars pizza and I think they have one of the best tasting pizzas in the city, besides giordanos. Now the Richton park location is the only place that serves garbage, that pizza is horrible, i've went there once and haven't been back.", "rating": "4", "date": [2010, 12, 31]}, "12": {"description": "The girls working here have real nasty ass attitudes. They were closing early to go to an event at the Shrine that weekend but yet there was no signs put up nor did they tell my brother-in-law we he called and ordered. They also should have had a special message on their phone as well and shouldn't have taken orders after a certain time to ensure they leave on time.When we pulled up, I could see the girl behind the counter had a nasy attitdde, we showed up 10 minutes before they were closing early and they kknew we were coming. My sister wnet up to the door to go in and pay and the door was locked, so the girl behind the counter started talkiing to my sistter between the door, finally my sister said she couldn't here the girl and sshe would have to open the door up. She told my sister she couldn't open tthe door and that security would have to do it, WTF?!?!?!? So the security guy came and unlocked the door, not with a key but by turnign the lock on thhe door, something that girl could have done herself. (And wait, what kindd of pizza place has a damn security person?) Definetly will not be back, ghetto ghetto ghetto, and a hot ass mess.", "rating": "1", "date": [2012, 9, 7]}, "21": {"description": "I have never had a bad experience here. The girls are always nice to me and cracking jokes every time I come there to pick up my food. Expect a 30+ min wait for your pizza, I always call ahead. They accept coupons and the food is never below amazing. The complaints about yelling thru plexiglass are unecessary because 1) they have an intercom system and 2) if you lived over there, you would understand why. Keep up the good work Stony!", "rating": "5", "date": [2012, 9, 30]}, "16": {"description": "Great pizza but overly priced. I have picked up from this location just once and I have no complaints. Even though the cashier, who was nice and respectful, was about two inches from sagging his pants from his knees.", "rating": "4", "date": [2013, 9, 3]}, "17": {"description": "Call it petty, but if I spend $40 on a pizza its crazy that I can only have 2 bags of parmesan. I'm big on customer service, and I hate that in black neighborhoods there are stupid rules like this. I can get 2 for one slice in other areas. There are 100s of pizza places, little things separate them from each other... learn what's good business.", "rating": "3", "date": [2014, 8, 9]}, "10": {"description": "This has got to be my favorite  Pizza place in Chicago. I'm not a real big deep dish fan so I get the thin crust with pepperoni, and Italian sausage, and when they say they laying on thick they mean it! This pizza is like a delicious cheesy slice of heaven. I can't really speak on the service cause I always call mine end but it's all ready hot and ready when I get there!I've also tried their taco pizza it's a bit messy but I enjoyed it as well!", "rating": "5", "date": [2014, 7, 21]}, "11": {"description": "This place has the worst customer service ever !!!!!! Literally every time I say I'm going to give them another chance they disappoint me. The people who answer the phone are absolutely horrible and rude. And when I was 9 months preggo the delivery guy wouldn't even bring my pizza to my door. I love the pizza from the beggars franchise but this is by far the worst location ever !", "rating": "1", "date": [2014, 9, 5]}, "26": {"description": "If you wanna have a heart-attack while scarfing down your second piece then this is the pizza for you.  I think the amount of cheese at least weighed 1 1/2 pounds. I had a small BBQ combo pizza. Sausage, grilled chicken breast,pepperoni, mozzarella and cheddar cheese, red onions and BBQ sauce. This pizza will kill you for sure.  I would like to know which corporate nit-wit said it was ok to mix mozzarella and cheddar cheese on pizza. After opening the box and seeing this monstrosity I was completely turned off after seeing how much cheese was dumped on this pizza.  And when I say dumped I mean by the truck load. Just a big glob.  This is a prime example of how Americans take something simple and bastardize it. Fred Sanford would definetly be going to see Elizabeth if he had a slice of this pizza.  SMDH!!!", "rating": "1", "date": [2010, 11, 17]}, "22": {"description": "The girls working here have real nasty ass attitudes. They were closing early to go to an event at the Shrine that weekend but yet there was no signs put up nor did they tell my brother-in-law we he called and ordered. They also should have had a special message on their phone as well and shouldn't have taken orders after a certain time to ensure they leave on time.When we pulled up, I could see the girl behind the counter had a nasy attitdde, we showed up 10 minutes before they were closing early and they kknew we were coming. My sister wnet up to the door to go in and pay and the door was locked, so the girl behind the counter started talkiing to my sistter between the door, finally my sister said she couldn't here the girl and sshe would have to open the door up. She told my sister she couldn't open tthe door and that security would have to do it, WTF?!?!?!? So the security guy came and unlocked the door, not with a key but by turnign the lock on thhe door, something that girl could have done herself. (And wait, what kindd of pizza place has a damn security person?) Definetly will not be back, ghetto ghetto ghetto, and a hot ass mess.", "rating": "1", "date": [2012, 9, 7]}, "0": {"description": "From the time I called in the order until the moment I walked out of the store with my pizza took almost an hour. In today's world that seemed a little long to me, however the pizza was still hot after a 14 minute drive and delicious! I will admit my expectations were low due to previous visits to this location but this visit was much better!!! The Beggar's franchise is known for stacking on the ingredients and this location got it right today, hopefully they continue the tradition.", "rating": "4", "date": [2015, 12, 24]}, "20": {"description": "I ordered 2 slices of cheese pizza, and got 2 slices of sausage. What else should I say in this review? I think I'm done. If you want Beggars Pizza, go to the north-side Chicago locations. This isn't the 1st time an order has been botched, and they're consistently understaffed and underwhelmed.", "rating": "1", "date": [2012, 11, 14]}, "19": {"description": "Quick delivery!! Told me it would be an hour and the delivery driver was here in about 40 mins. It was great!", "rating": "4", "date": [2013, 7, 3]}, "2": {"description": "The service is terrible,they don't have the same menu as other beggars, I stay right down street and I go to Blue Island location very courteous and they give more than one pack of Parmesan&peppers and you can play the lottery to ! Stop telling you're  friends to write good reviews", "rating": "1", "date": [2015, 9, 12]}, "18": {"description": "Where is the customer service at the Stony Island location?  Surely, your customer database stores the types of pizza your customers order.  And when a customer places an order by phone, don't you confirm it?So why did a relative of mine get an incorrect pizza order and was then told by the cashier, \"I don't make wrong orders\"?  I didn't know we lived in a perfect world.  Take ownership of your mistake next time.", "rating": "2", "date": [2013, 9, 2]}, "13": {"description": "Waaaayyyyy too expensive. $66.94 for 3 pizzas. Pizzas weren't even that tasty. For these prices I better be knocked off my feet impressed. I will not be returning.", "rating": "1", "date": [2014, 3, 6]}, "4": {"description": "they do not lay it thick anymore pizza were very thin. i spoke with lady name shon who were very rude.she told me we don't give refunds, so i suggest  you throw the pizza away... why would i throw.mu money away 20 dollars on a medium nasty pizza.i will never go back  to this beggars  on stony island ever  again if zero stars were an option i'll give them a negative 5 stars.terrible pizza and customers  service  equals no business  from me", "rating": "1", "date": [2015, 7, 16]}, "24": {"description": "Went there for the first time last night.  I called in an order. The young lady that took my order was VERY pleasant and helpful in helping us decide what to order. We decided on a large stuffed turkey sausage and chicken pizza and 4 wings. $30!!!! After eating my first slice, I wanted to go back and demand at least $20 back. It was not good at all. The chicken tasted old and the pizza just wasn't seasoned at all. I had another piece for lunch today, and I still feel the same.  I know how important it is to patronize businesses in our neighborhood, but unfortunately  I don't think that I will be going back.  I really LOVE Margaritas Pizza, but I refuse to put up with a rude person taking my order. I guess the search is back on for good pizza in South Shore.", "rating": "2", "date": [2011, 1, 1]}, "6": {"description": "Its a store front space with a sign on the door that says \"No Eating In The Lobby\"....which is understandable cause the lobby space only has enough room for a bench that customers use to wait for their orders to come up.Aside from that, the slices are delicious!!!! I get two if them and a can of pop, and then leave. There's is a lot of sausage,  the cheese is thick and the sauce is decent if not flavorful. The biggest downside maybe that the parking is smaller than the lobby space.", "rating": "4", "date": [2014, 11, 12]}, "15": {"description": "This place is the absolute worse pizza establishment on the south side of Chicago. The staff is very rude and unprofessional. I placed an order for a pizza over the phone, when I arrived the illiterate staff couldn't find my pizza. I asked them did the pizza grow legs and walk out. Goodness!!! The manager Shawn Ross refused to apologize about the incident and expected me to wait an additional 30-45 minutes, so they can prepare a new one. Absolutely unacceptable!!!!", "rating": "1", "date": [2014, 9, 10]}, "7": {"description": "Not too sure why other reviewers have had so many issues at this location. I've ordered from here at least 4 or 5 times and they've been incredibly consistent as far as the food and customer service are concerned. I have never experienced any nasty attitudes. And the people complaining about how much cheese is on the pizza are stupid. Their slogan is \"We Lay It on Thick!\" and they definitely do.", "rating": "5", "date": [2013, 8, 1]}, "8": {"description": "I placed an order and when I arrived to pick it up, they have no record of the order being placed.  They said I had to wait an 35 minutes which is addition to the 45 minutes from when I originally placed the order.  I asked did I have to pay full price and they said YES.  I just said that's ok and left.  They don't have to concern themselves with my patronage anymore.", "rating": "1", "date": [2015, 6, 7]}, "3": {"description": "I purchased two slices of pizza from beggars pizza @ 8100 S. Stony Island unitB on 4/13/2015 @ 248pm. As I. Began eating my slice I noticed a bright green hard piece of something next to my sausage which resembled either rodent poison or rodent dropping. I immediately called the restaurant and they advised me to bring it in. I brought it back @ about 315pm same day as i was already driving to my destination. I had to go out of my way to bring it back. The owner took one look and said it was the sausage. He showed no remorse or regard to my complaint as if he didn't want to deal with me. I tried to explain to him sausage is not green and his employee agreed with me. He walked off before offering an apology and listening to me. His only offer (which he informed the employee and not me before walking off) was another piece of pizza which I did not want as that piece may also be contaminated. I had to have the employee call him back to talk with me. He was very rude and wouldn't refund my money because they have a no refund policy. In a case like this you would think he would for one slice of pizza. He disregarded my complaint and walked off as I was talking to him. There needs to be an immediate inspection as this is a serious health precaution. I will never eat from this place again.", "rating": "1", "date": [2015, 4, 13]}, "14": {"description": "I catered lunch for my crew today in Hyde Park.  Although, I'm a lifetime fan of Beggars pizza none of my crew had the pleasure and was obviously skeptical.  Not only did the owner deliver himself, just to meet a new customer, the crew was floored by how good the food was.  Compared to catering from some Hyde Park eateries, this Beggars prices are a steal.", "rating": "5", "date": [2014, 10, 17]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.7475471496582, "longitude": -87.5862655639648, "rating": "2.5", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["12:00 pm", "11:00 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["12:00 pm", "9:00 pm"], "Fri": ["11:00 am", "11:00 pm"]}, "price": "$$", "categories": [["Pizza", "pizza"]], "address": ["8100 S Stony Island Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Loud", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Good for Groups": "No", "Good for Kids": "No"}, "category": "Restaurants", "number_of_reviews": "27"}, "groom-theory-unisex-hair-center-chicago": {"comments": {"0": {"description": "The owner (Aldo Brown) has been my barber since I was in high school... And for good reason. The shop boasts ONLY licensed barbers and a great atmosphere with free wifi and plasma TVs.", "rating": "5", "date": [2011, 11, 27]}}, "latitude": 41.7511902, "neighborhoods": ["Avalon Park"], "categories": [["Barbers", "barbers"], ["Nail Salons", "othersalons"]], "address": ["1419 E 79th Street"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.5896912, "category": "Beauty", "rating": "5.0", "price": "$$", "number_of_reviews": "1"}, "taurus-flavors-chicago-4": {"comments": {"28": {"description": "Great Hoogies and good prices", "rating": "4", "date": [2011, 10, 4]}, "1": {"description": "I'm a Cali girl and came to Chicago to visit my in laws. My man swears by his hoagies and I thought what the hell, let's give it a shot! Now I've had my fair share of sandwiches and when he ordered it with extra cheese and extra oil I thought, this can't be good... MAN, WAS I WRONG! I got a few looks standing in line, and it was a long line, BUT based on food alone, this was the best cold cut sandwich I have EVER had! We are here a few more days and not only will we be back, we will definitely be taking some back home!!!! AMAZING!!", "rating": "5", "date": [2015, 4, 6]}, "9": {"description": "**Update** I drove past Taurus Saturday and there was a crowd of people inside! It looks like they are up and running again. (Does anyone know the reason for the downtime?)", "rating": "5", "date": [2015, 2, 19]}, "29": {"description": "This is one of those \"hidden treasures\" of the south side!  Being raised in Michigan (which really doesn't have a \"foodie\" reputation to begin with), I was woo'ed by MANY foods when I moved here to Chicago back in 1997! This was from pizza to asian food, Greek food, to simple spots like J&J Fish!  I thought I had a \"hoagie\" when I tried Mr. Submarine's sandwiches...and, for the most part, I was pretty close to the ultimate.  However, it wasn't until 2005 when a dear friend of mine offered to bring me lunch at work that I was knocked OFF MY FEET by what was a white turkey breast hoagie from Taurus Flavors!  Being that I was raised not eating pork, I was beyond impressed that this place served absolutely NO PORK in their restaurant...only turkey and beef products!  I'm thinking \"WHAT? A spot in Chicago that DOESN'T SERVE PORK AT ALL?? NO WAY!\"  LOLAnyway, I have tried the steak hoagies and the turkey and both are FABULOUS!! Best hoagies I have ever tasted in my life!The service is strictly professional. No joking around or jive talk from the staff. And my orders have never been given to me with any errors. I currently reside in Naperville and every now and again, I will drive an hour all the way over to grab a few sandwiches to take back to the burbs (and pick up a few extras for my friends nearby) if I get a craving!This place is definitely worthy of way more than 5 stars... They deserve 20!FYI: THIS PLACE DOES NOT ACCEPT DEBIT/CREDIT CARD! CASH ONLY!", "rating": "5", "date": [2011, 9, 14]}, "23": {"description": "They need to step their game back up!  The food is not what it use to be.  You maybe fooled by the crowd outside.  Some are there to order food, the others are there to sell stuff outside the restaurant.  No, I don't want a dvd, I can go to RedBox!  Anyway, they never have white turkey meat, then take it off your menu!  They need a restaurant make over from top to bottom!", "rating": "1", "date": [2012, 6, 24]}, "5": {"description": "I was a fan of Charlie's Blade and Spade steak sandwich back in the day. I would drive clear across town to get one. I've seen reference that Taurus steak sandwich tastes like Charlie's. Well it did not. Taurus steak sandwich was wet where it should have been dry and dry where it should have been wet. They try to capture Charlie's Blade steak flavor but fall short.  My stomach rumbled for hours and I didn't eat the whole thing.  I ate the bread because the meat was too stringy with strands of fat or ligaments.The beef was dry. I thought it would be saucy but it wasn't. There were chunks of neon green bell pepper that was sweet, I didn't eat that because the color threw me off.  The sandwich was more like a philly cheese steak but not as good and with sweet toppings. Also I kept chewing on something dry like paper, I couldn't tell it it was onion, meat or paper.   I guess my review is jaded because if you tasted Charlie's Blade and Spade you'd know what I mean.I won't go back because it's out of my way and I keep seeking that old Charlie's taste. Service was fast and their was a steady line. It's a carry out, small aged little shack on Stoney Island (a busy street), so it's a safe location.   They sale hoagies but I only eat Fontanos deli subs. My rating is 1out of 5.", "rating": "1", "date": [2015, 9, 26]}, "31": {"description": "THIS...  Is a Special Review for a place I have LOVED since before the internet and Long before I knew what a review was.  If I could: I would give this place 11 stars.  Every Other word would be BOLD.  Every third phrase would flash.  There Would be an embedded audio track of my own creation SINGING the praises of this place.  As tacky as I think all of those things are, and as much as I Hate to see them... If allowed, I would Not be able to stop myself.  Thank you Yelp for your forced moderation.  No, REALLY.... Thank You.Long story shortened, I have LOVED this place for 25+ years.  I choose no to be more specific.  Although over that period I have probably had everything on their menu, there is only one thing I do or even Need to remember.  @}------- ** The Supreme Steak ** -------{@Yes.  It gets it's own line, with roses & padding.  You didn't see it, but I just added more.I have lived in or near Chicago, New Orleans, Boston, Dallas, San Francisco, San Jose, Los Angeles, New York and visited Egypt, Beijing, Shanghai, South Korea, Italy, France, Puerto Rico and many other places that aren't jumping out at the moment but I have never had Anything that has moved me and stayed with me like a Taurus Flavors Supreme Steak.Think about that one thing in your life that you've eaten and there's NOTHING else that can take it's place.  You can go YEARS without it, forget you even ever had it, but the moment you're in it's vicinity, you're going to have it again, because its a fact of life like the rising and setting sun.  That is what the Taurus Flavors Supreme Steak for me.It's probably a really good thing I don't have regular access to them.  This probably shouldn't even be considered a review.  I have NO IDEA what the service is like.  I don't care.  I don't remember what the rest of the menu is like.  I don't care.  Calories? Cholesterol?  Fat? Sodium?  Price Range... I think it's cheap... I Don't CARE!  Go get a Supreme Steak.  Put it in your Mouth, and Thank Me Later.", "rating": "5", "date": [2010, 9, 15]}, "25": {"description": "I ditto everyone here that have written paragraphs about the hoagies and steak.  You wanna man to like you, dress sexy.  You want him to marry you, bring him a Taurus.  I moved to the burbs and I hate that I can't have my drug of choice when I get that itch, (nawww..mean)  But maybe that's a good thing.  When I do come to the city, thats where you'll find me bringing back 10 at a time.  All for me!!!! well actually I got my boyfriend from NY hooked on them as well.  Taurus,Please dont ever change and get some locations in the NW surburbs.  I know white ppl will love them as much as black folks", "rating": "5", "date": [2011, 12, 5]}, "12": {"description": "There's nothing like a Chicago style hoagie or cheese steak!  I grew up on the south side and Taurus was a must for me.  I have been eating Chicago hoagies since I was a child.  I remember when dollar Wednesdays really meant the small hoagie was only a $1.  There is something about the mix of seasoning, oils, meat, rolls and veggies that no other hoagie shop in the city of Chicago or Philly can match. After going to Philadelphia recently and trying their \"famous\" cheese steak sandwiches I was not impressed at all, especially since they use cheese whiz on their sandwiches.   The steak in Philly was not cooked like a Taurus steak, which is finely chopped and full of season.  Hands down, Chicago Taurus Flavors has the best hoagies and cheese steaks in town.Every time I visit home I have to get a hoagie and steak sandwich from Taurus.  Wish I could ride down Stony Island and pick one up a couple of sandwiches right now.", "rating": "4", "date": [2013, 10, 21]}, "21": {"description": "The biggest decision of the work day where are we going to eat. Since we were out on the southside we decided to eat somewhere that some of my co workers knew so we ended up here. Its a little white hutch with the founder family and noted Chicago. I got the steak supreme regular $3.50 and it was just okay. I feel like this was stumbled upon one day when the owner had steak some rolls and decided to.do his own spin on a philly/beef sandwich. To me its too sweet maybe add some hot giardinara and the sandwich becomes better. I like to try the Turkey cause after I order 6 people orderd it so I'll give them another chance if I'm out Southeast.", "rating": "3", "date": [2012, 9, 7]}, "16": {"description": "THIS...  Is a Special Review for a place I have LOVED since before the internet and Long before I knew what a review was.  If I could: I would give this place 11 stars.  Every Other word would be BOLD.  Every third phrase would flash.  There Would be an embedded audio track of my own creation SINGING the praises of this place.  As tacky as I think all of those things are, and as much as I Hate to see them... If allowed, I would Not be able to stop myself.  Thank you Yelp for your forced moderation.  No, REALLY.... Thank You.Long story shortened, I have LOVED this place for 25+ years.  I choose no to be more specific.  Although over that period I have probably had everything on their menu, there is only one thing I do or even Need to remember.  @}------- ** The Supreme Steak ** -------{@Yes.  It gets it's own line, with roses & padding.  You didn't see it, but I just added more.I have lived in or near Chicago, New Orleans, Boston, Dallas, San Francisco, San Jose, Los Angeles, New York and visited Egypt, Beijing, Shanghai, South Korea, Italy, France, Puerto Rico and many other places that aren't jumping out at the moment but I have never had Anything that has moved me and stayed with me like a Taurus Flavors Supreme Steak.Think about that one thing in your life that you've eaten and there's NOTHING else that can take it's place.  You can go YEARS without it, forget you even ever had it, but the moment you're in it's vicinity, you're going to have it again, because its a fact of life like the rising and setting sun.  That is what the Taurus Flavors Supreme Steak for me.It's probably a really good thing I don't have regular access to them.  This probably shouldn't even be considered a review.  I have NO IDEA what the service is like.  I don't care.  I don't remember what the rest of the menu is like.  I don't care.  Calories? Cholesterol?  Fat? Sodium?  Price Range... I think it's cheap... I Don't CARE!  Go get a Supreme Steak.  Put it in your Mouth, and Thank Me Later.", "rating": "5", "date": [2010, 9, 15]}, "17": {"description": "Quick service. Steak sandwich is not as good as Home of the Hoagy. No fries! Sauce and seasonings on steak sandwich make the difference. They get the extra star for convenience.", "rating": "3", "date": [2014, 2, 11]}, "10": {"description": "Pretty good food except yesterday they put seasoning on my hoagie when I didn't ask for it they need to learn how to listen to orders. But other than that their food is great.", "rating": "3", "date": [2015, 3, 1]}, "11": {"description": "After a decade of refusing to try their subs (I'm not a sandwich girl but one of my favorite people swears by them), I finally got tired of saying no to him & gave in. I believe the sandwich I had was a signature turkey sub of sort and I did actually enjoy it. Nothing spectacular & I'm still not a sandwich girl BUT I will likely patron Taurus every now & then. I'm sure my son will be obsessed with them once he's old enough. It's in his genes. If you love subs, Taurus will make you happy.", "rating": "3", "date": [2014, 10, 18]}, "26": {"description": "I have never tasted better hoagies. I just love the South Side with its many hidden gems. The place does not look like much and slightly dark looking from the outside but, its always packed. Its my personal heaven when I want something with overall goodness. Although, you would put on major pounds eating them constantly.I usually go on a Wednesday or Friday. Wednesday they have specials on the steak hoagy and the small hoagy. I mean you cannot beat $2.75 for a hoagy, pop, and chips or $3.75 for a steak combo. Now, I must introduce you to \"The way of the hoagy\". It is a certain way that you should enjoy this little peace of deliciousness, It starts by finding a old shirt that you care nothing about. Then, you unwrap the sandwich slowly. It is now time to enjoy, bite into the sandwich vertically. Hoagy juice will get all over the shirt. It is the sign that you did these steps successfully. P.S. Strictly Cash Only!", "rating": "5", "date": [2011, 10, 26]}, "27": {"description": "I'm a fan. There are reasons why places stick around for over 40 years: loyal customer base, quality product, consistency. I can't speak for factors 1 or 3, but 2 impressed me and I can see why people flock from all over to get their mitts on one of these hoagies.They're delicious. Simply put. But, before I get to that, understand that there's a process to enjoying the sandwich. First, park behind the building. You might be tempted to park on the street. Don't. Stony Island is busy and crowded. If you attempt to park your vehicle while folks are flying past at 70 mph, there will be words. You will not want to hear them. Park in back. Then, once you've parked, walk inside, bypass the dude with the karate kid breath (cuz it was KICKIN'!) trying to sell bootleg DVDs, walk to the right side of the counter (as you're facing it), peruse your selection, step up, order, step back. While the folks behind the counter won't soup nazi your n00b azz, the folks waiting for their food will. Again, 40+ years. Don't screw the system. Once you've ordered (make sure you get chips and some sort of HFCS fruity soda; I chose grape), step up, pay (CASH ONLY) and get out. There's no seating, so come with a plan as to where you're going to dine. Got it? Good.Now, for the sandwich. Excuse me, the hoagie. I loved the fact that I didn't have to ask for a turkey sandwich and be looked at strangely. In the home of Italian Beef and steakhouses galore, not being a beef eater is, sometimes, a weighty label to bear. Here, you can get your turkey on without so much as a side-eye. I got the Regular (regular-sized/medium). It came packed with smoke turkey, cheese, oil, onions, vinegar, tomatoes, pickles, and herbs. It was very oily -- in a good way. You know, the way that makes the hard bread soft enough t be chewy and requires you to sop? Yeah, sop. It's like that. And, I savored every bite. The hoagie can be a mess, but if you are prepared and stacked with napkins, you'll be fine. Of course, the best thing to drink with such a hoagie is a brightly-colored HFCS soda with a fruity name. As mentioned earlier, I chose grape and I was wise to do so. Eating my meal, I felt as though I was participating in a Chicago tradition and I felt honored to have done so. Taurus Flavors *is* Chicago and I am so pleased to have finally experienced it. Maybe next time I'll take advantage of the ice cream and cookie selection... and maybe = definitely.", "rating": "4", "date": [2011, 10, 18]}, "35": {"description": "This place is a few miles from me. The food is okay but I think it's over priced by $2.", "rating": "3", "date": [2005, 12, 27]}, "8": {"description": "I grew up, just down the street from Taurus Flavors! Every time I come back, to the Chi, Taurus Flavors is always on my list, of places to hit up before I leave! Hoagie! 87th 4 Life!", "rating": "5", "date": [2015, 5, 22]}, "0": {"description": "I am glad to have the opportunity to give a review for them. I can remember as a young girl my uncles introducing me to their wonderful sandwich. But as as an adult I have grown to love their lemon ice cream. I highly recommend this place for a good hoagy. P. S. Make sure you try their steak sandwich too. OMG!", "rating": "5", "date": [2016, 1, 14]}, "20": {"description": "Ever have a taste for a really good hoagy or steak sandwich?  It doesn't get any better than this.  I've been eating these sandwiches since I was in high school.  There's always standing room only here (there's no place to sit down).  It's truly a carry out only establishment.  They also ONLY take cash, but the prices are so good, you'll have enough.  Their service fast, and they keep the line moving. Wednesday is discount day so if you don't want to stand in a long line, pick another day.", "rating": "4", "date": [2013, 5, 3]}, "19": {"description": "I'm a fan. There are reasons why places stick around for over 40 years: loyal customer base, quality product, consistency. I can't speak for factors 1 or 3, but 2 impressed me and I can see why people flock from all over to get their mitts on one of these hoagies.They're delicious. Simply put. But, before I get to that, understand that there's a process to enjoying the sandwich. First, park behind the building. You might be tempted to park on the street. Don't. Stony Island is busy and crowded. If you attempt to park your vehicle while folks are flying past at 70 mph, there will be words. You will not want to hear them. Park in back. Then, once you've parked, walk inside, bypass the dude with the karate kid breath (cuz it was KICKIN'!) trying to sell bootleg DVDs, walk to the right side of the counter (as you're facing it), peruse your selection, step up, order, step back. While the folks behind the counter won't soup nazi your n00b azz, the folks waiting for their food will. Again, 40+ years. Don't screw the system. Once you've ordered (make sure you get chips and some sort of HFCS fruity soda; I chose grape), step up, pay (CASH ONLY) and get out. There's no seating, so come with a plan as to where you're going to dine. Got it? Good.Now, for the sandwich. Excuse me, the hoagie. I loved the fact that I didn't have to ask for a turkey sandwich and be looked at strangely. In the home of Italian Beef and steakhouses galore, not being a beef eater is, sometimes, a weighty label to bear. Here, you can get your turkey on without so much as a side-eye. I got the Regular (regular-sized/medium). It came packed with smoke turkey, cheese, oil, onions, vinegar, tomatoes, pickles, and herbs. It was very oily -- in a good way. You know, the way that makes the hard bread soft enough t be chewy and requires you to sop? Yeah, sop. It's like that. And, I savored every bite. The hoagie can be a mess, but if you are prepared and stacked with napkins, you'll be fine. Of course, the best thing to drink with such a hoagie is a brightly-colored HFCS soda with a fruity name. As mentioned earlier, I chose grape and I was wise to do so. Eating my meal, I felt as though I was participating in a Chicago tradition and I felt honored to have done so. Taurus Flavors *is* Chicago and I am so pleased to have finally experienced it. Maybe next time I'll take advantage of the ice cream and cookie selection... and maybe = definitely.", "rating": "4", "date": [2011, 10, 18]}, "33": {"description": "Good steak sandwich, the sauce is what makes it yummy.", "rating": "3", "date": [2008, 11, 25]}, "2": {"description": "I've been eating Taurus flavor's steak sandwich sweet for years and they never let me down. Everything they have is the bomb! But, there is nothing like there steak sandwiches in the whole wide world. Trust me!", "rating": "5", "date": [2015, 11, 23]}, "34": {"description": "This place is pretty good. The service is ok. Very no nonsense so make sure you know what you want. It's super crowded on Wednesdays due to their awesome hoagies specials. I love the chicken breast hoagie. The bread is always fresh and I love the oil and sweet peppers. This place is definitely becoming one of my favorites. Screw subway!", "rating": "4", "date": [2008, 10, 8]}, "32": {"description": "This line has the potential to be out the door in the dead of winter. The sandwiches are made fresh to order and is fye as hell! Double steak no peppers or a large turkey w/oil. Back in the day when I was youngin and my metabolism was much faster I would get a steak AND a turkey and max it in one sitting. Can't do that anymore :(( Great place for dirt cheap good food!", "rating": "5", "date": [2010, 2, 16]}, "18": {"description": "I can walk here but choose to drive to Home of the Hoagy.  I like their food so much better.  The hoagies here are ok but the steak sandwich is just plain awful.", "rating": "2", "date": [2013, 11, 3]}, "13": {"description": "I can't live without Taurus Flavors. I always get a large ham hoagy extra sweet. My favorite location is the one on 85th and Stony. Been eating hoagies since I was 8. Catch the bus from the west side once a week and go there. The 3 footers are only $13.50 abs its big as Hell. I'm lovin' it!", "rating": "5", "date": [2013, 11, 27]}, "4": {"description": "Um, so I came here in the summer (forgot to review) and I could have sworn when I was younger that Taurus Flavors was called such because of the ice cream. They had their own ice cream. It was so much better than Baskin Robins, or so I remembered. I was soooo craving some chocolate chip ice cream. I remembered that the ice cream was this amazing vanilla and the chocoalate chips weren't chips at all, but these long straw like things. Yums...So I go inside and stand in line with about 20 other people...who are all ordering hoagies...what? I don't remember this part of Taurus Flavor. Now it is Chicago and people do love their meat, but there has to still be ice cream, right?By the time I made it to the register I found out there were like 3 flavors...whomp. Served in a styrofoam cup. whomp. whomp. I waited all that time so I got the ice cream and left. So disappointed. I am happy they have handmade signs though. Good to see a place still in business, although it doesnt' look like it's the same owner. whomp.", "rating": "2", "date": [2014, 1, 14]}, "24": {"description": "Best hoagies EVER! I grew up eating these and thankfully it is not near my home. I would definitely be in trouble if it was.  Definitely a must try, but you will get addicted.", "rating": "5", "date": [2012, 6, 10]}, "6": {"description": "The steak hoagie is to die for I crave that sandwich like a drug what can I say I just love this place", "rating": "5", "date": [2015, 8, 22]}, "22": {"description": "i use to come here a lot when i was younger for ice cream, i would get chocolate chip and my little sister would always get bubble gum. it wasn't until I was a teenager that i discovered their sandwiches. i wasnt really into the hoagies but I fell in love with the steak sandwich it was sooo good, that sweet tangy sauce, the tender beef and the soft roll. well i was out with a friend of mine and after a night of getting slapped it was time to go home as soon as i got into her car the aroma of hoagie hit me she had bought it for some dude but for some reason she ended up not giving it to him lucky for me, after scraping the lettuce and the other junk i dont like i ate one of the best sandwiches i have had in a long time it was so good that the next day after heavy weekend day drinking i had to go get a steak and boy did it not disappoint. i fell in love all over again", "rating": "5", "date": [2012, 7, 19]}, "15": {"description": "This is one of my favorite spot good sandwich and good prices can't beat it!!! It's always busy so you know it's got it be good check it out", "rating": "4", "date": [2014, 5, 14]}, "7": {"description": "My mom used to bring me here as a kid, this is really a drop in and go place... I'm not trying to be judgemental but due to the type of crowd it draws, I would be hesitant to bring kids in for picking up the food.  The hoagies are great though, full of flavor, but not as flavorful as the home of the hoagy on 111th street.  I still will continue to visit when I want to indulge in a hoagy!", "rating": "4", "date": [2015, 5, 1]}, "36": {"description": "this is the place u go to if you lookin for a kickass hoagy or steak sanwich. the service is good and the food is one that shows what its all about over here on the southside of Chicago. the hoagies come in small, medium, and large, whereas, the steak sandwiches come in a small and a large. expect to pay anywhere from 4 to 6 bucks", "rating": "3", "date": [2005, 7, 11]}, "30": {"description": "Yeah, the sandwiches are good. I go here repeatedly, no problem with this place at all! The steaks are B-I just wish Home of the Hoagie was closer! A++", "rating": "4", "date": [2011, 3, 8]}, "3": {"description": "This lace has been apart of the community since 1966...That's just one year shy of 50 YEARS! Best Taste'n \"Old Fashioned\" Steak Sandwich in the South side of Chicago...Period! Juicy and tender slices of steack with onions, hot and sweet peppers...BAM! Great hand-packed ice cream, too! Only thing is...you better be ready to wait in line! This place is busy from lunch time til close!", "rating": "5", "date": [2015, 5, 28]}, "14": {"description": "Definitely a HOOD CLASSIC!!!  I grow up loving them and will continue to support this community business.  Supreme Steak...YUM!!!!!", "rating": "4", "date": [2014, 5, 2]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.7395235242512, "longitude": -87.5859457080482, "rating": "4.0", "times": {"Mon": [], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "10:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": ["11:00 am", "6:00 pm"], "Fri": ["10:00 am", "10:00 pm"]}, "price": "$", "categories": [["Ice Cream & Frozen Yogurt", "icecream"], ["Sandwiches", "sandwiches"]], "address": ["8534 S Stony Island Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Good for Kids": "No", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Divey", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "37"}, "angies-hair-salon-chicago": {"comments": {"3": {"description": "Visited this shop today for the first time and my experience was very pleasant. The stylist that I saw was Zelda who is absolutely amazing and her chair side manner is wonderful. I will definitely be booking with Zelda into the summer..", "rating": "5", "date": [2015, 4, 22]}, "1": {"description": "The only reason why I'm giving this place 2 stars because my stylist individually was the bomb.When I got my hair done here, there was a young lady with a short blonde cut on the left side. I can't remember her name (below will tell the story) but she did a phenomenal job... still used barrel irons (which I loved) and my hair lasted forever. I had a sew in and she did a wash and style for 65$. I was planning on scheduling another appointment for a bob but until today. I had been referring people to this salon over and over. This time, my mother needed a new place to go. She's older and has a lot of questions. She called the salon and the receptionist was beyond rude to the point of my mother, the sweetest lady in the world, calling me cursing about her horrible experience and how the receptionist was rude, nasty and wouldn't answer simple questions, like \"is a specific stylist still working there?\" I'm confused, as I've recommended black senior leaders at my job to the shop, called the salon because this is also my brand. The receptionist was even more rude to me, I had to wait a good five minutes (after getting interrogated) to speak to the owner. After speaking to the owner, she was calm and listened. She only finished with a \"Thank you for letting me know,\" and we hung up.I think it's so beautiful that black businesses are doing so well that a rude receptionist can lose potential clients/money and they can be just fine with it. Hats off to you sis, your next venture should be teaching a business course at Harvard focusing on how in 2015 first point of contacts no longer represent the brand.", "rating": "2", "date": [2015, 2, 21]}, "2": {"description": "I've been a client of Angie's for over 20 years. I love the experience I have going to get my hair done. The environment is clean and the clientele and other stylist are very friendly. If you are looking to get an awesome hairstyle in a warm, friendly, and professional environment, then Angie's Hair Salon is definitely for you!", "rating": "5", "date": [2015, 2, 28]}, "9": {"description": "I went to Angie's for 2 months and there were a few things I didn't like. First off, if your appointment is at 10am, expect to spend the half the day there because they will book 20 people under that same time slot. The waiting time is crazy. Then once I've waited for 6hrs after my wash & dry then it takes only 15-20min to style my hair. I thought to myself damn, something so simple it takes almost 7hrs  to complete. It's crazy to wait that long for a simple wash and press!!!!", "rating": "2", "date": [2012, 12, 22]}, "10": {"description": "I scheduled an appointment with Paulette at 4 pm on a Thursday. She was very professional and pleasant on the phone.  I arrived about 20 minutes early. I was informed that she wasn't there yet. No big deal since I was early. At about 4:15, I inquired about my appointment. Another stylist, who was pleasant as well, informed me that I was next to be shampooed. At about 4:30, a rude shampoo girl came over and asked who I was there for. I told her Paulette and she said OK then walked away. At 4:45,  I was still waiting along with two other clients with no word from the stylist or the shampoo girl. At 4:50, I grabbed my coat and left. Everyone in the salon watched me walk out of the door without a word. No one ever contacted me to apologize or reschedule. I live in Evanston and I only drove all the way out there because I heard such good things about the stylist. After my experience, I would not recommend her to anyone.", "rating": "1", "date": [2013, 1, 8]}, "4": {"description": "Prior to finding Angie's salon on Instagram in September 2014, my hair was very brittle and limp. HOWEVER, now after six months my hair is healthy and long. I would definitely recommend my stylist, Regina, to anyone with short and long hair!", "rating": "5", "date": [2015, 2, 28]}, "6": {"description": "My stylist has always been Shaleah, and I love coming here! The salon has a fun atmosphere, everyone is very friendly and informative, and the architecture is flawless.  They offer a few TVs while you wait, and once you are in the chair, service is FAST! Went in for a color after getting my hair trimmed and Shaleah once again did a fantastic job! This location is also convenient for me to drive to, which is a big plus.", "rating": "5", "date": [2014, 8, 11]}, "12": {"description": "did a great job on my daughters damaged hair!!!!!! i am now a fan great service.", "rating": "5", "date": [2010, 12, 30]}, "5": {"description": "I have lived here for over seven years, an I have run into plenty of hair stylist, but never anyone like Ray. She is personal, on time, did an excellent job on my hair and very patient. She took the time to explain what and why this would be best for  my hair. Although, the salon is not in the best area Angie's hair salon is clean and the other hair stylist are great as well. You may come in feeling down, but leaving feeling like a million dollars. I must say my experiences here has been great. Thanks", "rating": "5", "date": [2014, 9, 22]}, "11": {"description": "It's so refreshing to find a classy salon where the staff/owner are friendly and they do good work.  I was very pleased with my hair and the overall service.  I'm definitely planning on becoming a regular.", "rating": "5", "date": [2011, 2, 20]}, "8": {"description": "First visit review:My stylist was Zelda. I went for shampoo, flat iron and hot oil treatment. Left the salon with bouncy, curly and healthy looking hair. Zelda was an excellent stylist, not overly talkative, but very personable. She took time to get to know me and my hair, particularly preference to style and home care routine. My hair is natural and it was great that she did not use too many or too much product...I didn't even have to tell her! The best part I booked same day and I was in and out in less than 1.5 hrs....no overbooking (I may be a southern belle, but I hate waiting)!!The salon itself is very nice, the music is not blasted, and the stylist keep conversation at a nice professional level. It felt very professional and quiet despite several stylists and customers. There was no yelling across the salon or gossiping. There are plenty of dryers so u don't have to wait with wet hair!! Salon provides a large and comfy waiting area. Beautifully decorated with an open floor plan. My only con is that on line booking is available and credit cards are accepted, but you have to double check with each stylist first. There is a beautiful front desk area, but no one is there to greet you or check u in.Overall, this a diamond in the rough! A modern, professional salon that's probably overlooked because of it's area. Quality work at a great price.Pls note I did go on a Thursday afternoon.", "rating": "4", "date": [2012, 5, 24]}, "0": {"description": "Not only is the owner awesome, personally she rocks as a stylist. Each stylist within her salon reflects her personality and spiritual growth. They are very passionate about hair and innovative with the latest styles and product... been a faithful customer for literally 20yrs.", "rating": "5", "date": [2015, 12, 4]}, "7": {"description": "Great place to go for your hair appointments. I have had Jamila as a stylist for about two years. She takes great care of my hair. Saturdays are pretty busy so I usually try to go during the week in order to be in and out in about 2 hours. All of the stylist are very nice ladies and the salon is very clean!", "rating": "5", "date": [2014, 11, 4]}}, "latitude": 41.7663955688477, "neighborhoods": ["South Shore"], "categories": [["Hair Salons", "hair"]], "address": ["1922 E 71st St"], "attributes": {"Parking": "Street", "By Appointment Only": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "longitude": -87.5777816772461, "category": "Beauty", "rating": "4.0", "price": "$$", "number_of_reviews": "13"}, "sun-beauty-supply-chicago": {"comments": {"0": {"description": "This neighborhood beauty suppy has all your hair need products but I think they are ready to give it it. I went into the establishment 15 minutes before they close and could not get serviced. I wanted to look at some hair but was told to come back tomorrow bc they were. about to close. It wasn't busy, actually when I walked in I was the only one there. Then about 2min lat er someone else came in. Not sure what the rush was for to close but I guess they makin it good. Since you dont need my money I will go someplace else. It was good while it lasted... Another neighborhood business going to the dogs!.", "rating": "2", "date": [2015, 8, 4]}}, "latitude": 41.7372, "neighborhoods": ["Avalon Park"], "categories": [["Cosmetics & Beauty Supply", "cosmetics"]], "address": ["1634 E 87th St"], "attributes": {"By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.58378, "category": "Shopping", "rating": "2.0", "price": "$$", "number_of_reviews": "1"}, "wendys-chicago-15": {"comments": {"3": {"description": "I wish I could give this location a ZERO for their terrible customer service. The girl working the drive thru never said a word. Didn't speak, give me my total say thank you, she didn't even smile. Just rude! How can she possibly work in customer service?! My sandwich was dry like they re warmed it. I'll never eat Wendy's again and I feel like complaining to corporate because every time I go to this location its always terrible customer service!", "rating": "1", "date": [2014, 12, 9]}, "1": {"description": "The craziest fast food experience I have ever had! Ordered a combo for one person and the drive thru order screen was frozen so I could not confirm the order. Upon arriving at the window, I am told I owe over $13 and am given a receipt for someone else's order. Despite giving back the wrong food three times, they could not get it right and I gave up. This drive through is complete chaos. And the drive thru attendant cannot make change at all.", "rating": "1", "date": [2015, 12, 3]}, "2": {"description": "A good neighborhood fast food restaurant. New menu featuring 4 for $4. Less expensive than the meals! Good for a add on too!", "rating": "4", "date": [2015, 11, 5]}, "5": {"description": "The driver thru cashiers are so disrespect. I remember when my mother was the manager for this location. Everyone was friendly and smiled. Several years later and with new management even after the update this establishment still hasn't gotten better.", "rating": "1", "date": [2014, 8, 17]}, "6": {"description": "The drive thru lines tend to be a little long sometimes, but they move fairly quickly. My orders are always accurate and fresh, besides the one time my fries were barely half full.The berry almond chicken salad is one of my favorites.", "rating": "4", "date": [2013, 6, 7]}, "7": {"description": "No icecream? really? in a heatwave like this?! wow...#6 with fruit punch. #thatisall", "rating": "3", "date": [2011, 7, 21]}, "0": {"description": "Super pleased upon realizing that there is a Wendy's here!  Great experience today--quick service and delicious, inexpensive food.", "rating": "5", "date": [2016, 1, 28]}, "4": {"description": "If i could give this location zero stars I would. I blame myself for giving them more than one chance. They are constantly sending out wrong orders...get snippy when you correct them and are unprofessional both in person and over the drive thru speaker. This location remodeled but didn't loose the dead weight employees. It's not my fault you work the night shift at Wendy's maybe if you had a better attitude you would land a better job. Stay clear! Drive down to the one on Ashland if Wendy's food is what you are craving.", "rating": "1", "date": [2014, 11, 4]}}, "latitude": 41.7376003414392, "neighborhoods": ["Avalon Park"], "categories": [["Fast Food", "hotdogs"], ["Burgers", "burgers"]], "address": ["8645 S Stony Island Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Very Loud", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Good For": "Late Night", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "No", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.585175037384, "category": "Restaurants", "rating": "2.5", "price": "$", "number_of_reviews": "8"}, "star-cinema-grill-arlington-heights": {"comments": {"58": {"description": "For one, I hope we all know to NEVER pay attention to someone with no friends and one or two reviews. For two, this place is still fantastic! We love it! Best ticket prices around. Especially when there is a groupon. The food really isn't that overpriced. I wish I could be present and sitting next to anyone who has had a bad experience here. I'm 6'2\" and while I can't go around folding one leg over the other I am FAR from being uncomfortable. Anyone that is shorter than 6 foot that feels uncomfortable was probably not hugged enough when they were a kid. Live the dream, eat and watch a movie at the same time. My motto in life, don't listen to idiots. Enjoy!", "rating": "5", "date": [2014, 3, 7]}, "56": {"description": "Way better than I expected.We came in on a $5 groupon, but it is only $7 on Tuesday & Thursday anyway, I don't understand any whining about not being senior or children priced friendly or the food overpriced. Pretty slick way to wrap up dinner AND a movie. Very friendly movie staff and servers. Looks like a pretty safe place to drop your kids, or seniors off.I trusted Howard C. on this one, and he was right. This place is better than ok, tons of legroom (don't trip the servers ;~) and prices aren't that bad for a night out. Tues and Thursay there are specials like $1.25 for sliders, $3 drafts and $5 off a pitcher of beer, and we liked the largeish $6 house salad, onions rings pretty good, and the sweet potato fries looked even better. Service isn't super fast but just relax into being served in the movie theater, I liked it. I also like carrying Turkey salad into the Catlow from BOLONEY'S. Getting there about 30 minutes early is perfect so you don't have to do the cellphone flashlight on your menus, your neighbors will appreciate that.I had expected the servers and neighbors eating to bother me but it wasn't bad at all, and I did have a cell phone flashlight menu reading neighbor, but it actually made it a little more guilt free when you were whispering to your partner during the movie, because so was everybody else, quietly. It is a little tricky to get out of the seats with the table in front of you but I still like to hold my food down when I can.I didn't see the magic of the 4k screen, my plasma is definitely better, but good enuf and the sound was fine. Our screen was kind of over on the left side of the room for some reason, like somebody very non-Union afterhours hung that one.We are fans, try it.", "rating": "4", "date": [2014, 3, 28]}, "29": {"description": "This theater is amazing. Definitely my favorite that I've ever been to! Best in the area. They have great specials, service is excellent, environment is classy, and it is in a great location.", "rating": "5", "date": [2015, 2, 28]}, "42": {"description": "A girlfriend and mine went and saw a movie and ate dinner here for the first time last week and we are definitely coming back!!!  The food is absolutely wonderful!!  Seriously delicious!!  The service was great and promt and the table is right in front of you so easy to eat!  The drinks are nothing to ride home about though. Downfall is that the chairs don't recline all the way major disappointment but for the food alone we will be back!!!", "rating": "5", "date": [2014, 11, 1]}, "23": {"description": "This movie theater was the best experience I ever had at any theater! Initially we went there because we were hungry as well. Did you know Tuesday and Thursday are the best days! $7 movies and so many discounts on food AND drinks! When you sit down, in front of you is a table along with a menu and paper to order. Once you press the button your host or hostess will arrive to take order!! How cool is that! I love their exceptional customer service. Special shout out to our host Nick for being prompt and friendly as well as the manager on duty April 30th 10:30p show. My friend left her purse there. After realizing when we got home, we called and she literally waited until 1:30 in the morning to hand off the bag. WOAH!! Definitely a company who cares about their customers. Please take anyone there or just yourself because it is an awesome experience! I will be returning!", "rating": "5", "date": [2015, 5, 27]}, "47": {"description": "Came here got great service, good selection of drinks and comfortable seats. I would definitely come here again recommend this to others. I will say this the food was mediocre and it's a little chilly in the theatre so you better eat your food fast.", "rating": "4", "date": [2014, 8, 16]}, "8": {"description": "Pros:It's a good place to take your kids, there is no flashy food ads. The seats are comfy.Cons:Don't order the food, its bad and it's late. Go to Panera Bread before your show.But if you do order food it's a hit or miss, today it took 1 hr to get our food and drinks the movie is almost over,  and it was an 11am show with only about 15 people at the movie.  The food was cold and did not taste fresh. So far 3 out of 3 times I got stomach pain from the food.", "rating": "2", "date": [2015, 8, 22]}, "31": {"description": "We love Star Cinema Grill!!  We live close, so we just walk on over at least a couple of times per month.  Some things that I love in particular about this place is that there is a fairly well stocked bar that you can grab a drink at prior to the movie, the chairs in the theater are leather (seems much more sanitary for a public setting), there is a pretty decent selection of food and it's actually good, the tickets are basically the same price as any other theater (and sometimes you can even land a deal from Groupon), and the swanky women's bathroom.:)", "rating": "5", "date": [2015, 2, 18]}, "34": {"description": "When they get it right it's a great experience. That said I've been 3 times and 2/3 times my food order never came. I thought the first time was a fluke but twice? I hope they worked out the kinks because it's nice little theatre to have locally.", "rating": "4", "date": [2015, 1, 23]}, "16": {"description": "There for the first time last week.  Service was good and food was not bad either.  Buffalo chicken wrap could have used better cuts of chicken but still good.", "rating": "4", "date": [2015, 9, 7]}, "13": {"description": "Since the only other dine-in theater I have been to is the Hollywood Palms, I will have to use it as a comparison. Let me start off by saying that the inside of this place is great! Beautiful soft seats, a lovely bar as you walk in, a very upscale looking bathroom and beautiful murals of movie icons on the walls. The owners of the theater definitely took time to make this place look like a five-star establishment. However, appearances can be deceiving. First off, ordering works on a paging system. You hit a little button on the front of your table and it is supposed to signal a server to come to your table. I thought that was pretty neat and would be useful in the dark! We arrived in the middle of the previews and met our group, and a server came to take our drink orders. I had a Poolside Lemonade, and my partner had the Castaway. We also ordered the Texas-style potato skins with no onions. Our drinks did not come until 15 minutes into the movie, about half an hour after we ordered, and the potato skins came with onions on them. We sent them back and waited some more. Our drinks had absolutely no alcohol in them, mine was essentially juice. I tasted my partner's and it was just lime juice and ginger beer. A different server brought us our potato skins again with no onions, and we asked to exchange the Castaway for an Anti-Hero (beer). The server responded, \"You need to push your button.\" Rude! He couldn't even say, \"Let me get your server,\" or \"Sure, let me inform your server.\" I thought that was rude. Any other restaurant would have just taken the order. My partner ordered his entree with his drink and our appetizer, and I ordered mine a little bit later, but they both came out at the same time, about halfway through the movie. What took so long? I ordered the Chicken Run sandwich, grilled chicken with provolone cheese, bacon, lettuce, tomatoes, and mayo. It came with seasoned fries. Fries were pretty standard fries. This sandwich tasted exactly like the chicken club sandwich from McDonald's, including rubbery chicken and rubbery bacon, but I was pretty hungry and was not going to wait until the movie was over to get another entree. My partner had the Porky's burger, he said it was good. We only saw our server when he took our appetizer/drink order and when he was giving us the check. I was incredibly disappointed in the food and experience at this theater. I am even more disappointed knowing that they are taking over the Hollywood Palms. Hollywood Palms has an amazing system, where orders are taken almost as soon as you sit down and the food comes out as it is ready and it is always hot and delicious. The drinks definitely have alcohol in them, the servers will get you whatever you need, no matter if they are your server or not, and there is always a server in the theater! You don't need to press a stupid button to page someone who may or may not come. I pressed the button once or twice and each time it took about 10/15 minutes for someone to get there. High volume is not really an excuse either, as HP has about the same volume of customers and gets the food and orders out quickly and correctly. I will not be returning to Star Cinema Grill, and if they implement the same policies and procedures at the Hollywood Palms in Naperville, they will lose my business as well.", "rating": "2", "date": [2015, 5, 30]}, "11": {"description": "This movie theater was the best experience I ever had at any theater! Initially we went there because we were hungry as well. Did you know Tuesday and Thursday are the best days! $7 movies and so many discounts on food AND drinks! When you sit down, in front of you is a table along with a menu and paper to order. Once you press the button your host or hostess will arrive to take order!! How cool is that! I love their exceptional customer service. Special shout out to our host Nick for being prompt and friendly as well as the manager on duty April 30th 10:30p show. My friend left her purse there. After realizing when we got home, we called and she literally waited until 1:30 in the morning to hand off the bag. WOAH!! Definitely a company who cares about their customers. Please take anyone there or just yourself because it is an awesome experience! I will be returning!", "rating": "5", "date": [2015, 5, 27]}, "39": {"description": "It's a cute place to watch a movie and have dinner and drinks at the same time. They have a bar right before you walk into your show room. You can also order drinks from the show room itself.  Once you are seated inside, your table has a couple menus and a button you can press whenever you wish to order something. The staff has always been friendly whenever we go. If you're going to get a drink I highly recommend the \"Tropic Thunder\".", "rating": "5", "date": [2014, 12, 3]}, "37": {"description": "The theaters are very nice but the food is fantastic with very reasonable prices. I'd like to go there just for the food!", "rating": "5", "date": [2014, 12, 28]}, "0": {"description": "Great movie theater. The concept is awesome but it can be a little slow to get service if the movie theater is full. The food is pretty good and can add up quick but usually Tuesday's and Thursdays are discounted so that can help keep the costs down. Parking there is brutal but that's not their fault.", "rating": "4", "date": [2016, 1, 1]}, "38": {"description": "Great experience with nephew. Only complaint is that it was very cold in the theater. Other than that- great service, great ambiance.", "rating": "4", "date": [2014, 12, 10]}, "51": {"description": "It's really an awesome theater, full bar, with a full restaurant. It's gluten free friendly with a a lot or tasty options. They even have an awesome gluten free pizza. They have underground parking and the other patrons are always nice and respectful. It's a nice date spot or place to grab dinner and a movie with a friend or family. I really wish more theaters would cater to the customer the way this place does.", "rating": "5", "date": [2014, 7, 6]}, "27": {"description": "Best movie theatre in the area!!!!!  Food and drinks are really good and seats r comfy. I won't go anywhere else. We're regulars.", "rating": "5", "date": [2015, 5, 7]}, "32": {"description": "i absolutely love star cinema grill! the prices are extremely reasonable, the food is pretty darn good (esp for a movie theater), and you don't need to get up during the middle of the movie to go get some popcorn. what could be better?", "rating": "5", "date": [2015, 2, 16]}, "54": {"description": "My husband and I saw Maleficent at this theater tonight. It is a clean theater located in cute downtown Arlington Heights. My poor review reflects the food and drinks we had for dinner. I ordered a cocktail with berries and mint: it was $10 and the glass was so small. My husband ordered their signature mac and cheese; it was just ok and lacked flavor. I ordered the \"Tony Montana\" sandwich: pulled pork, ham, cheese, pickles, mayo. The bread was very tough and hard to eat, pulled pork was really dry bc it had no sauce, and the cheese was gross. Our bill was over $40 not including the movie tickets. It the food was better, we would go back.", "rating": "2", "date": [2014, 6, 6]}, "48": {"description": "Great movies, food and service. Get the Groupons when you can. They have specials on Tuesdays and Thursdays: $1 Sliders, $5 off select beer pitchers and $7 tickets all day.This is truly a hidden gem. Definitely better than Muvico any day. Never crowded and hardly any screaming or crying kids. Perfect for dates or a get together with friends.", "rating": "5", "date": [2014, 8, 5]}, "44": {"description": "Amazing food, service and ambience plus the management is professional and savvy. I've been here on two occasions already and have had the chicken mac n cheese, buffalo chicken wrap, mozzarella sticks and the Chicago Hot Dog. The food is fresh and well made. Also, they show all the Bears games for free in theatre 1.", "rating": "5", "date": [2014, 10, 19]}, "24": {"description": "Just went to see Mad Max here. In the last minutes of the movie the waiter comes over to take away plates and collect the check. Since I'm WATCHING A MOVIE, I had not taken the time to sort out how much the bill was, or how I was going to pay, nor would I have been able to see in a dark theater to do so. I Intended to pay the bill as soon as I could see after the movie ended. Instead the waiter crouches in front of and us and just waits there for me to pay the bill. So I guess instead of watching the end of the movie I'm expected to figure out a tip and count money in a dark theater. I went to reach for my wallet and in the process knock the soda over in the cup holder all over my lap and seat. Movie going experience completely ruined. I will not be returning to this theater ever. Beside the awful customer service the food is one step below the worst bar food I've ever had.", "rating": "1", "date": [2015, 5, 24]}, "7": {"description": "Bought Star Wars tickets on line for 6 people. Arrived and the theater was full. Theater was oversold.  At first we were scolded for not arriving 45 minutes before the movie started.  Then told we were wrong because the computer is always right. Silver lining, sweet girl went into the theater and returned to say \"yea, we oversold, sorry.\"", "rating": "1", "date": [2015, 12, 20]}, "49": {"description": "Star Cinema Grill was very nicely decorated, has nice bathrooms and is well kept. My boyfriend and I went last night to catch a late Transformers 4 show. He ordered a drink and he liked it. We had just come from dinner so we didn't get any food. I will definitely go there again.", "rating": "5", "date": [2014, 7, 10]}, "40": {"description": "I love this place! Certainly  my husband and my favorite movie theater.  In the past year and a half, we've gone here at least a month. It is decent expensive,  the tickets are $10-12 per person, but only $5 on Tuesday.  The drinks  are quite  pricey,  not too many food and drink specials, but the experience  of eating and drinking  during a movie  is a lot of fun. The theaters  are also clean and the staff is friendly. The bathroom sinks are cool too. You can also order tickets online ahead of time I think.I forgot to mention  the food- I love their fries! I've also gotten the chicken tenders which are alright and the sliders on Tuesdays which are good", "rating": "4", "date": [2014, 11, 23]}, "53": {"description": "This is generous. Went to a Rated R movie at 1pm. As the movie was starting a family walked in and had a child under the age of 1. The baby constantly whimpered and cried. A half hour into the movie I went to speak to the manager. The manager stated,\"there's no age restriction in a child when with an adult.\" He could not believe I had an issue, nor did he try to resolve the issue. I asked if my friends with all their babies could come and he said, \"there is no age restriction.\" I will never come again!!", "rating": "1", "date": [2014, 6, 29]}, "30": {"description": "This is the closest dinner and movie experience to me. My fiancee and I enjoy going here, especially on weeknights when we want to watch a movie but don't have time to get dinner and watch a movie afterwards.The food isn't great, but it's good. We've been here at least 10 times and never had a bad experience.", "rating": "4", "date": [2015, 2, 18]}, "46": {"description": "This is the coolest, nicest, cleanest, best movie theatre I've ever been to! This is my first time coming to a theatre that services food and you can eat while you watch a movie. The menu has practically everything. I had the burger with fries and a drink. The drink is huge and the portions are more than enough. The seats are so roomy, nice and white. You have a lot of leg room in front of you which I like. You have a little table in front of you. It was a really great experience.  The movie theatre even had a bar outside which was really cool. Everything was great and I love the fact that the movie theatre is really clean. Even the bathrooms are really nice. I definitely can't wait to go back. I've been dreaming about it!", "rating": "5", "date": [2014, 9, 6]}, "1": {"description": "Star Cinema Grill is a different kind of movie experience, which didn't sit well with me and explains why I'm only giving it two stars. The layout of the theater is a lot flatter than usual, with paired, big chairs indicated by tables in front of them. You sit down, and pull out a menu from the table. You can press a button on your table to have a waiter awkwardly crouch towards you and take your order, and they do full service as if you were in a restaurant while the movie is playing.The food I've gotten here is good enough, but it's expensive like all movie theaters are. The service makes it hard to be entrenched into a movie, even if you're not the one ordering food because waiters will be crouching around you for other customers. This just wasn't my ideal place to see a movie. If I want to spent $10 to see a movie, you better believe I'm watching the movie and not wanting to be distracted. I recommend this place for date nights or for a time you want dinner and a movie in one experience, but aren't hooked on what the movie actually is.", "rating": "2", "date": [2016, 1, 12]}, "55": {"description": "I really like this theater - it is so out of the way for us that it seems like our little secret.  Besides that, the theater is so adorable.  The decor, the bar (yes I said the bar), the bathrooms are awesome.  The theaters are really nice.  The food, in my opinion is very reasonably priced.  It's comparable to eating at a restaurant, but you get it brought to you in the movie theater.  The only item that I thought was overpriced were the sodas/iced tea.  over $3, and no free refills - however, they are pretty big glasses.  As far as taste, everything we had was pretty good!!Every person that helped us was super-nice, making the experience so much fun, from the girl who sold us our ticket, to the young man who thanked us for coming.  We will definitely be returning here - even though it is pretty far from where we live.", "rating": "4", "date": [2014, 5, 18]}, "9": {"description": "Awesome concept. Family friendly, very comfortable, just a great place for movies. Plenty of parking underground.", "rating": "5", "date": [2016, 1, 30]}, "26": {"description": "I always go to Star Cinema Grill with my best friend to watch a movie. The food is good, the seats are comfy, good movies and wonderful staff.", "rating": "5", "date": [2015, 5, 8]}, "25": {"description": "I love the idea of eating (or even just getting a snack) while I'm watching a movie. I went here with 2 other people today.You buy your ticket, go in the theater, pick a seat. There are tables in front of the seats. They kinda go by twos, I guess for couples or something. Then there are menus in little slots under the tables. You can either write down what you want on the papers (also in slots under the tables) or you can press a button on the table to get a server to take your order.We ordered Margherita pizza and onion rings. Just a little snack to munch on while we watched the movie. The food was alright. I've had better, but it wasn't terrible either. I want to try the other stuff on the menu tho & the drinks too.I loved it. It's perfect for date night or just a night out with friends. The service was great too. Although I wanted to take the leftover pizza home after the movie so I pressed the button & nobody came? Maybe I was too late or something. The bathrooms are really nice. Actually, the whole place looks new & clean & nice. I think I'll be back soon.", "rating": "4", "date": [2015, 5, 20]}, "12": {"description": "This place is great! Better than Muvico, better than Hollywood Cinemas and Palms and worth the drive to the burbs. Food is a lil over priced but the menu has regular updates and friendly to everyone, gluten free, vegan, veggie, etc.", "rating": "5", "date": [2015, 10, 16]}, "59": {"description": "Food is decent. Sites are very comfortable. Greta atmosphere!! Definitely way to spend evening in Arlington Heights!!!", "rating": "4", "date": [2014, 3, 2]}, "21": {"description": "I would give zero stars if yelp allowed me. I had seen a movie here recently and everything was nice. Saw their advertisement for the Blackhawks Stanley Cup Viewing Party (game was on one of their theatre screens and everyone sat in seats like a normal movie). It sounded like a cool way to watch the game so I invited two other people with me. We arrived and commented the designated theatre seemed warm but gladly took our seats. The game began and we ordered some drinks as the room was getting hotter. We then ordered food which took almost an hour to be delivered to our seats (nachos are not an hour worthy wait!). We also ordered candy and due to the warmth of the theatre melted in the martini glasses the candy is served. The couple next to us were given the wrong drinks and food. We watched as other fans brought up the temperature to staff and one male associate loudly told the customer they were wrong and the air conditioning was on (well it might be on but it definitely was not working). We pay our tabs and leave from our drenched seats. The next day I check my bank statements and I was overcharged 60 dollars by the theatre. I stop by the theatre that day and speak to a manager (after asking an associate for the manager the first response was, \"actually we are looking for him and can't seem to find him\"). After explaining the situation about my account and receipt from the night before in hand, I'm told by the manager that I have to wait for the entire transaction to go thru and only after it has been completed can they give me credit. He then offers to handle the situation with better customer service and gives me an envelope, I look in it outside and was given one free movie pass. Overall, as a resident of Arlington Heights I'm appalled by a local business treating customers in such a fashion and making so many mistakes in one experience. I've never written a negative review for an establishment but felt this experience deserved such treatment.", "rating": "1", "date": [2015, 6, 11]}, "17": {"description": "I really like this theater - it is so out of the way for us that it seems like our little secret.  Besides that, the theater is so adorable.  The decor, the bar (yes I said the bar), the bathrooms are awesome.  The theaters are really nice.  The food, in my opinion is very reasonably priced.  It's comparable to eating at a restaurant, but you get it brought to you in the movie theater.  The only item that I thought was overpriced were the sodas/iced tea.  over $3, and no free refills - however, they are pretty big glasses.  As far as taste, everything we had was pretty good!!Every person that helped us was super-nice, making the experience so much fun, from the girl who sold us our ticket, to the young man who thanked us for coming.  We will definitely be returning here - even though it is pretty far from where we live.", "rating": "4", "date": [2014, 5, 18]}, "10": {"description": "This movie theater has a great menu to go along with their movies.  Not sure how the food is as I did not order anything.  Next time I will give the food a try.  The three star rating comes from how VERY COLD the theater was.  We kept our coats, hats and mittens on throughout the movie.  Part way through the movie I did ask a usher if some heat could be turned on.  It never happened.", "rating": "3", "date": [2015, 12, 18]}, "5": {"description": "Visited on 12/29  ordered food and got horribly sick which required an emergency visit where I was told i had food poisoning. Star cinema was the only place I ate and when I called to tell them what happened ( more to inform them, not looking for a refund) they ignored me. Called again, asked how I knew it was that I got sick from their food). I was shocked. Anyhow if u do go, I wouldn't eat the food, not worth the risk. Wish management cared about their customers.", "rating": "1", "date": [2015, 12, 30]}, "3": {"description": "Service has always been good at this place. Went to see Kung Fu Panda 3 on 2/06. Ordered nachos for myself, that was the worse nachos ever. The cheese was underneath the nachos, instead of on top. The cheese was so thin, it was like water. Hopefully next time it will be better. And to the couple that sat next to me. If you want to have a conversation, take out to the bar. They were pretty much talking during the first half of the movie. Of all the available seats, you had to put your kids in the back, and you and your bad breath boyfriend had to sit next to me.", "rating": "3", "date": [2016, 2, 10]}, "35": {"description": "Great Theater. Wide comfy seats. Nobody kicking your seat from behind. Push a button and a quick food and drink service right at your seat. I would recommend getting your payment ready , if you purchase something, before movie starts. I found it somewhat distracting to be digging out my credit card in the dark while trying to watch the end of the movie.", "rating": "5", "date": [2015, 1, 23]}, "19": {"description": "I like to see movies here because I don't have to get out of my seat to order beer.That is all.", "rating": "3", "date": [2015, 6, 28]}, "28": {"description": "I really wanted to give this place 4 or 5 stars considering the location and the cool setup on the inside.....but....the food.  It might have been the worst I have ever ordered off a menu.  I'm not one of those people who sends stuff back, but I was close.Shrimp tacos were awful.Positives:Very friendly serverCheap matinee pricesCool (and clean) venueLocation, location, location: love downtown AHThe positives are enough to let me give this place another try - hopefully the food will be edible.", "rating": "3", "date": [2015, 5, 4]}, "45": {"description": "They have very good food for a theater. Better than all the others we have been too. Love the push button service through out the movie. Gold Class used to do it but stopped when it changed to iPic. The service here is excellent. And they show football on the big screen. Sold.", "rating": "5", "date": [2014, 10, 18]}, "33": {"description": "I can't believe I haven't written a review for this place. It is absolutely hands down the best movie theater. The service is great, the food is awesome (especially the wings) and the chairs/ space is really great. I'm spoiled and I usually don't go to another theater after going to this one!", "rating": "5", "date": [2015, 2, 12]}, "43": {"description": "We had an impromptu family night out. I don't even know where I heard about this theater, but I'm glad we went! I actually liked this MUCH MUCH better than the other dinner and a movie place in Barington. This was REGULAR food. The servers were great - prompt and courteous. The screen and sound was excellent quality. My sandwich (a cuban of sorts) was awesome. My son's pizza was good. And the popcorn was real movie popcorn - not prepackaged yuckiness we've gotten at other dinner/movie places. I didn't get around to ordering my drink. The whole experience - popcorn, drinks, dinner and tickets was $100 for our family of four. I don't know that we could have gotten the same deal if we went to the AMC and Chilis. I hope it sticks around. Also, the mgr heard me say how great a time I had and he looked genuinely pleased, which was nice.", "rating": "5", "date": [2014, 10, 24]}, "2": {"description": "Note: I will update this review if I go back and have a better experience. I also plan on sending this review to Star Cinema via email. It's the holidays right? We're all busy, and trying to make time for family & friends. That's exactly what I was doing on 12/29 when I took my 15 year old sister (who lives in MI) to see Sisters. This theater is super close to my house so we opted to go here. We get to the ticket line and the girl warns us that the theater we're in is sans-heat. Has been for a few hours. Doesn't apologize, she's basically just warning us. My sister insists she'll be fine so we go for it. When I ask about the Tuesday $7 special the girl says (even though the heat is out and it's \"really cold in there\") that they don't offer it during the holiday season. Um...ok. Kinda lame but fine. Then we  get into the theater and it is FRIGID! Ice cold! My husband even had to drive a sweatshirt to us for my sister. Then I see the wait staff coming in with hot beverages. I think \"oh, maybe they're handing out complimentary cocoa for all their patrons willing to pay full price to sit through this\". WRONG AGAIN! They offered ZERO compensation! I'm not looking for anything for free here, really, but no one even apologized! No vouchers for a discount in the future, nothing! Not even small popcorn- and you KNOW they up charge like crazy for movie theater popcorn! They weren't going to lose money on us. At the very least honor your daily special admission price. It was really disappointing as far as customer service goes. Personally, if I'm a manager there and I know this heat has been off for HOURS, I'm running to Wal-mart for blankets (which I can expense) or at least offering people something hot to drink. With all the other theaters in the area (unfortunately we wouldn't make it to another one with a decent show time in this case- and I had to work the next morning) I'll definitely think twice before going back.", "rating": "1", "date": [2015, 12, 31]}, "18": {"description": "We had an impromptu family night out. I don't even know where I heard about this theater, but I'm glad we went! I actually liked this MUCH MUCH better than the other dinner and a movie place in Barington. This was REGULAR food. The servers were great - prompt and courteous. The screen and sound was excellent quality. My sandwich (a cuban of sorts) was awesome. My son's pizza was good. And the popcorn was real movie popcorn - not prepackaged yuckiness we've gotten at other dinner/movie places. I didn't get around to ordering my drink. The whole experience - popcorn, drinks, dinner and tickets was $100 for our family of four. I don't know that we could have gotten the same deal if we went to the AMC and Chilis. I hope it sticks around. Also, the mgr heard me say how great a time I had and he looked genuinely pleased, which was nice.", "rating": "5", "date": [2014, 10, 24]}, "41": {"description": "We have been to this theatre many times and have always had a pleasant visit. However, I am a bit bent out of shape regarding tonights visit. We got to the theatre a few minutes before our movie was to start. There was no one at the booth to get our tickets. After standing outside, looking for someone we finally tried the doors. The first one was locked, but the second one was open so we went in. There was not one person around. We stood there for a few minutes and waited and waited and nothing. Finally, an employee came in who had been outside smoking and asked us if anyone was around. He then went and knocked on a door and the girl came running out. She was apologetic and rang up our tickets. When we left the theatre there was not a person in sight. This is very poor customer service. I'm not sure we'll be returning. It's not any cheaper to go here then any other theatre so we'll give our business to someone who wants it.", "rating": "2", "date": [2014, 11, 3]}, "52": {"description": "It's a nice theater.  Prices were a little high and parking can be a little challenging.  But the seats were comfortable", "rating": "4", "date": [2014, 6, 30]}, "50": {"description": "Go for the experience of seeing a movie while sitting in big comfy chairs & eating dinner and drinking a beer. The food has never been amazing, I would call it average or slightly below average, but it is fine for the situation. If you order a Martini it will take 15-20 minutes. Stick with the basics with the food (ie, cheeseburger and fries) They have Groupons every now and then too.", "rating": "4", "date": [2014, 7, 10]}, "4": {"description": "Absolutely fantastic experience!!! I have a feeling that Village of AH restricts them from doing something to the uninviting exterior but inside will blow you away. Very modern and clean. Food and drinks were surprisingly good (I did not expect to find quality food in the movie theater)", "rating": "5", "date": [2015, 7, 24]}, "6": {"description": "I love the idea of eating (or even just getting a snack) while I'm watching a movie. I went here with 2 other people today.You buy your ticket, go in the theater, pick a seat. There are tables in front of the seats. They kinda go by twos, I guess for couples or something. Then there are menus in little slots under the tables. You can either write down what you want on the papers (also in slots under the tables) or you can press a button on the table to get a server to take your order.We ordered Margherita pizza and onion rings. Just a little snack to munch on while we watched the movie. The food was alright. I've had better, but it wasn't terrible either. I want to try the other stuff on the menu tho & the drinks too.I loved it. It's perfect for date night or just a night out with friends. The service was great too. Although I wanted to take the leftover pizza home after the movie so I pressed the button & nobody came? Maybe I was too late or something. The bathrooms are really nice. Actually, the whole place looks new & clean & nice. I think I'll be back soon.", "rating": "4", "date": [2015, 5, 20]}, "22": {"description": "Since the only other dine-in theater I have been to is the Hollywood Palms, I will have to use it as a comparison. Let me start off by saying that the inside of this place is great! Beautiful soft seats, a lovely bar as you walk in, a very upscale looking bathroom and beautiful murals of movie icons on the walls. The owners of the theater definitely took time to make this place look like a five-star establishment. However, appearances can be deceiving. First off, ordering works on a paging system. You hit a little button on the front of your table and it is supposed to signal a server to come to your table. I thought that was pretty neat and would be useful in the dark! We arrived in the middle of the previews and met our group, and a server came to take our drink orders. I had a Poolside Lemonade, and my partner had the Castaway. We also ordered the Texas-style potato skins with no onions. Our drinks did not come until 15 minutes into the movie, about half an hour after we ordered, and the potato skins came with onions on them. We sent them back and waited some more. Our drinks had absolutely no alcohol in them, mine was essentially juice. I tasted my partner's and it was just lime juice and ginger beer. A different server brought us our potato skins again with no onions, and we asked to exchange the Castaway for an Anti-Hero (beer). The server responded, \"You need to push your button.\" Rude! He couldn't even say, \"Let me get your server,\" or \"Sure, let me inform your server.\" I thought that was rude. Any other restaurant would have just taken the order. My partner ordered his entree with his drink and our appetizer, and I ordered mine a little bit later, but they both came out at the same time, about halfway through the movie. What took so long? I ordered the Chicken Run sandwich, grilled chicken with provolone cheese, bacon, lettuce, tomatoes, and mayo. It came with seasoned fries. Fries were pretty standard fries. This sandwich tasted exactly like the chicken club sandwich from McDonald's, including rubbery chicken and rubbery bacon, but I was pretty hungry and was not going to wait until the movie was over to get another entree. My partner had the Porky's burger, he said it was good. We only saw our server when he took our appetizer/drink order and when he was giving us the check. I was incredibly disappointed in the food and experience at this theater. I am even more disappointed knowing that they are taking over the Hollywood Palms. Hollywood Palms has an amazing system, where orders are taken almost as soon as you sit down and the food comes out as it is ready and it is always hot and delicious. The drinks definitely have alcohol in them, the servers will get you whatever you need, no matter if they are your server or not, and there is always a server in the theater! You don't need to press a stupid button to page someone who may or may not come. I pressed the button once or twice and each time it took about 10/15 minutes for someone to get there. High volume is not really an excuse either, as HP has about the same volume of customers and gets the food and orders out quickly and correctly. I will not be returning to Star Cinema Grill, and if they implement the same policies and procedures at the Hollywood Palms in Naperville, they will lose my business as well.", "rating": "2", "date": [2015, 5, 30]}, "15": {"description": "There's not many places where you can go in and dine while watching your movie. This is a great option to have, especially not having to leave your seat and miss a scene because you want a drink. The seats are relatively comfortable. The size of the table and the distance is good enough where nothing covers your view. My experience with the servers have all been positive. They are both speedy and respectful of their surroundings. I would have given this place a 4/5 stars but their ALWAYS changing policies are annoying. I had 2 expired Groupons I wanted to use today. I had paid $5 for each of them so regardless of when I would redeem them, they already have my $5 (there is no loss). First, don't be fooled by their Tuesday and Thursday all day $7 movies. If it's a premier, they will deny this advertisement and charge you $11.50, regardless of their displayed prices and your age (I saw them charge a 4 year old for #11.50). Expired Groupons will also be rejected (although in the Groupons policy, it clearly states that it can be redeemed anytime - but I'm not going to waste my time arguing). But I was told that if I come back tomorrow, I could use my expired Groupon that I had paid $5 for and get $5 off my movie, ALTHOUGH I would have gotten the SAME $5 today... logic?Would I go back? Sure, it's a good place to hit 2 birds with one stone. My lessons learned: if I'm getting a Groupon I better make sure I use it on time since this place is not so friendly about people redeeming expired ones. Oh, and always make sure to see if they changed their policy AGAIN... smh...", "rating": "3", "date": [2015, 6, 18]}, "57": {"description": "This movie theater is a hidden gem! We found out by accident this was a dine in movie theater. We just wanted to watch a movie after dinner and it happened to be in the same complex. We walk in and the first thing you see is this awesome bar with velvet cushioned chairs and I thought to myself, that's pretty nice for the movies! Then we realized it was literally a movie and dinner! Unfortunately we just had dinner but that didn't stop me from ordering a cheesecake in the middle of the movie! It's like being at home and getting a snack only better! Awesome place, next time we are coming back for actual dinner here as well", "rating": "5", "date": [2014, 3, 23]}, "20": {"description": "There's not many places where you can go in and dine while watching your movie. This is a great option to have, especially not having to leave your seat and miss a scene because you want a drink. The seats are relatively comfortable. The size of the table and the distance is good enough where nothing covers your view. My experience with the servers have all been positive. They are both speedy and respectful of their surroundings. I would have given this place a 4/5 stars but their ALWAYS changing policies are annoying. I had 2 expired Groupons I wanted to use today. I had paid $5 for each of them so regardless of when I would redeem them, they already have my $5 (there is no loss). First, don't be fooled by their Tuesday and Thursday all day $7 movies. If it's a premier, they will deny this advertisement and charge you $11.50, regardless of their displayed prices and your age (I saw them charge a 4 year old for #11.50). Expired Groupons will also be rejected (although in the Groupons policy, it clearly states that it can be redeemed anytime - but I'm not going to waste my time arguing). But I was told that if I come back tomorrow, I could use my expired Groupon that I had paid $5 for and get $5 off my movie, ALTHOUGH I would have gotten the SAME $5 today... logic?Would I go back? Sure, it's a good place to hit 2 birds with one stone. My lessons learned: if I'm getting a Groupon I better make sure I use it on time since this place is not so friendly about people redeeming expired ones. Oh, and always make sure to see if they changed their policy AGAIN... smh...", "rating": "3", "date": [2015, 6, 18]}, "36": {"description": "The best theater in Illinois.My fiance and I really enjoyed this theater. The food was delicious. A wonderful environment. This was worth the 45 minute drive we took. Reasonable prices", "rating": "5", "date": [2015, 1, 13]}, "14": {"description": "Thanks to groupon my roommate and I found this hidden gem. Great food, very comfortable seats, and great customer service. I recommend their spicy bbq boneless wings and chips and queso! Very good!", "rating": "5", "date": [2015, 9, 16]}}, "categories": [["Cinema", "movietheaters"], ["American (Traditional)", "tradamerican"]], "address": ["53 S Evergreen Ave"], "attributes": {"Has TV": "Yes", "Parking": "Garage, Street, Private Lot", "Take-out": "No", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Delivery": "No", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Trendy", "Dogs Allowed": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Dinner"}, "category": "Restaurants", "times": {"Mon": ["11:00 am", "1:00 am"], "Thu": ["11:00 am", "1:00 am"], "Sat": ["11:00 am", "1:00 am"], "Wed": ["11:00 am", "1:00 am"], "Tue": ["11:00 am", "1:00 am"], "Sun": ["11:00 am", "1:00 am"], "Fri": ["11:00 am", "1:00 am"]}, "rating": "3.5", "price": "$$", "number_of_reviews": "82"}, "qianas-massage-chicago": {"comments": {"3": {"description": "While I was going to leave 4 Stars for Qiana's massage techniques, all my future prepaid appointments have been cancelled by Qiana. The 1 Star Rating is based on her unprofessionalism and inability to fulfill the 6 month biweekly in-home 60 minute massage deal purchased.", "rating": "1", "date": [2013, 5, 8]}, "1": {"description": "I bought a YouSwoop deal for a massage in my home. Unfortunately I will not be able to use it because it is impossible to make an appointment. Not only is she going on vacation the last 2 weeks of the voucher being valid, but when I tried to make an appointment via text message, I was told to \"check on the website for availability.\" I can't even speak to a live person.Poor customer service.", "rating": "1", "date": [2013, 3, 21]}, "2": {"description": "I have been using Qiana's Massage for a year and a half on a very regular basis. I had spinal fusion surgery in May 2012 and there were complications. The drugs in the hospital were unable to control my pain. I have never experienced anything like it in my life. Qiana came to my home the day after I came home from the hospital. She immediately helped me to manage my pain. Without Qiana I have no idea how I would have ever recovered from my surgery. I would have become addicted to pain meds and would still be using my walker. THANK YOU!", "rating": "5", "date": [2013, 11, 21]}, "5": {"description": "I've been going to Qiana's Massage for almost six months and I've had only pleasant experiences. She is always professional, attentive and accommodating to whatever my needs are in a given session.  I normally prefer male masseuse because of there upper body strength but I was pleasantly surprised and not disappointed when referred to Qiana and experienced her deep tissue massage. GREAT PRICING$$. I intend to be her client for a long time!", "rating": "4", "date": [2013, 11, 25]}, "6": {"description": "I have been using Qiana for almost a year now and I'm hooked!  She is responsive, she is always on time and she gives amazing massages!  I fall asleep almost every time and never want to get off of the table!  She asks me every time if I have problem areas that she should attend to and she can go as light or as deep as you want/need her to. I have had no trouble making appointments and she gets back to me in a timely manner.  She's great!", "rating": "5", "date": [2013, 11, 22]}, "7": {"description": "I had my first massage yesterday and it was wonderful.  Qiana was wonderful and put me to sleep instantly.  I booked my appointment online and received a confirmation with minutes.  I also received a text message reminder the day of the massage.  I would definitely go back.", "rating": "5", "date": [2013, 9, 19]}, "8": {"description": "Qiana is amazing! She is my go-to in-home masseuse and my mother in law loves getting her massages in the comfort of her home. Give her a call, I assure you you'll be back for more!", "rating": "5", "date": [2012, 7, 9]}, "9": {"description": "I have received massages in in Chicago, Honolulu, The Marinara Islands, Thailand, and the Philippines. I recently received a 20 minute massage from Qiana, and received the best massage to date. She used an overwhelming amount of techniques that had me feeling very relaxed and refreshed. I view this as a direct reflection on her abilities and her mastery of the art of massaging. I definitely recommend fellow hard workers to experience a hand, whole arm, and leg massage after a labor intensive day as a treat for your own hard work. Thanks Qiana.", "rating": "4", "date": [2012, 7, 19]}, "0": {"description": "While it was a bit difficult for me to use the online scheduling system, once I had scheduled my first appointment I sent Qiana an email informing her of the problem.  She responded promptly to arrange some appointments with me.I have had three appointments with Qiana so far and I am very happy with her services.  She listened carefully when I explained what muscle issues I was having and she made sure to pay close attention to those areas.She is very friendly and personable and I am very happy with her services.", "rating": "5", "date": [2013, 6, 13]}, "4": {"description": "I don't recommend this place just because it is impossible to make a reservation.  I bought a voucher for massage at your location (that's what it said on the deal).  There are only 2 methods to make reservation, text her that don't always get response or book online.  I tried to book online a week ago for a massage in my home.  But the calendar has no avaiable through Feb. 11.  There is no calendar beyond Feb 11.  I requested my refund.", "rating": "1", "date": [2012, 12, 15]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.746, "longitude": -87.5867891, "rating": "3.5", "times": {"Mon": ["9:00 am", "8:00 pm"], "Thu": ["9:00 am", "8:00 pm"], "Sat": ["9:00 am", "8:00 pm"], "Wed": ["9:00 am", "8:00 pm"], "Tue": ["9:00 am", "8:00 pm"], "Sun": ["12:00 pm", "4:00 pm"], "Fri": ["9:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Massage", "massage"]], "address": ["8153 S. Saginaw", "Ste 100"], "attributes": {"Parking": "Street", "By Appointment Only": "Yes", "Wheelchair Accessible": "No", "Accepts Credit Cards": "Yes", "Accepts Insurance": "No"}, "category": "Beauty", "number_of_reviews": "10"}, "nitas-gumbo-chicago": {"comments": {"28": {"description": "Absolutely loved my shrimp po' boy! OK so I may be a bit biased because its so close to my house and I just want you to stay forever Anita's Gumbo. Its great having another flavorful option.I thought the price was pretty reasonable and the food was good. My only suggestion would be to create a kids meal the chicken was good but the gumbo on the side was a bit spicy for my 3 year old.", "rating": "4", "date": [2014, 7, 17]}, "1": {"description": "Been wanting to try this gumbo and  today Was The day.Size: for $13.00 The gumbo had big chunks of sea scallops, shrimp and they give You a small cup of crab(very small) to add, shrimp and plenty andouille sausage and chicken.Taste: The roux is executed perfect I Was missing thyme and okra otherwise The flava Was good not GREAT...and there Was no trinity But worth trying, oh and it wasn't spicy to me as I added Tabasco hehehe...", "rating": "4", "date": [2015, 5, 29]}, "9": {"description": "Came to the restaurant  for the first time yesterday and I was very impressed. The food was awesome and the customer service was great. I will be a return customer.", "rating": "5", "date": [2016, 1, 17]}, "29": {"description": "Great food, the roux is delicious. I've had the gumbo wings with gumbo rice, the chicken gumbalaya, the chicken po boy and the signature flagship gumbo. Everything I listed had fresh ingredients and just right on the spice for my taste. The restaurant itself is very clean and the staff is friendly and real. I will be back in the future for more.", "rating": "5", "date": [2014, 6, 17]}, "23": {"description": "Decided to try this since they had a booth set up @ The South Side Soul Festival.  I tried the Gumbo Wings & The Seafood Gumbo.  The wings were nothing more than the wings having been \"soaked\" in the roux.  I didn't particularly care for them The Gumbo was pretty tasty however they probably should turn down the spice. It has a \"kick\" that will be too much for some people.  Overall I would buy the Gumbo again but not the wings", "rating": "4", "date": [2014, 9, 13]}, "5": {"description": "I stopped in Anita's Gumbo this evening after salivating thinking about delicious gumbo! I'm so glad I was determined to stop in because it was absolutely AMAZING! I ordered the Signature Gumbo and buttermilk wings! The Gumbo: nice kick of spice!  Delicious roux! Nice amount of crab, shrimp, chicken and sausage! The wings: Delish! I didn't get the wings with the roux on top since I figured it was pretty much the gumbo I had on the side. The customer service was excellent! Everyone was friendly, the owner was very personable as well! Thank you for bringing delicious Gumbo to Chicago! I'll be spreading the word and will also return!", "rating": "5", "date": [2014, 12, 2]}, "31": {"description": "They just opened on May 31st, 2014. Probably working out some kinks at the restaurant. So far I received carry-out for the Wednesday special Caribbean Gumbo. The roux is pretty good and it's not very spicy. Alittle lacking in the amount of meat and mostly rice, but i'll see what happens later.All menu items are made to order so anticipate waiting 10-20mins for your take-out food. Signs are posted.At the time of writing this review, their temporary hours of operation are:Sunday: ClosedMonday: ClosedTuesday: 11am-6pmWednesday: 11am-6pmThursday: 11am-6pmFriday: 11am-7pmSaturday: 11am-7pm", "rating": "3", "date": [2014, 6, 4]}, "25": {"description": "A bit of kick to the roux- I decided on the seafood gumbo.. just a bit pricey in my opinion, but I don't mind paying for decent to excellent food. The staff were genuine and nice. I'll be back to try other menu items", "rating": "3", "date": [2014, 8, 23]}, "12": {"description": "First time trying this establishment and I must say I was completely disappointed . I tried the gumbo wings and the texture was very slimy considering the fact that they just came out the deep fryer . Thanks but no thanks", "rating": "1", "date": [2015, 7, 25]}, "21": {"description": "True confession: I haven't been to this restaurant. But I was at the Hyde Park jazz festival, they had a booth, and I thought I'd take a chance on the seafood gumbo. It wasn't cheap; if I remember correctly, I gave up a mug of Alexander Hamilton for the pleasure.But DAMN, that was GOOD gumbo! Perfect amount of spice--will perk you just up a little, while letting you concentrate on the flavor rather than the heat. Tasty morsels of seafood and andouille. (I checked it out for my pescatarian friend, though she was willing to suspend disbelief of the presence of sausage long enough to try a shrimp and bless the delicious roux.) This place is pretty deep in the south, which I guess is appropriate for a creole place. I will definitely venture down there for lunch sometime, and perhaps stop by Calumet Fisheries on the way back for some of their smokey goodness for dinner.", "rating": "5", "date": [2014, 10, 6]}, "16": {"description": "There is nothing bad to say about Anita's. Everything I've tried here is DELISH but my absolute favorite are the blazin gumbo wings! The peach cobbler is THE BEST I've had anywhere, ever. After my first visit I went back 2 more times within that same week! If I didn't know better i'd swear they put crack in the food- it's sooooo good and addicting...", "rating": "5", "date": [2015, 1, 29]}, "17": {"description": "Probably the best place you can grab food quick in South Shore.", "rating": "4", "date": [2015, 4, 6]}, "10": {"description": "I love this place. I have a seafood allergy but that doesn't mean I can't enjoy delicious gumbo. My first dish here was the Caribbean and I've been hooked since. Doesn't help that it's literally right around the corner-less than a 2 minute walk. The desserts are wonderful, the mac n cheese is great, and the wings are perfection. Check out Anita's Big Chase-it's $27.99 for shrimp gumbolaya, chicken gumbolaya, 2 liter pop, 6 gumbo wings and 6 buttermilk wings. I can feed my family of 5 with leftovers.", "rating": "5", "date": [2015, 3, 18]}, "11": {"description": "I actually first learned about Anita's from the huge billboard on the Dan Ryan. After that all that publicity it was actually not the easiest to find. The signage isn't highly visible. It's on a corner of a tightly packed strip mall. On to the gumbo.. It was salty and overall just okay. My major issue was with the process at Anita's.-First the staff was not very accommodating: I requested to have rice and gumbo separated because I was counting carbs. I was told that this is not an option with the lunch special and they try to avoid customizations. The cashier. then added that they used to serve separately but customers reported that this was too cumbersome. Hmmm, Okay while I can appreciate that... This customer is requesting rice on the side. Oh well says Anita's, no can do, you have to order the 1/2. This essentially means no lunch special for me because I want rice &gumbo separate ... This is clearly because they want to give you a smaller portion and fill the container with mostly rice. Thats understandable because lunch options are generally smaller, so putting my rice and gumbo in 2 separate small containers seemed likes the obvious solution, but not to Anita's. SmhI won't be back because I wasn't wowed by the food and I was irritated with the service.Anita's gumbo, please check out MSNBC's The Profit, you could learn a lot about improving your process and satisfying customers.", "rating": "2", "date": [2015, 6, 30]}, "26": {"description": "I just left anita's gumbo I ordered the  buttermilk  wings which came with gumbo. The wings were overcooked and had no seasoning at all! The gumbo was spicy but had no flavor , spice  does not equal flavor . I went , I saw I will not return!", "rating": "1", "date": [2014, 8, 9]}, "27": {"description": "Im sorry....i just finished eating  Saturday's leftover seafood gumbo ,which prompted me to write ANOTHER review .....Wtf! Anita, Where have you been all my life?????    Lol ok im done!THEE .....BEST......FOOD.....EVER! Nuff said", "rating": "5", "date": [2014, 7, 21]}, "0": {"description": "Of all nights to try this joint I picked FAT TUESDAY.  The line was long but I didn't care, I had a craving for gumbo and nothing short of an all-out BLIZZARD and the cook quitting mid shift could stop me from acquiring a bowl that night.  So let's get to the good stuff . . . . the food and service.Note to Management:  Please have Streets and Sanitation or the owner of the Plaza in which you're located to put more lights on the building - it's hard to find you in the dark!!Like I said in my intro, when I arrived [or rather FINALLY found the place] the line was long but not bursting outside the door -  service was a little slow but I guess they had an after work surge AND the fact that it was Fat Tuesday.   Many people in the small [9x20] order/waiting area were new to the restaurant like me and just waiting for their food.  I found my place in line [humbly placed at #4] and scanned the menu.  I laid eyes on the coveted Gumbo which can be ordered as a half or full order.  Although the description states that the gumbo contains shrimp, crab, chicken, scallop, and sausage [which I assume is Turkey since they proudly state that their food does not contain BEEF OR PORK], your Gumbo will only contain scallops if you order the FULL size.  Also, the crab meat is served in a separate 2oz plastic sauce container for you to mix in at your pleasure - I thought this was nice.  Moving on, I figured since this was my first try, I would order a sample for me and my son to enjoy: Half order of Gumbo, Shrimp Gumblaya, 2 Gumbo Wings, and 2 Buttermilk Wings.  Oh and by the way Yelpers, the wing orders comes with a BONUS -  a side of Gumbo Rice w/ sausage  WOO-HOO!!!Verdict:  Guilty of getting the Itis.This place is THA BOMB!!!  Not many people know how to \"do\" a Roux right, and if you're a novice you will end up burning it but Ms Nita knows what she's doing [her and her sous chef].  I went to college in the South with friends from the Gulf Coast and tasted authentic homemade Gumbo from the Mobile, Alabama kitchen of my college BFF's Mother and Grandmother so I know what it should taste like.  The Gumbo was perfect, the Gumbalaya [name twist on Jambalaya] was equally as good, but the STAR of the order was the Gumbo Wings!!!  Sorry for my language Yelp but those wings were so damn good, I wanted to go back and propose marriage to whoever battered, fried, and sauced those wings!!!  A flavor that can only be explained as taking a good but not overly seasoned wing and dipping it in a flavorful Gumbo/Roux gravy.All in all, I will definitely be returning to patronize Nita's Gumbo and you should too.", "rating": "5", "date": [2016, 2, 11]}, "20": {"description": "I stopped in Anita's Gumbo this evening after salivating thinking about delicious gumbo! I'm so glad I was determined to stop in because it was absolutely AMAZING! I ordered the Signature Gumbo and buttermilk wings! The Gumbo: nice kick of spice!  Delicious roux! Nice amount of crab, shrimp, chicken and sausage! The wings: Delish! I didn't get the wings with the roux on top since I figured it was pretty much the gumbo I had on the side. The customer service was excellent! Everyone was friendly, the owner was very personable as well! Thank you for bringing delicious Gumbo to Chicago! I'll be spreading the word and will also return!", "rating": "5", "date": [2014, 12, 2]}, "19": {"description": "Great food, It will fill you up!", "rating": "4", "date": [2015, 1, 9]}, "2": {"description": "Tried for the first time this evening. Really good. However it was much too spicy for me. Line I'll go back and ask if they can adjust the spice", "rating": "4", "date": [2016, 2, 10]}, "18": {"description": "Absolutely loved my shrimp po' boy! OK so I may be a bit biased because its so close to my house and I just want you to stay forever Anita's Gumbo. Its great having another flavorful option.I thought the price was pretty reasonable and the food was good. My only suggestion would be to create a kids meal the chicken was good but the gumbo on the side was a bit spicy for my 3 year old.", "rating": "4", "date": [2014, 7, 17]}, "13": {"description": "Finally lucked out and had the opportunity to try Anita's Gumbo.I had them bookmarked for a while.Tried their chicken and also their seafood gumbo.Both were delicious.The only thing I wasn't too crazy about is that they're TAKE OUT ONLY.Bummer.But as far as the food and service is concerned,WORTH STOPPING IN!!!! The young man at the counter noticed that I waited a bit probably longer than usual(no more than 20 minutes) and gave me some FREE BUTTER COOKIES!!!! That was really nice and appreciated.Good experience overall and portions were HUGE!!", "rating": "4", "date": [2014, 10, 1]}, "4": {"description": "I am giving this review based on their flip flop policies.  I've been ordering Gumbo hear for the last year.  I always order the signature gumbo and my rice is on the side,except when I order the lunch special which I am told always has the rice in the bowl.  Now on Friday, I order the 1/2 order gumbo. I get my order and am told the rice is mixed in already.  I don't like rice, and am cutting carbs. So I'm pissed off, I have never gotten it with rice in the bowl. In fact the cashier has always stated, \"Lunch specials are the only gumbos that have the rice already in it\". if I didn't want the rice in the bowl I have to order the Gumbo off the regular priced menu. So, imagine my surprise.  I was told since they increased the price this is also the new policies.  This fact should have been posted.  Anita's Gumbo has raised their Gumbo price by 20%, and you would think that would be enough to offset the overhead etc.   I don't pay for rice!!  Mind you I get home, and of course I have a bowl of rice with Gumbo roux............your practices are a little bi-polar Anita's Gumbo.  Be consistent for a while.  Gumbo is good. But to use rice as a filler and do a price increase is just completely unfair.", "rating": "1", "date": [2015, 11, 7]}, "24": {"description": "So far everything I've had from here is delisious. the Carribean Gumbo, the buttermilk wings, the gumbo wings, the shrimp and chicken gumbolaya, the sweet potatoe pie, the gumbo rice, all of it! The lunch specials are a great deal and a great option to try some higher priced menu options or only $6.50. Went last night and got one of the deals for $27.99 and was able to feed a family of 5 (4 adults and 1 child), and had leftovers!!!! Great flavor, fresh made to order food, beautiful design! Worth a trip to the southside!!!!", "rating": "5", "date": [2014, 8, 27]}, "6": {"description": "Outside of Hyde Park, there are few choices outside of mediocre tacos, fried foods, jerk and fast food so it's great that there's a gumbo spot on the south side.  If you're looking for whole crab legs in your gumbo - this is not the spot. But The ingredients are fresh and seasoned well, it is very tasty, and more importantly the shrimp they use does not shrivel up , and is not over cooked when fried and it is very juicy. And the different types of gumbo actually taste different so you're getting a different experience. I like it.", "rating": "4", "date": [2015, 10, 31]}, "22": {"description": "Finally lucked out and had the opportunity to try Anita's Gumbo.I had them bookmarked for a while.Tried their chicken and also their seafood gumbo.Both were delicious.The only thing I wasn't too crazy about is that they're TAKE OUT ONLY.Bummer.But as far as the food and service is concerned,WORTH STOPPING IN!!!! The young man at the counter noticed that I waited a bit probably longer than usual(no more than 20 minutes) and gave me some FREE BUTTER COOKIES!!!! That was really nice and appreciated.Good experience overall and portions were HUGE!!", "rating": "4", "date": [2014, 10, 1]}, "15": {"description": "They just opened on May 31st, 2014. Probably working out some kinks at the restaurant. So far I received carry-out for the Wednesday special Caribbean Gumbo. The roux is pretty good and it's not very spicy. Alittle lacking in the amount of meat and mostly rice, but i'll see what happens later.All menu items are made to order so anticipate waiting 10-20mins for your take-out food. Signs are posted.At the time of writing this review, their temporary hours of operation are:Sunday: ClosedMonday: ClosedTuesday: 11am-6pmWednesday: 11am-6pmThursday: 11am-6pmFriday: 11am-7pmSaturday: 11am-7pm", "rating": "3", "date": [2014, 6, 4]}, "7": {"description": "The gumbo roux was great!! I'm a big seafood eater so I would have liked more crab meat but over all the gumbo and Wednesday special was great!!", "rating": "5", "date": [2015, 5, 20]}, "8": {"description": "True confession: I haven't been to this restaurant. But I was at the Hyde Park jazz festival, they had a booth, and I thought I'd take a chance on the seafood gumbo. It wasn't cheap; if I remember correctly, I gave up a mug of Alexander Hamilton for the pleasure.But DAMN, that was GOOD gumbo! Perfect amount of spice--will perk you just up a little, while letting you concentrate on the flavor rather than the heat. Tasty morsels of seafood and andouille. (I checked it out for my pescatarian friend, though she was willing to suspend disbelief of the presence of sausage long enough to try a shrimp and bless the delicious roux.) This place is pretty deep in the south, which I guess is appropriate for a creole place. I will definitely venture down there for lunch sometime, and perhaps stop by Calumet Fisheries on the way back for some of their smokey goodness for dinner.", "rating": "5", "date": [2014, 10, 6]}, "30": {"description": "Had potential but a little pricey for gumbo. Ordered a lunch special and thought the portion sizes were a little small. Got nickeled and dimed on a can soda when there was no distinction on the menu about excluded items. I will give it one more try but felt that it has a long way to go.", "rating": "3", "date": [2014, 6, 11]}, "3": {"description": "Heard about Anita's from my friend and since she was in my neighborhood, I gave her a try and I am sooo glad I did. Her signature gumbo is authentic, hearty, and delicious! My hubby had the gumbolaya and my friend had a tangy shrimp po boy, which was all delicous. Her service was courteous and they had my food was ready when they said it would be time. Anita has a repeat customer!", "rating": "5", "date": [2015, 11, 21]}, "14": {"description": "AMAZING!! the gumbo was soooo good and flavorful! the roux was just the right texture & taste & the customer service was on point. the only thing I didn't like what that I had to crack open the crab legs & made a mess. I wish they had an option with them crab leg meat instead of the whole leg but that was honestly minor. I will DEF. be back!", "rating": "5", "date": [2015, 4, 7]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.747605, "longitude": -87.586237, "rating": "4.0", "times": {"Mon": [], "Thu": ["11:00 am", "8:00 pm"], "Sat": ["1:00 pm", "9:00 pm"], "Wed": ["11:00 am", "8:00 pm"], "Tue": ["11:00 am", "8:00 pm"], "Sun": [], "Fri": ["11:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Seafood", "seafood"], ["Caribbean", "caribbean"]], "address": ["8100 S Stony Island"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Good for Kids": "No", "Attire": "Casual", "Ambience": "Casual", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "32"}, "inkhart-tattoos-and-body-piercing-chicago": {"comments": {"1": {"description": "I had the worst experience with a piercer on the south side.  I came to Jay at Inkhart Tattoos and he hooked me up.  He told me how to care for my new nose stud and he was very professional and provided great customer service.  The other employees that I came in contact with were just as awesome with their customer service.  I will be back when I'm ready to cover up this stupid Mickey Mouse tat I got when I was a teenager.  I highly recommend this place!", "rating": "5", "date": [2013, 4, 27]}, "2": {"description": "DOPE AS HELL, actual artist and not super expensive, you can see your tat on there facebook too!", "rating": "4", "date": [2012, 11, 3]}, "0": {"description": "I went to Inkhart for my first tattoo. Reggie was strongly recommended by a good friend and I was impressed with his work. I sent him several pics with the concept of what I wanted and what he designed was better than I expected. Additionally, he gave very useful guidance on what script we should use, the placement of the text and use of color. Reggie also did my son's first tattoo and he was very happy. We'll be back.", "rating": "5", "date": [2015, 6, 2]}}, "neighborhoods": ["Washington Heights", "Brainerd"], "latitude": 41.7289727, "longitude": -87.6630484, "rating": "4.5", "times": {"Mon": ["12:00 pm", "8:00 pm"], "Thu": ["12:00 am", "8:00 pm"], "Sat": ["12:00 am", "9:00 pm"], "Wed": ["12:00 am", "8:00 pm"], "Tue": ["12:00 pm", "8:00 pm"], "Sun": [], "Fri": ["12:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Piercing", "piercing"], ["Tattoo Removal", "tattooremoval"], ["Tattoo", "tattoo"]], "address": ["9046 S Ashland Ave"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "3"}, "mitchells-food-mart-joliet": {"comments": {"3": {"description": "A hidden gem! From two towns over and was looking for a new meat market. Read the reviews on here and decided to try it. Great knowledgeable butcher with a great selection. Just tried the Wisconsin brats for lunch, very tasty! Looking forward to the others meats we picked up. Prices are very competitive with the big box store. Love going to mom and pop places. Worth the drive if you live a few towns over.", "rating": "5", "date": [2015, 3, 21]}, "1": {"description": "This place is as good as it gets. The butchers go out of their way to make sure you get exactlly what you want. They are very friendly and ougoing. The store has all those last minute items you may have forgotten to get earlier. The meat is fresh and well displayed so you can see what you are buying.", "rating": "5", "date": [2016, 2, 12]}, "2": {"description": "A blast from the past neighborhood grocery store.  They have the staples and the best part is the Meat Counter!!  The best meat you'll find around.  The potato sausage is incredible.  They even take the membrane off of the ribs when you order them, Jewel's butchers wont.  Well worth the effort to find this gem in the off beaten path.", "rating": "4", "date": [2016, 1, 4]}, "9": {"description": "A classic, superb \"Mom & Pop's\" grocery store.  The kind of small business that we all need to support.  The meat counter is superb, with great product and butchering.  Their ground beef is so far better than the local megamart crap.  Yeah, you will spend a couple dollars more for the items off the shelf, but you'll feel better making purchases from a small business that has nice people in it.", "rating": "5", "date": [2014, 2, 2]}, "10": {"description": "Mom and pop very tiny, old fashioned grocer. Very friendly staff. What people come for is the meat counter. The best fresh cut meat around.", "rating": "5", "date": [2013, 7, 30]}, "4": {"description": "We are pleased to have found this little gem.  We usually do a lot of our shopping at a big name grocer but I am looking for that small and local relationship not too far from home so this fit the bill.  When we first pulled into the parking lot I was a little skeptical, since we are not familiar with the neighbor hood and live in a cookie cutter subdivision just west of Mitchell's. We walked in and checked out the meat department and I was instantly sold. We placed an order for some rib tips that were not available and ordered some meat and cheeses. When the day came to pick our order up, I was able to call and confirm that the order was there and all this was done with professionalism, and you can tell their customers happiness is important to them.  We will be back and excited to get to know those behind the meat counter at Mitchell's.", "rating": "5", "date": [2014, 12, 16]}, "6": {"description": "Been going there all my life including my grandmother, mother, aunts, and cousins. Never had a piece of bad meat. Its nice to have a neighborhood store like this.", "rating": "5", "date": [2015, 3, 26]}, "12": {"description": "Meat. Meat. Meat. Chicken. Chicken. Chicken. No hidden fat like from chains. Everything perfectly and honestly trimmed. Ground chuck. No gristle. And tasty.", "rating": "5", "date": [2013, 7, 17]}, "5": {"description": "Great little place right down the rode from me. Love getting meat where your supposed to. A MEAT market!", "rating": "5", "date": [2015, 8, 8]}, "13": {"description": "Yes!! Mitchell's is by far the best place to get your fresh deli and meats. We moved out here 40 years ago and been shopping at Mitchell's ever since!", "rating": "5", "date": [2011, 6, 5]}, "11": {"description": "Its great to see a small old-fashioned grocery stand on its own among the sea of superstores out there overwhelming our neighborhoods.  Sure seems like nothing here has changed a bit from when I started patronizing this establishment some 15 years ago.  I believe they're more well known for their meat and deli section.  Such high quality at a great price (their hot Italian sausages are my favorite).  Next time you're in the area and get a hankering for some groceries, skip the chains and give this place a visit.", "rating": "4", "date": [2010, 5, 25]}, "8": {"description": "This small neighborhood grocery has the BEST fresh meat you will ever buy!", "rating": "5", "date": [2012, 10, 13]}, "0": {"description": "When I moved from New Lenox I was in need of a new meat market. My husband's family had been using Mitchell's for years.  This is now the only place I go. Their cuts of meat are fantastic. The employees are so helpful and kind. It's important to keep these small business owners in business. I suggest you give them a try.", "rating": "5", "date": [2015, 10, 10]}, "7": {"description": "My family used to own a grocery store that was built around customer service and our meat dept. Their meat dept. is outstanding. The best place to get meat. Tony's on rte. 59 in Plainfield is the only other place that I get ribs and steaks. I will always go to here first though.", "rating": "5", "date": [2014, 4, 26]}}, "categories": [["Convenience Stores", "convenience"], ["Butcher", "butcher"]], "address": ["1300 N Raynor Ave"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Food", "times": {"Mon": ["8:00 am", "7:00 pm"], "Thu": ["8:00 am", "7:00 pm"], "Sat": ["8:00 am", "6:00 pm"], "Wed": ["8:00 am", "7:00 pm"], "Tue": ["8:00 am", "7:00 pm"], "Sun": [], "Fri": ["8:00 am", "7:00 pm"]}, "rating": "5.0", "price": "$$", "number_of_reviews": "14"}, "tameca-locs-tweakedbymeca-chicago": {"comments": {"0": {"description": "When my loctition ditched out on me Tameca agreed to take me last minute, the night before her birthday. Excellent customer service, some great loc advice, and quality service. I left out extremely happy with my retwist!", "rating": "5", "date": [2015, 8, 20]}}, "neighborhoods": ["Avalon Park"], "latitude": 41.746347, "longitude": -87.585043, "rating": "5.0", "times": {"Mon": ["10:00 am", "4:00 pm"], "Thu": ["3:30 pm", "8:00 pm"], "Sat": ["3:30 pm", "8:00 pm"], "Wed": ["3:30 pm", "8:00 pm"], "Tue": ["3:30 pm", "8:00 pm"], "Sun": [], "Fri": ["3:30 pm", "8:00 pm"]}, "price": "$$", "categories": [["Hair Salons", "hair"]], "address": ["70 E 71st"], "attributes": {"By Appointment Only": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "category": "Beauty", "number_of_reviews": "1"}}