{"dans-hot-dogs-chicago-2": {"comments": {"0": {"description": "Best Chicago Style hot dogs on the southside.100% Pure beef hot.Fresh cut veggies and toppings.Fresh buns.", "rating": "5", "date": [2013, 10, 26]}}, "neighborhoods": ["Washington Heights", "Brainerd"], "latitude": 41.7243049166397, "longitude": -87.6631321012974, "rating": "5.0", "times": {"Mon": ["10:00 am", "7:00 pm"], "Thu": ["10:00 am", "7:00 pm"], "Sat": ["10:00 am", "6:00 pm"], "Wed": ["10:00 am", "7:00 pm"], "Tue": ["10:00 am", "7:00 pm"], "Sun": [], "Fri": ["10:00 am", "7:00 pm"]}, "price": "$", "categories": [["Hot Dogs", "hotdog"]], "address": ["9314 S Ashland Ave"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Good for Groups": "No", "Outdoor Seating": "Yes", "Delivery": "No", "Good for Kids": "Yes", "Takes Reservations": "Yes"}, "category": "Restaurants", "number_of_reviews": "1"}, "i-57-rib-house-chicago-4": {"comments": {"3": {"description": "This rib house on 97th and Halsted is worth the drive and the wait. None of the other locations can compare 2 the taste and quality of their ribs. Remember, the wait isn't 2 pleasant and the parking isn't either. It's pricey 4 the location, but you will get your money's worth.", "rating": "5", "date": [2015, 5, 15]}, "1": {"description": "Nice people, bad product.  It may be a sign of our times in south Chicago and it made me sad.On the other hand, maybe this place wasn't meant to make it after all.  Serve me stale bread and cover your extra bony ribs tips with enough french fries and BBQ sauce to fool me into thinking my lunch may be worth the $14 by weight alone....?  I won't cover cover for you!This was not good BBQ.  The rib tips were cooked, chopped and presented like a third rate staple.  What a disgrace :(Plus, it's a full day later and I'm still thirsty from all that sodium!!", "rating": "2", "date": [2015, 1, 15]}, "2": {"description": "Ran my credit card and refused to give me my food.  The manager Erika (sp?) was rude and doesn't know the menu. Lines are often over 20-45 mins.", "rating": "1", "date": [2015, 10, 19]}, "5": {"description": "Today I phoned in an order for a \"mild bucket of turkey tips\". I arrived, payed and received my order, only to drive 10 miles home and discover that I had been given pork instead. I called the store, and was CONFRONTED by the rude customer disservice person who questioned whether or not I placed the right order. Once I returned to the store, the call taker again questioned whether I made the right order, and charged me the difference in the price although I was the person who was inconvenienced. As a faithful customer for more than 10 years, I feel disrespected, and will never do business with this chain again.", "rating": "1", "date": [2014, 10, 28]}, "0": {"description": "I have had great experiences with this location over the years.  Service times have been less than 15 minutes, order takers efficient and the turkey tips and links perfectly smoked and sauced.  The combo is just shy of $20 and generous enough for at least 3 meals/people.  Parking can be slightly challenging, the fries are nothing special and no one picks up when I phone to advance order.  None of these drawbacks are a big deal for me.", "rating": "4", "date": [2015, 9, 4]}, "4": {"description": "They r ripping people off now. The large order is really a small.  I bought two large orders and they were exactly the size of the small order. Very disappointed. Very disappointed. I know prices have increased, but this place is definitely taking advantage of the demand.", "rating": "2", "date": [2015, 1, 30]}}, "latitude": 41.7175102, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Barbeque", "bbq"]], "address": ["9709 S Halsted St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Very Loud", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "No"}, "longitude": -87.6427231, "category": "Restaurants", "rating": "2.5", "price": "$$", "number_of_reviews": "6"}, "inkhart-tattoos-and-body-piercing-chicago": {"comments": {"1": {"description": "I had the worst experience with a piercer on the south side.  I came to Jay at Inkhart Tattoos and he hooked me up.  He told me how to care for my new nose stud and he was very professional and provided great customer service.  The other employees that I came in contact with were just as awesome with their customer service.  I will be back when I'm ready to cover up this stupid Mickey Mouse tat I got when I was a teenager.  I highly recommend this place!", "rating": "5", "date": [2013, 4, 27]}, "2": {"description": "DOPE AS HELL, actual artist and not super expensive, you can see your tat on there facebook too!", "rating": "4", "date": [2012, 11, 3]}, "0": {"description": "I went to Inkhart for my first tattoo. Reggie was strongly recommended by a good friend and I was impressed with his work. I sent him several pics with the concept of what I wanted and what he designed was better than I expected. Additionally, he gave very useful guidance on what script we should use, the placement of the text and use of color. Reggie also did my son's first tattoo and he was very happy. We'll be back.", "rating": "5", "date": [2015, 6, 2]}}, "neighborhoods": ["Washington Heights", "Brainerd"], "latitude": 41.7289727, "longitude": -87.6630484, "rating": "4.5", "times": {"Mon": ["12:00 pm", "8:00 pm"], "Thu": ["12:00 am", "8:00 pm"], "Sat": ["12:00 am", "9:00 pm"], "Wed": ["12:00 am", "8:00 pm"], "Tue": ["12:00 pm", "8:00 pm"], "Sun": [], "Fri": ["12:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Piercing", "piercing"], ["Tattoo Removal", "tattooremoval"], ["Tattoo", "tattoo"]], "address": ["9046 S Ashland Ave"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "3"}, "beggars-pizza-chicago": {"comments": {"1": {"description": "A. It took almost two hours B. My pizza had a piece of hair in it. I took a pictureC I ordered barbecue wings but instead got hot wings with barbecue sauce on the sideD the cashier turned into the manager when I asked to speak with a manager about the hair and when I asked her name and it matched the receipt she lied and said that someone else took my order under her nameE the customer service was horrible. I've never had this experience with beggars. It's proof the owner could care less about how people are treated. I'll never ever buy from this place again. I'll get a jacks frozen pizza first", "rating": "1", "date": [2015, 10, 23]}, "9": {"description": "good pizza, bad everything else. although there was one time when i ordered and did get a friendly and helpful person, but that was far from the norm which is why i no longer order from them. in 2014 they either don't take credit cards or they require you to provide your drivers license # (over the phone) for a delivery order. i won't even go into the 2 hour wait because you really shouldn't even bother to order from them at all. i sent a complaint to the corporate offices and never got a response so my pizza dollars go elsewhere and so should yours. see my other reviews if you live in the washington heights/beverly area for a better option.", "rating": "1", "date": [2015, 1, 17]}, "12": {"description": "Worst Beggars pizza in the Chicagoland area. Crust is harder than cardboard. Seems like they use lower grade products than other beggars pizza establishments. Something's wrong. Don't eat here! If you live close, drive the few extra miles to the 127th street location.", "rating": "1", "date": [2013, 12, 21]}, "21": {"description": "It's pretty good.  Take out only at this one, can't use the coupons that you could normally print out for the other locations.  I suggest placing the order, waiting the 35 minutes (for thin) and picking it up.", "rating": "4", "date": [2009, 5, 13]}, "16": {"description": "The pizza was decent but the service was garbage. chick behind the counter didn't call my number just walk up to the counter and sat it on the counter and looked at me wow!!! while waiting for the pizza 2 customers returned pizzas.", "rating": "2", "date": [2012, 10, 12]}, "17": {"description": "Its safe to say that with other's review of this place, its best to delieve than to pick up. Which is what I did! I got the thin crust 12' sausage pizza and boneless chicken wings with curly fries. The pizza can feed two hungery people and the boneless wings, even with the fries won't fill up a person. However, the seasoning on the wings are spicy, but not too hot! I'd order from them again, but won't drive there to get it.", "rating": "4", "date": [2013, 4, 12]}, "10": {"description": "Awesome awesome awesome!!First off, this was a Home Run Inn pizza place. My wife and I decided to grab some lunch after dealing with the auto shop people (that's a whole other review I'll give later). We walked in and all the serving staff was busy. But after waiting about 30-45 seconds, someone comes and seats us. The waitress was really friendly and checked on us a little more than desired but hey, I would rather her check in than leave us hanging. We ordered two personal pizzas. I had grilled chicken, bell peppers and diced tomatoes. That was one of the best little pizzas I've had in Chicago! Chicago really has the pizza industry down to a science. It arrived hot, great presentation on a mini pizza rack with a spatula. The chicken was seasoned well, the peppers and tomatoes tastes super fresh! The crust was nice and crisp. Look out Giordano's, I might have a new favorite place to eat pizza. Then for desert....we ordered the Cookie Mound with one chocolate chip cookie, one scoop of icecream, and lots and lots of whip cream and chocolate drizzle on top. The cookie was soft and warm, with just enough icecream on top to make you want to shove the plate in your mouth! Pleasant surprise. I will definitely recommend Home Run Inn!!", "rating": "5", "date": [2014, 8, 5]}, "5": {"description": "January 3, 2015This was my first and will be my last trip to Beggars'!  Here's what happened, I stopped by the store on 103rd and Halsted and checked out the menu. I thought it was pretty high but decided to go ahead and order Italian Fiesta and Lou Malnati's too far tonight. So I order a small thin crust sausage, 30 mins she says, I go to my car. 25 min later I go back in. I look at my receipt #277 and ask the girl why is the price 12.50 one the receipt but 12.00 is posted on the menu. She doesn't know, must be taxes. I say there's a separate charge for taxes she doesn't know she'll get the manager. Manager comes out I tell her the extra charge problem she tells the tax lie. I tell her the amount listed for the taxes so she tells the I don\"t know lie, an adds the prices were changed yesterday lie, maybe they just haven't got around to changing the store menu. I picked up the box and left, got in the car and notice she gave me a menu.Open the menu and lo and behold, the menu says the small pizza is 9.75 not 12.00. The slices were 2.80 for thin instead of 3.50 and 2.95 for Deep dish instead of the in store posted 3.85. all the prices are less than the prices posted in the store. So I'll stick to Italian Fiesta and Lou Malnati's and pass the stickup at Beggar's!", "rating": "1", "date": [2015, 4, 11]}, "11": {"description": "I ordered a pizza earlier today 01/13 from your Roseland location.. I had the ABSOLUTE WORSE experience I've ever had with this company EVER.. The OWNER/MANAGER  told me a time frame in which my pizza was supposed arrived at my work place. not only was my pizza cold and late.. The owner that beggars saw fit to run a company continued to be inadequate by showing up to my job to tell me i was a thief for refusing to pay for my pizza, after he said he tried to contact the driver and did not get any responses. He was loud and extremely belligerent AT MY WORK PLACE instead of handling the situation with customer service. The driver told me there was a zero balance on the receipt and to call beggars back which I did. After explaining my situation i was told sorry for my inconvenience just to have the owner continuously shout THIEF at me.. I've always paid for my pizzas coming from stony island on 83rd we have never had problems because they have always had excellent customer service and ALWAYS delivered my pizzza in the time they told me.. This location on 103rd in Halsted was filled with ignorance and HORRIBLE customer service.. They lost a faithful customer to the Beggars corperation...", "rating": "1", "date": [2015, 1, 13]}, "3": {"description": "If I could give this store zero stars I would. The assistant manager who said her name was Britney is rude, brash and a liability to the brand.  Order Doreens Pizza, order Dominos Pizza order anywhere but here.  They are inept at the most basic thing in business, collecting payment.  So instead of me enjoying the pizza I ordered, they left with it after trying to run 4 different cards they determined the drivers card reader was malfunctioning and if I wanted my food I should find an ATM, really? The purpose of ordering in is STAYING IN! So after all that they would rather throw away my pizza because they do not have their shit together.", "rating": "1", "date": [2015, 12, 13]}, "0": {"description": "My family and I have ordered from this restaurant a handful times in the past. The service is fair and the wait time on hold can be cumbersome. The representatives that answer the phone can be challenging sometimes. Besides the phone service the wait time for deliveries can be utterly ridiculous. Thankfully this time I delivery was under the advised 90 minutes. Despite the lack of customer service the pizza is pretty good. The pizza is always served hot with a delicious amount of cheese and sauce. Hopefully restaurants like this will put some of these reviews to good use. '_'Cheers", "rating": "2", "date": [2015, 8, 31]}, "20": {"description": "I've never had thin crust so thick in my life- I damn near choked. Oh and when I picked up my order it had pizza sauce all over the box which is kind of unsavory IMO. Also this place ain't cheap I spent $27 on a 16\" pizza-  mannn...skip this place", "rating": "2", "date": [2009, 7, 27]}, "19": {"description": "wait time for delivery was 1 and a half. Was put on hold for over 10 minutes. Avoid this play like the plague. Also, 15 dollar minimum to charge on card. Absurd. Not to mention they got my order wrong. Do not buy from here.", "rating": "1", "date": [2011, 9, 11]}, "2": {"description": "I called to order a pizza with turkey sausage all around and chicken/pineapples on one side. Wings, fries, and mozzarella sticks were added too. Once the order was done, I asked them to repeat the order for me to avoid any mishaps. I get home to, and start eating, and tasted pork on my pizza. Everybody else at my house was eating pizza but me. The wings tasted like they were frozen, put into a refrigerator, and heated in a microwave. The mozzarella sticks tasted like they were cooked in a bowl of grease and finished off in a toaster. The fries tasted liked they've been sitting in a pair of skates filled with water. They didn't even put the sauce on the wings bruh. I'm bothered and hungry as ever, but I can't eat. I don't even want to give them a star man.", "rating": "1", "date": [2016, 1, 3]}, "18": {"description": "Let me start this review with this disclaimer: I reserve these opinions and observations for this particular franchise, not to negate the largely positive regard I hold for the chain Beggar's Pizza. Now, being born and raised in Chicago, to say I have a healthy affection for pizza is the understatement of the century! From thin crust to stuffed and deep-dish, I have an appreciation for all things Chicago when it comes to pizza. Home Run Inn, Giordano's, Uno's, Gino's and er, uh -- you get the idea, lol. But today I am reflecting on my experiences with Beggars on 103rd & Halsted Ave on the South Side. The service is nightmarish. All too typical of what you find in the heart of the city, most of the employees appear to be young, largely impersonal individuals. They seem particularly indifferent to anything reminiscent of 'attentive' service, chatting with one another, texting, chewing gum and then perhaps seeing what you could possibly want. Most saddening of all they have managed to make me less fond of the pizza. Beggar's marketing ploy is: We lay it on thick(cheese). I have received a family size with almost 5 entire pieces absent of  cheese. I have picked up a pizza on occasion to find 1/3 of the cheese is melted to the cardboard box in which it is packaged.Ultimately it's all too much or too little for me. Don't get me wrong, when made right this is an amazing carryout pizza! But ultimately, that doesn't atone for the lack of enthusiasm and attention to product this $27 family size pizza misses at this location.. At the end of the day, this is Chicago and there are literally hundreds of other places where you can make good on your hard-earned pizza dollar!", "rating": "2", "date": [2009, 11, 22]}, "13": {"description": "I went today during my lunch break. The service was fine and food was quick. I love Beggars, some of the best pizza in Chicago.", "rating": "4", "date": [2013, 7, 31]}, "4": {"description": "I LOVE Beggars but this location is ABSOLUTELY HORRIBLE! The customer service was the worse I've experienced. I called my order in and when I arrived I paid for my order and the young lady never said if my order was ready or not so I ASSUMED it wasn't ready. So I sat there patiently for ten minutes and I finally went back to the window and asked one of the four ladies if my order was ready and it had been ready since I arrived!!!!  Beggars is known for the thick layer of cheese but my pizza did not have a thick layer of cheese and just looked sloppy. I was not satisfied.", "rating": "1", "date": [2015, 3, 17]}, "6": {"description": "The pizza is ok , but the staff makes you not want to go and give your money . Just a bunch if folks who hate their job and mad at the world , working in customer service . I would rather take my business to crestwood , than come here . They destroy the brand of beggars.", "rating": "3", "date": [2014, 9, 8]}, "15": {"description": "Placed an order for our company holiday party at 10:15am this morning, specifically explained we only had 1 hour for our lunch period & needed the order here promptly at noon. 12:20 came & no oder, when we called to see where our order was we were told it was on the way. 12:40 comes around, we now have less then 20 minutes left for our lunch and still no order. This time when we called, we were given a run around about how they were very busy & couldn't be accomadated. They offered to tak $9 off a $60+ order, big whoop! Needless to say, we canceled our order & will NEVER order from them again! This is very upsetting as their suburban locations are very friendly & accomadating. If it were possible, this location wouldn't get any stars.", "rating": "1", "date": [2012, 12, 21]}, "7": {"description": "Why oh why won't yelp let you give no stars???? First off the pizza here is the worst pizza I've ever had in my life! Greasy, cheap every thing.. Sauce, pepperoni, and cheese. Now the service is unbelievably bad, unprofessional and lazy. The phone rings forever before somebody picks up when i finally get an answer place my pick up the person is rude and obviously hates her job possibly life. I go on to pick up my order and get informed that they not only have the wrong thing they chose for me but they don't even have what I wanted on the menu anymore. Why did this lady choose not to tell me and then make her own substitution. Never will I order or go near this place again. I suggest nobody does.... Please let them go out of business and a real restaurant take its place....oh and yelp give us the option for no stars pleaseeeee its longgggg overdue.", "rating": "1", "date": [2015, 3, 13]}, "8": {"description": "Pizza isn't even good. It literally tastes like old pizza warmed up. Then half the people there act like they don't want this job. I'll pass and give my money to somewhere else.", "rating": "1", "date": [2015, 1, 26]}, "14": {"description": "This is the worst one I've been to!!!! The service is beyond horrible! When you order your food for carry out they wait yo you get there to start your order! This is unacceptable! And customer service is super WACK! Any time I'm paying $20 for a small deep dish I want the best pizza made! I have grew up on beggars and will forever love it but this particular franchise is terrible!!", "rating": "1", "date": [2013, 3, 4]}}, "neighborhoods": ["Washington Heights", "Brainerd"], "latitude": 41.7062683, "longitude": -87.6431885, "rating": "2.0", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["11:00 am", "11:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["12:00 pm", "10:00 pm"], "Fri": ["11:00 am", "11:00 pm"]}, "price": "$$", "categories": [["Pizza", "pizza"]], "address": ["10314 Halsted Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Very Loud", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "22"}, "subway-chicago-142": {"comments": {"0": {"description": "I have been to this subway on several occasions. I have never been disappointed. Their food is fresh and they offer good service 24 hours a day. I truly enjoy building my own salad with the tuna and crab.  The place is kept clean and staff is professional.", "rating": "3", "date": [2015, 5, 20]}}, "latitude": 41.7208264768124, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Sandwiches", "sandwiches"], ["Fast Food", "hotdogs"]], "address": ["9518 S Halsted St"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Takes Reservations": "Yes", "Good for Groups": "Yes", "Delivery": "Yes", "Good for Kids": "Yes", "Has TV": "Yes"}, "longitude": -87.6433233171701, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "1"}, "harolds-chicken-shack-no-27-chicago": {"comments": {"3": {"description": "THE WORST CUSTOMER SERVICE IN THE WORLD!!! It's a chicken place, but when I ordered chicken the wait was 20 minutes. And the cook got mad when I placed an order. I guess I had the audacity to order chicken at a chicken place.", "rating": "1", "date": [2014, 12, 5]}, "1": {"description": "I would love to know who owns this Harold's! !!!The called ahead and when I got there they were SOOOOO disrespectful!  Because \"THEY\" hadn't started the order!  I know why!  The cook was sleep and the cashier was on the phone! Mr. Owner. ....you lost a lot or business!", "rating": "1", "date": [2016, 1, 20]}, "2": {"description": "The worst customer service I've ever had.....and that was just on the phone!!My co-workers and I tried to place an order over the phone. Asking for 4 breast and 4 thigh pieces. Now, they don't have a meal that includes those pieces, but we told them to just charge us accordingly per piece. They informed us that they could not do that, even though it states prices per piece on a website. I asked to speak to a manager, there was not one on duty at the time. We ended up going to Popeye's and getting exactly what we wanted. Never had a problem with any other Harold's locations, this might have just been un-properly trained employees.", "rating": "1", "date": [2015, 3, 19]}, "5": {"description": "Where do I begin? The customer in front of me was arguing with the cashier because they gave her order to a homeless guy. She was told she should have been listening. The customer went ballistic and threatened to call the police. The cashier had the nastiest attitude in the world. After ten minutes, they replaced her order. The cashier complained the entire time. When I got my chicken home, it was disgusting. It was so salty I couldn't eat it. Unprofessional employees coupled with exorbitant prices for over cooked salty chicken is an insult. Does the owner only stop by to collect his money? This cashier has been at this location for quite some time being ignorant and rude to the customers. Unfortunately, as long as the communities need for inferior food and service supersedes demanding a quality product for their hard earned dollar, this place will be open.", "rating": "1", "date": [2014, 12, 7]}, "6": {"description": "If you not from the ghetto, you don't know about this..Love that chicken from Harold's Cheap prices for a chicken,bread,fry combo. Yea in the \"hood\" we eat bread with everything & I mean everything! The gizzards are very good friend,pretty much everything in that place is bomb.Watch out for the workers seeming like they don't want to be at work, but who does. Call ahead & give it 20 more min then when they tell you it'll be ready or you will be waiting for sure. Make sure to dip the fry in the sauce provided for that extra ummph. I have been going to Harold's for years,now that I moved I can't find any other place like this. I'll be sure to pick up a combo whenever I'm back in town!", "rating": "4", "date": [2010, 5, 13]}, "7": {"description": "Pretty good Harold's! I like this one if I'm in the area, but there's no parking in this densely residential area. It doesn't help that there's a bus stop right in front, so you can't even \"stand\" there.", "rating": "4", "date": [2012, 6, 23]}, "8": {"description": "A good one to visit... Really good service", "rating": "3", "date": [2009, 10, 25]}, "0": {"description": "It's definitely in the hood, but well worth the trip. My good friend from high school used to live in Chi-town and told me this is the original location.I ordered the 4 wings & fries with mild sauce. The wait was reasonable (it helped that there were only three other customers there at the time). The food was hot & fresh. To my delight a few extra wings had been thrown in. YAY for me!  Deelish! I devoured every bite and will be back the next time I'm in Chicago.", "rating": "5", "date": [2011, 8, 4]}, "4": {"description": "Harold's has always been a favorite of mines. The sauce is amazing, then you add the chicken and fries that makes it epic! Honestly, haven't been in Chicago for years now, but Harold's is a place I tell anyone that visit the Chi to make sure they get some Harold's!", "rating": "4", "date": [2014, 8, 26]}}, "latitude": 41.7076759, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Fast Food", "hotdogs"]], "address": ["10259 S Halsted St"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Good for Groups": "No", "Delivery": "No", "Outdoor Seating": "No", "Drive-Thru": "No", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.642601, "category": "Restaurants", "rating": "2.5", "price": "$", "number_of_reviews": "9"}, "acupuncture-access-evanston-2": {"comments": {"12": {"description": "I used to have a lot of headaches!!  Especially if I tried eating lightly or didn't eat every few hours!  Not good when a person is trying to lose weight.Bonny treated my headaches with acupuncture a handful of times.  These sessions held off the headaches for a matter of time.  Until now!!! -Now I don't get headaches anymore and I didn't even get one headache during my recent 30 day juice fast!!  A miracle!!  Thanks to being headache free, I lost 25 pounds!!!Thank you, Bonny!!I'll continue referring and also return for massages!", "rating": "5", "date": [2011, 10, 22]}, "7": {"description": "Very calming atmosphere and I've had great results every time I've gone. The acupuncturist is very caring and takes time to listen to any questions or issues you might have. Plus, it's affordable!", "rating": "5", "date": [2013, 11, 5]}, "3": {"description": "I had both deep tissue massage and acupuncture from Bonny and she was just wonderful. The massage felt great and the acupuncture was painless - I am quite wimpy when it comes to pain in general and because she kind of tapped my skin before applying the needles, I barely felt them at all. She was great about talking to me and explaining exactly what she was doing and well. I would absolutely recommend her.", "rating": "5", "date": [2015, 11, 4]}, "1": {"description": "Bonny is great!  I went to her for palmar hyperhidrosis (really sweaty hands) and found relief within 2 weeks.  She's attentive to details and has provided the best care of any community acupuncture experience that I've ever had.  As a side bonus, my seasonal allergies have completely disappeared.  I've gone from 1 Zyrtec every morning and Flonase to needing nothing. Bonny is one of the only acupuncturists in Chicago providing community acupuncture and it's a major service to the community.   I'd definitely suggest a visit.", "rating": "5", "date": [2015, 6, 24]}, "2": {"description": "Bonny saved me when I was suffering from tremendous pain in my head & nerve pain in my legs.  She's kind and gentle and definitely knows what she's doing.  I looked forward to seeing her every week for relief and after a few weeks of sessions, the pain eventually disappeared AND she was able to get my blood pressure problems under control. I was on many medications for many years and after working very closely with Bonny and my regular doctor, I was able to get off of all of my medications except for one.  That was a feat in itself. She has flexible hours and her rates are affordable, so given that my insurance did not cover acupuncture, that was a huge plus for me.  I've been pretty stable for a few months now, but I will definitely return to her in the future.", "rating": "5", "date": [2015, 12, 15]}, "9": {"description": "I highly recommend Acupuncture Access. I would give Bonny, the acupuncture specialist at Acupuncture Access, very high marks for professionalism, attentiveness, communication, facilities, reasonable fees, and, above all, results. After a couple of years of procrastinating, my mother finally tried acupuncture with Acupuncture Access. My family tried hard to manage our expectations since we knew the research said that acupuncture showed real results but certainly not for everyone (including a major recent study funded by the National Institutes of Health found at nccam.nih.gov/research/r…). And my mother's level of pain in her back and joints was very serious and her walking seem to be getting more challenging every month. It almost sounds cliche' but my mother tried everything before trying acupuncture: several orthopedic surgeons, rheumatologists, several physical therapists, diet, exercise, etc. She experienced only temporary relief. From the very beginning Bonny seemed very committed to my mother's progress even if it meant suggesting other non-acupuncture approaches. She took a very holistic approach with acupuncture being one main component. Within a few sessions, my mother's pain drop significantly and her walking improved. The results were quite dramatic after a few months. One other thing that really impressed us is how Bonny suggested that the frequency of the visits drop from two per week down to one after it was clear that less acupuncture was necessary.", "rating": "5", "date": [2012, 11, 12]}, "18": {"description": "I highly recommend Bonny Rhodes for both acupuncture and massage.  The clinic itself is very warm and inviting, spotlessly clean and very peaceful. Bonny is a great listener and extremely attentive to her patient's concerns and needs. And while I am really not a big fan of massage, her deep tissue massage is incredible.  If you are even considering making an appoint ment, you should: it is highly likely you will find relief from your ailments and a great stress-relieving experience.", "rating": "5", "date": [2011, 5, 14]}, "10": {"description": "I suffer from a number of ailments and wanted to try acupuncture as an alternative to medication. While there are some community acupuncture clinics in Chicago, Acupuncture Access is very convenient for Evanston and north Chicago. It is located about two blocks away from the Main Street station on the bottom floor of an apartment complex. The office/clinic is actually has a serene ambience with new age or classical music playing in the background, sunlight shining (not beaming) down the windows, and matching furniture.I completed several forms inquiring about my health history for the practitioner, Bonny Rhoads, to review. She took time to access my health. After a comprehensive exam and advice, she escorted me back to the main area where I sat on a chair. She then proceeded to insert the needles in several points of my body while closely monitoring my comfort levels. My body was overwhelmed by tingling and numb sensations. She asked me to rest for 45 minutes, but the sensations, particularly on my right hand, were too great. After about 25 minutes, she removed the needles. I felt a bit more energized after the first treatment, but I wasn't sure how effective acupuncture might be. I did sleep better over the next few days. I've been an insomniac by the way.Bonny called me a few days later inviting me to return for another treatment. I was a little wary, but a second try wouldn't hurt (literally). This time around, I was much more comfortable and Bonny was as hospitable as ever. After the insertions (which felt less painful), she wrapped me in fleece blankets and I almost fell asleep. This session was much more relaxing this time around.I recommend Acupuncture Access for anyone interested in this traditional Chinese therapy. It's affordable (charges based on sliding scale), the office is quiet and peaceful, and Bonny Rhoads is soft-spoken and very pleasant.", "rating": "4", "date": [2008, 9, 11]}, "13": {"description": "I have suffered from major depression most of my life. I have not responded well to medication, hospitalization, and talk therapy, so I decided to give acupuncture a try. Over the past three months, I visited three acupuncturists, and I had pretty good success. But I was looking for an affordable practitioner, closer to my place of employment. I found Bonny through the Community Acupuncture Network. Community acupuncture features group treatment spaces (no private acupuncture treatments) and a sliding scale (between $20 and $40) with an additional $10 surcharge for the first treatment. On my first visit, Bonny asked me several questions about my symptoms, took my pulse, and examined my tongue. Unlike the other acupuncturists I had seen, Bonny was female, so, I have to admit, I felt more comfortable. Bonny's warm, calm persona and clean, relaxing environment made me less anxious about the acupuncture itself (I hate needles). Bonny inserted several needles in my legs, feet, wrists, hands, and ears and made sure I was comfortable while I relaxed for 40 minutes. The rest of my evening was spent in complete bliss!", "rating": "5", "date": [2008, 12, 25]}, "16": {"description": "I've been receiving treatment at Bonny's capable hands since January 2012. After years of progressively worse knee pain, I can see a light at the end of the tunnel. I cannot recommend her enough.", "rating": "5", "date": [2012, 7, 1]}, "17": {"description": "I highly recommend booking a massage here! I've only had the deep tissue massage and it is one of the best I've ever had. Plus, Bonny does vacuum cupping as well (wonderful chi cleansing/aligning treatment)  and that has been an extemely beneficial treatment as well. Too many times I have paid about twice what she charges for massages that were not as good and beneficial as the ones I've recieved here. It's so great to have found an excellent massage therapist who charges such affordable prices. I really can't say enough good things about Bonny Rhoads and her practice!", "rating": "5", "date": [2011, 1, 26]}, "15": {"description": "I highly recommend Acupuncture Access with Bonny. The clinic is very calm and relaxing, and Bonny is a very attentive acupuncturist. During my second pregnancy, I suffered from chronic headaches and severe back pain. After finding out which ailment was greater (the headaches), Bonny went right to work. She focused on both problems, and had the headaches wiped out within a few weeks. The back pain, which was initially so bad I couldn't go more than a day without extreme discomfort, was kept in check with a bi-monthly acupressure massage. Bonny has done more for my headaches and back pain than any doctor has ever done. She's always very attentive, and asks if there are any other problems that need attention.", "rating": "5", "date": [2011, 8, 10]}, "0": {"description": "I've gotten deep tissue massages from Bonny several times. Her technique is effective, and I have left every session feeling great. I appreciate that she starts our sessions by asking for my input, and that she periodically checks in with me to see how things are feeling. Massages are by appointment on Monday, Wednesday, Thursday, and Saturday, and she's prompt with returning emails or phone calls. Accepted forms of payment are cash or check.", "rating": "5", "date": [2015, 9, 28]}, "5": {"description": "Acupuncture Access is a great, affordable, efficient way to get top-notch help. Bonny is caring and is very vested in my treatment and relief from skin problems. Her bedside manner is impeccable and she exudes calm. This feeling of peace pervades the space where the treatment takes place.The clinic format means that not only is the care affordable; I can also rest longer than would be possible in a private office. Because of Bonny's serenity, the space is also quiet and relaxing. I never fail to fall asleep.Bonny has a thorough knowledge of the medicinal herbs. Just as importantly, she can communicate in clear terms the purpose of each herb and each treatment zone. She also set realistic expectations as to the amount of time I would need to see results.I'm so glad I found this treatment option. Acupuncture Access has made a huge difference in my quality of life.", "rating": "4", "date": [2012, 10, 12]}, "11": {"description": "Do not go to this place. I got a pinched radial nerve in my  arm and couldn't get rid of the pain for months. I should have sued. Also, this place is NOT relaxing! Sliding scale obviously means you have to take a gamble with your body.", "rating": "1", "date": [2011, 8, 31]}, "8": {"description": "I had a bad fall and severely separated my shoulder in two places.  After months with an orthopedic surgeon, and follow up with a great chiropractor, I still had terrible pain in my right hand from the wrist to the fingertips.  It was like 100 pins were being stuck in my hand. Bonny completely eliminated the problem with about 6 visits, and I've been pain free for months.  I had apprehension about acupuncture, but it was painless, and effective.  She's the best!", "rating": "5", "date": [2012, 6, 18]}, "4": {"description": "Bonny is a talented acupuncturist and healer. She has a great community healing concept in a vintage space, and at a price that is affordable for frequent sessions. The one hour catnaps are really a bonus! After seeing multiple, and very talented clinical acupuncturists, I will continue seeing Bonny at Acu Access.", "rating": "5", "date": [2014, 5, 29]}, "14": {"description": "So, even though I now live in Portland OR, I had to just say this again about Bonny and Acupuncture Access. Community Acupuncture is a god send for the world. Seriously. I am a firm believer in the health revolution and community acupuncture is helping us change things one needle at a time. I now go to a clinic out in PDX (Working Class Acupuncture) and they have this board with all these pins that locate various CA clinics around the country. I smiled when I saw Bonny's was on that board. Please go see her, you will not be disappointed.", "rating": "5", "date": [2011, 9, 2]}, "6": {"description": "This review is long over due. I've been seeing Bonny since this past September. I've been seeing her nearly every week since then. My story starts out in the field of bodywork and healing. I was a practicing massage therapist and yoga teacher, and after two years, I damaged my ulnar nerves in both arms. Unable to do much of any type of work, with burning pain in my arms and hands and tingling sensations in my palms and fingers, I sought out help from doctors and physical therapists, with very little success. Yoga did not help. Massage helped minimally. It became something that I lived with every day. 8 months went by. I decided it was time I gave acupuncture a try. I found Acupuncture Access through the Wildcard network from Northwestern. From the moment I walked in, I felt relaxed. Bonny creates a calm and open environment. She does a very thorough intake about why you are seeing her, and allows plenty of time for treatments. In addition to my arms, I also suffered from GERD, as well as plantar fasciitis and a heel spur, patella-femoral dysfunction, and PCOS. In the time since I've started seeing her, I no longer have knee pain, or GERD issues. My left arm is completely recovered, and my right arm feels mostly better. My heel pain is very, very minimal, and we are currently working on the PCOS symptoms, of which I am noticing a marked difference monthly. I'm someone who doesn't need pampering with my relaxation. I enjoy the group environment. It's rare that something disrupts the naps that I fall into every time I go. It's some of the most relaxed moments of my week.I'm a firm believer in giving EVERYTHING a chance, to find what works the best for your body, in terms of healing. My body responds better to acupuncture better than anything else I've tried. Bonny is fantastic. Her approach works. She has a keen ear, and a drive to help get to the bottom of ailments. She's the real deal.", "rating": "5", "date": [2012, 6, 17]}}, "categories": [["Massage", "massage"], ["Acupuncture", "acupuncture"]], "address": ["915 Elmwood Ave"], "attributes": {"Parking": "Street", "By Appointment Only": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "No", "Accepts Insurance": "No", "Wheelchair Accessible": "No"}, "category": "Beauty", "rating": "4.5", "price": "$", "number_of_reviews": "19"}, "urban-wellness-chicago-chicago": {"comments": {"3": {"description": "Terri is one of the best.  Every time my back goes out, I give her a call and she snaps me back to health quicker than I could on my own. She knows what she's doing and she's damn good at it!", "rating": "5", "date": [2012, 9, 14]}, "1": {"description": "I was looking for my first ever massage in the Wicker Park area within walking distance from my apartment. After coming across the reviews here and reading the bios of the massage therapists on their website, I decided to email them about their availability. Within an hour or two, Terri (the owner and a massage therapist) got back to me with some times for the date I was looking for. Quick and easy scheduling, and Terri even offers a $10 discount for your first time coming in. Walking up the stairs and in their door, I was a little unsure about the place (it is not a storefront, and is on the second floor above City Soles and Flash Taco). It's an older apartment building from the looks of it, and the \"lobby\" is more of a living room. However, the massage rooms are normal, peaceful massage rooms. Terri was fantastic and was very accommodating to a first time massage client. I'm struggling to find a time I was more relaxed than right now. My legs were very sore from a leg workout the day before, but they feel as good as new after the massage. Terri is highly recommended and I will certainly go back next time I need a massage.", "rating": "5", "date": [2015, 5, 29]}, "2": {"description": "I'm thankful Terri was open the day before a half-marathon to Rock Tape my ankle tendons. All the other rehabilitation offices were closed! She accommodated me for a last minute appointment. She had different styles available. She was incredibly friendly. My ankles felt well supported during the race and didn't swell at all post-race. I can't wait to hear about her Rock Tape workshops so I can learn how to apply them myself.", "rating": "4", "date": [2011, 9, 12]}, "0": {"description": "Excellent massage therapy.Highly trained and well educated staff. Terri is phenomenal. Her myofascial work is outstanding. She is very upbeat and friendly.The space is large, bright, and comfortable. The colors are very relaxing but energizing. The decor is tasteful. Tranquil. Peaceful. Perfect.The location is convenient to the Blue Line and the rumble from the trains passing slowly by is actually quite relaxing.Parking is easy to find within a block and it's usually free.Make an appointment in advance or hope to luck out with a last-minute cancelation.You won't be envious of anyone else's massage, heavenly or other, after visiting Urban Wellness.", "rating": "5", "date": [2013, 5, 28]}, "4": {"description": "They have given me absolutely no reason to try someone new, even though I have been meaning to.  I go at least once a month.  :)", "rating": "5", "date": [2012, 1, 24]}}, "neighborhoods": ["Wicker Park", "West Town"], "latitude": 41.9100395, "longitude": -87.6774587, "rating": "5.0", "times": {"Mon": ["8:00 am", "9:30 pm"], "Thu": ["9:00 am", "9:00 pm"], "Sat": ["8:00 am", "7:00 pm"], "Wed": ["8:00 am", "9:30 pm"], "Tue": ["8:00 am", "9:30 pm"], "Sun": ["9:00 am", "4:00 pm"], "Fri": ["8:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Massage", "massage"], ["Massage Therapy", "massage_therapy"]], "address": ["1564 N Damen Ave", "Ste 207"], "attributes": {"Parking": "Street", "By Appointment Only": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Accepts Insurance": "No", "Wheelchair Accessible": "No"}, "category": "Beauty", "number_of_reviews": "5"}, "tonys-original-philly-steaks-and-wings-chicago": {"comments": {"3": {"description": "yes!!!! the food is great and it is the best philly steak i had in my life!!!!!!they also have 2 other locations :111th st and halasted on corner across from white castle  in chicago and 159th and dixie hwy!!  in harvey il ...they have great quality and great customer service!!!! tonys steaks is the best philly cheese steaks!!!!     try it and you will be back!!!", "rating": "5", "date": [2011, 7, 9]}, "1": {"description": "The food was good at first Now the food is bland and over priced I would not recommend this eatery there too expensive and its dangerous it was a shooting at there establishment not too long ago", "rating": "3", "date": [2015, 10, 5]}, "2": {"description": "this place has the worst food! the highest prices! and the worst costumer service ever.... not only are they rude, my opinion is that they think people will spend their money on anything. it was on this day fathers day when i was treated to a gyro dinner plate, at the calumet park location (60827). after paying $15, when my food arrived most of my meat was dry and crispy. my fries were grease soaked. and my pita bread was rolled up like a taco. i would never recommend this place to anyone!", "rating": "1", "date": [2015, 6, 21]}, "0": {"description": "I broke my diet with a Gyro Cheeseburger and it was worth it! The Italian Beef was exceptional as well! The food was so delicious I ignored the eye lash in my burger! That's why I gave it 4 stars. Oh, and I could even get the latest movies in theater while I waited (2 for $5) talk about convenience!", "rating": "4", "date": [2015, 10, 31]}, "4": {"description": "Went here and got a great lunch a few days back. i'm certain we were the most annoying customers they had that day since we had to place more oders and keep calling back, thats what happens when you work at a big place and your coworkers have a bigger appetite. The philly cheese steak was great and no problems with the orders even though we had to keep calling extras in. Quick and good.. Yeah very good", "rating": "4", "date": [2008, 11, 15]}}, "latitude": 41.721565, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Chicken Wings", "chicken_wings"], ["Cheesesteaks", "cheesesteaks"]], "address": ["1400 W 95th St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "longitude": -87.658043, "category": "Restaurants", "rating": "3.5", "price": "$", "number_of_reviews": "5"}, "hassy-african-hair-braiding-and-weaving-chicago": {"comments": {"3": {"description": "I had my Senegalese twists done at Hassy's over a yr ago. I looked at all the pictures online and on Facebook, and checked the prices ahead of time. I called to get a quote also. Once I got there they gave me a higher price and the girl doing my hair was very slow. Eventually someone else began to help her and the pace picked up. They charged over $300! Some of the braids began to come out in less than 2 weeks and they will only replace them within a few days. The cream she put in my hair made it itch really badly. To top things off, she asked if I could give her a ride home, and she lives nowhere near me! Needless to say, I never went back.", "rating": "1", "date": [2015, 2, 6]}, "1": {"description": "Unprofessional. Will never return. I had an appointment for 10:00. When I arrived, the braider was not there.   I asked how long would it take her to arrive. They didn't know.   Very unprofessional. Will never return", "rating": "1", "date": [2015, 8, 14]}, "2": {"description": "Super rude on the phone! I just called to schedule an appointment. Since it was early in the day, I asked if they had any availability today. The woman on the phone asked me if I was serious... I told her that I was, but that I understood if there was nothing available today. Then I think she hung up on me (after asking me if I was serious a few more times). I called back, because the conversation was so ridiculous, I was sure I had the wrong number. I told her that I thought we may have had a misunderstanding, she rudely told me to just call her when I got in my car and was on my way. I told her I'd just find someone else. WTF.", "rating": "1", "date": [2014, 6, 19]}, "5": {"description": "I went to them in June of last year for senegalese twist. I loved them! And got tons of compliments so I was excited about getting them again. They were very long and medium size. Price was 220$ I thought that was reasonable because I had tons of twist. They were tight but upon removal I had very minimal breakage. I went again yesterday for the same style. The same girl did them but I must say I'm highly disappointed. My parts are huge! Yet this time I had to pay $230. I am very upset and this may be my last time going to the Africans for anything.", "rating": "2", "date": [2014, 3, 9]}, "6": {"description": "I ABSOLUTELY would NOT recommend this place to anyone. ..First of all they will tell you one thing over the phone and something totally different when you arrive...Secondly there's no need in being specific about what you want because they will say okay and do what they want. ..Thirdly anytime someone tries to force you to write a good review and I mean literally (standing over you asking and attempting to watch you pull it up on your phone attempting to tell you what to say) is an indication that something is wrong and most of these good reviews were more than likeky forced/coached. ..smh!...I went to Hassy years ago and her service was great!..Years later i tried her salon again now off 95th & Ashland and they did everything i asked them not to do...I specifically asked that they not braid my edges tight let alone my baby hair due to it being so fine...total opposite. ..in fact not only did they do what i asked them not to do they braided large braids on small pieces of hair.. another realistic request..I'm definitely one who have no problem paying whatever it cost to do what I WANT done and have a HUGE problem paying for something someone else wants to do...I swore i would never go back...My bf did however a few weeks ago and encountered worse treatment than did when we went together the first time. .What a joke on her..lol!...I paid 200.00 for something I didn't ask for with very poor excuses when communicating my displeasure and can't believe she gave them her business thereafter. ..one things for sure. ..she's never going back again now lol!...btw...i had to take my braids down after 3 weeks to prevent bald edges after loosing a braid and hadn't touched my hair since getting it done (considering it was so damn tight)..FYI..not new to african hair braiding been getting it done over 15 years and that place is the worst and a joke! Oh i almost forgot...she asked if i was on fb had me look her up..i showed her the screen and asked if it was her and before giving a definitive answer hit add friend. .lmao!..talk about intrusive...", "rating": "1", "date": [2014, 5, 30]}, "0": {"description": "This is my 4th time getting my hair braided here. I have no complaint other than they change prices as they choose.  They can be slow but the results are worth the wait.  I travel from Indiana here and that should say a lot.  Its not a bad hair braiding spot.. to me they do an excellent job.", "rating": "4", "date": [2015, 8, 9]}, "4": {"description": "PAY UP FRONT!!! These hustlers make you pay up front, so that if they screw up your hair you are stuck. absolutely hated this place. I bought a picture that they supposedly did and the girl said she got it. After 6 twists I saw that she wasn't doing what I requested and said something . She then says it is right it just didn't look like it. When she was done and I look like a 5 year old I complained and they told me the only way to get a refund is to sit for another 7 hours to get it taken out. Please don't go to this place they don't even deserve 1 star.", "rating": "1", "date": [2015, 6, 19]}}, "latitude": 41.7220837622881, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Hair Salons", "hair"]], "address": ["9449 S Ashland Avenue"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "No", "Good for Kids": "Yes"}, "longitude": -87.6626546680927, "category": "Beauty", "rating": "1.5", "price": "$$", "number_of_reviews": "7"}, "bodywork-studio-chicago": {"comments": {"0": {"description": "Once upon a time I was an Urban Oasis girl.  But I was poor.  So I moved north and could no longer afford a swanky spa for my squishing needs.   While riding the 151 up to my new Edgewater digs, I spotted Bodywork Studio.  With signs in the window offering massages for OMG cheapz.  I have been a client ever since.  In 1999 or 2000 (can't recall) it was just the owner, John.  It's grown to several therapists and a receptionist, but it is still in the same comfy spot with the same very considerate style and best of all, the same great value.  Several years later, I've moved twice, each time further away, but I keep going back.They understand my quirks.  I cannot stand the sound of running water, so they are courteous to put me where I cannot hear the water dispenser through the door.  I'm a big girl in certain areas and they always remember to provide towels to support my shoulders so I don't wind up squished.  They remember that my ankle is bum and my hip has a trigger point and I come out feeling lovely.I've been to several of their therapists - every one that I've tried has been very responsive and pleasant.  My favorite is Jeremy, if he's there, he's fantastic.This is a very basic studio.  The rooms are pleasant and simple - this is no Urban Oasis but if you're looking for a decent deal with lots of specials (half off Mondays, referral bonuses, etc) then they're worth considering.  The only drawback preventing that fifth star is the lack of showers, but really, for the price?  It's an awesome massage.", "rating": "4", "date": [2009, 6, 24]}}, "latitude": 41.9775411, "neighborhoods": ["Edgewater"], "categories": [["Massage", "massage"]], "address": ["5244 N Sheridan Rd"], "attributes": {"By Appointment Only": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.6551968, "category": "Beauty", "rating": "4.0", "price": "$", "number_of_reviews": "1"}, "lauras-hair-salon-and-boutique-chicago": {"comments": {"1": {"description": "I will NEVER return to this salon, first lets start with PERVERTED BARBER that is at this location he  had his tongue sticking out of his mouth  the whole time while cutting young men's hair, very creepy and made me feel extremely uncomfortable, not to mention all of his sexual harrasment comments, Hello? where's management?  VERY SCARY, CAN SOMEONE SAY CRIMINAL BACKGROUND CHECK? A little advice to Laura's manament GET RID OF THE PERVERTand update the look to the salon to year 2013 that place needs to completed cleaned and remodeled. Not mention his barber's license is not up for customer's to see if he is certified to cut hair.", "rating": "1", "date": [2013, 9, 23]}, "0": {"description": "Its a comfortable salon that you can go to without hearing allot of mess and be comfortable similar to a family setting my stylist is awesome and doesn't try to get over on u at  all and she is honest about the care ur hair needs", "rating": "4", "date": [2010, 12, 7]}}, "latitude": 41.71429, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Day Spas", "spas"], ["Hair Salons", "hair"]], "address": ["9858 S Vincennes Ave"], "attributes": {"By Appointment Only": "No", "Wheelchair Accessible": "Yes"}, "longitude": -87.65356, "category": "Beauty", "rating": "2.5", "price": "$$", "number_of_reviews": "2"}, "uncle-joes-jerk-chicago": {"comments": {"12": {"description": "When my sister suggested we go eat I thought we were going to your standard restaurant. She told me where we were going and I was totally disappointed.I totally underestimated this place. The jerk chicken was amazing! Rice and peas, cabbage, and plantains were excellent. (I want to give 4.5 stars bc there wasn't a meal w/ just white meat.)However, this is still my new go to spot :-)", "rating": "5", "date": [2013, 5, 2]}, "7": {"description": "Very surprised at how cute it was inside, seeing as though it's not very visible from the street. The bathroom situation is a bit weird. The chicken was very good, the service was adequate. Definitely budget friendly. I would recommend this place for a quick bite, nothing fancy.", "rating": "3", "date": [2014, 8, 8]}, "3": {"description": "Uncle Joe's Jerk consistently serves the best jerk catfish in Chicago.  I typically order a large catfish with no sides.  It's served over a medium sized bed of sautéed slivered onions and carrots.  They are also spicy.  It also comes with a slice of white Jamaica bread.The catfish comes as several thinly sliced steaks. They are all uniformly cooked and well worth the 7-10 minute wait.  Some places are not serving catfish regularly any more.  I've heard that catfish prices are volatile.  But Uncle Joe's has figured it out.", "rating": "5", "date": [2015, 3, 2]}, "1": {"description": "This place has great food but they never never never open on time is my third time coming this week and they didn't open till 1 o'clock when they're supposed to open at 11 you see people in there working but they won't even answer the phone to tell you that they're not going to Open truly unprofessional", "rating": "1", "date": [2015, 7, 2]}, "2": {"description": "Advice. Before you order, make up your mind as to what you want; if you ask questions about things, or ask to modify menu items, she's not gonna have it. It is what it is, and it's damn good jerk chicken. Place your order, paying in cash by slipping it under the bullet-proof glass like you're at a bank. Then you're gonna' wait about 15 minutes, listening to Jamaican music, likely standing, as there's tons of people waiting as well. Then, you'll hear your order being screamed--not your name, just what you ordered--which should prompt you to retrieve your food through the turn table window of the bullet-proof glass.It's that good.", "rating": "5", "date": [2014, 11, 5]}, "9": {"description": "Uncle Joe's on Vincennes has THE worst customer service on the planet.  You are doing great if they even answer the phone.  You are doing even better if they don't put you on hold and leave you hanging for 20 minutes and never come back.  The cashiers/order takers loud, don't listen and don't care.  Good luck getting the right order.  Be prepared to wait for an extra 15 minutes once you get there even if you called your order in.  They don't care about your time or the accuracy of your order.They get 3 stars for the food but its not worth the price considering how darn long it takes to get your food.Good luck at this location.The owners should fire everyone and start from scratch.  SUCKS", "rating": "2", "date": [2014, 12, 6]}, "18": {"description": "Omg why are you sooooo far away!!  Normally, I wouldn't mind driving a ways to have some amazing Jamaican jerk chicken, the best I've had in Chicago (though I can't say I'm the expert in that department).  BUT and this is one major BUT, the fact that there is nothing else for me in that neighborhood means I must be dying for some before I drag my butt alllll the way to 103rd.  My suggestion to the owner is pleeease open a location closer to downtown Chicago so we can all appreciate yummy Jamaican jerk chicken without driving to bufu!", "rating": "5", "date": [2013, 1, 9]}, "10": {"description": "Been eating jerk from here for years. I always call ahead and have never had to wait longer than the time it takes to bag the food, which is a major plus for Caribbean food in Chicago. I only gave 4 stars because I like to order the jerk wings and they are not always available and I also like jerk fish from time to time and time to time they don't have that available either. Never disappointed in the meal I choose however.", "rating": "4", "date": [2013, 6, 7]}, "13": {"description": "Great chicken but dont get the jerk salad, its a waste of money and a huge disappointment.", "rating": "4", "date": [2013, 9, 27]}, "16": {"description": "Uncle Joe's has the best Jerk Chicken in Chicago. The plantains are amazing also. Extra soft and plenty sweet. The food is very generous and flavorful. The rice and peas had a very good smokey flavor to them. I usually go to the uncle Joe's on 86th and Stony Island but since it's closed I decided to venture to this one. They did not disappoint me in the least. I recommend Uncle Joe's to anyone looking for good Jamaican food. I traveled all the way from Rogers Park to get my fix!", "rating": "5", "date": [2012, 9, 22]}, "17": {"description": "First word that comes to mind:  SUPERB!!!  This was our first visit to Uncle Joe's and it came HIGHLY recommended...rightfully so too.  We had the jerk chicken wings (dabomb.com!!!!!), plantains (soooo delicious), macaroni and cheese (it was just okay but its a matter of personal preference too.), and the Jamaican Ginger beer you serve (DG Genuine) is the best we have tasted.  Our only sad point was not having enough time to wait for a second order to take on the plane home to Texas.  However, if we had started eating the jerk chicken dinners, all the passengers on our American Flight would have been pretty upset by the deliciously mouth watering aromas and us NOT sharing at all.  Its that serious! Lol.  My boyfriend said the only other place he has had better Jamaican food is when he visited Jamaica.  So thank you, thank you for the wonderful experience.  We will be certain to visit again when we are in town and if you ever consider expanding, Dallas would give you a HUGE Texas welcome.  There is only one other good Jamaican restaurant in this area that I recommend and what I tasted over the weekend, blows them out of the water.", "rating": "5", "date": [2013, 8, 12]}, "15": {"description": "There is usually about a 30-40 minute wait, so it would be best to call in your order.  If you are one of the lucky people to actually get what you want to order, the food here is amazing. I visit this spot about 2-3 times a year, but when I do, I usually order 1/2 white chicken dinner with rice and cabbage. i would say 2 out of the 3 times I order this, I am told they are short on chicken and only can provide mixed dark and white chicken. Other than that, the food is wonderful and full of flavor. The usually provide a very tiny container of jerk sauce, but honestly the sauce is so flavorful and spicy, I rarely use the full container.", "rating": "4", "date": [2013, 9, 1]}, "0": {"description": "This was my first time at this location. There was a bit of a wait. Next time, I'll call in my order. I thought I got short changed on the plantains (only gave me two) until I just saw some pictures posted, but the curry goat dinner was AHHHMAZING!!! :)", "rating": "4", "date": [2015, 10, 1]}, "5": {"description": "This is my second time going to this location, the first time a friend and I went the food wasn't the best and tasted nothing nearly as delicious as the Uncle Joes across from the Harold Washington Cultural Center and this last time was just as disappointing. The cabbage was very salty, the chicken was ok, the oxtails were dry and the rice and peas were soupy. I don't even want to start on how DISGUSTING the Jerk Sauce was and my favorite part is to dip my chicken in there. I will never go back to this location again, they don't even deserve one star.", "rating": "1", "date": [2015, 4, 26]}, "11": {"description": "I went here based on good reviews but I must have caught them on a bad day because I was very disappointed, in fact I wish I had all 11 of my dollars back. The lady taking orders was pretty nice (thats why I gave 2 stars). However, my chicken was very very...very dry and so were my rice and peas. My jerk sauce was bitter and had an odd consistency to it.  I will probably be going somewhere else the next time a jerk craving hits.", "rating": "2", "date": [2014, 3, 15]}, "8": {"description": "For a walk-in, you will wait, but that's because the food is hot and fresh. I have never had a bad meal here. Great to stop through for a quick Beef Patty and Ginger Beer.  Try the Curry Chicken!", "rating": "5", "date": [2014, 11, 23]}, "4": {"description": "food is good.. never open on time, and customer service is flat out horrible... will not return to this particular store... the sit down restaurant on King drive is sooo much more preferred!!", "rating": "2", "date": [2015, 11, 2]}, "14": {"description": "EXCELLENT CURRY GOAT DINNER & PLAINTAINS!Great take out and worth the wait (but one could call ahead).  The only ting better is home cooked-- and only because it would be straight from pot to plate.I cannot speak to how it would taste as leftovers as I NEVER have ANY.  Guess I must go when I'm really hungry because the dinner portion is really enough to share (and I'm neither greedy nor fat- relatively speaking). KUDOS to You!", "rating": "4", "date": [2014, 3, 16]}, "6": {"description": "Their chicken is verrrry tender.  It reminded my wife and I of the real thing from the jerk chicken huts in Negril.  We ordered upon arrival (did not call ahead) and the food was very fresh, made to order, and came out quickly.", "rating": "4", "date": [2015, 2, 11]}}, "neighborhoods": ["Washington Heights", "Brainerd"], "latitude": 41.7085057497025, "longitude": -87.6554515957832, "rating": "3.5", "times": {"Mon": ["4:00 pm", "7:00 pm"], "Thu": ["11:00 am", "9:00 pm"], "Sat": ["11:00 am", "9:00 pm"], "Wed": ["11:00 am", "9:00 pm"], "Tue": ["11:00 am", "9:00 pm"], "Sun": ["4:00 pm", "7:00 pm"], "Fri": ["11:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Caribbean", "caribbean"]], "address": ["10210 S Vincennes Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "No", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "19"}, "morning-glory-chicago": {"comments": {"1": {"description": "Ok I had been hearing about morning glory for some time from a pretty reliable coworker. We are both foodies. The tips were ok, they were meaty but tasted like they had been cooked earlier that day abc reheated. The wings were very crispy. Sauce is on the sweeter side and a little thick. The fries have a crispy coating that I am not a fan of, are they more inexpensive than a regular old potato? Some places need to stay away from fancy fries, a good old Idaho potato will do. Ok back to the review....they give you the traditional two pieces of white bread stuck to your food. All in all if nothing else is around it'll do, but I've had far better bbq, I57, best, ribs unlimited, etc.", "rating": "2", "date": [2014, 1, 27]}, "2": {"description": "Good food, they're always out of stuff though.", "rating": "4", "date": [2011, 8, 19]}, "0": {"description": "I had smothered pork chops, greens, macaroni and corn muffins. It was really good and the the prices are reasonable ! Comparable to a Sunday meal at big Mama's house and the lady that took care of me was nice as well. I'll certainly be returning. I heard their ribs are quite tasty.", "rating": "3", "date": [2011, 11, 24]}}, "latitude": 41.728954, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Barbeque", "bbq"]], "address": ["9044 S Ashland Ave"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Has TV": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Good for Groups": "No", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Good for Kids": "Yes"}, "longitude": -87.663231, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "3"}, "jojo-the-balloon-lady-chicago": {"comments": {"1": {"description": "Fresh floral arrangements with a beautiful touch!She personalizes items very well, it's like she knows you or can read your mind.  Great variety to choose from and she ships (which was a huge bonus). Reasonably priced and well worth the drive to the southside.", "rating": "4", "date": [2011, 5, 23]}, "0": {"description": "Jojo the balloon lady delivered 125 amazing balloons to the baby shower I planned for a friend.  She was professional, on-time, and reasonably priced.  I like to support small businesses and she definitely won't disappoint.  I will be a return customer.", "rating": "5", "date": [2011, 7, 31]}}, "latitude": 41.7210502624512, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Party Supplies", "partysupplies"], ["Florists", "florists"]], "address": ["1116-18 W 95th St"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.6707305908203, "rating": "4.5", "price": "$$", "number_of_reviews": "2"}, "jimmys-nails-chicago": {"comments": {"0": {"description": "Been to this place plenty of times before but never had  an experience like this before. If you ever go be mindful of an older Asian woman. She is not pleasant or professional. Her attitude was very rude and she never asks if things are ok. I felt like I was on an assembly line so I will not return to this place.", "rating": "1", "date": [2011, 6, 23]}}, "latitude": 41.7216033935547, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Nail Salons", "othersalons"], ["IT Services & Computer Repair", "itservices"]], "address": ["1304 W 95th Street"], "attributes": {"By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.6556777954102, "category": "Beauty", "rating": "1.0", "price": "$$", "number_of_reviews": "1"}, "popeyes-famous-fried-chicken-chicago-6": {"comments": {"1": {"description": "Do Not Go Here At Night! My daughter went to grab some chicken from Popeyes and this is the second or third time that they have served chicken that is old, dry, and has no taste. They should be ashamed to serve food like this. They don't have to worry about my family anymore!!!", "rating": "1", "date": [2015, 7, 17]}, "2": {"description": "Absolutely the worst Popeye's I've ever been to. Worst customer service consistently. Only go here when you have a taste for Popeye's, yet no other Popeye's is an option.", "rating": "1", "date": [2014, 12, 31]}, "0": {"description": "I worked here as a teenager n we had tough standards on cleaniness n freshness........it still applies today. Good fresh chicken!", "rating": "4", "date": [2011, 8, 1]}}, "latitude": 41.7210807800293, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Fast Food", "hotdogs"]], "address": ["9516 S Vincennes Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Loud", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "No"}, "longitude": -87.65087890625, "category": "Restaurants", "rating": "2.0", "price": "$", "number_of_reviews": "3"}, "menas-hair-design-chicago-2": {"comments": {"1": {"description": "After the wife paid I found they charged $15 more than what was stated in the beginning. There were no prices listed and I was instructed by the gentleman at the front desk to ask the stylist about pricing. We agreed on a wash and trim. I was quoted $40 total by the stylist but after being charged $55 and asking about the extra charges I was told I was wrong and he would never say that. I didn't pull the price out of thin air. The charges I can handle if I was told up front. The stylist did an amazing job but after being told I was wrong and they aren't going to honor what I was quoted I will be going to a different establishment. I don't like to feel like I was ripped off", "rating": "3", "date": [2014, 8, 27]}, "2": {"description": "Went here on a Saturday morning.  I'm natural and needed my hair straightened for a special occasion.  I got there at 8 (when they opened) and was taken immediately.  I was out of there by 10:30 and was very satisfied.  My hair is super straight and the stylist feathered it nicely.   I'll be back when I need my hair straightened in a pinch!", "rating": "4", "date": [2014, 8, 20]}, "0": {"description": "I love this salon!  I've been going on and off for over a decade. In the last several months, I have been going weekly and I am ALWAYS in and OUT in less than three hours - even with my very thick shoulder length hair... no matter what services I get! They get straight to the business right away and there is no awkward pressure for small talk. My hair is healthier and growing like never before with any other salon I have frequented. I especially appreciate the convenience of not having to make an appointment - they are always ready to rock!!! :)", "rating": "5", "date": [2015, 11, 1]}}, "latitude": 41.7215881, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Hair Salons", "hair"]], "address": ["1314 W 95th Street"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "longitude": -87.6560974, "category": "Beauty", "rating": "4.0", "price": "$$", "number_of_reviews": "3"}, "jamaican-gates-restaurant-chicago": {"comments": {"3": {"description": "DELICIOUS! And very addictive, I know people who travel from afar to get it! I have to have it at least twice a week...Everything is good and the jerk catfish is actually grilled to perfection.", "rating": "5", "date": [2015, 5, 15]}, "1": {"description": "Just recently tried the chicken and we're big fans...recommended!", "rating": "5", "date": [2015, 3, 11]}, "2": {"description": "I'm VERY surprised there aren't more reviews raging about this hidden south side gem. Their food is DELICIOUS. Service friendly and good. No hour long waits for food. The time they quote is the time you can pickup. Take notes Uncle Joes! I've had most things on the menu but always come back for the oxtails. They are amazing.", "rating": "4", "date": [2014, 7, 25]}, "5": {"description": "I normally get the jerk dark dinner almost every other night!! I am extremely hooked on their food. I have been to other local jerk places and I thought they were the best until I came to this one! Now it's to the point that I'm cooking dinner less and going to this place more.", "rating": "5", "date": [2014, 4, 15]}, "6": {"description": "I ordered the jerk catfish. The only reason I didn't give this place five stars is because the catfish was a little under done for my tastes. Super thick pieces weren't cooked as thoroughly as I'm used to. Other than that the flavors were on point. The calaloo was some of the best I've had. I like to have oxtail gravy over my peas and rice. Yumm city! Ill definitely go back, but will make sure to ask for my fish to be well done. A little pricey for the location but worth it.", "rating": "4", "date": [2012, 8, 10]}, "0": {"description": "I ate this for lunch twice. First time it was great, so I had to come back again just to make sure and check the consistency. The second time.... the chicken was fresh off the grill. Smoke coming out the box and it was FYE!!!! The best jerk wings I've had from a restaurant.", "rating": "5", "date": [2016, 2, 12]}, "4": {"description": "I have a West Indian background so I know a lot about authentic Caribbean cuisine. When I moved to Chicago from New York I tried almost every West Indian restaurant on the south side of Chicago and I have to say hands down this is the best.", "rating": "5", "date": [2015, 1, 14]}}, "neighborhoods": ["Washington Heights", "Brainerd"], "latitude": 41.707832, "longitude": -87.643234, "rating": "4.5", "times": {"Mon": ["11:00 am", "9:00 pm"], "Thu": ["11:00 am", "9:00 pm"], "Sat": ["11:00 am", "9:00 pm"], "Wed": ["11:00 am", "9:00 pm"], "Tue": ["11:00 am", "9:00 pm"], "Sun": [], "Fri": ["11:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Caribbean", "caribbean"]], "address": ["10226 S Halsted St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Good for Kids": "No", "Attire": "Casual", "Ambience": "Casual", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "7"}, "sally-beauty-supply-arlington-heights-3": {"comments": {"1": {"description": "Staff was very rude to me.  I'm a 52 year old school teacher and they followed me around the store, reprimanded me when I unscrewed a cap to smell how a hair product smelled and actually stood over me until I left, which I did and I will not be back.", "rating": "1", "date": [2013, 5, 1]}, "2": {"description": "Omgoodness the Sally in Arlington Hts. is soooooo much better then the one in Schaumburg! The girls there are helpful and knowledgeable! I just wished I lived closer to this location!", "rating": "5", "date": [2012, 2, 14]}, "0": {"description": "I adore this Sally Beauty Supply! They always have exactly what I need, and just enough of what I dont need (but buy anyway because really... isn't that what you do at a cosmetics store?). I'm in here about every 3 weeks to get supplies to keep up my *cough* natural blonde color. I've never had any problem with a product from Sally's. Plus, they always have a deal on nail polish. I'm not an OPI girl, so their Orly and China Glaze products keep me happy.The employees here are the best. They're always sure to ask me if I need help, and when I say no, they back off. I love that. They also don't seem to mind when I double check that the prices came up correctly at check out (their system is OLD, so you can't see prices when they're ringing you up). There's one girl who works here who gives off a little bit of an April Ludgate vibe, but I dont mind. She leaves me alone, I leave her alone, we're good.I'd definitely recommend getting a club card. It discounts everything in the store!", "rating": "5", "date": [2012, 3, 29]}}, "categories": [["Cosmetics & Beauty Supply", "cosmetics"]], "address": ["379 E Palatine Rd"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "times": {"Mon": ["9:00 am", "9:00 pm"], "Thu": ["9:00 am", "9:00 pm"], "Sat": ["9:00 am", "8:00 pm"], "Wed": ["9:00 am", "9:00 pm"], "Tue": ["9:00 am", "9:00 pm"], "Sun": ["10:00 am", "6:00 pm"], "Fri": ["9:00 am", "9:00 pm"]}, "rating": "3.5", "price": "$$", "number_of_reviews": "3"}, "9705-lounge-chicago": {"comments": {"0": {"description": "I saw this place advertised plenty of times on the internet and magazines. My exboyfriend is a bigshot at this club so I always get in even though we ended on bad terms. It's a really nice club, the music is great. Sometimes the women can get bitchy though.", "rating": "5", "date": [2005, 11, 16]}}, "latitude": 41.71759, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Lounges", "lounges"]], "address": ["9705 S Halsted St"], "attributes": {"Good for Groups": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.6429151, "category": "Bars", "rating": "5.0", "price": "$$", "number_of_reviews": "1"}, "mcdonalds-chicago-69": {"comments": {"1": {"description": "This McDonald's is great during the daytime. The food is hot and prepared properly. Now at night, the service is horrible.  Most of the time they have run out of one or two items.   The line is long and the food is cold.", "rating": "3", "date": [2011, 1, 12]}, "0": {"description": "I was driving along the expressway from the suburbs and had to stop and use the bathroom. This McDonald's has to be the cleanest bathroom I've ever seen. I bought a coffee while I was there and the manager on duty was so polite and professional. I felt like I was at a 5 star restaurant. Kudos to this McDonald's and their management.", "rating": "5", "date": [2014, 12, 22]}}, "latitude": 41.7197754, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Burgers", "burgers"], ["Fast Food", "hotdogs"]], "address": ["9560 S Halsted St"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Good for Groups": "Yes", "Takes Reservations": "No", "Delivery": "No", "Outdoor Seating": "No", "Drive-Thru": "No", "Good For": "Lunch", "Good for Kids": "Yes"}, "longitude": -87.6434106, "category": "Restaurants", "rating": "4.0", "price": "$", "number_of_reviews": "2"}, "washington-heights-barber-shop-chicago": {"comments": {"1": {"description": "Done..Done..Done with this neighborhoop shop.. Too many clowning..unprofessional behavior and drugs when the elderly owner steps out!!! Bad scene for my teenson as well...", "rating": "1", "date": [2014, 6, 5]}, "0": {"description": "DeMario has been keeping me clean and fresh for a couple years now. This was my brother's best friend before he was taken, and I have adopted him as well based on him being super close with Jon.E.LLs", "rating": "5", "date": [2014, 9, 19]}}, "latitude": 41.7067751, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Barbers", "barbers"]], "address": ["859 W 103rd St"], "attributes": {"By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.6445587, "category": "Beauty", "rating": "3.0", "price": "$", "number_of_reviews": "2"}, "wellspring-integrative-medicine-evanston": {"comments": {"3": {"description": "I have been coming to see Lori Sherlock for about 6 months now and I have to say, I'm totally impressed!  She really listens to you and gives you a specialized treatment (with a combination of acupuncture and herbs).  She is always very calm and nice. I love that she aims to solve the root cause and not just  the symptoms. She also helps guide you on things you should be doing from a dietary perspective.  Lori addresses every single one  of my  questions/concerns and is very quick to  follow up on email. The facility is VERY nice - very clean and inviting. I always look forward to my next appointment with Lori.", "rating": "5", "date": [2013, 5, 1]}, "1": {"description": "Went to Frank Scott on a referral and am thoroughly impressed. Quality care and a whole system approach. Look no further for care, prevention and support.", "rating": "5", "date": [2014, 7, 19]}, "2": {"description": "I can only review Elizabeth Heinz, since she is the only one I see there, but she is phenomenal. I highly recommend her for fertility and pregnancy related issues. She knows her stuff and is happy to explain everything to you. She is also extremely sweet and you can't help but feel 100% comfortable with her. Her prices are also very reasonable as compared to a lot of places who are not nearly as good or experienced as she is.", "rating": "5", "date": [2010, 10, 11]}, "5": {"description": "I've been seeing Elizabeth Heinz off and on for several years now and she's fantastic. VERY knowledgeable and experienced. I completely trust her. I've seen her for pregnancy issues, immune system problems, women's health problems, muscle trouble, and more. She really listens to what you tell her and is supportive and friendly. Acupuncture isn't for everyone, but if you're looking for someone who knows what they're doing I'd highly recommend Elizabeth.", "rating": "5", "date": [2011, 10, 3]}, "6": {"description": "I worked with Elizabeth Heinz when she was covering for collegue who was on maternity leave. Elizabeth is knowledgeable, friendly, smart.  I would recommend her to anyone!  Especially for fertility issues.", "rating": "5", "date": [2010, 1, 31]}, "7": {"description": "I see Frank Scott for acupuncture and Chinese herbs.  I have always been deathly afraid of needles so this is quite a feat. Frank is amazing! He is patient and kind, and honest too ... which is a great combination. He has a way of putting everything back in perspective both physically and emotionally. I recommend him highly!", "rating": "5", "date": [2012, 4, 16]}, "0": {"description": "I go here to see acupuncturist Frank Scott, who's been my acupucturist since, get this, 1997.  My going to this practitioner has outlasted my first marriage, my first car (Saturn- loved it), my living in Evanston, and who knows how many jobs.  My present husband goes to Frank too, so you know that's a good sign.  :-)  So Frank is really good at acupucture and Chinese herbs and just being a good human being.  He's very non judgemental and can recommend lifestyle or food changes that can help a lot in addition to the acupuncture and herbs.  He can mix up custom herbal powders for you, or just tell you what supplements or teas to get on your own if you prefer.  If you are willing to take supplements or eat special foods or take special morning or evening teas tell him because he can recommend things to you.  Many patients won't bother with that stuff so he won't push it at all.  I think it's great to know what tea helps me in the morning and what tea and supplements help me in the eve.  But hey, I'm just crazy in that preventative medicine, stay healthy rather than wait until you're sick kind of way.  Overall for Wellspring Integrative Medicine the location is clean, low-key, and peaceful.  You can have tea or water while you wait.  This place is right in downtown Evanston, and the street entrance is very low profile, one glass door in between various restaurants, which leads up a flight of stairs and they are on the 2nd floor.  I drive now but you can also take the train.That general number is probably fine but I use a direct number to Frank's work cell to make appointments with him 847-791-9214, and that's the number on his business card.  You leave a VM and get a call back.  He sees clients on Mon, Tues, and Sat.", "rating": "5", "date": [2009, 3, 11]}, "4": {"description": "I have had such a positive experience at Wellspring. I see Elizabeth Heinz for acupuncture and herbs. I have gone to several acupuncturists before meeting Elizabeth and I knew right away she was special. Not only is she knowledgable, but she explains her treatment in a way that I understand and I can feel confident and informed in the treatment I'm receiving. I saw her for a variety of issues but was recommended by a few friends who saw her for fertility issues and had successful outcomes. I find she has a wide variety of expertise. I would highly recommend anyone to go see Elizabeth, she is life changing.", "rating": "5", "date": [2013, 1, 5]}}, "categories": [["Massage", "massage"], ["Acupuncture", "acupuncture"]], "address": ["1565 Sherman Ave"], "attributes": {"Parking": "Garage, Street", "By Appointment Only": "Yes", "Wheelchair Accessible": "No", "Accepts Credit Cards": "Yes", "Accepts Insurance": "No"}, "category": "Beauty", "rating": "5.0", "price": "$$", "number_of_reviews": "8"}, "k-w-spice-is-nice-chicago": {"comments": {"1": {"description": "I hate the sauce here. It's hit  or miss. Sometimes the meat is pretty good and sometimes it's burnt and drowned in sauce to cover it up. The sauce is gooey and wack.", "rating": "1", "date": [2008, 2, 2]}, "2": {"description": "This place is always packed with people and I can see why. The barbecue here is delicious! It's very tender and the meat falls right off the bone. They aren't the fastest but the barbecue is well worth the wait!", "rating": "5", "date": [2007, 2, 20]}, "0": {"description": "Decent barbeque. The rib tips are very moist and pretty flavorful. Their fries are very good, not the typical soggy, bland free-with-everything in Chicago fries, but instead are like thinly wedged, almost steak cut fries and are crispy on the outside - actually good enough to eat.. They have pork and turkey links, which isn't that usual and you get a lot of meat for the money (about $11 for a large combo). Hot links will kick your ass a bit, which I'm not all about, but they also have mild. The sauce is so-so - vinegary and thin, but I like my barbeque without sauce usually anyway, because I'm pretty picky about that, so I had mine without - wise decision.. The women working the counter are busy, but nice and efficient. Cash only.", "rating": "3", "date": [2008, 6, 20]}}, "latitude": 41.70215, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Barbeque", "bbq"]], "address": ["10536 S Halsted St"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Accepts Credit Cards": "No"}, "longitude": -87.64307, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "3"}, "new-vision-chicago": {"comments": {"0": {"description": "I'm stunned that I'm the first review of this place as I've been going here for almost a year now.  Been going to barbers in my area and realized I needed to hit the city for a true haircut that I can be happy with.  After doing some research, I had 6 places that I was going to try and pick the best one.  After hitting New Vision, I never made it to the other 5.  Love this place, all the barbers are great and cool as well.  Jimmie is my barber and compared to what I was getting, he's a true breath of fresh air.  Easy to talk to and knows how to cut.  They don't play a bunch of thug rap music like the last place I had went to, very respectful of their patrons.  Sure we talk a lot of junk, but it's all in fun.  They also have a lady that does nails if you need them.  Highly recommend this place.", "rating": "5", "date": [2015, 5, 22]}}, "attributes": null, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Barbers", "barbers"]], "address": ["9360 S Halsted St"], "latitude": 41.723194, "longitude": -87.643577, "category": "Beauty", "rating": "5.0", "price": "$$", "number_of_reviews": "1"}, "poppin-dough-chicago": {"comments": {"1": {"description": "Nothing like a good donout after a hard day of work or to start your morning.  These are tasty, airy and I like the variety.  The caramel are my fav, but they go fast and I never seem to get any :(.  I think lemon and orange are just as tasty.  The staff are great and very friendly.  I typically get 2 dozen once a month for a meeting at work.  They recommend calling ahead to order, but I typically don't (forgetful) and they are always willing to accommodate last minute requests.  They serve juice, milk and coffee, but no water (hopefully, that will be available soon).", "rating": "4", "date": [2016, 2, 13]}, "2": {"description": "Would give them 5 stars but they never seem to have vanilla donuts and to bad because those are my favorite . They are good though and very fresh.", "rating": "4", "date": [2016, 1, 24]}, "0": {"description": "It's a very friendly-family atmosphere. Very upbeat. The donuts are first class. There are so many to choose from. So many different kinds that everyday you can get something different. I recommend the pink and glazed ones. So much better than Dunkin. Can't get them anywhere else.", "rating": "5", "date": [2016, 2, 4]}}, "neighborhoods": ["Washington Heights", "Brainerd"], "latitude": 41.72099, "longitude": -87.65437, "rating": "4.5", "times": {"Mon": ["6:00 am", "6:00 pm"], "Thu": ["6:00 am", "6:00 pm"], "Sat": ["8:00 am", "5:00 pm"], "Wed": ["6:00 am", "6:00 pm"], "Tue": ["6:00 am", "6:00 pm"], "Sun": [], "Fri": ["6:00 am", "6:00 pm"]}, "price": "$", "categories": [["Donuts", "donuts"], ["Cafes", "cafes"]], "address": ["1235 W 95th St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "3"}, "harolds-chicken-shack-no-26-chicago": {"comments": {"3": {"description": "This Harold's is much better than the others in the neighborhood.", "rating": "2", "date": [2015, 4, 24]}, "1": {"description": "One of the worst in the city. All the chicken is precooked and re dipped in grease after your order is placed...  NEVER EATING THERE AGAIN", "rating": "1", "date": [2015, 9, 13]}, "2": {"description": "This Harold's NEVER answer their phone. They charge all this money, for some dry ass chicken. WORST ONE I've been to in Chicago. The people who works here, also has terrible attitudes.", "rating": "1", "date": [2015, 7, 28]}, "5": {"description": "Had not been here since I was a teenager and it was the best back then and still is good.  Great customer service, great food.  Love this place!", "rating": "5", "date": [2014, 9, 7]}, "6": {"description": "Harolds is notorious for the wait times, so just know that going in. By the time you walk out, not only will you have some good fried chicken (extra mild sauce), but you might be able to get some DVDs and incense. This Harolds is def in the top 3 in the city.", "rating": "4", "date": [2013, 3, 15]}, "7": {"description": "Best Harold's. This place has been Here since the early 80's", "rating": "5", "date": [2011, 4, 2]}, "8": {"description": "the food here is just average and the service sux waited over 20min for a 6pc wing and a 1/4 dark and only 1 other person there so was not busy, I love wings and can appreciate all types. 1st off its hard to screw up anything you put in the deep fryer, the chicken was juicy but had no flavor and it tasted like they havent changed the fryer oil in a long while, the fries were soggy, to top it all off the sauces were just basic and it was expensive . I dont mind paying a little more for good food but this place has crappy food.crappy service and crappy prices my suggestion is go chek out Reeses fast food on 87th they have killer wings, good service and prices.", "rating": "2", "date": [2012, 12, 2]}, "0": {"description": "Best Harold's in the city..better than Hyde Park, 87th St, Western..", "rating": "5", "date": [2012, 11, 8]}, "4": {"description": "We live closer to another Harold's location, but at this location the chicken is ALWAYS hot and fresh. The fries are ALWAYS hot and fresh. However, it is a bit hard to place a phone order and the service isn't the greatest. BUT ... they're open 'til 5 am! Hallelujah!!", "rating": "3", "date": [2015, 8, 10]}}, "latitude": 41.7268715, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Chicken Wings", "chicken_wings"]], "address": ["9151 S Ashland Ave"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Takes Reservations": "No", "Good for Groups": "No", "Alcohol": "No", "Delivery": "No", "Good for Kids": "No", "Has TV": "No"}, "longitude": -87.6626282, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "9"}, "panna-handcrafted-soaps-chicago": {"comments": {"0": {"description": "This place is good. The staff was useful and I got what I wanted.The people there are cool and very helpful!", "rating": "4", "date": [2012, 2, 6]}}, "neighborhoods": ["Washington Heights", "Brainerd"], "latitude": 41.7162666320801, "longitude": -87.6341857910156, "rating": "4.0", "times": {"Mon": ["10:00 am", "6:00 pm"], "Thu": ["10:00 am", "6:00 pm"], "Sat": ["10:00 am", "6:00 pm"], "Wed": ["10:00 am", "6:00 pm"], "Tue": ["10:00 am", "6:00 pm"], "Sun": [], "Fri": ["10:00 am", "6:00 pm"]}, "price": "$$", "categories": [["Cosmetics & Beauty Supply", "cosmetics"]], "address": ["9756 S Eggleston"], "attributes": {"Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "1"}, "colours-nail-salon-chicago": {"comments": {"3": {"description": "I went to this place yesterday before my evening class. I was in desperate need of a quick manicure because I had an appt. this morning and needed my hands to look nice. I walked in not expecting much too begin with so... The lady who did my mani did okay. Nothing to complain about, my hands look nice, no cuts, polish is smooth, etc.. She offered to do my eyebrows. I only had about 45 minutes for the manicure but knew I needed that done too otherwise I would have passed. Afterwards they looked pretty good.  I was a little redder than usual and kind of felt a little burning on the top of my brows that was unusual as I only get the bottom waxed. I like my brows to look a little thick but shapely and neat. Well when I woke up I was still red and noticed little chaff marks between my brows on my skin. Looks like she got a little happy with the razor and left little scratches on my face. They are hardly noticeable, not at all with a little makeup powder, but definitely not cool. While I won't be getting my brows done here anymore I guess it's cool for a quick mani if I am strapped for time. I wouldn't go out of my way to go here though...", "rating": "2", "date": [2011, 9, 16]}, "1": {"description": "I hate this place. I tried to like it because it is around the corner, but after going back several times just to get my nails torn up, I gave up. Oh, and the nasty customer service doesn't help but after going to do many of these types of nail \"shops\" I've learned to expect it. Don't go here if you care about the health of your nails.", "rating": "1", "date": [2014, 12, 23]}, "2": {"description": "I have to say it took some time but I finally found the right combination of techs when I go into this shop. The new owner and his wife seem to be very receptive to what I want as a customer and take the time to actually listen. Thank God they are nothing like the old owner!When I first started going I took a chance with whatever tech was available. Now there is no way I would let anyone other the 3 of the 7 nail techs do my gel nails, only one is allowed to do my pedicure (I hate short toe nails and lose my patience if you cut me), and only two people are allowed to do my eyebrows (I am no one's experiment).This shop has come a long way because true leadership is starting to shine through. If every tech listened to their customer and made changes in their delivery of services like the owner instead of giving an excuse, the entire shop would be stellar.You're headed in the right direction Daniel and Tina! Keep it up!", "rating": "4", "date": [2012, 1, 11]}, "0": {"description": "My nails were rushed. I requested coffin nails . The tips which should be even even  were filed slanted . The nail bed of my full set  aren't smooth either . You can see ridges thru the paint . I'm not a difficult person and this isn't my normal shop , so I left with out complaining. The salon was really busy (( Sunday at 5pm . Close at 6) but still . Crappy job . 3 stars  because the tech was nice.", "rating": "3", "date": [2016, 1, 8]}, "4": {"description": "If there was a negative stars option, I'd give it -3. The only thing that I've ever liked about this place is the fact it's close to home and there's never a long wait. Even on a busy Saturday summer afternoon. I went Wednesday to get a full set. I asked if they use UV gel. He said yes and opened up the jar. It was a powder. I said \"that's not gel.\" He says: \"Gel powder is better.\" Now, I'm a cosmetologist and I do nails. Today I had no time to do my own. There is NO SUCH THING AS GEL POWDER. GEL is like GEL. POWDER is POWDER. It's just a finely milled acrylic powder. So I just ask for acrylic. The guy was way too rough. I tell him my cuticles have been pushed back and sort of out of shape. (shampooing). He proceeds after putting the acrylic on to FILING THEM OFF!!!! 7/10 fingers were bleeding because now he's moving too close. Then he continued to file roughly with the buffer after I said ouch you're hurting me 50,000 times. And everybody else in the salon heard me and did nothing about it. I didn't know how terrible everything looked and felt until yesterday when I had to work and washed a client. It felt like someone was slicing the skin off my fingers they are so tender. I'm praying I don't get an infection and I'm going to continue to wash them with peroxide. The part that really gets me is that it's not just this nail shop. There are a lot of \"non-american\" ones that treat people this way. They'll be good to the ones that yell and scream and loud talk but be shitty to those that pay and tip and are quite and respectful. I'm not racist but honestly, I'd rather pay high dollar again and go to a white woman on dearborn who's mannerable or do them myself than EVER go to another shop like that. You get what you pay for and I paid a high price for this. Never again.", "rating": "1", "date": [2011, 8, 19]}}, "latitude": 41.7209250479937, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Nail Salons", "othersalons"]], "address": ["9514 S Halsted St"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.6433259993792, "category": "Beauty", "rating": "2.0", "price": "$", "number_of_reviews": "5"}, "nails-today-chicago": {"comments": {"1": {"description": "The owner BJ & his wife Cindy are so u professional! Some of the staff are not friendly and have very nasty attitudes! They are argumentative with the clients & I guess because the location is somewhat in the \"hood\" they feel like they can LACK professionalism!! Only a few of the employees smile at you. I have put up with the lack of professionalism because the quality of what I was getting done has been good for the PRICE.....that's it!! But enough is enough! I will never return there, I will not recommend anyone to go there and I will tell all of the people I know that go there not to go anymore! Their attitudes would be different if they were in evergreen park, oak lawn or other neighboring suburbs! After they are done being disrespectful they go off & start talking in their native language to one another when everyone speaks English! So You know they are talking about you!", "rating": "1", "date": [2016, 2, 4]}, "0": {"description": "A small neighborhood nail shop that's well worth it.  I've been coming to this nail shop since 2009.  Michelle, one of the nail techs, and B.J., the owner, are two of the best nail techs I've experienced (I haven't been able to find nor match the quality of service in even some of the most expensive places within the city and out of state).  It's a small and simple nail shop (nothing fancy and no fancy services), however, I routinely come ever two weeks when I'm not traveling.  Also, when Michelle isn't working, ask for her sister.  While all of the techs do an excellent job (all appear to have regulars who come in and request for them by name) she and her sister are the two I always get services from.", "rating": "5", "date": [2014, 6, 30]}}, "attributes": null, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Nail Salons", "othersalons"]], "address": ["1546 W 95th St"], "latitude": 41.7214249, "longitude": -87.6612099, "category": "Beauty", "rating": "3.0", "price": "$", "number_of_reviews": "2"}, "roses-are-red-flower-boutique-chicago": {"comments": {"1": {"description": "Ordered a pointsetta plant- paid approx $60 and received the saddest plant- 5 inch pot with 4 flowers on it. When contacting them on social media, they didn't respond and deleted my post. Be very aware when using this florist as you probably won't get what you ordered.", "rating": "1", "date": [2015, 12, 21]}, "2": {"description": "Amazing, wonderful, and knowledgeable! Always willing to help pick out a perfect gift! Love them very much and will definitely be going back!", "rating": "5", "date": [2016, 2, 3]}, "0": {"description": "I want to thank you for helping me In my Valentine's Day purchase.Destiny helped me with all my questions and to pick out the perfect arrangement, you made my fiancé's day special and if I need roses in the near future you will be my first call. Wynda I want to thank you for keeping me updated until they were delivered and to Antron for delivering them to her.. Thank you all for your great Service", "rating": "5", "date": [2016, 2, 14]}}, "latitude": 41.7249523848295, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Florists", "florists"]], "address": ["9303 S Halsted St"], "attributes": {"Wheelchair Accessible": "Yes", "Bike Parking": "Yes", "Delivery": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.6431845128536, "times": {"Mon": ["9:00 am", "7:00 pm"], "Thu": ["9:00 am", "7:00 pm"], "Sat": ["9:00 am", "5:00 pm"], "Wed": ["9:00 am", "7:00 pm"], "Tue": ["9:00 am", "7:00 pm"], "Sun": [], "Fri": ["9:00 am", "7:00 pm"]}, "rating": "3.5", "price": "$", "number_of_reviews": "3"}, "melloswing-chicago": {"comments": {"0": {"description": "Had been going there at the suggestion of my good friends who live around the area. Don, had been exceptional barber for three years after looking for permantly barber home.He does great job, no qualm about it.The place is clean and had about 8 barbers. There pool table, tv, even music. If you ever entering the place, ask for Don.", "rating": "5", "date": [2015, 6, 27]}}, "latitude": 41.7083012312651, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Barbers", "barbers"]], "address": ["10234 S Vincennes Ave"], "attributes": {"By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "No"}, "longitude": -87.6555307209492, "category": "Beauty", "rating": "5.0", "price": "$$", "number_of_reviews": "1"}}