{"diva-tude-chicago": {"comments": {"1": {"description": "Mr.  Twist is absolutely awesome. He is passionate about his craft and a consummate professional.", "rating": "5", "date": [2014, 8, 16]}, "0": {"description": "The review is well past due. I just finished with an awesome mani and pedi \"extended stay\". This is my second visit and I repeat the \"extended stay\" is definitely an experience! Don't slip on Mr. Twist, you won't be disappointed! Check him out!", "rating": "5", "date": [2015, 8, 24]}}, "neighborhoods": ["Calumet Heights"], "latitude": 41.7370153633694, "longitude": -87.5782656669617, "rating": "5.0", "times": {"Mon": ["9:00 am", "8:00 pm"], "Thu": ["9:00 am", "8:00 pm"], "Sat": ["9:00 am", "6:00 pm"], "Wed": ["9:00 am", "8:00 pm"], "Tue": ["9:00 am", "8:00 pm"], "Sun": [], "Fri": ["9:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Day Spas", "spas"], ["Nail Salons", "othersalons"]], "address": ["1859 E 87th St"], "attributes": {"By Appointment Only": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "2"}, "infinite-touch-of-chicago-chicago": {"comments": {"12": {"description": "Very nice massage therapists. Not spa like but great massages. Far away from where I live, but if I lived in the neighborhood I would frequent it more often. My boyfriend loved one of the songs on the play list when we were there. The ladies were nice enough to e-mail him the song and info afterwards! Very polite, very easy going.", "rating": "4", "date": [2012, 2, 5]}, "7": {"description": "I have received many massages in many places, but none compare to what I've received at Infinite Touch with Kimm.  Hands down, this is the BEST place for \"real\" massages. Kimm is very professional and her massages are to die for!  I try not to let a month go by without getting a massage.  I can't rave enough!!!  Excellent!!", "rating": "5", "date": [2013, 11, 21]}, "20": {"description": "Infinite Touch of Chicago is the greatest massage therapy salon in Chicago bar-none! The owner and operator, Kimm Danzie, has the hands of an angel and the atmosphere of a soothing vacation. My husband purchased a home visit massage for our anniversary as a surprise for me! I was not only amazed and how quickly Infinite Touch of Chicago set up and broke down but there was music and the BEST MASSAGE I'VE EVER RECEIVED IN MY LIFE! From that point forward I've recommended and used Infinite Touch of Chicago for many events and gifts to friends, family and co-workers, including a youth group! I always try to do an half hour but always end up going for a full hour! Plus they do house calls! I'll repeat HOUSE CALLS!! Keep it up Infinite Touch of Chicago!", "rating": "5", "date": [2011, 7, 16]}, "19": {"description": "Infinite Touch of Chicago is the greatest massage therapy salon in Chicago bar-none! The owner and operator, Kimm Danzie, has the hands of an angel and the atmosphere of a soothing vacation. My husband purchased a home visit massage for our anniversary as a surprise for me! I was not only amazed and how quickly Infinite Touch of Chicago set up and broke down but there was music and the BEST MASSAGE I'VE EVER RECEIVED IN MY LIFE! From that point forward I've recommended and used Infinite Touch of Chicago for many events and gifts to friends, family and co-workers, including a youth group! I always try to do an half hour but always end up going for a full hour! Plus they do house calls! I'll repeat HOUSE CALLS!! Keep it up Infinite Touch of Chicago!", "rating": "5", "date": [2011, 7, 16]}, "1": {"description": "Been awhile since I've been here. The first time with my mother. The second with my husband. Both for massages. Service was wonderful.", "rating": "4", "date": [2015, 5, 19]}, "2": {"description": "Look no further south siders (and Everyone else) Kimm is the greatest! I no longer travel far and wide for a mediocre massage when I can stay is my neighborhood for the best.", "rating": "4", "date": [2015, 3, 2]}, "9": {"description": "I suffer from chronic back pain due to my job. So it was recommended that I start going for massages at least once a month. I learned of Kimm and Infinite Touch from Groupon. The location was not too far from where I live in Hyde Park and I knew that parking would not be too difficult unlike if the location was downtown or on the North side. I really liked the fact that I was able to schedule my appointment online. It was extremely easy and convenient and I immediately received confirmation via email. Two days later, I received a confirmation call from Kimm. If you are looking for a very high end, frou-frou spa experience, then Infinite Touch is not for you. I am from the south side of Chicago, so I was not phased by the location on 79th St. If you're nervous about venturing into the south side (let's be honest, some people are) don't worry, Infinite Touch is located just a few blocks off the the expressway- it is very easy to get to (although you can easily miss it as there is not a sign that says \"Infinite Touch\" rather just the business logo) and there is ample street parking. I was immediately greeted by the receptionist upon entering. He took my coat and offered me something to drink. Again, it's a no-frills place however it was clean and modestly decorated. The new age music that was playing was a nice, relaxing touch.  By no means am I a massage therapy connoisseur, however I can't imagine a massage being any better than Kimm's. Kimm seemed to instinctively know where my trouble spots were without me even going into much detail other than a few questions answered on the first time client questionnaire. I have experienced less than stellar service from companies once they found out I was patronizing their establishment because of a Groupon deal. However, that was not the case at all with Kimm. I did not feel rushed or short changed in the least bit. Matter of fact, once my massage was over, Kimm went the extra mile by giving me a cupcake and mini bottle of champagne for my birthday which was that day! I highly recommend Kimm based on the actual massage and customer service. I have already scheduled my next massage and I look forward to being a long time client of Infinite Touch!", "rating": "5", "date": [2012, 1, 1]}, "6": {"description": "Where do I begin. I have received massages before, but the massage I got here from Kimm was by far the best massage ever.  Let me repeat that THE BEST MASSAGE EVER.  Kimm is amazing.  I read all the reviews for all the spa's in Chicago trying to find the best one so I could surprise my girlfriend. I am so glad I chose this one.  If I could give it ten stars I would.From the moment you walk in you are treated like a VIP.  The staff is very professional and friendly.  I lucked out and found a Groupon deal for a one hour couples massage with refreshments.  We were not treated any differently because we had the Groupon discount.The room was set up very romantically.  Two massage tables side by side, soft lights, warm atmosphere, relaxing music and a sweet smell in the air (most likely one of the massage oils).  Once we were settled in they came in to start the massage. I again had Kimm and my girlfriend had Donald.  I received a deep tissue massage.  Kimm worked areas of my shoulders, back and legs in a way that it felt like there were five sets of hands on me.  It was amazing.  After the massage was over there was a table set up with juice, bottles of water and some very fresh moist pastries. Everything tasted great.  We were never rushed or hurried.If you want the best massage ever than this is the place to come.  We plan on always getting a massage here when come to Chicago.", "rating": "5", "date": [2012, 10, 28]}, "18": {"description": "I purchased a Groupon for a couples massage and I must say I have never been treated better! They didn't treat me any different because I purchased and offer as many places do. The location is not in a great neighborhood, but it's located right off of the expressway. You have to be sure to look for the logo on the window because they do not have a sign. When you walk in you are greeted by a very friendly receptionist who makes sure that you are comfortable and taken care of. This is not your usual upscale spa but, remember to never judge a book by it's cover because the massage therapists are great at what they do. My husband enjoyed his massage so much, I heard him snoring a few times. Mine was a little more rough, but still amazing. Once the massage was over we were left alone with a small bottle of pink champagne and a plate of desserts and fruit and were allowed to stay as long as we wanted. The only downfall to this place is that you can hear everything going on outside, the car alarms going off, the ambulances, the people yelling at each other on the street. It is a little difficult to relax, but they try their best. I will be returning soon!", "rating": "5", "date": [2012, 1, 8]}, "10": {"description": "We recently returned for another groupon goodie and, unsurprisingly, enjoyed another wonderful, relaxing afternoon. I just wanted to update this review to add both Kimm and Will to the list of fantastic therapists available who I would not hesitate to return to. I think my partner actually dozed off for a bit during his massage with Kimm because he was so relaxed and comfortable, and Will worked out all the kinks in my body. It's great to know that I can trust so many people here to all do fantastic work. I have already scheduled my birthday massage with Kimm for next month and plan to return soon after for a hot stone massage. Also, I wanted to mention that my partner and I had booked separate 90min massages per the groupon but Kimm must have recognized our names from our previous appnt, because she very thoughtfully put us together in the same large room so that it was like a couple's massage. I am sure this is not always possible but it was another sweet gesture that did not pass us by. Infinite Touch has definitely become my go-to massage place!", "rating": "4", "date": [2013, 3, 27]}, "13": {"description": "Best massage I ever had-Infinite Touch has found a new regular! Amazing quality massage for the price! Easy to get to, right off the highway. Plenty of free parking right around the corner, in front of cute houses in Chathem. You walk in off the busy street into serene music. The place is simple and clean. If you want a super posh spa that has the price of decorations build into the cost of your massage- go somewhere else. My boyfriend and I did the couples massage and plan to sign up for another. We both liked the idea of supporting a new, local business and with so many deals it is hard to resist.", "rating": "5", "date": [2011, 11, 18]}, "16": {"description": "**Disclaimer**- I am NOT an employee or relative, but simply one that enjoys getting good service for money I work hard for and spend!!I have a child that plays sports and constantly complains of aches in her body.  Although I always give her a nice mommy rub down it never seemed to be enough.  I purchased the Groupon deal for her to get a 1 hour massage yesterday.  She treated my daughter no different from any other client. I stayed in the room with my daughter for the first few minutes, but since she is older and Kimm is professional, I left the room 5 minutes into her session so she could enjoy her massage experience. While in the waiting area, I fell asleep to the nice relaxing music.  When my daughter came out, she was wobbled to me as she stated how good she felt. She was provided a bottle of water and after paying the tip (which I provided), told Kimm she would see her soon.  We all laughed! After getting in the car, my child told me she had higher expectations from me.  All day and night she talked about her massage experience and how Kimm was so nice.  My daughter said she wanted to save her money so she could go back. She thanked me all night for her treat. Before going to bed she said, \"Mom, the girl that massaged me was really good\".  I told her the \"girl that massaged her\" was the owner! She said she really felt special knowing that and kept trying to show me techniques that were used.  I have created a monster!I am sending my brother for the birthday special they have and can't wait for his feedback.  Although I purchased my deals through Groupon, I would definitely pay full price! I encouraged my sister to buy a 90 minute for her husband and she is also getting one for her son.  I just want everyone to have an Infinite Touch experience! Before leaving, Kimm told me that she offers a class for individuals and groups on how to give your mate a massage.  I will be signing up very soon because the way to a man's heart is not his stomach, it's relieving the aches and pains in his body!!", "rating": "5", "date": [2013, 4, 9]}, "17": {"description": "First of all, bless Kimm for opening a place for massage on the south side. I'm sick of having to travel up north or to the south suburbs, so this place is great for that reason alone. The deep tissue massages that I got from Kimm and Renee have to be some of the best that I've ever gotten. I can only think of two others that I've gotten that even came close and I've been getting massages on a regular basis from all over for years now. I also love the beautiful music that always plays here and the warm inviting scent that always seems to be on the air. All the staff is very friendly and professional. I'm glad Groupon helped me find them.", "rating": "5", "date": [2012, 7, 9]}, "15": {"description": "Kim is pleasant, professional, down to earth, and GREAT!!! Atmosphere is nice, calming, and very relaxing. I will definitely be returning and recommending friends!!", "rating": "5", "date": [2013, 3, 15]}, "0": {"description": "Love it. I've been twice and sent my brother and sister in law. They were both pleased and have since returned or made plans to. I haven't tried anyone there but Kimm, but if they're half as good as her, they'll do fine. I have a muscular skeletal disorder that causes pain and stiffness in my muscles. I have had other massages and left just as achy as when I came in. Not here. She seems to know where the trouble spots are and she works them out. The digs are nothing special, but you aren't coming to sit and drink wine. Give her a try and I think you'll be pleased.", "rating": "5", "date": [2015, 7, 2]}, "5": {"description": "I scheduled an appointment for a massage for my birthday a month in advance and literally while im on my way to the place, I get a call saying they need to reschedule me and unable to service me today, 30 minutes before my appointment!!! Needless to say I will not be rescheduling with them, I will take my business elsewhere!!!", "rating": "1", "date": [2014, 12, 13]}, "11": {"description": "God Bless Kimm & her healing hands!  I'm a massage therapist myself and was hurtin bad from an event the day before. Not only did Kimm fit in the time for me but had all the right skills to work out my sore muscles & knots into puddy. I'm also very selective of who massages me but would gladly let Kimm work on me anytime! Thank you!!! :)", "rating": "5", "date": [2011, 9, 30]}, "8": {"description": "I met Kimm last winter, when I took advantage of a Groupon for a chocolate massage and sugar rub at one of the posh, high-end downtown spas.  It was all good, but Kimm was all magic.  I wrote a yelp back then, that \"if you have money and don't pamper yourself weekly with this woman, you're crazy.\"  Since then, she got wise and opened her own spa, Infinite Touch of Chicago.  I have called on Kimm's services (she actually came to my house two or three times) to literally HEAL me and take me on creative voyages with her restorative powers, but yesterday I visited her new spa for the first time.  Ever the critic (of things that don't matter), I have to admit that the location didn't rival Oak Street (but then again, free parking was a plus).  She has just opened, so I have no idea what her ultimate plans might be, but I commented that \"less is more,\" and here's why:Her massage rooms are light and oh-so-airy, which gives her space to move and the lucky recipient of her services mega chi to breathe.  The rooms have at least ten foot high ceilings, and the separation walls don't go all the way to the ceiling, so the gigantic ceiling fan provides that hint of a tropical breeze to all.  And because of the minimalist decor, the stereo--playing New Age \"let your troubles go\" music kind of echoes throughout the space.When I schedule massage, I want to let it all go for the time I'm there and leave feeling better than I did when I entered.  Sight and taste disappear, and I become a skin sensitive nerve ending, while I allow the music to fill my ears and Kimm's aromatherapy scented oils to soften my withered skin.  It's all I need.If you are one of those people who seeks an instant replay of the last massage, be sure to tell Kimm what you want.  Otherwise, you might have to decide which experience takes you on your favorite journey.  Never one to fall into a pattern, this masseuse lets your body tell her where to take you. And, unlike those Chicago Mag-Mile prices, Infinite Touch of Chicago is reasonably priced.  I used to think \"the experience is what you make it.\"  After growing used to Kimm's pampering, I know it's what SHE makes it.  And it will be amazing.  I recommend having a journal handy.  For some reason, on occasion, these massages unlock my creative juices and I get some of my most inspirational thoughts.Five stars are not enough. Tip large.Can't tell you about Credit or insurance, but she has an awesome online scheduler, and it works.  You'll get a confirmation email.", "rating": "5", "date": [2011, 8, 31]}, "3": {"description": "I have become a regular here. Kimm is the owner and a sweetheart.  The prices are affordable but she always have specials just check the website.  She has a special touch with her fingers unlike anyother message therapist I've been to. The atmosphere is soothing and calming music always playing. Don't let the area fool you, trust once you go there you will not regret it and will be back!", "rating": "5", "date": [2014, 3, 26]}, "14": {"description": "Kim is the BEST massage therapist in Chicago! Treat yourself like a king or queen today!", "rating": "5", "date": [2012, 6, 1]}, "4": {"description": "I heard about the September birthday special that was being offered by Infinite Touch and decided to purchase a massage for my mother since it's her birthday month. To say that she was pleased is an understatement. My mother called me twice....TWICE! Typically, if she calls twice in one day, something is wrong. Not this time. She wanted to rave about the services and treatment that she received from Kimm.  I am so dang happy to know that my mother was well taken care of. It's in a very convenient location off of the EL, and in a small, charming, space. I'm visiting Chicago in a few weeks and plan to treat myself to the services as well! SUH-WHEET!", "rating": "5", "date": [2014, 10, 2]}}, "latitude": 41.750828, "neighborhoods": ["Chatham"], "categories": [["Massage", "massage"]], "address": ["231 E 79th St"], "attributes": {"Parking": "Street", "By Appointment Only": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Accepts Insurance": "No"}, "longitude": -87.618645, "category": "Beauty", "rating": "4.5", "price": "$$", "number_of_reviews": "21"}, "east-point-associates-ltd-chicago": {"comments": {"12": {"description": "I sought acupuncture as a way to relieve a chronic sinus infection that antibiotics were not taking care of.  Kathy Hanold is delightful and very good at explaining energy blocks that cause different maladies and discomforts.  The treatments cleared my awful sinuses, and I have since had the same success with back issues.   Kathy has many years background in western medicine which compliments her knowledge of eastern treatments.  Visits to Kathy are my gift to myself.  I always leave feeling healthier and more balanced.", "rating": "5", "date": [2012, 1, 10]}, "3": {"description": "I've been going to Devra for massage for a handful of years now, and I can't recommend her highly enough. The location is extremely convenient, her rates are profoundly reasonable, and her touch teaches me something about my body every time I go.", "rating": "5", "date": [2014, 6, 19]}, "1": {"description": "Devra is amazing. Hands down. No questions asked. She applied the exact amount of pressure desired. She didn't talk too much or too little but was extremely kind and thoughtful. She took time to point out things she noticed about my body. She gave me tips for moving forward. I could go on an on but there is really no need. If you need a massage, and a really good one at that, she is the best and the prices are so reasonable. The location is is humble but you don't need much more than the good table, clean sheets, and of course those wonderfully healing hands.", "rating": "5", "date": [2016, 2, 22]}, "2": {"description": "On May 23, 2014 I had a Uterine Artery Embolization (Uterine fibroid embolization (UFE) is a procedure done by a radiologist. It blocks blood flow to fibroids in the uterus. (It is also called uterine artery embolization.) I was informed of some side effects, however, I experienced side effects I was not informed of & I'm thinking it's because the medical staff was not aware of them.In any event, the week following the procedure, I had pain that concentrated in my legs & feet.  To the degree, I thought blood clots had developed.  After going to the emergency room and discovering I did not have blood clots - just non life threatening pain, my GodMother suggested I try her accupuncturist - Kathy.By time I got to Kathy, my feet felt like I had been walking barefeet on rocks for days.  After two sessions (Friday (6/6) and then followed up that Monday (6/9)), my pain level went from a 10 to a 1.5 & I have been good ever since.Thanks, Kathy for pinning me back to health!!!", "rating": "5", "date": [2014, 7, 1]}, "9": {"description": "Devra is an amazing massage therapist!  My doctor recommended seeing a massage therapist for my carpal tunnel and overall crappy neck/back pain.  I had never had a massage before and the thought of it made me a bit uncomfortable, but the pain was too much so I decided to give it a try.  Devra made me so comfortable --she is very professional and knowledgeable, and I am already (it's been about 3 weeks) feeling a difference in my arm and neck.  She also is very reasonably priced with a discount for students.  I highly recommend Devra!", "rating": "5", "date": [2010, 7, 20]}, "10": {"description": "To all the students with ailing muscles and joints from studying in Hyde Park:  you need DEVRA HELGERT!Devra at East Point Associates is just the best.  I've had massages in some of the swankiest spas in NY and LA, and Devra is far and away the best!  She intuitively understands pain in the body.  And she is 100% attentive to every muscle and joint in your body.  Just when the base of my scalp feels neglected, Devra seems to divine just what my body needs and gives me a deep scalp massage.  If my hip has been out of whack, Devra seems to know that the hip is the cause off all my problems and she roots all the tension out with her deft hands.  Devra practices a mix of Swedish and Deep Tissue massage, which strikes the perfect balance for most--not too light for those who have real back pain to address, like me, and also not too deep that you feel like your internal organs are being rearranged for an hour.  I always leave feeling elongated, lighter, and more refreshed when I leave. Also a plus: Devra is very reasonable and will give student discounts.  She's also very knowledgeable about the body.  You are literally in very, very good hands with Devra!I have also gone to Mary  Rogel and can attest that she is a miracle worker.  She won't take you unless you are really, really injured or screwed up though--you need to find an \"in\" and make your case to her.  but all in all the folks at East Point are extremely good at what they do and they are an absolute treasure to have in the Hyde Park area.", "rating": "5", "date": [2008, 12, 23]}, "4": {"description": "I've had one session with Mary, the owner with a PhD. I have Fibromyalgia, and it was my first acupuncture ever, so I was a little nervous. But the session went incredibly well, and I felt immediate relief! For days after I kept feeling like my body was STILL relaxing and smoothing out after the session, so I didn't set up another appointment until just ten minutes before writing this review. When I called, Mary answered the phone. When I told her who I was, she said that she had just been talking to her assistant about me, and that they'd been coming up with a couple of appointment schedules and treatment options and invited me down to talk them through to see if they work for me. Being in and out of hospitals over the last five years, I was stunned at the level of care East Point Associates has for their patients.Educated, effective and caring. Can you ask for anything more?", "rating": "5", "date": [2013, 4, 20]}, "6": {"description": "Devra is an incredible masseuse.  I like to stay in shape, and with athletic activity comes some wear-and-tear.  For that reason, I've gotten massages off and on for the past eight years when necessary. I generally like deep tissue, or a hard forceful massage, because that gets the muscles to heal the best for me.  Devra is very knowledgeable about the body, knows how to work out injuries, and is friendly and nice too.  I have been seeing her for about six months, and I would recommend her to anyone without hesitation.Oh yeah, there are great rates for students too!", "rating": "5", "date": [2009, 3, 8]}, "0": {"description": "Mary is a very gifted healer. I first met her three years ago for severe neck and back pain (with which I struggled for months) and couldn't be more pleased with the results. After only two sessions, the pain was completely gone and my overall health drastically improved. Since then, her treatments (massage/acupuncture) became a regular and essential component of my wellness routine. She's not only extremely knowledgeable, experienced and reliable, but also caring and compassionate. Anybody searching for healing should seek the services of Mary. I highly recommend her!", "rating": "5", "date": [2015, 11, 19]}, "5": {"description": "Devra is AMAZING!  She is incredibly knowledgable and really nice to boot!  I went with swedish rather than deep tissue, but I still wanted to feel it.  She promised that she wouldnt just \"pet me\" and she didnt.  She really worked all of my muscles without using too much pressure.  It felt wonderful both during and after.  I will definitely be making visits to her a part of my regular routine.", "rating": "5", "date": [2011, 4, 22]}, "13": {"description": "Devra gives an amazing massage at very reasonable rates.  If you're a student, she has a student rate, as well.  Best massage I've had ever.  Well worth it.", "rating": "5", "date": [2008, 11, 25]}, "11": {"description": "I get several massages because I spend all day on the computer and have extremely tight muscles.  After going to at least 15 different massage therapists throughout Chicago, Devra is simply the best.   She is personable, professional, and most important very effective at relaxing my muscles.", "rating": "5", "date": [2009, 8, 27]}, "8": {"description": "How do I spell relief?  Salvation?  Hope?  UnSoo!!!!!UnSoo Kim, M.Ac., L.Ac., will now and forever by my acupuncture and physical therapy goddess.Four years ago I had a C-section, pulmonary embolism, two herniated discs, and a kidney stone in the space of four months.  I was hospitalized three times.  All the while pumping breast milk and managing to successfully produce enough for my infant son.  I slept in a lounger chair for six months before moving back to my bed on a wedge that I never moved from.For almost the next three years I dealt with my primary doctors increasing amounts of strong narcotics (Oxycontin) and anti-epileptic drugs as a means to control my pain.  After seeing a pain specialist, I began to get injections directly into my spine to deal with the ongoing pain I had in my lower back.And, none of it really worked or fixed the problem.This is where UnSoo comes in.  After just a few treatments, my back is beginning to feel better.  I am doing the physical therapy exercises she has given me to do.  I am more than happy to shell out from my pocket to pay this woman for her unique expertise in both acupuncture and physical therapy, in which she is licensed.  Additionally, she was a yoga teacher for many years.  She knows her stuff and she knows the body.  She has got a plan to get me back into working order in about four months, and I believe she will be able to do it and to help me do it.I'll be honest, the office is cramped and overfull, and has nothing like a spa feeling.  However, I still won't take away a star.  If you too suffer from lower back pain, I would recommend her in a heart beat.", "rating": "5", "date": [2008, 1, 27]}, "14": {"description": "all the rave about Devra is true. she's very professional and nice. affordable too!", "rating": "5", "date": [2009, 10, 1]}, "7": {"description": "If you need a massage, see Devra. She really knows what she's doing, her rates are good, and you'll feel great afterwards. She's also incredibly nice and a great conversationalist!", "rating": "5", "date": [2012, 11, 27]}}, "neighborhoods": ["Hyde Park"], "latitude": 41.7993278503418, "longitude": -87.5881881713867, "rating": "5.0", "times": {"Mon": ["9:00 am", "5:00 pm"], "Thu": ["9:00 am", "7:00 pm"], "Sat": ["9:00 am", "5:00 pm"], "Wed": ["9:00 am", "5:00 pm"], "Tue": ["9:00 am", "7:00 pm"], "Sun": [], "Fri": ["9:00 am", "5:00 pm"]}, "price": "$$", "categories": [["Acupuncture", "acupuncture"], ["Massage", "massage"]], "address": ["1525 E 53rd St", "Ste 705"], "attributes": {"Parking": "Street", "By Appointment Only": "Yes", "Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes", "Accepts Insurance": "Yes"}, "category": "Beauty", "number_of_reviews": "15"}, "campbells-caribbean-cuisine-chicago": {"comments": {"12": {"description": "The food is usually good but that depends on what time of day you go.  The service is bad.  The old lady there has turned me off from coming here and I will not recommend this place to anyone anymore.", "rating": "2", "date": [2013, 12, 9]}, "7": {"description": "It's alright, nothing to write home about. The chicken was cool, but not the best I've had.", "rating": "3", "date": [2014, 10, 17]}, "3": {"description": "Horrible the food is good but the customer service defiantly needs improvement!!!!! I don't spend my money on bad customer service", "rating": "1", "date": [2015, 5, 3]}, "1": {"description": "HORRIBLE customer service. Ordered my food, I sat down. I see customers coming in ordering food and getting their order before me. Went up to the counter to see what was taking so long after an hour and the cashier had no clue. This my second time having this problem with them. The food is good but I will not be back.", "rating": "1", "date": [2016, 2, 6]}, "2": {"description": "This place has awesome food if you like Caribbean  this is the place to go. Their brown stew chicken is the absolute best I've ever had, love this place. The atmosphere is like a mom and pop shops not like a franchise but the music, the flavor, and the people make this place worth going to. If you order out though call ahead because you will have to wait a little bit.", "rating": "4", "date": [2015, 3, 16]}, "9": {"description": "I LOVE THIS PLACE!!!!The Campbell family  and the food!!!This is the best Jamaican food i had since i left Jamaica!!!! If you go M-F 11am-2pm they offer lunch specials.My favorites are jerk chicken,curry goat and oxtails.", "rating": "5", "date": [2012, 9, 5]}, "18": {"description": "Coming from Brooklyn, we sure miss our jerk chicken and rice. This place is satiates that craving readily. Friendly, spacious and delicious, we came home with leftovers for yet another meal. The ginger beer is homemade as well. Highly recommended!", "rating": "5", "date": [2012, 4, 29]}, "10": {"description": "Not sure why it gets 5 stars.  I found the food to be just average.   I always pass this place & finally stopped.   I'm not in a rush to go back.", "rating": "3", "date": [2013, 9, 6]}, "13": {"description": "I first went to Campbells with my family over a year ago.  Though the service was sub par, as we decided to stay in and eat, the food was so good that there were no complaints.  The last two times I have ordered from them, it has been really bad.  I know they are ridiculously slow, so I call in ahead to give them time.  The last time, it took over an hour after being told on the phone 30 minutes.  The food was cold by the time I got it home and the woman on the register, as always, very unfriendly.  Today, I wanted to give them another try, again told 30 minutes for pickup.  I went early hoping that my presence would push them along.  It didn't...30 minutes turned into 45.  The very unsmiling woman on the register called me up to show me my orders, $50.00 worth of food.  When she opened the tilapia order, she quickly realized as did I that  there was only 1 small piece of fish in the container.  She told me, sit I will have them put more in  15 minutes later, while my other food sat on the counter and got cold, she came back with the fish.  I had two small extra sides which were forgotten, another 10 minutes while she went into the back to have them made.  When I arrived home, of course the other two orders were cold and in every order the rice in the rice and peas was only half cooked making that staple of Jamaican cuisine uneatable. Sorry Campbells, enough is enough for me,  You won't be getting any more of my money. The BBQ jerk is to die for, but not enough to make me come back!", "rating": "2", "date": [2014, 3, 16]}, "16": {"description": "If I could give them 10 stars I would.  This is the best caribbean cuisine I have ever had.  I would even say it is better than anything I had in Jamaica!  I catered for my super bowl party and everyone was blown away.  Hands down my favorite go to place for a party!  I could eat it everyday!  The Jerk is dead on!", "rating": "5", "date": [2013, 2, 15]}, "17": {"description": "best ive eva tasted. that callaloo is something like a phenomenon! brown stew chicken was the tastiest ever.. uncle joes who? vegetables are fresh, chicken tastes fresh.. nice customer service.. i am sitting here rubbing my full belly with a smile on my face", "rating": "5", "date": [2013, 4, 20]}, "15": {"description": "My husband and I have ordered takeout from here in the past. This time we decided tosit down at lunch time. We got there 2:08 and the lunch special ends at 2:00. The waiter was gracious enough to let us pay lunch special prices for our plates. My husband ordered Curry Goat and I ordered a beef patty followed by Oxtail (obviously I was starving). The Oxtail was soooo tasty and tender and seasonsed just right! The waiter also was very friendly and accomodating...checking to see if we needed anything from time to time...It was just a nice experience with great food!", "rating": "5", "date": [2012, 8, 20]}, "0": {"description": "This is not Caribbean food..it's Jamaican! Let's get that straight. Us islanders cook meals differently. If you have never been to more than one island you don't know what you're talking about. The jerk chicken is okay, the red beans and rice has never been under cooked. The Ox Tail is delicious and the cabbage is always good. Ting and Cola takes me back to those hot days and cool breezes. I always do take out. The decor could use some lifting but it is modeled like back home not American style. The dinner menu is pricey so order before 2pm to save $$. There are times when the owners daughter is cooking and then the gentleman cooks. You know who is in the kitchen when you taste the food. BIG DIFFERENCE. 4 stars for keeping Jamaican jerk and Ox Tail in my life.", "rating": "4", "date": [2014, 7, 27]}, "5": {"description": "This restaurant was a huge disappointment my friend recommended this place.  I tried the macaroni and cheese that had no cheese. Who does that ? it was barely warm as a matter of fact the whole entire meal was not warm. The jerk fish was decent but it was not great.  She recommended the  spinach as well . It was really greasy and nothing was just worth it .  The service was poor too .  Ughhh never planning on going back.", "rating": "1", "date": [2014, 2, 22]}, "11": {"description": "I hope you don't hate me too much for leaving this well established restaurant for it's slow service and inconsistent quality.", "rating": "2", "date": [2013, 11, 1]}, "8": {"description": "What is it with me and Caribbean food??Anyhow,  this place is great!  I pass by it all the time but stopped in for the first time 2 weeks ago.  I used to be a loyal Uncle Joe's patron, but when they consolidated and moved to Hyde Park, the food left much to be desired.  I'm so glad, I decided to give this place a try.  I ordered a jerk chicken dinner.  Oh boy was it is good!  It was flavorful, spicy, without being ridiculously hot.  The peas and rice were great, served with gravy and a side of yams.  The meal was about 11 bucks, but the portion was a lot better than Joes or any other Caribbean spot I've tried recently.  I'm definitely gonna make this my go to for Caribbean cuisine!", "rating": "5", "date": [2013, 7, 6]}, "4": {"description": "Great representation of Jamaica. Home made juices, collectors sauces. Impressive menu items. Some innovative, such as jerk nacho", "rating": "5", "date": [2015, 5, 21]}, "14": {"description": "I love the food and service here. Diamond in the hood!!", "rating": "5", "date": [2012, 12, 27]}, "6": {"description": "Was looking for Jerk Shrimp and stumbled upon this place...I ordered expecting grilled Shrimps like the photo but it was still good and spicy in the sauce. My sisters salmon was delicious.... I like that her salmon had a crust on it. That crunch with the escovitch toppings was a great combo. I agree that the place could us some uplifting but it's definitely like back in Jamaica. They sell Sorrel too so that  was nice!!  Some Reggae music would have been nice in the background too, especially when dining in... I would visit again with friends because of the large seating area. Lastly, if it says \"Cook to Order\" Be Patient!", "rating": "3", "date": [2014, 11, 19]}}, "neighborhoods": ["Burnside"], "latitude": 41.7367480695248, "longitude": -87.5940819829702, "rating": "3.5", "times": {"Mon": ["11:00 am", "9:00 pm"], "Thu": ["11:00 am", "9:00 pm"], "Sat": ["11:00 am", "11:00 pm"], "Wed": ["11:00 am", "9:00 pm"], "Tue": ["11:00 am", "9:00 pm"], "Sun": ["12:00 pm", "8:00 pm"], "Fri": ["11:00 am", "11:00 pm"]}, "price": "$$", "categories": [["Caribbean", "caribbean"]], "address": ["1225 E 87th St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "19"}, "the-massage-therapy-center-chicago": {"comments": {"1": {"description": "Very skilled and experienced.  Good for the heavy-duty working out of terrible knots or more relaxation-oriented stuff.  Very easy to get to.  Glad to have her in Hyde Park!", "rating": "5", "date": [2013, 1, 7]}, "2": {"description": "I tried this place upon the recommendation of my massage therapist from back home in Washington. He had been doing an intense series of trigger point therapy on me and wanted to pass me into good hands, so he did the research and suggested the wonderful lady who runs The Massage Therapy Center. I'm so glad he did! I went last spring and have hoped to return but $70 massages are not frequently in a student's budget. :) She is very knowledgeable and has a wonderful relaxed (and relaxing) personality. Her place on Harper may not be the most impressive set-up (and that might have changed for the better by now) but you are going for her magical fingers with the healing touch. She blended some wonderful smelling (and healing) creams together and between my self-diagnoses and her examination she worked out a one hour massage that completely relaxed me and set me right again. I would definitely recommend going to her if your pain is of the chronic-ready-to-go-to-a-doctor type, but you want to try a natural alternative to loosening up stiff or injured muscles. The experience is more than your average spa-massage with deeper and longer lasting results and I give her a hearty recommendation.", "rating": "5", "date": [2009, 4, 16]}, "0": {"description": "I selected this place due to the reviews on YELP and the location near my home.  I workout a lot and am turned off by those weak massages that barely feel good at the time and have no real relief from tight muscles.  Almeda is fabulous.  She is a good listener and really released some intense stiffness I had waited too long to resolve.  I am happy that I was able to find her and am excited to go back!  Relief is in sight:-)", "rating": "5", "date": [2011, 9, 14]}}, "latitude": 41.7981571, "neighborhoods": ["Hyde Park"], "categories": [["Massage", "massage"]], "address": ["5305 S Harper Ave"], "attributes": {"Parking": "Street", "By Appointment Only": "Yes", "Wheelchair Accessible": "No", "Accepts Credit Cards": "No"}, "longitude": -87.5890591, "category": "Beauty", "rating": "5.0", "price": "$$", "number_of_reviews": "3"}, "seafood-junction-chicago-3": {"comments": {"3": {"description": "after seeing all the hype on facebook about the original place thats all the way out west, i was more pleased to see that they opened a location in my own neighborhood. i am a lover of seafood & i usually have to travel far & spend lots of money on crab & lobster. everything i believe is frozen already. the menu is upon the wall to the right of when you walk in. its usually a crowd in but they try to get to your order soon as they can. my only problem i had was when i made an order that came with a small lobster tail when i stated more than once i want two large tails. once i had got my food the worker threw in 3 extra small tails. so its really not a complaint but make sure if you want an order specified make sure you have them repeat it back to you once or twice. i eat here occasionally i would reckon this place to anyone who enjoys seafood at a nice price.", "rating": "4", "date": [2015, 11, 24]}, "1": {"description": "Finally! A seafood restaurant close to home. I will admit that it is a bit pricey, but it's worth the money. It's not to many places (seafood) that offers potatoes, corn and broccoli.  The food was good, the sauce that goes with the food was excellent, the service was good and they were also friendly. I highly recommend this place if you don't mind splurging on some good seafood.", "rating": "5", "date": [2016, 2, 22]}, "2": {"description": "A little pricey and in a questionable area of town but food was delicious and they take link card for those who have it.", "rating": "5", "date": [2015, 12, 24]}, "5": {"description": "Finally! - a neighborhood restaurant that doesn't fry anything. I must have passed by this place many times.  It's small and located in a little strip-mall.  But the food was excellent.  We had the steamed platter with Cajun seasoning.  It came with well-cooked, fresh and crisp potatoes, broccoli, and corn on the cob.  Definitely will return.", "rating": "4", "date": [2015, 11, 12]}, "0": {"description": "So far looks good can't wait to see what prices are.Obtained a surprisingly excellent dinner! STEAMED NOT FRIED!Prices okWill come back again!", "rating": "5", "date": [2015, 11, 22]}, "4": {"description": "I would not recommend this place at all. I bought lobster and scallops which were rubbery and tasteless and the sad thing about it my cat didn't even want any. If you want good seafood this is not the place to get it from.", "rating": "1", "date": [2015, 11, 7]}}, "neighborhoods": ["Burnside"], "latitude": 41.7365608215332, "longitude": -87.592155456543, "rating": "4.0", "times": {"Mon": ["10:00 am", "9:00 pm"], "Thu": ["10:00 am", "9:00 pm"], "Sat": ["10:00 am", "10:00 pm"], "Wed": ["10:00 am", "9:00 pm"], "Tue": ["10:00 am", "9:00 pm"], "Sun": ["11:00 am", "9:00 pm"], "Fri": ["10:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Seafood", "seafood"]], "address": ["1317 E 87th St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Good for Groups": "Yes", "Good for Kids": "No"}, "category": "Restaurants", "number_of_reviews": "6"}, "the-chicago-body-works-a-chiropractic-and-massage-spa-chicago": {"comments": {"12": {"description": "when you move to a new city, it's never fun trying to find the good things- hair salon, grocery store, etc.  but its slightly different with chiropractic services...if you go to a restaurant and it's 'meh', then oh well, try the next one.   but you don't want to have someone adjusting your back and have it just be 'meh, ok i'll try the next one'.which is why i was so happy that Chicago Body Works was only my second stop at finding a chiropractor in chicago.  the atmosphere is wonderful- good wall colors, music, and awesome staff.  they're all very friendly, and after just a visit or two, will know you by name.i've had dr. chris halliday adjust my back many times, as well as massages from most (if not all) the massage therapists, and never have a single complaint.  they're all talented, and very good at connecting with their patients.  whether you're feeling talkative, or just want to close your eyes for some peace, they will follow your lead.  also, i never feel pressured to come back for services if i feel i don't need them, which definitely adds to the calm atmosphere.one highlight- they always call the day before to confirm your appointment.  if you have your spacey days like i do, this is key!", "rating": "5", "date": [2010, 6, 21]}, "7": {"description": "Dr. Chris Hallidy is the best! Great combination of expertise, skill, and the personal touch. He has helped me with a number of issues, such as lower back pain (from carrying too many boxes when I moved), tight shoulder muscles. He is a great guy, very caring and personable. And he includes a massage (by a trained massage therapist) as part of the treatment--if you request it. BTW: If you have a Chicago accent, call him Dr. Holiday. He's Canadian, and to the Canadian ear that sounds like Halliday.", "rating": "5", "date": [2009, 8, 27]}, "3": {"description": "I have used Dr. Halliday's services off and on for several years as needed, and he always delivers top quality chiropractic services.  I highly recommend him.Gary B., Attorney at Law", "rating": "5", "date": [2014, 6, 12]}, "1": {"description": "Doc is Professional but personable. He is big and strong enough to handle any patient. He is hands on, and might be a little rough for smaller people but I need someone to work my larger body. They are understanding when I show up late so long as I call ahead. Ask about a message/chiropractor combo visit, you won't regret it.", "rating": "5", "date": [2014, 6, 26]}, "2": {"description": "Dr. Halliday is fantastic. He is very interested in healing bodies. I have been a loyal patient for over 2 years and I couldn't maintain my crazy lifestyle without his help. My favorite is the combo - 1/2 hour massage followed by an adjustment. It's easy to park right in front and they have great availability of hours.", "rating": "5", "date": [2014, 12, 29]}, "9": {"description": "I was having intense back pain and came here for a massage last April.  The girl who I received the massage from was really sweet and good, but it was pretty much your standard massage, with standard expenses.  Dr. Halliday, the chiropractor who runs this business, was also very nice, and introduced himself to me and asked if everything went okay for me.  Overall, it was a nice experience, but nothing stood out as extraordinary, just that I paid quite a bit of money.After finding The Pain Stop in Wicker Park, it's hard for a lot of other places to compare as far as price and quality goes.  Also, I will note that this business offers all types of services- chiropractic, physical therapy, etc. and my review only reflects massage therapy.  Either way, no complaints with this business, I just found a place that I think is better for the service that I need.", "rating": "3", "date": [2008, 11, 13]}, "10": {"description": "I have never been one for any type of alternative medicine, but after throwing out my back (I'm talking can't get off the couch, incredible pain just to walk 3 weeks after it happened type of pain) and not seeing any real improvement for almost a month of my PCP's prescribed Aleve, ice and taking it easy, I decided to give it a shot. Best thing I could have done. I was able to get an appointment the day I called and there was noticeable improvement in my range of motion and comfort level after the first visit. I've gone to see Dr. Halliday about 15 times during the past 2 months and am seeing great results. I'm not going to say chiropractor's are magicians, but regular treatment with Dr. Halliday got me back on my feet and back to my active lifestyle. Staff is courteous and professional, office is clean and modern, treatment is really helpful. Check it out.", "rating": "4", "date": [2011, 4, 14]}, "13": {"description": "I love this place. Dr. Halliday is the coolest. He's always upbeat and very professional. When I come it's usually with my boyfriend and he sees Dr. Halliday while I see Melissa. She's phenomenal and there are times when I can't go without her. The service and staff are both outstanding! I stay very far away now but I refuse to go anywhere else. On that note, let me call and schedule an appointment now...", "rating": "5", "date": [2009, 11, 30]}, "16": {"description": "....um yeaah..I don't go here for massages. I go here for a comprehensive overall view of my back and my health. I'm a strong believer of holistic care. And for me? THE DOC ROCKS!!! Dr. Halliday is a no nonsense guy. He's helpful and honest. I can talk to him about how I'm feeling overall physically without feeling like I'm wasting his time and he's very helpful and patient with my questions. I am 150% on board with the exercises he gives me to do, the tips he gives on nutrition, and I have never felt more confident in my choice of a chiro.  Want comprehensive care looking out for the long term? Go see Doc Halliday.", "rating": "5", "date": [2008, 12, 18]}, "17": {"description": "Beautiful, calm environment. Relaxing, nurturing. Chris is a fantastic chiropractor. He is informative and explains what he is going to do before he adjusts. He is well balanced, strong and soft. Very caring. He really helped me with my lower back pain. I highly recommend him!", "rating": "5", "date": [2010, 3, 29]}, "15": {"description": "Chicago Body Works is great!  I was referred to the chiropractor, Dr. Halliday by my old doc in Michigan.  I have gone to other chiropractors in the past and was less than impressed with the care I received.  Dr. Halliday gives great adjustments and I always leave feeling 100% better!  I have gotten massage services there as well and was never disappointed.  Dr. Halliday and the staff are very nice and I never have to wait to be seen which is always a plus!  I highly recommend this place to anyone who is looking for good chiropractic care!", "rating": "5", "date": [2009, 3, 13]}, "0": {"description": "Dr. Halliday is extremely professional, friendly, and knowledgeable. I was having upper and lower back, and neck pain, and he seemed to truly care about getting me in better overall health. He offered suggestions for caring for my body on my own, such as certain stretches, posture, and walking more often while at work. I felt so much better after just one visit and continued as a patient until I moved. Additionally: Great staff. Easy parking. LGBT friendly.", "rating": "5", "date": [2014, 6, 12]}, "5": {"description": "Ive been going here for years.  I have been treated by with Dr Halliday and each of the massage therapists, and I will tell you they are all fantastic.  My back hasnt felt this good in years!", "rating": "5", "date": [2013, 3, 9]}, "11": {"description": "I've been seeing Doc Halliday for a couple of years now - I'm a huge fan of the services they offer. I seek out the good doctor for his skill in fixing up my occasionally crunked-up back and the rest of his team  provides excellent body work - Not your typical massage, either. Come here if you are looking for a team of folks who are interested in helping you get healthy and feel good!", "rating": "5", "date": [2012, 11, 15]}, "8": {"description": "Until the age of 54 I had never had a massage, but I finally got serious about my health and started going to the gym and working out pretty vigorously.  My body ached.  A colleague suggested I try a massage and since Chicago Body Works is close to where I work, I decided to give them a go.Boy, am I glad that I did.  For the last couple of months I have been going to Trisha for a weekly massage.  What can I say? Sheer bliss.  Each week the experience has been somewhat different, she never does the same routine twice.  I still can't believe that, with someone vigorously massaging you, I can still fall asleep on her.  I feel that comfortable, safe and secure.  Can't say enough good things about my experience with CBW.", "rating": "5", "date": [2010, 8, 22]}, "4": {"description": "Been going to Doc Halliday for years and he has always been a truly great listener who over delivers and I believe is a caring soul who genuinely cares about his patients. Chiropractic work usually is sought when things are bad, so you need to give your body time to heal with both an adjustment and massage.", "rating": "5", "date": [2014, 6, 12]}, "14": {"description": "Doc Halliday is AMAZING.  I never believed in chiropractic until my step dad moved in and now I would go to them before any orthopedic doctor.  Doc Halliday literally fixed my issues, he is wonderful!!!!!!!!!!", "rating": "5", "date": [2009, 4, 8]}, "6": {"description": "In a city where there seems to be a chiropractor on every corner, I'm very glad that I found Doc Halliday.  He's smart, knows his stuff, and is a big guy with strong hands and a healing touch.  He's helped me, my daughter and my husband. Nice staff, clean, serene space, good music. Can't wait for my next visit which will include a massage before my adjustment.I highly recommend Chicago Body Works.", "rating": "5", "date": [2011, 8, 15]}}, "neighborhoods": ["Lakeview"], "latitude": 41.9453193, "longitude": -87.6686325, "rating": "5.0", "times": {"Mon": ["1:00 pm", "7:00 pm"], "Thu": [], "Sat": ["9:00 am", "1:00 pm"], "Wed": ["9:00 am", "7:00 pm"], "Tue": ["10:00 am", "7:00 pm"], "Sun": [], "Fri": ["9:00 am", "7:00 pm"]}, "price": "$$", "categories": [["Chiropractors", "chiropractors"], ["Massage", "massage"]], "address": ["3505 N Ashland Ave"], "attributes": {"Parking": "Street, Private Lot", "By Appointment Only": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Accepts Insurance": "Yes", "Accepts Bitcoin": "No", "Wheelchair Accessible": "Yes"}, "category": "Beauty", "number_of_reviews": "18"}, "darrians-cocktail-lounge-chicago": {"comments": {"1": {"description": "Was there Friday , keep asking when was food going to be ordered. The manager did a poor job of managing that aspect. When food did come he made damn sure he ate first. It took another hour and 15 minutes to get more food. So if you come make sure you eat dinner first folks .", "rating": "1", "date": [2016, 1, 17]}, "0": {"description": "I always find some new hole in the wall when I'm wandering around the Southside with friends. This happened to be one of them. Darriens is a low key spot that you would totally drive right pass, not realizing that it's open, let alone a bar. The outside leaves much to be desired, it's a lot, unpaved, whatever. Once you get inside though, it's a pretty nice place. Modern and clean facilities. A little area for dancing with a nice DJ setup. The drinks were good and we were allowed to bring in snacks to munch on at the bar. Service was average. The bartender played card games with some of the patrons. I guess that was cool seeing as she had multiple moments of down time. Be careful of your surroundings and stop in for a drink.", "rating": "3", "date": [2015, 6, 21]}}, "latitude": 41.736538, "neighborhoods": ["Burnside"], "categories": [["Lounges", "lounges"]], "address": ["1251 E 87th St"], "attributes": {"Good for Groups": "Yes", "Outdoor Seating": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.593239, "category": "Bars", "rating": "2.0", "price": "$$", "number_of_reviews": "2"}, "aldi-grocery-store-chicago": {"comments": {"0": {"description": "This location is typically clean, well organized and the employees are helpful.  I did have to complain about rotten fruit one time, however they rectified the problem immediately.  Love the return policy.", "rating": "4", "date": [2013, 9, 12]}}, "neighborhoods": ["Burnside"], "latitude": 41.7369229155248, "longitude": -87.5946900956062, "rating": "4.0", "times": {"Mon": ["9:00 am", "9:00 pm"], "Thu": ["9:00 am", "9:00 pm"], "Sat": ["9:00 am", "9:00 pm"], "Wed": ["9:00 am", "9:00 pm"], "Tue": ["9:00 am", "9:00 pm"], "Sun": ["9:00 am", "7:00 pm"], "Fri": ["9:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Shopping", "shopping"], ["Grocery", "grocery"]], "address": ["1246 E 87th St"], "attributes": {"Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "1"}, "japanese-spa-zen-chicago": {"comments": {"28": {"description": "After living in Hyde Park for five years, I had come to the conclusion that the only way I could get a non-mangled cut was to do it outside the neighborhood. I'd never asked for anything terribly elaborate-- shortened to a certain length, with some layers so it's not so heavy, but the results had been some combination of horrible and expensive.Then I found Naoko at Japanese Spa Zen. She was able to do exactly what I wanted, and has offered helpful suggestions when I've asked. I've never had such consistently great service anywhere else-- Hyde Park or otherwise-- and the prices are lower than just about anywhere else I've gone. I don't relish the thought of having to find someone new if I ever move, because Naoko has been the best of the best.That said, the one time I walked in without an appointment with Naoko, the results from the other girl who was around were just as bad as elsewhere in the neighborhood. I haven't seen that girl around in a while, though, but regardless, be sure to ask for Naoko, even if it means a bit of a wait. She usually has appointments the same day if you call in the morning, and I've never had to wait more than a day.", "rating": "5", "date": [2009, 4, 12]}, "1": {"description": "Do NOT get your nails done here. It took over two hours to get a mani/pedi and she did not know how to paint nails. I asked her to repaint a couple of my fingernails because she applied to much paint and it was clumping. Several hours after I had left and after the paint had dried, I took a shower and the paint on my nails was all messed up and sliding off because she has applied way too much paint with each coat. I later noticed that the same thing had happened to my fingernails. I spent $50 for a manicure and pedicure that got messed up within a few hours.", "rating": "1", "date": [2015, 10, 3]}, "9": {"description": "Good and detailed pedicure service!", "rating": "4", "date": [2014, 2, 13]}, "29": {"description": "Oh, I know why Britney Spears went all batshit crazy and shaved her head a while back. My baby son has been straight ripping the hair out of my head by the root for the past year, leaving my hair a cracky looking mixture of frizzly lengths and my nerves shot to hell. So I just went and got a new haircut. But if I had TWO little babies doing that to me at the same time, who knows what I would have done... Getting my hair cut by Dezel was a trip - he was literally dancing around me in the chair, regaling me with stories about his life. At one point he bumped me, like the dance The Bump, while listening to Usher and Lil Jon working it out (YEAH! OH-KAAY!!) - not monk chants or anything super peaceful. I didn't really have a style or cut in mind, so I just told him to fix my shit - and he did. I was disappointed that he only spray bottle wet me down instead of a proper shampoo, but I just figured that's how he does it, so whatever. After the cut he gave me a blow out that made me look so Jackie/Chelle-rific that I wanted to throw my hat up in the sky toward all of those Obama banners all over Hyde Park. $25 and they let me walk in with no appointment. I'd come back for a style or blow out, but the cut itself is pretty average.Although I did not get the massage that outdoes people literally jumping on your back and shit (clearly a mistake on my part), I didn't really find this spot very Zen, other than leaving with a pretty slamming new do. The name of the salon might make you think it's all fancy and minimalist with the sound of a gurgling water fountain and little bamboo sculptures or something, but it's not. It's very small, kind of cramped and the bathroom is not cute. That kind of shit doesn't really bother me, but you might care, so I'm telling you. I really didn't like that they wouldn't accept a check from me and that I had to walk a few blocks down to the bank, though - that part was foul. I have been getting compliments on my awesomeness for two days though, so it has all worked out - even though almost anything would have been an improvement. Don't call it a comeback.", "rating": "3", "date": [2009, 1, 4]}, "23": {"description": "3 for decor, 5 for the cut = 4 star experience!Just moved to Hyde Park and had heard horrors about finding a place to get a decent cut. Found the reviews for Japanese Spa Zen and decided to take a chance on Naoko.Boy, am I glad I did! While I'm not overly picky, she did just what I asked (long layers, sideswept bangs) and I left feeling beautiful. Naoko obviously has a lot of experience, and is very very attentive while cutting. She spent at least 15 minutes just making sure every strand was in the right place after my blowout. She had great advice for making sure my hair didn't dry out too much in the Chicago winters, and instead of pushing products (like so many salons do) she worked with what she knew I had. The icing on the cake was the price - $33 for a shampoo, cut, and style. I'm not sure about Chicago, but coming from DC that is a STEAL!   The only downside is that this is not the place to go if you are looking for a transformative spa setting. While the spa is clean and efficient, it isn't exactly relaxing. The setup is very functional.All in all, this will definitely be my go-to for Hyde Park haircuts. Naoko and her staff were very friendly and did such a great job at a good price- I'm hooked.", "rating": "4", "date": [2011, 1, 16]}, "5": {"description": "This place is a lifesaver. Had my hair mangled by another salon in HP and not only did they fit me in immediately, but they gave me a great haircut, especially since they had to salvage the remains of my poor hair. I had Ramona, she was really helpful and friendly, and knew exactly what I wanted. I will definitely be going back whenever I need a haircut. My new go-to in Hyde Park.", "rating": "5", "date": [2015, 4, 27]}, "31": {"description": "based on the other reviews, it seems that this is a good massage/pedicure place. however, i would not recommend getting my eyebrows waxed here. i've been looking for a good place to get my eyebrows done in hyde park, and i really want to support local business in my neighborhood. the staff were pretty nice. but my wax wasn't! the employee who did it had just gotten back from a smoking break, so the first thing that put me off was that when she started touching my face the smoky smell was overwhelming. the waxing job was really mediocre, i didn't feel like my eyebrows looked particularly neat when they were done. also, when this employee went back and tweezed her hands were waxy, and so my eyebrows got all sticky and i walked out of there without getting cleaned up. the tweezers also weren't particularly clean or sharp, so i didn't feel like they did much good. i still feel like it's worth it to take make the long trip downtown on the cta and pay more to have it done by better-trained staff. sorry!", "rating": "2", "date": [2008, 8, 19]}, "25": {"description": "Nothing spectacular. They seem to not go the distance for their business (or regular customers for that matter) and are happy with the occasional walk in-s of Hyde Park. That summons it pretty much.", "rating": "3", "date": [2010, 5, 29]}, "12": {"description": "I initially picked this spa because of its proximity to my school, turns out the massage here is so good I end up returning at least once every month. I appreciate the prompt and friendly greeting everytime I walked in. The masseuse usually offers a choice between Swedish and deep tissue massage. I have tried both and enjoyed the deep tissue more. The ambiance is nice and has relaxing aroma.If you want some tranquil and private time while you relax, try the Japanese herbal bath. Basically, they place a bag of Japanese herbs into a hot tub and you get to enjoy it for an hour while instrumental music is played in the background. The scent is absolutely refreshing. There are chairs (with towels placed on them) next to the tub in case the water gets too hot. I highly recommend this spa for those who live in Hyde Park and are looking for a place for a spontaneous self-indulgent splurge. Trust me- you'll enjoy it.", "rating": "4", "date": [2012, 6, 24]}, "21": {"description": "Waste of time and money!!!!! Went in for a Pedi/Medi and ended up having to buy my own nail polish from the CVS down the street because all their nail polish was so old you couldn't even shake or open the top. Why would I even go there you ask? Because no one else could fit me in and it was necessary. Anyways... I get the worste pedicure of my life, I had to trim my own nails, scrub my own feet because the girl touched me like I was going to break. She ended up only painting half of my nail, so tomorrow I basically have to go get another pedi. So then I now needed my Manicure right? No! Now they are saying they thought I only needed a Pedi and she has another client. At the end of all of this, I ended up spending 20 dollars on nail polish and 30 on the pedi. Just to do the whole thing over again tomorrow. Please Beware!", "rating": "1", "date": [2011, 6, 4]}, "16": {"description": "I went here for a simple upper lip wax... Everything seemed to go fine enough but now, exactly one week later, I see a ton of missed areas. I usually only have to go once every 3-4wks or so. What a waste of money - I'm not going back.", "rating": "1", "date": [2013, 10, 23]}, "17": {"description": "This has been my go-to place for getting my brows waxed since I moved to Hyde Park. I would totally recommend it for this service. A little pricier than what I'm used to ($15 as opposed to $10-12), but worth it. This is the least irritating wax I've ever had and both women I've had wax my brows were very professional and ensured that that the end result was the best possible.I had a haircut here once (and by haircut, I mean trim) and I was really unimpressed. No shampoo, only a spritz which ended up backfiring because I have curly thick hair (which was straightened at the time) so bits and pieces started curling again so each strand was a different length which seemed to confuse her. The fact that she didn't see that coming doesn't speak well to her skill as a stylist. The price is what I'm used to when a shampoo is included. For the fact that she just trimmed by dry hair it was too much. Won't be doing that again.I've also had a massage here on one occasion and I would go back again. The price was lower than usual and it was a pleasant experience except for the background noise from the salon.  Overall, this place is better for somethings than others.", "rating": "3", "date": [2011, 4, 19]}, "10": {"description": "************If I could rate this place with zero stars I would!*************************************WARNING: DO NOT GET A BRAZILIAN WAX HERE!!!!!********************I came here for a Brazilian 3 years ago, I still remember the horrible experience like it was yesterday!  I had maybe 10 Brazilian waxes prior to coming here to get one so I know what is supposed to happen! Anyway, the waxing person kept sweating and wiping the sweat off of her face during the entire procedure. Talk about disgusting, maybe she was having a hot flash...anyway, it was nasty! She looked like she just ran a marathon!  This was the most painful waxing I have ever had. Also she didn't finish. She claimed \"Your hair is not right for waxing.\" She quit about 3/4 of the way through, I had wax on me still and she recommended that I \"Go home and use olive oil to remove the rest of the wax.\" I was in shock, I have had many waxes and never had this issue. I paid (which I should have never done) and left and then went to the near by Rite Aid and picked up a waxing kit and finished the rest at home. THIS PLACE IS HORRENDOUS!!!!!!!!!! Do not get your waxing done here!!!!!!!", "rating": "1", "date": [2013, 10, 13]}, "11": {"description": "I got a mani/pedi here for an upcoming vacation. I am really happy with the result. The pedicure station is tucked away in a little corner, which I liked. It felt really private. The basin for my feet was nice and had neat heated rocks in it, which felt kind of awesome. Both the manicure and pedicure were exactly what I expected when I get one. I soaked, was exfoliated, scrubbed, moisturized, and my nails were carefully trimmed/filed and painted. I feel that the price ($20 for a manicure, $30 for pedicure) is very reasonable for the treatment.Another reviewer mentioned that they do not have a big polish selection, which is true. I brought my own polish so that I can take it on my trip with me in case it chips while I am away. And yes, manicures chip! Unless you get a gel manicure, your manicure will probably chip in 5-7 days. It is always a good idea to bring your own polish if you are concerned about chips.Overall I was very happy with my mani/pedi experience and I will definitely go back to JSZ for this service again.", "rating": "4", "date": [2012, 7, 19]}, "26": {"description": "Japanese Spa Zen is friendly, casual, and reasonably priced. I get my (short) hair cut there about once a month.   If you are going for a haircut, ask for Naoko. She is the owner of the spa, and she's great. She always does exactly what I ask for, and she does it well. I receive compliments on my hair all the time, and have referred several people to Naoko. If it were just her, things would be close to perfect there, but I was not very pleased with either of two other stylists' work. They didn't seem to care as much about getting it right. Also, they don't routinely shampoo at Spa Zen -  If you want your hair washed, there is an extra fee.All that being said... I'm very happy with my hair and I won't go to anyone else for a cut.", "rating": "4", "date": [2010, 3, 18]}, "27": {"description": "I love this Hyde Park spa on 53rd Street. Naoko is a great hair stylist, very friendly, and the prices are reasonable. I used to trek downtown to Vidal Sassoon in the Water Tower, and pay $70-100,  but I can honestly say that Japanese Spa Zen does a better job for around $25-30.  I've also had some excellent one hour Thai-Swedish massages here for $65.", "rating": "5", "date": [2009, 10, 16]}, "0": {"description": "I really, and I mean really, like Naoko.  She's incredibly personable and while I'm not one to be so chatty in the salon chair, Naoko has in the past had me laughing over just about everything, from her neighborhood raccoon problems to wedding fiascos.  And she gives a truly decent cut.  When we first moved to Hyde Park two years ago, we noticed Japanese Spa Zen while combing 53rd street for restaurant finds and the like, so naturally when my husband needed his first Chicago cut, he went to Naoko.  And loved her.  She gives a great men's cut.  \"Go see Naoko\", he said, when I complained about my ever-populating split-ends.  And go I did.She was charming in exactly the way he described her and I remember bouncing back the few blocks to our apartment that first fall, taking pleasure in my new-found style, which was a fairly simple bob.  Back then, I'd gone for ages without so much as a trim.  I was in paradise.I'd return every few months for the next few years for cuts and trims, eyebrow waxes, and even a french manicure.  All of my cuts were always with beloved Naoko, but the waxing and nails were done by another employee who was very engaging and pleasant, yet I never really loved the wax job.  It was inexpensive, and for what it was, it was fine, but I was coming up to my wedding date and really wanted some truly clean lines.  As for the nails, the French manicure wasn't quite perfect and she mentioned that she really liked to put the sparkly polish on when she did Frenches, assuring me it would look great.  I didn't dig it.  But she was nice, and I knew she was still training, and I love that Naoko opts to hire people who are still making their own way.  This was over a year ago, so I'd consider returning and giving it another go.Last winter, Naoko was out for a bit, in Japan, I believe, and then down with a surgery.  I was selfishly devastated and had to go elsewhere.  I tried University Stylist.  A similar cut to Naoko, but I loved Naoko, and when it was time for my next cut I was in the mood to take off some serious length and rock a new style, with time taken to teach terribly impossible-to-teach me on how to properly do my hair, and for this, I knew it was time to leave Hyde Park.  And I'm glad I did.  It was time for a change, and my new cut and style was a two hour session that I know wouldn't go down at Zen.I know for many, though, like myself, Naoko is just what you need sometimes, and the memory of bouncing down 53rd and Woodlawn in my first crisp Chicago fall after my first visit to Naoko's will always be an endearing one.", "rating": "4", "date": [2014, 9, 19]}, "20": {"description": "Received a much needed massage here today.I hadn't realized how badly I needed a massage until last night.  I knew it was essential for me to receive a massage this weekend as I have a very busy week ahead of me.I was all twisted up, tense and in pain.  It felt as though my head, neck and shoulders were all one unit.  But that was all before 4-5pm today!Japanese Spa Zen allowed me to make a same day appointment.  My appointment was origianlly scheduled for a little later in the day but they had a cancellation so contacted me to see if I could move my appointment up.  Yes!As mentioned in previous reviews; this is not a shi-shi-poo-poo type of atmosphere; it's basic functional space.  The customer service didn't knock me off my feet either.  It wasn't good or bad though.  So for the lack of decorum and awesome customer service, I have to keep a star to myself.I went to JSZ today for a good massage.  I ended up getting a great massage.  This is probably about the 20th massage I've had (but only my 2nd non-american massage) and I must say it was my best massage yet!  The spa has this whole list of services but I was asked and only confirmed a 60-minute massage.  When greeted by the lady that would perform my services she simply asked \"why are you getting a massage today?\".  She never asked what \"type\" of massage I wanted; nevertheless, I knew it would be okay.I was guided into your typical massage room with the dim lights, candle glow, soft -music and massage table.  I went through the same ol'-same ol' of disrobing and blah-blah-blah.  She started off with a lighter touch than I expected or desired but once again, I somehow knew that things would be ok.  What ensued was a customized massage comprised of different methods.  I felt some Swedish, some Reiki, some deep tissue, some trigger point manipulation and just overall rebalancing.  It was awesome!I can get a little OCD at times and expect to receive the exact same thing to one side that you did to the other side.  However, today I knew that each side was getting what it deserved!  My massage was so personal and specific to my needs!  I walked away feeling like a new person!  Upon completion of my service my masseuse told me that I needed to come more oftern.  This felt more like a consultation than a sales pitch.  I feel as though she was saying \"hey chick! you've got a lot of tension and it took a lot of work to get it out, come on a more regular basis and it'll be better for you and I!!!!\"  LOL....................I'll take it!In summation; choose JSZ if you're looking for a quality massage.  If you are looking to have a whole \"Zen\" experience, you may want to go elsewhere.Toodles!", "rating": "4", "date": [2011, 8, 13]}, "19": {"description": "So I've been to this place a few times before today, maybe 4 or 5. The experience was always pretty nice, always had the same hairdresser and it's really cheap. Today things were different though. First, despite having washed my hair like 1 day ago they insisted that it was dirty and so I had to pay extra to have my hair washed, because of state regulation (?) (it is a dry hair cutting place, Japanese technique they say). This never happened before, even when I had not washed my hair for much longer. Then, the lady who cut my hair (big black frames) was just so weird and not nice. I was just feeling really uncomfortable around her. And she cut my hair in a funny way. My hair is pretty long, and she made a first cut all around my head pretty short. So it looks like a bob but with longer hair behind. It's just really bad. My office friend was appalled when she saw me coming back. The worst was also that the owner (the Japanese lady) was like oh it's pretty! No it is NOT pretty.", "rating": "1", "date": [2012, 2, 27]}, "33": {"description": "Dude. I can't even speak right now. I am SOHOO relaxed I feel like I just popped two vics (not that I would EVER do such a thing. crazy talk)HANDS DOWN the BEST massage I've ever had! And let's just keep it real, I've been around the block a few times - I've had a Vietnamese women tip-toe on my vertebrae while hanging off monkey bars in Ho Chi Minh City (STILL reeling from the socio-economic-neo-colonialist implications of that day), blind Cambodians, stone-therapy, mud-therapy, light-therapy, you name it. What's so great about it? In addition to having the most methodical, perfectly-pressured, no-ache-left-behind technique, the masseuse here is not squeamish; unlike other masseuses who will (understandably) hit-and-quit the feet, homedude went to town. And it should be noted that my feet are, to quote my charming sister, \"hella nasty,\" so BIG UP!! n'wayz, HYDE PARK man!! If you want the kinda massage where someone touches your neck, and the stress shoots out your toes, THAT's where it's at.  WHO F*CKIN KNEW?! And if ya don't know, now ya know.", "rating": "5", "date": [2007, 9, 24]}, "2": {"description": "Went for a haircut. My hair was long, and I had no idea what to do. The hairdresser asked me what kind of style I want, I had no clue...so I said I don't know... short? She smiled and asked no more. For around 30mins, she did a extremely meticulous job to my weed like hair. I never would expect such professional service with 20 dollars... I didn't even know what I want, but the process was very swift and enjoyable. I actually like my new hair... Which hardly ever happened when I stepped out of any barber shop. Will come back again.", "rating": "5", "date": [2015, 4, 20]}, "34": {"description": "Walking into this place, I didn't know what to expect because it doesn't have that cozy spa feel, but the actual room where I received my massage was quite pleasant.  The cost for their services are pretty inexpensive.  If you just need to get a massage one day, try this place out.", "rating": "3", "date": [2007, 1, 24]}, "32": {"description": "ONE OF THE BEST PEDICURES EVER.  Ok, truth is, you could slap my feet a few times and I'd like it but I just got one of the best pedicures ever.  I'm so super sad I found Lisa Marie my final weeks living in Hyde Park.  So sad.  I would have been to her once a month if I had known!  Call this salon, ask for pedicure with Lisa Marie, tell her I sent you.  I told her I'd Yelp this and she laughed.  I'm telling you...I can't stop talking about my great pedicure and it was only $30.", "rating": "5", "date": [2008, 7, 10]}, "18": {"description": "During the summer, they are a little short staffed, so my lunch-hour pedicure ended up taking longer than expected.  However, I was delighted with the results! The woman who did my pedicure was very thorough and my feet look great.  Since this is one of the only nail salons in Hyde Park other than Fairy Nails (DO NOT GO THERE! IT'S GROSS!), I will be returning during lunch hour soon.", "rating": "4", "date": [2012, 7, 19]}, "13": {"description": "I got a corrective facial from Ramone, a cosmetologist,  not  aesthetician. Let me tell you as an avid facial reciever, I am used to having the cool steam spritzing machine be used on my skin. But it just sat there in the corner,  unused. The exfoliation process, or what I assumed was exfoliation consisted of steamy towels when I ultimately expected a facial scrub.  However,  I must give accolades for the fact that extractions weren't that bad. As I said I get facials pretty often and have had eye watering extractions,  but these were not of that sort.  Too bad only one side of my nose got the pleasure. I know my skin,  I know it needed it because I had walked in after taking 2mos off of facials due to the bad customer service I got across the street at Bettye O. I prefer aestheticians to do my skin care and I probably should have checked that first, and the music and background clatter were all just a little much for zen to be in the title.  But overall,  Ramone is a lovely person,  although my attempt at humor about how painless the extractions were seemed to fall on dead,   impersonal ears.  Oy! Probably just worth the $10 tip,  instead of the $75 service.", "rating": "2", "date": [2013, 11, 1]}, "4": {"description": "The location is super convenient and scheduling was easy. I did not wait at all even after arriving early. The esthetician did a perfect, thorough job on my brows. Fair pricing.", "rating": "4", "date": [2015, 7, 26]}, "24": {"description": "Hands down the best waxing I've ever had and i've been waxing my lip and brows for  30 years.  Ronetta is absolutely amazing!  She will leave you with exactly the brow you ask for, without a trace of wax, redness or proof she was even there to remove the harrying hairs.  I've been going to her since this spa opened up in Hyde Park and won't let anyone with a wax wand touch me as long as she draws breath.  I can happily claim I have made 3 Ronetta converts so far and not one has been disappointed, and 2 of those were redheads (redheads tend to welt or redden up temporarily after waxing)!", "rating": "5", "date": [2010, 11, 18]}, "6": {"description": "Naoko is the hair-whisperer. I have thin curly hair. It's completely different from cutting straight hair. She understands how my hair works, gets the split ends without destroying texture, and cuts it exactly as I requested. Main points to mention to her: overall length and length of layers. She will follow it to the letter. Make sure to wash your hair the night before if not you have to pay extra to have your hair washed. Straighten it if that's what you usually do (if you have curly hair). It's a no-frills salon, but she does a great job. Not sure about her other employees. Also, ask her about Japanese culture, She has some great stories.", "rating": "5", "date": [2013, 3, 21]}, "22": {"description": "This has been my go-to place for getting my brows waxed since I moved to Hyde Park. I would totally recommend it for this service. A little pricier than what I'm used to ($15 as opposed to $10-12), but worth it. This is the least irritating wax I've ever had and both women I've had wax my brows were very professional and ensured that that the end result was the best possible.I had a haircut here once (and by haircut, I mean trim) and I was really unimpressed. No shampoo, only a spritz which ended up backfiring because I have curly thick hair (which was straightened at the time) so bits and pieces started curling again so each strand was a different length which seemed to confuse her. The fact that she didn't see that coming doesn't speak well to her skill as a stylist. The price is what I'm used to when a shampoo is included. For the fact that she just trimmed by dry hair it was too much. Won't be doing that again.I've also had a massage here on one occasion and I would go back again. The price was lower than usual and it was a pleasant experience except for the background noise from the salon.  Overall, this place is better for somethings than others.", "rating": "3", "date": [2011, 4, 19]}, "15": {"description": "Received a much needed massage here today.I hadn't realized how badly I needed a massage until last night.  I knew it was essential for me to receive a massage this weekend as I have a very busy week ahead of me.I was all twisted up, tense and in pain.  It felt as though my head, neck and shoulders were all one unit.  But that was all before 4-5pm today!Japanese Spa Zen allowed me to make a same day appointment.  My appointment was origianlly scheduled for a little later in the day but they had a cancellation so contacted me to see if I could move my appointment up.  Yes!As mentioned in previous reviews; this is not a shi-shi-poo-poo type of atmosphere; it's basic functional space.  The customer service didn't knock me off my feet either.  It wasn't good or bad though.  So for the lack of decorum and awesome customer service, I have to keep a star to myself.I went to JSZ today for a good massage.  I ended up getting a great massage.  This is probably about the 20th massage I've had (but only my 2nd non-american massage) and I must say it was my best massage yet!  The spa has this whole list of services but I was asked and only confirmed a 60-minute massage.  When greeted by the lady that would perform my services she simply asked \"why are you getting a massage today?\".  She never asked what \"type\" of massage I wanted; nevertheless, I knew it would be okay.I was guided into your typical massage room with the dim lights, candle glow, soft -music and massage table.  I went through the same ol'-same ol' of disrobing and blah-blah-blah.  She started off with a lighter touch than I expected or desired but once again, I somehow knew that things would be ok.  What ensued was a customized massage comprised of different methods.  I felt some Swedish, some Reiki, some deep tissue, some trigger point manipulation and just overall rebalancing.  It was awesome!I can get a little OCD at times and expect to receive the exact same thing to one side that you did to the other side.  However, today I knew that each side was getting what it deserved!  My massage was so personal and specific to my needs!  I walked away feeling like a new person!  Upon completion of my service my masseuse told me that I needed to come more oftern.  This felt more like a consultation than a sales pitch.  I feel as though she was saying \"hey chick! you've got a lot of tension and it took a lot of work to get it out, come on a more regular basis and it'll be better for you and I!!!!\"  LOL....................I'll take it!In summation; choose JSZ if you're looking for a quality massage.  If you are looking to have a whole \"Zen\" experience, you may want to go elsewhere.Toodles!", "rating": "4", "date": [2011, 8, 13]}, "7": {"description": "I've been going to Japanese Spa Zen regularly for my haircut, eyebrow and lip wax.  Paulina does a beautiful job.  She takes her time and does a great job with layers and bangs.  The quality of the cut is the same as a $50 to $60 cut but she only charges $35.  They don't wash your hair first, so I guess that explains some of the price difference.   Also, the salon could use a renovation, but the service is very good.", "rating": "5", "date": [2014, 4, 25]}, "8": {"description": "I've had a few haircuts here, and I've always been very happy with my cut. At $30 for a haircut, it's also an incredible bargain.", "rating": "5", "date": [2014, 9, 10]}, "30": {"description": "I needed a massage badly, as my entire body was seizing up in a rigor mortis like stress ball.My massage was not terribly relaxing, nor were the surroundings so great.  Walking in, I was overpowered by the smell of the mani/pedi supplies in this small salon in Hyde Park.  The bathroom was tiny, cramped, and clearly an afterthought that wasn't as nicely appointed as the \"public\" space up front in the salon.They got me in fast on the same day, but overall I didn't love it and won't go back.", "rating": "3", "date": [2008, 8, 24]}, "3": {"description": "Neither very zen, nor very spa like; it's actually kind of cramped and cluttered in there.  But - that's my biggest complaint; the staff was indeed very considerate.  I've been twice now, both for waxing and my first Brazilian was a breeze compared with what I was expecting.  One tug really smarted but the rest were done with minimum pain.  And $55 seemed reasonable to me.  I would definitely go back!P.S.  The one other thing that bugs me is that they're closed on Thursdays - which so often has been the exact day I want to go!", "rating": "4", "date": [2014, 7, 29]}, "14": {"description": "This place is amazing. I just got a brazillian, and was expecting it to be so painful, but I barely felt anything!!! They are so nice, and very considerate! I highly recommend this place!!", "rating": "5", "date": [2014, 5, 6]}}, "neighborhoods": ["Hyde Park"], "latitude": 41.7996249, "longitude": -87.5921911, "rating": "3.5", "times": {"Mon": ["9:00 am", "7:00 pm"], "Thu": ["9:00 am", "7:00 pm"], "Sat": ["10:00 am", "6:00 pm"], "Wed": ["9:00 am", "7:00 pm"], "Tue": ["9:00 am", "7:00 pm"], "Sun": ["10:00 am", "5:00 pm"], "Fri": ["9:00 am", "7:00 pm"]}, "price": "$$", "categories": [["Day Spas", "spas"]], "address": ["1380 E 53rd St"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "No", "By Appointment Only": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "35"}}