{"hot-wok-chicago-2": {"comments": {"3": {"description": "Hot Wok was a HOT MESS! I've never eaten egg foo yung so unappealing. My meal included bad gravy and a weird tasting egg patty. In addition to the disappointment of lackluster food, the $6 delivery took an hour and a half. I recommend they rethink that recipe and start from scratch. This was my first and last time ordering from this restaurant. NEVER AGAIN!", "rating": "1", "date": [2015, 10, 13]}, "1": {"description": "I, too, was happy to see a Chinese Restaurant in the neighborhood and thought I would give it a try. My first order was good enough that I ordered from them again. The second time, not so good. My son wanted to try them, so I ordered a third time. Three strikes and their out. Rice seems stale, Tso chicken is wet & mushy and overall flavors are not good. I'm going back to King's Chop Suey. Excellent food, never should have left.", "rating": "1", "date": [2016, 2, 10]}, "2": {"description": "The first time me and my bf bought food from hot wok it was great! The second time my bfs orange chicken was stale and hard to chew on but my food was good so today I decided to try them again for the third time. I ordered the zseshwan beef and as I was eating it my stomach started hurting so I looked at the meat and it was RAW!  never again will I eat here! I think they switch cooks because it's always different.", "rating": "1", "date": [2015, 10, 22]}, "5": {"description": "It's a tiny place. When you walk in you'll see a big fish tank. Pretty interesting to look at. The food prices are fair. I got a won ton soup, egg rolls, shrimp fried rice and beef and broccoli. It was ready pretty fast didn't even take 10 minutes. The food tasted great once I got home. Was also given sticky rice and a few fortune cookies.", "rating": "5", "date": [2015, 11, 4]}, "6": {"description": "We ordered Hot Wok for a small family birthday and we were looking forward to getting it, since we haven't had decent Chinese food close to home in a long time. My brother ordered 2 large beef and broccoli, 2 orange chicken, a large combination fried rice WITHOUT shrimp, and a small shrimp fried rice. Not too hard.... we go to pick up the food, we get home and our order was completely wrong. All shrimp fried rice, 1 missing orange chicken...  I call Hot Wok back and the person that answers the phone sounds couldn't understand how the order was messed up. He sounded annoyed when I told him that 2 people are allergic to shrimp and sighed and said , well I can see if the chef will remake it if you bring it back. So now we have to wait over an hour to get a simple order right? Also, we didn't get fortune cookies, sauces, forks or anything with our food.It's unfortunate, I really wanted this to be a good experience since my whole family loves Chinese food and a place this close would have been great instead of driving to Js Peapod or 3 Happiness.", "rating": "2", "date": [2015, 9, 5]}, "7": {"description": "Finally we have a legitimate Chinese restaurant on the East Side! We tried it for the first time today and loved it. The orange chicken was as good as any I have tried in the past. I would totally recommend this place.", "rating": "5", "date": [2015, 5, 27]}, "8": {"description": "We have been long time residents of the east side.. Thrilled there is finally an authentic Chinese food restaurant in this area. We ordered several entrees and all were delicious. To top it off, my husband eats gluten free..we spoke to the owner Alex, and expressed our concerns about the food preparation. He was more than willing to discuss his menu options and explained everything was made to order.. ultimately they prepared an excellent gluten free meal using our own soy sauce! They may carry it in the future if more patrons request it. Basically, we will be back!", "rating": "5", "date": [2015, 7, 10]}, "9": {"description": "Fantastic authentic Chinese food. Had the the Chef's recommendation Singapore rice noodle dish. I don't like curry so asked the owner Alex to substitute anothe spicy suace. The dish was beyond fantastic!                           It was great to have Chinese food of this quality outside Chinatown which I regularly visit.  The spicy egg rolls are also a must try.", "rating": "5", "date": [2015, 7, 16]}, "0": {"description": "Had the chicken broccoli dinner which includes an egg roll, chicken fried rice and a pop. They used a little too much seasoning/salt. The egg roll was a little too greasy. The rice was on the mushy side. It was my first time here so I will definitely try something else the next time around. The staff were very friendly, which is why I gave them 4 stars.", "rating": "4", "date": [2015, 9, 22]}, "4": {"description": "Hot Wok was pretty good when it first opened but I've ordered twice in the past month and the food has been bad. Their beef and broccoli had a strange taste and I ended up throwing it out, their rice is dry and barely edible. The only good thing they have is their orange chicken.", "rating": "2", "date": [2015, 12, 15]}}, "latitude": 41.7024439573288, "neighborhoods": ["East Side"], "categories": [["Chinese", "chinese"]], "address": ["10611 S Ewing Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.5352081656456, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "10"}, "v-i-p-cutz-chicago": {"comments": {"1": {"description": "Don't ever go to this place. Just spent $50 for a 4 year old and 3 year old to get a haircut. CJ was the barber they went to and it is not worth the price. Either he ripped me off or they just they just sucker you in.", "rating": "1", "date": [2015, 10, 3]}, "0": {"description": "My hubby goes here and always comes out looking fresh and sexi! You gotta ask for Jose, he is truly skilled!", "rating": "5", "date": [2015, 9, 2]}}, "latitude": 41.7026062, "neighborhoods": ["East Side"], "categories": [["Barbers", "barbers"]], "address": ["3723 E 106th St"], "attributes": {"By Appointment Only": "No"}, "longitude": -87.5332108, "category": "Beauty", "rating": "3.0", "price": "$", "number_of_reviews": "2"}, "puccis-restaurant-and-pizzeria-chicago": {"comments": {"3": {"description": "Had a Sausage Sandwich with Fries , it was GOOD, I am very partial to the food and service at Pucci 's for me comfortable easy & good.", "rating": "3", "date": [2015, 4, 4]}, "1": {"description": "It's been 5 year's since my last review and have noticed some need for improvement.  We order the Chicken Vesuvio dinner regularly and have noticed smaller quantities of chicken pieces served in 2 of our last 3 dining visits.  The chicken in whatever presentation is still delicious as is the gravy on/in pasta dishes.  They give you a decent serving of salad or soup, of which the latter is always delicious.  I'm not being picky but you need a fresh coat or touch up of paint on your outdoor hanging sign as the sunlight has done a number on your original one.  Your pizza is very good but in my opinion but your strong suit is in chicken & or pasta dishes.  They have daily specials and we frequent there on Saturday's as the Chicken Vesuvio and Lasagna are the special of the day.", "rating": "5", "date": [2015, 4, 24]}, "2": {"description": "The best pizza in the city, they have s great thin crust and stuffed pizza and the breaded steak is second to none.", "rating": "5", "date": [2015, 4, 17]}, "9": {"description": "Meh, the food at Pucci's is only alright and the portions that I received were far from overwhelming.  I won't be in a huge hurry to return, even if its waitresses are so refreshingly genuine and nice.", "rating": "2", "date": [2010, 9, 28]}, "10": {"description": "Great Pizza!  They have great take-out or eat-in food.  It's a local family pizzeria that has good Italian cuisine as well as chicken, fish, sandwiches and pizza.  It's on US Route 41 & 20 and the Skyway/Indiana Toll-way run right by it.  Just get off at the 104th Street exit, the last before Indiana.  It's worth the stop.", "rating": "5", "date": [2008, 10, 23]}, "4": {"description": "I go there often with my mom.  Big portions and friendly service and super affordable.  Wednesday we had eggplant parmesan and spaghetti & meatballs.  The eggplant was crisp and flavorful, the meatballs were fantastic!  A good size salad or soup are included along with bread.  Total bill including 2 very cold Bud lights and one vodka martini - less than $32.   Leftovers for at least 2 meals.", "rating": "4", "date": [2014, 10, 3]}, "6": {"description": "We always get take out from here at my school because it is one of the few places nearby. The Cheeseburger is always my favorite. Its large, good and shockingly cheap. You do have to order fries separate. Don't travel down here to eat it, but if you're in the neighborhood for some reason, its a good cheap, quick bite.", "rating": "3", "date": [2010, 12, 1]}, "12": {"description": "Whenever I go to my grandmother's house to stay a night or so, I usually ask if we can order from here. They have pretty good pizza and their Italian Sausage sandwich isn't too bad either. And, i'm serious here, I know the daughter of the owner, Toni, who went to school with me. She's really hot and sometimes she delievers the pizza. How many pizza places can say that: they have a hot chick delievering your pizza. So order from here for the food and the service.", "rating": "4", "date": [2005, 9, 8]}, "5": {"description": "I have enjoyed the food from this place since it was called Duke's in the 60's. Understand I grew up on this and probably had my 1st. pizza from here.Unlike a lot of people I get a kick out of sitting at a bar I sat at as a kid.The fried chicken here is better than White Fence Farm[ Ya I said it].Pizza and beef are great.", "rating": "5", "date": [2013, 10, 20]}, "11": {"description": "It's an okay place. I like that it's family owned and the pizza girls has a dangerous job. Being cute and delivering to psychos is not fun!", "rating": "4", "date": [2005, 11, 22]}, "8": {"description": "The best damn Italian joint south of Madison Street! Family-owned, Pucci's is old-school neighborhood joint, with a small, unpretentious and simply stocked bar, and TOP-NOTCH pizza, sandwiches, and pasta. Go with the thin-crust pizza, the Italian Steak Sandwich (hint: ask for extra sauce), and the antipasto. The Gnocchi is also great. There's not a whole lot going on, maybe, on Chicago's original East Side, but if you're passing through via the Chicago Skyway or Indiana Toll Road, do yourself a favor and exit onto Indianapolis Boulevard and head south about a mile to Pucci's. Seldom crowded and usually with just one server, this quiet little place is a hidden gem. More like the cafes in Italia (except the coffee options) than just about anywhere else in the city.", "rating": "4", "date": [2008, 8, 6]}, "0": {"description": "Now this is what deep dish is supposed to be! Hearty thick pizza at a reasonable price! Though (fair warning) I have ate all kinds of deep dish, all over the city and what sets this apart is how thick it is. So this is going to FILL you up", "rating": "5", "date": [2015, 11, 7]}, "7": {"description": "I found myself in the area for an extended period of time helping an acquaintance. Scrounging for something to eat -- because they didn't have anything in the house - I came upon this place as one of the few in the area.I was really craving a salad, and after Hienie's Chicken (now known as \"Shrimp\") hung up (yes, hung up!) on my friend's teenager when he called to ask if they had a salad -- I was relieved to find that Pucci's did indeed serve salad. That is, until the meal arrived. The \"side salad\" was served in the tiniest cup I've ever seen for a salad. It was the kind of cup that would be used for coleslaw. Never a regular salad! I have to wonder what it would look like if you ordered it in the restaurant. I don't know if they were out of the utensils used for side salads -- but it is hard to believe that they would serve a salad that size in the restaurant.Needless to say, I was disappointed. The chicken we ordered was pan fried in olive oil and delicious. But they should be ashamed of themselves on that \"side salad.\" Really!!", "rating": "3", "date": [2010, 12, 13]}}, "neighborhoods": ["East Side"], "latitude": 41.712100982666, "longitude": -87.5349426269531, "rating": "4.0", "times": {"Mon": ["10:00 am", "10:00 pm"], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "10:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": ["10:00 am", "10:00 pm"], "Fri": ["10:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Italian", "italian"]], "address": ["10063 S Ewing Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Delivery": "Yes", "Wheelchair Accessible": "No", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "13"}, "birrieria-ocotlan-chicago-2": {"comments": {"3": {"description": "First time here, the birreria is the dish you want! Very small and nice atomosphere only a couple things on the menu but you have to get the Goat soup!", "rating": "5", "date": [2015, 6, 28]}, "1": {"description": "The  birria at Birrieria Ocotlan is worth the 30 minute drive from the north side.  A small portion ($8) had at least 6-7 ounces of perfectly braised goat meat, (chopped to order) , with white onion and cilantro. (Beware however, there were numerous bone splinters that made it into the soup.  The dude with the cleaver hacking the meat, needs to be more careful).  The consommé was really delicious .  Thicker in consistency than what I'm used to, but flavorful nonetheless.  It was redolent of adobo and clove flavors.  The servers come by with additional consommé free of charge. The corn tortillas had been \"browned\" , and were  almost crispy.  Warmed, still pliable,  tortillas would have been more preferable.  Add a few squeezes of lime wedges , and you're good to go.  In addition to the luscious goat soup, they also serve tacos. Don't come expecting Old El Paso ground beef taco filling here. This place serves beef cheeks, heart, tongue, head, and other offal delights. Short of flying to Jalisco, ( not a bad idea this 30° day ), it's probably the best birria you're going to find in Chicago.", "rating": "4", "date": [2016, 2, 17]}, "2": {"description": "Hands down best birreria in the city of chicago! Exceptional service and flavorful birria! A bit far from me but its worth the drive near the indiana border. Well worth it.", "rating": "5", "date": [2015, 6, 28]}, "9": {"description": "38 years and counting... so you know they must be doing something right. (This is the original Birrierias Ocotlan --don't be fooled by imitations!)Birria (goat stew) is not such an acquired taste as one would imagine. The meat is tender, the consome is hot, and the garnish is fresh. Not ready for the dish? Try a taco, goat, beef, or tongue (yes! tongue)...you won't be disappointed. The portions are generous, the prices are cheap. Wash it down with an Horchata (rice water) which is a personal favorite of mine-- it's not too sweet like at most other places. Make sure to get there early on weekends as it tends to get packed and the waiting lines get long. P.S. A sign above the register reads \"Cash Only--We're from a third world country.\" :p", "rating": "5", "date": [2010, 6, 11]}, "10": {"description": "¡El Rey del Chivo!!!! I hope I just wrote \"The King of the Goat. I can't wait to work in that area again,", "rating": "4", "date": [2012, 4, 30]}, "4": {"description": "I really enjoyed the goat from here. Stop already...its friggn awesome. Stay here or take t to go...either way the food was great. Cilantro and onion with some juices marinating in the meat and the world seems like a better place. A cold Victoria in my hand and I am comfortably numb. My mouth is watering.Damn!", "rating": "5", "date": [2014, 12, 1]}, "6": {"description": "After spending several weeks in Guadalajara last fall, I found myself craving the taste of birria tacos again. After doing some research, I decided this would be a great place to start. It definitely didn't disappoint. The staff was extremely friendly and helpful, the prices rock bottom, and the birria was loaded with meaty, savory goodness. My only regret is that I instinctively ordered 3 birria tacos, rather than trying some of the other options. But no matter, as I will definitely be back. You'd be awfully hard pressed to find a meal this satisfying at this price point anywhere in the US.", "rating": "5", "date": [2014, 7, 12]}, "11": {"description": "Best goat", "rating": "5", "date": [2011, 6, 9]}, "5": {"description": "After a little too much fun last night . This place is the place to be their birria is the best. You order yourself a birria and consome and what hangover ??? Gone !! Love this pace even for a lunch break it's good!", "rating": "5", "date": [2014, 8, 17]}, "7": {"description": "Do you love eating meat? Do you love eating meat seasoned to perfection? Then Birrieria Ocotlan is the place for you! I stumbled upon this place by accident and have had the pleasure of eating their delicious birria many times since then. The place is unassuming and the customer service is good, but you're not going there for either the decor or the staff - you're going there to satisfy your taste buds with the best goat or beef stew known to man. I've had birria at two other restaurants in Chicago and neither match Birrieria Ocotlan in flavor or quality of the meat.  The recipe is secret but is rumored to contain over 70 ingredients, I've definitely tasted cumin and suspect that a bit of cocoa might be another one. It's also rumored that Rick Bayless, of Frontera Grill fame, has offered to buy the recipe many times.  I wish this place was closer to my home, but it's definitely worth traveling to if you want to give your taste buds a treat you won't be able to find anywhere else in the Midwest, or possibly the United States.", "rating": "5", "date": [2012, 7, 30]}, "8": {"description": "My first time having goat.  It was delicious!  Got there early on a Sunday before noon, and the place had ample seating.  15 mins later, and it was packed!  The meat in the stew was fresh and the consomme was perfect.  I love that they come and fill your bowl up with more consomme or \"juice\" if you are low.  The horchata was good, not too sweet so it did not drown out the flavor of the food.  Well worth the trip!  Be sure to bring cash, as they do not accept credit cards.", "rating": "5", "date": [2012, 1, 9]}, "0": {"description": "This place has been here forever. It never disappoints! A little out the way from my house but worth the trip. I had others but it doesn't compare. Give it a try you won't regret it!", "rating": "5", "date": [2015, 8, 11]}}, "neighborhoods": ["East Side"], "latitude": 41.70244, "longitude": -87.52677, "rating": "5.0", "times": {"Mon": ["8:00 am", "5:00 pm"], "Thu": ["8:00 am", "5:00 pm"], "Sat": [], "Wed": ["8:00 am", "5:00 pm"], "Tue": ["8:00 am", "5:00 pm"], "Sun": [], "Fri": ["8:00 am", "5:00 pm"]}, "price": "$$", "categories": [["Mexican", "mexican"]], "address": ["4001 106th St"], "attributes": {"Parking": "Street", "Bike Parking": "No", "Accepts Credit Cards": "No"}, "category": "Restaurants", "number_of_reviews": "12"}, "sacramentos-tacos-chicago": {"comments": {"1": {"description": "This place is amazing! The service is great! Steak is out of this world! We stopped here on a whim after a high school game across the street. I'd live here if I lived close.", "rating": "5", "date": [2013, 11, 3]}, "2": {"description": "Damn good tacos.I just started working on the far S. E. side of the city, and I have to say, I am amazed by what it has to offer.Sacramento's Tacos being one of the highlights.Tacos are slow to come up but prepared to order. I've only had the asada so far but they are awesome. They have tortas that are to die for and more than a million different options. May not be worth the trip all the way south, but if you're near the Indiana border it is well worth a stop!", "rating": "4", "date": [2010, 9, 9]}, "0": {"description": "We eat here so much that when the boyfriend goes in here without me, the owner's daughter asks him \"where's your wife?\" :)I love Sacramento's Tacos! From the Tacos, to the Quesadillas, to the Tortas, and full dinners this is my favorite place to eat on the East Side!", "rating": "5", "date": [2012, 7, 25]}}, "latitude": 41.7104797, "neighborhoods": ["East Side"], "categories": [["Mexican", "mexican"]], "address": ["10148 S Ewing Ave"], "attributes": {"Take-out": "Yes", "Has TV": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Wheelchair Accessible": "Yes", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "longitude": -87.5356293, "category": "Restaurants", "rating": "4.5", "price": "$", "number_of_reviews": "3"}, "small-world-inn-bar-and-grill-chicago": {"comments": {"3": {"description": "Great ethnic Serbo/Croatian food and great music.  They have specials during the week and everything is so fresh, check it out!!!", "rating": "5", "date": [2015, 4, 18]}, "1": {"description": "Food is great at a fair price. 12 beers on tap. Stop on in for some Serbian food. There is always a good beer special.", "rating": "5", "date": [2015, 8, 22]}, "2": {"description": "Great neighborhood bar on the east side. Bartender's I thought were friendly, it being my first time in the place. Taco Tuesday's!!! Now everytime I have to pass through the east side I stop for a little food. The patrons are friendly and will easily start up a conversation about the game on TV. Tried to go there a few months ago,  very tricky due to the street being closed off.", "rating": "4", "date": [2015, 6, 6]}, "0": {"description": "Great place for your local Serbian/Croatian food.  Have been to this place a couple of times since they reopened and both times had good food.  This place does sell typical pub grub (burgers/fries) but goes to the next level by serving the Serbian/Croatian equivalents of them....so instead of just a burger you can get a Serbian burger which has pork mixed in.  They also have shish kabobs (again various meats including lamb) and a serbian sausage (which tasted like beef jerky).A unique experience for those willing to venture to the far Southeast Side of Chicago or from Indiana.", "rating": "5", "date": [2013, 1, 27]}}, "neighborhoods": ["East Side"], "latitude": 41.70249, "longitude": -87.54274, "rating": "5.0", "times": {"Mon": ["11:00 am", "12:00 am"], "Thu": ["11:00 am", "12:00 am"], "Sat": ["11:00 am", "3:00 am"], "Wed": ["11:00 am", "12:00 am"], "Tue": ["11:00 am", "12:00 am"], "Sun": ["11:00 am", "11:00 pm"], "Fri": ["11:00 am", "2:00 am"]}, "price": "$$", "categories": [["Sports Bars", "sportsbars"], ["American (Traditional)", "tradamerican"]], "address": ["3325 E 106th St"], "attributes": {"Best Nights": "Fri, Sat, Sun", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Happy Hour": "Yes", "Outdoor Seating": "Yes", "Alcohol": "Full Bar", "Delivery": "No", "Coat Check": "No", "Attire": "Casual", "Ambience": "Casual", "Has TV": "Yes", "Good For Dancing": "Yes", "Music": "DJ, Live, Juke Box", "Smoking": "No", "Good for Groups": "Yes", "Noise Level": "Average", "Good for Kids": "Yes", "Takes Reservations": "No"}, "category": "Restaurants", "number_of_reviews": "4"}, "lilys-supermarket-chicago": {"comments": {"0": {"description": "Make sure you go to Lilys next time you're driving under the skyway. Lilys is my favorite place to get tortas in the whole city, probably in part because of its out-of-the way charm, but mostly because they're so darn good and clean and friendly they make their own everything and they even cater and all the other things that Yelp readers like.", "rating": "5", "date": [2014, 4, 3]}}, "latitude": 41.716068, "neighborhoods": ["East Side"], "categories": [["Grocery", "grocery"]], "address": ["9863 S Ewing Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.534966, "category": "Food", "rating": "5.0", "price": "$", "number_of_reviews": "1"}, "tacos-nietos-chicago-3": {"comments": {"3": {"description": "Sweet! This place made it to Yelp!  Welcome to Yelp Taco Nietos of 106th!  I am pleased to see this because I was here some months ago and I found it be one on my top list of best Mexican food in Chicago!  Their other location on 95th is just not that good though, and I will be reviewing that one as well.When you dine here you get complimentary chips and three salsa, and spicey guacamole!  What a bargain!  The sauces are really good and have a nice burn to them.  I ordered the steak burrito and I was in burrito heaven! The steak was very tasty and juicy, and they put avacado into it for no extra cost!  This is one of the best burritos I ever had!  I also had the El Pastor taco and it was a big slice of heaven!  I will be back here at this location, maybe to try their seafood, this place is amazing, too bad I have to beat up their other location a little bit.", "rating": "5", "date": [2014, 4, 21]}, "1": {"description": "This place has the best tacos. I heard it from a lot of people and finally decided to stop by and try them myself and I'm glad I did, because now for sure I will be going back, the tacos are delicious and good size.I recommend this place!!!!!", "rating": "5", "date": [2014, 12, 10]}, "2": {"description": "Pretty good steak fajitas. The steak is cooked well and has a nice flavor. Spicy with just a hint of barbecue.  My only complaint is that it's just a tad oily. Remove that and you are golden.", "rating": "3", "date": [2015, 1, 11]}, "9": {"description": "Good Mexican food. Burritos are excellent. The restaurant itself is a bit small but it's great if you want to call ahead and pick up.", "rating": "4", "date": [2014, 9, 11]}, "10": {"description": "Tacos aren't the best but they are decent for the area. It's clean inside and the service is okay. This is as good as it gets for tacos in the area definitely no 26th street authentic tho. :/", "rating": "3", "date": [2014, 11, 4]}, "4": {"description": "Good food. Small dine in area. Staff is friendly. Busy during lunch so call in your order before.", "rating": "3", "date": [2015, 5, 20]}, "6": {"description": "We stopped into Tacos Nietos on our way out of Chicago and were so excited to get GOOD Mexican food. The waitress was friendly and attentive and the food was seriously delicious. We even got a couple of burritos to take back home! We shared a taco platter and some menudo and both were absolutely perfect. The menudo was spicy, flavorful, and full of meat and the tacos were authentic and absolutely delicious. The rice and beans were also a hit. This restaurant was our favorite part of visiting Chicago. Must go!", "rating": "5", "date": [2015, 4, 29]}, "12": {"description": "This place was great.  It's hard to find good Mexican places, in my opinion! I got a steak torta and I have to say it was one of the best tortas I ever had.  The meat was juicy and seasoned perfectly, the bread was great, the salsas were tasty and spicy, and the toppings (lettuce, tomato, avocado, etc) were fresh and crisp.  My agua de tamarindo was good too.  I gave it 4 stars because I've only tried one item off the menu, I will give it 5 stars after I go back and try more things on the menu.", "rating": "4", "date": [2014, 5, 21]}, "5": {"description": "I wanted to rate Tacos Nietos 3 stars but my first visit was a mess. Food is good, but the customer service was HORRIBLE! My boyfriend and I placed an order for pickup. The woman who took the order had us repeat so many things including the pickup name. We went to pick up, the bag of food was all wrapped up with one or two knots but the waitress guaranteed everything was there. She even read us back the order. We both nodded agreeing that everything we orders was repeated and was in the bag. We take our food and get home. The bag is being opened and food is getting passed to the person that ordered it. Only to find out I was missing my torta and cebollitas. We call back and let them know and excuse ourselves from family to go back to the restaurant. Once we get there the waitress just hands the bag and says \"here, have a nice day.\" And that's when it went downhill for my first visit. My boyfriend was upset and replied to the waitress \"not even an apology?\" The waitress was confused acting like their mistake wasn't even done. We explain to her we had to drive all the way back to get this food after being reassured everything was in the bag. All she did was give us a shrug and say \"well sorry.\" The tone she used is was pissed me off. We had to shake our heads and walk away. Sorry Tacos Nietos, the food was good but it was the staff that killed it for me.", "rating": "2", "date": [2014, 7, 22]}, "13": {"description": "In my opinion, the best tacos within a ten mile radius. Their reputation follows and satisfy my taste buds when ever I have A taco crave. Good food!", "rating": "4", "date": [2014, 9, 4]}, "11": {"description": "Wanted to like the food here, but it's just meh. Tried a steak torta the first time I went, steak was hard and gross, kinda like it was sitting on the flat top for hours. Decided to give it another shot a month or so later, had some al pastor tacos, they were just ok. Overall food was disappointing, I won't be back.", "rating": "2", "date": [2015, 3, 2]}, "8": {"description": "This place is ok was a lot better when they had the small place by 95th. They still have amazing gorditas", "rating": "3", "date": [2014, 12, 17]}, "0": {"description": "Can you believe that I had never been to the East End?Sunday morning, driving through this hood and hungry. Did not know where to go so consulted with yelp. Got to Tacos nietos wnet for it.  There with a friend. I had the enchiladas rojas and he had the chilaquiles.The enchiladas were good. Cheese and onion enchiladas, dipped on a perfect red sauce accompanied with rice, refried beans and grilled onions and salad. Service was good and reasonable prices.Tacos Nietos, I wouldn't drive the distance just to go here but if in the hood totally", "rating": "4", "date": [2015, 8, 27]}, "7": {"description": "I love there food and I think its was better then San Fransisco which is east 4 blocks from nietos. I love there salsa Verde always fresh and spicy. Fast service when you dine in. Too bad they don't have delivery.", "rating": "5", "date": [2014, 11, 30]}}, "latitude": 41.7025094602919, "neighborhoods": ["East Side"], "categories": [["Mexican", "mexican"]], "address": ["3335 E 106th St"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Ambience": "Casual", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Brunch"}, "longitude": -87.5421407913061, "category": "Restaurants", "rating": "3.5", "price": "$", "number_of_reviews": "14"}, "nuevo-chapala-restaurant-chicago": {"comments": {"3": {"description": "Fast, friendly service. 5 star tacos -- especially recommend carne asada and camaron. I plan to return to try every entrée.", "rating": "5", "date": [2015, 5, 25]}, "1": {"description": "Good food and attentive good service, family vibe throughout and definitely would recommend if you're in the area.", "rating": "4", "date": [2015, 7, 31]}, "2": {"description": "If you are the neighborhood, you have to check it out. Oh and for all of those gluten free people...they have a gluten free menu! For those of you who are not..no worries you can't taste the difference. Overall, I am very impressed with this place! The food was so fresh and the service was great. Make sure you try their ceviche!", "rating": "5", "date": [2014, 11, 9]}, "0": {"description": "I am so happy someone saw my old review and told me the old owners were back.  I traveled a distance to come check it out.  OMG they did not disappoint.  The food is once again delicious!   I absolutely love the rice.   Service was great also.  They even let me use a charger for my phone.    I will be back & I will definitely recommend them to everyone.", "rating": "5", "date": [2015, 1, 16]}, "4": {"description": "So glad the original owners are back! Food is amazing!! I've had the ceviche, huevo con chorizo, chilaquiles, tacos dorados, sopes, etc.  Everything I've had here has been delicious but the ceviche is definitely my favorite! And this is coming from a person that was never a big fan of ceviche.", "rating": "5", "date": [2014, 11, 6]}}, "neighborhoods": ["East Side"], "latitude": 41.70247, "longitude": -87.537339, "rating": "5.0", "times": {"Mon": ["10:00 am", "8:00 pm"], "Thu": ["10:00 am", "8:00 pm"], "Sat": ["10:00 am", "8:00 pm"], "Wed": ["10:00 am", "8:00 pm"], "Tue": [], "Sun": ["11:00 am", "6:00 pm"], "Fri": ["10:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Seafood", "seafood"], ["Mexican", "mexican"], ["Gluten-Free", "gluten_free"]], "address": ["3537 E 106th St"], "attributes": {"Has TV": "No", "Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Wheelchair Accessible": "No", "Takes Reservations": "No", "Attire": "Casual", "Accepts Bitcoin": "No", "Waiter Service": "Yes", "Dogs Allowed": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "5"}, "avys-pizza-chicago": {"comments": {"1": {"description": "Excellent customer service, pizza is delicious!! The price is cheap and very generous portions.", "rating": "5", "date": [2015, 8, 19]}, "0": {"description": "Not only is this place close to my house it's an amazing pizzeria the pizza never disappoints and the staff is so friendly the owner is such a sweet family guy who always has a smile on his face which makes you feel welcomed I would definitely recommend this place!!", "rating": "5", "date": [2016, 2, 18]}}, "neighborhoods": ["East Side"], "latitude": 41.715298, "longitude": -87.534897, "rating": "5.0", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["1:00 pm", "10:00 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["1:00 pm", "10:00 pm"], "Fri": ["11:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Pizza", "pizza"]], "address": ["9917 S Ewing Ave"], "attributes": {"Attire": "Casual", "Take-out": "No", "Good for Groups": "No", "Outdoor Seating": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "category": "Restaurants", "number_of_reviews": "2"}, "the-barbeque-zone-chicago": {"comments": {"12": {"description": "It's a Brand New Spanking BBQ Restaurant. It has a sportive interior decor. with pro. sport team's memorabilia. The place is equipped with a couple of LCD and or LED TVs making it a very comfortable place to dine in. The restaurant has a fast drive-thru with a wonderful service. It's Cash only however, they have an ATM. I believe the BBQ is cooked on wood (its visible when ordering) that is why it has a distinctive smoked taste.Also you can have a combination of both mild and spicy BBQ sauce on the mouth watering wings, legs and rib tips at no extra cost.", "rating": "4", "date": [2010, 5, 18]}, "7": {"description": "I absolutely love their ribs!!!! The barbecue sauce they mix with spiciness is great!!! They are delicious !!!! A little expensive but worth every penny!!! Their fries are also great !!! Just another one of my favorite spots in the neighborhood !!!!", "rating": "5", "date": [2014, 8, 7]}, "19": {"description": "This is a great spot in the area, the BBQ sauce is spectacularly spicy!!! The rib tips meaty and a light smoke taste.", "rating": "3", "date": [2011, 6, 28]}, "1": {"description": "Don't know why this place isn't named Leons because that's what it is. Ordered a large tips and links dinner HOT. It was good. Barbecue sauce wasn't very hot  I'd definitely give the place another try. Construction all around there is killing business.", "rating": "3", "date": [2015, 4, 16]}, "2": {"description": "love this place. it may be a little expensive but its totally worth it! their rib tips are to die for especially with their sauces. my friends uncles own and work at this location and they do a fantastic job!! the service here is fast and very well cleaned.", "rating": "5", "date": [2015, 6, 20]}, "9": {"description": "These guys are from Leon's on Archer! My friends and I went to this place on a whim and it was such a great surprise.Must be the same cook too because the chicken and the sauce are the exact same and I absolutely LOVE THEM. The sauce is amazing. And it's a great portion size for the price. The place is clean and the guys are friendly.I just wish there was one a lot closer to me - I'm on the northwest side - and that they accepted credit cards (even though there's an ATM).", "rating": "5", "date": [2013, 10, 2]}, "6": {"description": "The rib tips are some of the best I've ever had.  A perfect mix of fat and meat.  The hot BBQ sauce is the best I've ever had for a hot BBQ.  Actually hot.  Very very good.", "rating": "5", "date": [2014, 5, 8]}, "18": {"description": "i guess i'm spoiledhaving had ribs at heckys and carsons and pete millers, i guess i expect a lot from ribs.  these were so-so, nothing special.  the sauce was good but the meat wasn't great and wasn't even good as leftovers for lunch the next day..also ordered chicken.  i guess i should have asked first, but i assumed (stupid me) that the half chicken would be BBQ, especially since they asked what kind of sauce i wanted on it.  to my surprise, it was fried chicken.  it was just okay, but not grilled, BBQ'd or smoked.the slaw was gooey, too much dressing for me to eat.  disgusting.the fries were great, except about 2/3s of them were hot, the rest cold.the service was fast and friendly.i don't often find myself on the east side at all, much less at dinnertime, but next time i would hesitate to stop here again.", "rating": "2", "date": [2012, 2, 29]}, "10": {"description": "Where do I start?  Why in the world is they using the name The Barbecue Zone and then when you get there, they are called Leon's. Confusing and could be causing they the lost of some business. Anyway...... I grew up on Leon's when it was on 79th and Stony Island, 59th and Racine and so on. It took me over twenty something years to find this place again, but as soon as I walked in the smell brought back memories. I will die for there mild hot links.  Now that I have found them, I've been there almost every week with in this last month to get me some links.  That's just how much I love them and come to find out that they are just minutes away from me. The pork ribs was still as tender as they was back then. Angry........ All the money I spent looking and trying links at other rib places, when all I had to do is what I did this time. The only way I found them was by doing a search on the internet to see what the history was on them and why they went out of business in the hood. And then found that there was a location out there that I refuse to visit because it's called The Barbecue Zone.", "rating": "4", "date": [2015, 2, 5]}, "13": {"description": "This is one of the few drive throughs in the area that isn't a chain.  The food is delicious and I like to stop by for a snack on my way home from work. One thing I'd like to see is smaller,  snack sized portions.", "rating": "4", "date": [2013, 1, 15]}, "16": {"description": "We're always driving into somewhat questionable neighborhoods to get our rib fix, screw political correctness, we go into really questionable neighborhoods to get Uncle John's or Barbara Ann's or Lem's.  We drive by The Barbeque Zone on occasion and thought it looked like a nice joint so we finally tried them.  We got hot links and ribs, both very good.  The hot links perhaps not as \"hot\" as some of the southside places but still very good.  And the ribs fell right off the bone, tender and flavorful.  We will definitely go back!We got it for pickup so I didn't actually go inside but my husband said it was very clean.  And no bulletproof glass.", "rating": "4", "date": [2012, 3, 11]}, "17": {"description": "Excellent Ribs, Hot Links & Chicken!!!!  Don't forget the Rib Tips!!!  Clean place, great barbeque, fast service & not far from the Skyway...  It's nice to eat in or drive thru. Check it out, I do believe you will be pleasantly surprised....", "rating": "5", "date": [2011, 5, 12]}, "15": {"description": "The Mild Rib Tips are amazing! They fall off the bone the second you try picking them up. Very clean interior. There were only 3 workers there and one other customer. This was our first time stopping here. I don't know how new they are but more people should visit. They have several high top tables, a few TVs, LARGE portions and a great price. My husband and I both got the Large Rib Tip dinner (came with a ton of sauce, handful of fries and 2 pieces of bread) and a side order of coleslaw. Honestly I'm not a big fan of the coleslaw but the Rib Tips were so good. We have a lot left over for a whole second meal. They only take cash right now but like the other review said there is an ATM machine in the building. We'll be going back very soon!", "rating": "5", "date": [2011, 2, 12]}, "0": {"description": "Great place! The ribs are really good.  The guys are Nice and friendly to me every time I order catering. The spicy sauce is very \"spicy\", i highly recommend you get it on the side for your wings. The only thing is its cash only.  Atm is on site.  Great for a snack or for a big event too.", "rating": "5", "date": [2014, 10, 22]}, "5": {"description": "Awesome ribs! I recommend going there around noon when the ribs seem fresh off the smoker!", "rating": "5", "date": [2015, 3, 1]}, "11": {"description": "Great rib place on the East Side. Staff is always friendly and the food comes out hot and fast. The only issue I have is that I wish the inside felt more like a restaurant instead of a fast food joint. The Ribs and Wings are awesome!", "rating": "4", "date": [2014, 5, 28]}, "8": {"description": "Friendly atmosphere and a very clean restaurant. They give you very fair portions but the price is a little expensive for what it is. I got the rib tips which weren't great. My friend got fried chicken wings which were pretty well burnt. Probably just a bad day but bad enough that I wouldn't go back or recommend it to a friend. It's annoying to me when a restaurant only takes cash and has an ATM in house that has a hefty fee for use. I understand that credit card fees stink for a small business with tight margins but don't pass it onto the customer. A lot of these ATMs charge the customer an upfront fee for use then the bank docks you for using an out of network ATM. Some restaurants actually make money off you using their ATM so you can pay them in cash, not cool.", "rating": "2", "date": [2014, 11, 24]}, "3": {"description": "Ribs are good! Staff is friendly. Great barbecue sauce! Shrimp is good too. Can't wait to go again", "rating": "4", "date": [2015, 5, 20]}, "14": {"description": "I recently orderd a pan of rib tips for my car club picnic, this being my first time ordering from here i was praying my members gone enjoy it. Exactly everybody loved it and they are reasonable. Defly, going back for me some more ribs and they links. I found me a new spot even tho its 20 mins away from me.", "rating": "4", "date": [2012, 8, 27]}, "4": {"description": "Customer service is fantastic! And the food is great! Not to mention that the building is beautiful it helps the community Their BBQ sauce is insanely delicious! And they have a drive through! Service is fast and they accept cc now!", "rating": "5", "date": [2014, 8, 14]}}, "latitude": 41.7024918, "neighborhoods": ["East Side"], "categories": [["Restaurants", "restaurants"]], "address": ["3309 E 106th St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "longitude": -87.5432968, "rating": "4.0", "price": "$$", "number_of_reviews": "20"}, "papi-real-taco-taqueria-chicago": {"comments": {"0": {"description": "One night I was stuck at home with no husband to feed, no homework to do and very very hungry. I was hankering for the one thing I knew could end my salivating hunger pains: a burrito suizo.  So I looked in my menu envelope where I keep all the delivery propaganda that attaches it self to my door.  Aha! I found a new place just around the corner from my home.  So in I  went to Papi Real Taco Taqueria.  The first thing I noticed is that they have an outdoor sound system. I could hear Spanish Rock as I walked into the establishment. I was greeted warmly by the cashier and read her menu on the wall above. I ordered and sat down in a table right off the stand up refrigerator.  They have a wide variety of soft drinks and natural fruit juices.  It is painted a nice shade of yellow and decorated tastefully with Mexican touristy decor. Nicely lit and clean with 8 tables and can fit about 28 people very well in this place.Sample menuBreakfastHuevos a la Mexicana 5.50Chilaquiles 5.99Huevos Divorciados 5.50Tacos 2.00 Sopes 3.00 Gorditas 3.00 Tostadas 3.00Chicken, Asada, Al Pastor, Carnitas, Picadillo, Nopales, Chorizo, TongueHuaraches 4.95Same as above also Chicharron en salsa verdeQuesadillas with meat 3.50Tortas  4.50 -6.00Milanesa, Ham and Hawaiiana tooSandwich with above meats and lettuce, cream, avocado and beansFlautas (4) 5.00BURRITOS Reg. 4.50  Suizo 6.75Choice of meat filling andBeans lettuce tomato s. cream with cheese melted on topFries 1.80 Guacamole and Chips 3.00 Shakes/Licuados 3.50 Soda .88 canAnd that is exactly what I ordered! A burrito suizo made with steak/asada.I got it in my hands in about 5 minutes.  They also have hamburgers and sincronizadas at 3.50 a pc. I walked home and very heftily swung the burrito in my plastic bag until i reached my steps.  I opened the aluminum wrapping and it was full of meat and cheese. Some places give you too many beans as filler in your burrito not this one. Good flavor over all. It was gone in about 8 minutes flat! I am a slow eater and savor every bite.Try them next time your home alone!They do deliver + 2.50 charge and you have to order 10.00 or more of food.They also make Menudo 7 days a week.Hrs 11- 9pm Mon - SatSunday 12-7773-374-7509", "rating": "4", "date": [2011, 1, 6]}}, "latitude": 41.7027819156647, "neighborhoods": ["East Side"], "categories": [["Mexican", "mexican"]], "address": ["3544 E 106th St"], "attributes": {"Good for Groups": "Yes", "Waiter Service": "Yes", "Alcohol": "No"}, "longitude": -87.5373177230358, "category": "Restaurants", "rating": "4.0", "price": "$", "number_of_reviews": "1"}, "route-66-chicago": {"comments": {"12": {"description": "Love their pizza any kind is good but their  Hawaiian pizza is great !!!  Not to mention their hamburgers yum. I was addicted to there jalapeño hamburger!!! And there hamburger with ham!!! I always keep going back!!!", "rating": "5", "date": [2014, 8, 7]}, "7": {"description": "Me: Are you hungry?Husband: Yeah, we should stop somewhere before we get to that desert island of GaryMe: Any ideas?Husband: We can do Mexican or pizzaMe: I was eyeballing a Mexican joint off CommercialHusband: Yeah, that sounds decent or we can do pizzaMe: I noticed this fried fish place that sounds goodHusband: Yeah, fish would be good, but I had fish earlier. What do you think about pizza?Me: So you really want pizza huh?Husband: I been wanting to try this place off Indianapolis. Me: Pizza it is thenI found the place on Yelp. And of course the other Yelpers were right, no phone. So we take a chance and pull up hoping they were open.Not only were they open, they were busy. And they assured me that they do have a phone, they just have sucky service.What we ordered:Large hand tossed pizza extra sauce with light onionsBroasted 8 piece chickenThe chicken came with coleslaw, fries, and garlic bread. Chicken was delish, fried beautifully, and quite flavorful; no need for hot sauce. The coleslaw was sweet and quite gross. Fries were the frozen kind and went uneaten. Bread was bread.The pizza was very good. Sauce was tangy, cheese was good, crust was decent. The crust left a little too be desired but it wasn't a game killer.I would definitely recommend the place over anything in that area. If it wasn't so far I can see them being a place that we hit at least twice a month for our pizza fix. Hell that sounds like good plan.Happy Eats!", "rating": "4", "date": [2013, 12, 12]}, "20": {"description": "Okay, I'm a fan of this place for ONE reason only:ROUTE 66 STUFFED PIZZA.If you're from the East Side, you REMEMBER Giappo's Pizza. RIP to that place. I don't know a single person who DOESN'T miss that place. Well, this stuffed pizza might the second coming of Giappo's! It's definitely worth a try! Crust is flaky, the sauce is superb (I get my pizza with a little extra sauce, though), and the sausage and mozzarella taste really FRESH (the sausage even has those little seeds in there..YUM!).As a former hostess at Giappo's Pizza (believe me...I KNEW my Giappo's Pizza!) this pizza gets the Rebecca Campos STAMP of APPROVAL!", "rating": "4", "date": [2010, 7, 15]}, "19": {"description": "Best pizza on the East side! The owner and staff are very friendly. Food is always fresh and they don't go cheap on the toppings. I love the hand tossed pizza. The chicken fingers and parmesan chicken sandwich are also very good.", "rating": "5", "date": [2012, 10, 16]}, "1": {"description": "Had a slice of sausage while waiting. It was decent. I would get again. Cheeseburger with grilled onions was tasty, although frozen party. Got home fries were BURNED. PISSED", "rating": "3", "date": [2016, 1, 29]}, "2": {"description": "Well I came here by mistake and was surprised how good the pizza is . The chicken and fries were extremely good you may say chicken is chicken but the chicken was very flavorful . I seen the burgers that were being made and wish I would of ordered one but I will go back and try them", "rating": "5", "date": [2015, 3, 8]}, "9": {"description": "A true hole in the wall, yes it's small but it does serve up some big tastes. Pizza slices were pretty good, I enjoyed the sausage which isn't usually my favorite but my husband thought it was just okay. I did spot a few fresh whole pizzas being boxed and those looked really good. I find slices never are as good as a fresh whole made to order pie, and I'm usually disappointed so to find a slice I like is saying something.We also ordered a two piece broasted chicken to take home just to see if it was any good, for a reasonable 4.65 I got a breast, wing, fries, slaw and garlic bread. A definite meal for sure. The chicken was juicy and crisp, the slaw tangy without swimming in mayo, and the fries were crispy without being overdone. Sounds like the ultimate fast food meal, but it's not. You need to allow 20 minutes at least for chicken broasting magic. If you're lucky enough to snag the parking spot in front of the door they'll wave at you while you wait in your car, because the waiting area is maybe 4x5 sq. if that.The only tip I can give you is just south of the place is a speed camera, so I'm not sure if my under 15$ meal is really 115$ but that's not their fault. Although, we were talking about the flash while we were walking in, their driver called it \"blinkey city\" odd I didn't see a school, or park. Will have to take a look the next time I roll through their slowly.", "rating": "5", "date": [2014, 5, 24]}, "6": {"description": "Route 66 isn't bad pizza. It will not \"wow\" you with its taste or fresh ingredients. Little pools of grease in indentations of the cheese are a way of life. Overall, though, it is a decent balance between cheese and sauce. Their crust is crisp and sweet. Would I go out of my way for a slice? No. I will continue going here because of its convenient location and friendly staff.I will also mention the lot is tiny so expect to park on the street (not a problem).", "rating": "4", "date": [2014, 12, 2]}, "18": {"description": "Okay, I'm a fan of this place for ONE reason only:ROUTE 66 STUFFED PIZZA.If you're from the East Side, you REMEMBER Giappo's Pizza. RIP to that place. I don't know a single person who DOESN'T miss that place. Well, this stuffed pizza might the second coming of Giappo's! It's definitely worth a try! Crust is flaky, the sauce is superb (I get my pizza with a little extra sauce, though), and the sausage and mozzarella taste really FRESH (the sausage even has those little seeds in there..YUM!).As a former hostess at Giappo's Pizza (believe me...I KNEW my Giappo's Pizza!) this pizza gets the Rebecca Campos STAMP of APPROVAL!", "rating": "4", "date": [2010, 7, 15]}, "10": {"description": "Great burgers especially the the Harley and the jalapeño burger those r the ones I get all the time and they r pretty big in size so keep that in mind they also deliver!!!!!!!", "rating": "4", "date": [2014, 10, 31]}, "13": {"description": "I love the pizza here. I've only had the deep dish(stuffed, whatever you want to call it) but it was the ABSOLUTE BEST I HAVE EVER HAD! The sauce is perfectly seasoned, the cheese is plentiful and the sausage...OMG the sausage is amazing. I don't even like to eat sausage but the way it tastes is better than any I've ever had. The only reason this place is 4 stars instead of 5 is because they no longer deliver to South Deering :(", "rating": "4", "date": [2014, 7, 21]}, "16": {"description": "Just ordered from them today and they no longer deliver to South Deering.  The food is still good but beware that delivery may not be available in your area.", "rating": "4", "date": [2014, 7, 20]}, "17": {"description": "Seth and I just ordered an extra large cheese, hand-tossed pizza from this place.  I plan to eat it when I get it home.  As many Yelpers typically note, Yelp doesn't allow for \"half stars\".  I'm neither for, nor against this policy.  I just got back from a weekend in NYC.  My favorite pizza spot in NYC is John's of  Bleecker Street.  Thanks.", "rating": "5", "date": [2014, 1, 5]}, "15": {"description": "I love this lil hole in the wall, a needle in a haystack, place. their pizza is the s%it as in amazing. although my only problem is that this place is sooooooo darn tiny I couldnt find it. It was crazy I think I spent 30 mins looking for this place with the help of the cashier and gps and directions...(no joke and dont make fun) i really couldnt find this place and I wasnt even drunk....lol(joking ....dont drink and drive its really bad for you and your health)...I was driving down the street doing like 5 mph and still missed it..lol..it was crazy and if it wasnt for the fact that I had placed my order for pick, I would have felt bad if I didnt go get it, plus I wanted pizza, I would have said forget it...crazy but I am glad I found this palce because there pizza is yummmmmmyyyyy....When I finally found the place, it was a lil shack with a counter, and the kitchen and thats it, you couldnt sit anywhere and I think only 3 people could fit in the building at a time but I am willing to overlook all that because they provided excellent customer service for the hood and great food.....I will be back", "rating": "5", "date": [2013, 2, 4]}, "0": {"description": "Had them cater our dad's 75th bday last minute and was blown away by how delicious everything was!  Beef, rolls, sausage w/ peppers and onions,  chicken,  salad and mostaccioli were all awesome. $250 or so to feed 35 people and plenty of leftovers!  Would definitely use them again!", "rating": "5", "date": [2015, 11, 12]}, "5": {"description": "Can't go wrong with the hand tossed pizza.  All their sandwiches are good but the hamburger is the best on the south side.", "rating": "5", "date": [2015, 8, 29]}, "11": {"description": "Too greasy for me and I always get sick after eating here. A lot of people love this place but if can't take that much greasy food stay away. Also there pizza is greasy as well.I'll stick to capris or hienes.", "rating": "1", "date": [2014, 11, 30]}, "8": {"description": "You have to try the sausage - red pepper pizza Fantastic!!! Great Burgers and chicken.  Great carry out, or in the summer they have a picnic table outside. Keep up the good work, thick or hand tossed pizza, you will enjoy the experience.", "rating": "5", "date": [2015, 4, 18]}, "3": {"description": "Amazing burgers and Italian beef sandwich at a reasonable price! Although their pizza is mediocre at best. Nonetheless their burgers are what keeps me coming back.", "rating": "4", "date": [2016, 1, 2]}, "14": {"description": "I finally tried the stuffed pizza I've heard so much about.  While the menu offers two sizes I was informed, \"we don't have small\".  So be it.  At least they didn't tell me it had to be grandi.  While an hour wasn't totally out of line, it seamed a bit long for an early Tuesday evening.  The pizza wasn't bad, but nothing special.  My \"small\" sausage seemed to taste very strongly of onions.You can do much better.  Try Capri in Whiting.  Their stuffed is outstanding.", "rating": "2", "date": [2014, 7, 8]}, "4": {"description": "Burgers are awesome!! And fairly priced!!", "rating": "4", "date": [2015, 10, 23]}}, "neighborhoods": ["East Side"], "latitude": 41.7103264, "longitude": -87.5329945, "rating": "4.0", "times": {"Mon": ["10:00 am", "10:00 pm"], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "11:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": ["10:00 am", "10:00 pm"], "Fri": ["10:00 am", "10:00 pm"]}, "price": "$", "categories": [["Pizza", "pizza"]], "address": ["10180 S Indianapolis Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Ambience": "Divey", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "21"}, "la-florencia-bakery-chicago": {"comments": {"0": {"description": "This place has the best \"Rosca de Reyes\" (Kings'/Magis' doughnut, literally) around the South Chicago and Northwest Indiana! (Google the Mexican tradition of eating this pastry around January 5th and 6th as part of Christmastime celebrations if you don't recognize the term.) Most roscas you buy around the area are pretty dry and almost stale with bad toppings, but this one has a moist bread with good quince or fruit candy (\"cajeta\") on top with a paste like Mexican concha pastries have. Large and small sizes available. Also, when it's not Christmas, try their other pastries and baked goods, which are mostly a bit better than some of the local competing bakeries. This place a bit tucked away, and even locals sometimes pass this up. But now you know, so don't pass it up!", "rating": "4", "date": [2016, 2, 17]}}, "latitude": 41.7055206, "neighborhoods": ["East Side"], "categories": [["Bakeries", "bakeries"]], "address": ["10429 S Ewing Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No"}, "longitude": -87.5349121, "category": "Food", "rating": "4.0", "price": "$", "number_of_reviews": "1"}, "walgreens-chicago-200": {"comments": {"3": {"description": "This is your typical \"90s\" Walgreens. It doesn't have all the bells and whistles of the new revamped Walgreens and actually closes at night! It's a little cramped, but I love it! This is \"my\" Walgreens in town and I love the coziness.", "rating": "4", "date": [2012, 9, 9]}, "1": {"description": "The service is good. The store is clean and the cashiers are friendly and helpful. They are willing to help out with any questions you have.", "rating": "4", "date": [2014, 9, 1]}, "2": {"description": "This was a great Walgreens and the staff was incredible.  I had (3) 2 liters bottles and they were mis priced the cashier went to check where I got the soda from and she apologized and gave me the soda for what was posted.Now, I know that is what they are suppose to do but she did it with a smile and that is always important to me!", "rating": "4", "date": [2012, 11, 6]}, "0": {"description": "Nancy rocks! I'm gonna miss her when she finishes her coursework at University! Reward her like the dedicated employee she is!!!", "rating": "5", "date": [2014, 12, 4]}}, "neighborhoods": ["East Side"], "latitude": 41.702469, "longitude": -87.535988, "rating": "4.5", "times": {"Mon": ["8:00 am", "10:00 pm"], "Thu": ["7:00 am", "10:00 pm"], "Sat": ["7:00 am", "10:00 pm"], "Wed": ["7:00 am", "10:00 pm"], "Tue": ["7:00 am", "10:00 pm"], "Sun": ["8:00 am", "10:00 pm"], "Fri": ["7:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Drugstores", "drugstores"], ["Cosmetics & Beauty Supply", "cosmetics"], ["Convenience Stores", "convenience"]], "address": ["3611 E 106Th St"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "4"}, "waldo-cooneys-pizza-chicago-4": {"comments": {"3": {"description": "Waldo's their hot/barbecue chicken wings are pretty they come with ranch sauce, at a decent price but the delivery time suck. Took over hour and fifty minutes. Which I timed If you guys want your food fast ask for pick up!", "rating": "2", "date": [2014, 3, 9]}, "1": {"description": "Ultimately it was dissapointing. This was the first time I had eaten from here since 2008. It was better then, it was far below par for a pizza. Too salty not enough cheese, the sauce was similar but too salty and not as sweet as it used to be. It wasn't the worst pizza I've had but not the same Waldo's as it used to be.", "rating": "3", "date": [2015, 6, 6]}, "2": {"description": "Stay away, stay away, and whatever you do, DO NOT ORDER ONLINE!!! The pizza is ok but beware of hire you order it. Delivery is slow no matter where you stay. They charged my credit card twice for the same order, when I tried to speak to someone about it they gave me the run around saying i need to speak to a manager and they don't know when he comes in.UpdateAfter this review, the manager reached out to resolve the issue and gave me an in-store credit. The manager also went on to explain they were having problems with the online ordering.", "rating": "3", "date": [2014, 4, 25]}, "5": {"description": "My experience with Waldo's is they are hit or miss.  Sometimes you get a good pie, sometimes not.  And it always doesn't taste the same.  Plus they are more expensive than some of the other places in the area.  Also, they only give you a 1-liter pop for ordering a large or bigger pizza. The norm is 2-liter.The best pizza I've had here is the Mexicana.  It has cheese, ground beef, jalapenos, onions, tomatoes, and chili peppers.", "rating": "2", "date": [2009, 12, 2]}, "6": {"description": "When I was a senior in highschool my basketball coach always got pizza from this place when we had games in the southside. Whew! It sits in your stomach though and you feel heavy and then you have like the best sleep in the world. Worth trying, and the best medicine for a girlfriends who talks to much!", "rating": "5", "date": [2005, 11, 14]}, "7": {"description": "Waldo Cooney's has very good pizza. It's similar to \"Giappo's\", but I prefer the latter. Worth checking out.", "rating": "4", "date": [2005, 8, 10]}, "0": {"description": "Get the calzone but be prepared to split that b**** is one big mother", "rating": "5", "date": [2013, 6, 5]}, "4": {"description": "This is an update of my earlier review.Six years later and the quality is gone way downhill.  The last few times we ordered pizza with extra cheese there has been no extra cheese. This time there wasn't even enough to cover the exposed dough in the center of the pizza. No cheese either within two inches of the edge of the crust all the way around.  The garlic bread was flat, dry and hard. Inedible unless you like shoe leather.We won't be ordering from this business anymore. Money is too hard to come by just to throw it away on nonexistent extra ingredients.This place used to be great... maybe it's just this certain store. Who knows. No interest in finding out.", "rating": "1", "date": [2013, 1, 20]}}, "latitude": 41.7026051, "neighborhoods": ["East Side"], "categories": [["Pizza", "pizza"]], "address": ["3651 E 106th St"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Delivery": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Wheelchair Accessible": "Yes", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "longitude": -87.5345176, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "8"}, "ocotlan-chicago": {"comments": {"0": {"description": "Barbacoa de chivo. Good but It could be better. Consome needs better flavor. Meat is good", "rating": "3", "date": [2011, 7, 31]}}, "neighborhoods": ["East Side"], "latitude": 41.7024421691895, "longitude": -87.5265731811523, "rating": "3.0", "times": {"Mon": ["8:30 am", "6:00 pm"], "Thu": ["8:30 am", "6:00 pm"], "Sat": ["8:00 am", "6:00 pm"], "Wed": ["8:30 am", "6:00 pm"], "Tue": ["8:30 am", "6:00 pm"], "Sun": ["8:00 am", "6:00 pm"], "Fri": ["8:30 am", "6:00 pm"]}, "price": "$", "categories": [["American (New)", "newamerican"]], "address": ["4007 E 106th St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "1"}, "skyway-dog-house-chicago": {"comments": {"36": {"description": "I'll go way out of my way to get here--@#$% the Skyway tolls, I'll spend that on my hot dogs.  The question of your favorite hot dog stand is a weighty one in Chicago.  For your basic garden variety hot dog (i.e., not charred, spiced, etc.), this place has my vote.Nowhere to sit inside, but I'm a big fan of sitting at the picnic tables outside (which have a canopy to keep you in the shade or out of the rain), and enjoying the East Side atmosphere.", "rating": "5", "date": [2009, 4, 1]}, "29": {"description": "They have great chicago style hot dogs and french fries.  Don't know too much about the other stuff.  One thing I do know is that they are clean, quick and cheap.", "rating": "4", "date": [2010, 11, 17]}, "42": {"description": "To quote Patton Oswalt-\"Nummers.\" Skyway Dog House is small and tucked away but believe me when I say that it was some of the best hot dogs and hamburgers in Chicago. This place is so good that it is a must for whenever we visit Chicago. The bun is black sesame, hot dog is Vienna, be it Chicago Style or however you like it, it's delicious! Top it off with an order of fries, a soft drink and a pizza puff, you'll be completely satisfied. ^__^ Enjoy.", "rating": "5", "date": [2007, 9, 26]}, "23": {"description": "Skyway the best Chicago style hotdogs and burgers. Definetly a stop on the way home", "rating": "4", "date": [2011, 6, 20]}, "31": {"description": "Like Josh N, I settled into this homey East Side staple for a delicious chocolate shake. What I received was a churning chocolate maltED. It started off well enough. Then, it got questionable. Then, it crossed into the danger zone. My belly gave me a 2-minute warning that some bad stuff was about to happen if I proceeded further. Don't get me wrong: it wasn't prepared badly. I just *hate* malt. It grosses me out. Whoppers are repugnant to me. The only appropriate place for malt in my belly comes via Colt .45 (or, more recently, Smirnoff Ice; revenge is a dish best served cold, my dear Ms. Curtis!). That's too bad I was grossed out because the store is pretty cool. It's small but functional. It's survived a car running straight through it. It has extremely polite high schoolers working there (one who even recognized my college t-shirt because her friend is attending my alma mater come Autumn). I don't know that I would race down to the East Side to come back but if in there neighborhood, I would stop in for some dogs, fries (with cheese) and SODA. I notice a variety of brightly-colored, fruity-flavored concoctions. You know those are a weakness of mine.", "rating": "3", "date": [2010, 6, 12]}, "34": {"description": "This one brings me back...Lived about a half-mile away growing up. Everyone in the area knows about it, has eaten there, and has dug it! Excellent place to go when you're just craving some good, old-fashioned, greasy American fast-food. The dogs are great and the fries are good (thicker-cut). When it comes to hot dogs on the East Side, I do favor Harmony's slightly, but Skyway definitely queches the craving as well. If this place ever closes, it will be a definite loss for the East Side.", "rating": "4", "date": [2009, 10, 16]}, "16": {"description": "Looking out at and being near large bodies of water was a great form of  relaxation for me when I was living in Hawaii, and now that I am back in Chicago, I try to get over to Calumet Park at 95th and Lake Michigan whenever I can to enjoy our Great Lake.Located at the North entrance to the Park on 95th Street is a tiny place called Skyway Dog House. There is very little seating in there, (and a couple of picnic tables outside) so I decided to get my hotdog and drive over and park by the Lake. There is also a \"Drive-thru\" which is ideal for people going to the Park.I ordered the Chicago Style with everything. The young ladies who worked there were extremely polite and I had my food in less than 5 minutes. Hot Dog and fries: only $2.39!The hotdog was wrapped together with the fries, which adds a certain flavor to the hotdog and I liked it. It had cucumbers, tomatoes, celery salt and sport peppers.  The poppy seed bun left little black pellets all over my car, so I recommend eating it outside. A really good hotdog by my standards.I heard that the burgers and Italian Beef are good too. So if you are into a lakeside lunch, hit the Skyway Dog House drive-thru and head over to Calumet Park.skywaydoghouse.com", "rating": "4", "date": [2013, 4, 7]}, "11": {"description": "Love this place. Family owned. I have been going here since i was a kid. Cant complain at all about the food. Basic hamburger and hotdog joint.Try the cheese fries with a chicago style with extra peppers ( if you like a kick to your food) but remember this is a CASH ONLY SPOT", "rating": "5", "date": [2015, 1, 23]}, "39": {"description": "This place is great I remember going there as a kid and biting into a chicago style hot dog with fries that were to die for. I havent been there recently but there is always a police officer there so I kind of feel safe.They also have an very attractive all girl staff. I go there for the hot dogs but I stay for the girls.        It's almost impossible to miss because of its location on the corner and there drive thru makes it possible for an easy order and go. All and all this place is great if you really want to experience a real chicago style hot dog.", "rating": "5", "date": [2008, 11, 5]}, "37": {"description": "Love the hot dogs, cheese fries and mozzerella stcks. Its hot dogs so there's really not much. This is more of a take out place.  The place is really small but whatever. Did i mention its really cheap also?", "rating": "5", "date": [2009, 3, 2]}, "0": {"description": "One of the best Chicago dogs in the city comes with fries. Try the shaggy dog for something different ( sauerkraut and Swiss )", "rating": "5", "date": [2015, 8, 29]}, "38": {"description": "Best of the what I like to call \"Everything\" restraunts, or dog houses.  My meal at this place consists if so many different things, it would make most people sick.FOOD:  Great.  The first time I ever had a mozarella cheese stick was from here and it blew my mind.  The dogs are great.  The nachos are ballpark style.  Tamales are ok... go across the street for better ones.  Sandwiches and more... the list goes on.DRINK:  Fountain Pop.  Self serve.  All the good stuff.ATMOSPHERE:  I love this place.  I dont exactly hang here, but I have eaten at the window a few times.  Just a bunch of young girls serving up your great food.  You can read various articles on the wall about the establishment and the time somebody drove a car through the wall.  My dad used to take my brother and I here when we were little in the 80's.  We would sit by the bridge and wait for boats to come to watch the bridge go up.  Sometimes we would sit at Cal Park and throw fries to the seagulls.  This place has great food and great memories.", "rating": "5", "date": [2009, 2, 27]}, "27": {"description": "Skyway Dog House is alright, but nothing more.  The women that work there are lovely.  However, one lady who took my order shorted me two dollars when she made change for a $20.  To be fair, she looked young and mistakes do happen, but she needs to learn how to do her sums better.  When I pointed out that she owed me another two dollars, she kind of froze and didn't know what to do.  One of the other ladies there came over and fixed it so everything was right.  Let's get on to the grub.The jumbo hot dog was pretty standard; nothing served to distinguish it from zillions of other jumbo dogs available across the Chicagoland area.  The fries were basic foodservice fries.  Nothing exceptional.A second jumbo dog was ordered charred.  When I asked for it charred, the same inexperienced lass who short changed me in our first exchange had no idea what a char dog was.  After figuring out that she didn't know what I was talking about, I told her to ask one of the gals in the kitchen.  This she did, and one of the grill girls told me that there was no charcoal grill in the stand (fair enough; lots of places lack charcoal grills), but she'd be able to do something for me.  I guess she said that she'd grill it on the griddle, but I couldn't make out what she said.  Anyway, she butterflied my dog -- not my favorite style of preparation, but not an uncommon one -- and grilled it up.  When it came without the hot peppers that I had asked for, I didn't bother going back to the counter; there had been enough SNAFUs for one night.All in all, despite the graciousness of the ladies working at Skyway Dog House and the friendliness of the patrons, I don't think that I'll be making a return trip.  It just isn't worth the drive for me.  By the way, if your idea of an urban adventure in Chicago is grabbing a mocha-frappe-foolish drink in Lincoln Park or Andersonville, then you might want to skip a trip here.  The area is a bit hit or miss from block-to-block, and while nothing has ever happened to me, you are left with the sense that there is a remote possibility you could get yourself into trouble if you inadvertently roll through the wrong neighborhood.  Stick to the main drags, buy only sandwiches, and you should be alright.  It's gritty, but odds are that you should be fine.", "rating": "2", "date": [2011, 3, 8]}, "32": {"description": "Stopped in for milkshakes with some yelpers after a trip to Calumet Fisheries.  A vanilla shake sounded great at the time, but I had no idea that they would be using malted milk, which I find to be totally gross.  The menu says \"shakes and malts\", so I assumed that you could have a vanilla shake or a vanilla malt.  It is just the malt.  Strawberry, on the other hand comes as a shake and is actually pretty good.If you hate the taste of whoppers or \"maltizers\" as my worldly friends were calling them, then avoid the vanilla and chocolate shakes here.", "rating": "3", "date": [2010, 5, 16]}, "13": {"description": "Like Josh N, I settled into this homey East Side staple for a delicious chocolate shake. What I received was a churning chocolate maltED. It started off well enough. Then, it got questionable. Then, it crossed into the danger zone. My belly gave me a 2-minute warning that some bad stuff was about to happen if I proceeded further. Don't get me wrong: it wasn't prepared badly. I just *hate* malt. It grosses me out. Whoppers are repugnant to me. The only appropriate place for malt in my belly comes via Colt .45 (or, more recently, Smirnoff Ice; revenge is a dish best served cold, my dear Ms. Curtis!). That's too bad I was grossed out because the store is pretty cool. It's small but functional. It's survived a car running straight through it. It has extremely polite high schoolers working there (one who even recognized my college t-shirt because her friend is attending my alma mater come Autumn). I don't know that I would race down to the East Side to come back but if in there neighborhood, I would stop in for some dogs, fries (with cheese) and SODA. I notice a variety of brightly-colored, fruity-flavored concoctions. You know those are a weakness of mine.", "rating": "3", "date": [2010, 6, 12]}, "24": {"description": "It's a good hot dog joint.  Definitely not someplace I would drive out of my way to eat at but if I'm passing it by and happen to be starving I would eat there again.My husband, son and I all ordered the 1/4 lb. hot dog, fries and drink meal for $3.99.  We ordered them Chicago style and it was good but I wouldn't say the best I've ever had.  But... the cheese fries really were quite yummy and the biggest reason I gave three stars... seriously good.There is a private lot but it's quite small.  We went during lunch time so it was packed but there's plenty of street parking.  The service was quick and they seemed nice enough.  And free drink refills is always a plus!", "rating": "3", "date": [2011, 6, 13]}, "7": {"description": "We found this place almost 10 years ago while trying to find a shortcut from interstate 65 into the city...Originally from Indianapolis, a good style hot-dog is a delicacy for us. This place hits the spot!! 5 Chicago style dogs with fresh hot fries will run you about $20...or about $2.50/dog!! They will also give u extra peppers!! Yum!!", "rating": "4", "date": [2014, 3, 28]}, "40": {"description": "Skyway Dog has a wall with a print-out of its Yelp reviews! I found this quite entertaining as I waited for my food.And, the workers here are smarties. The local newspaper has a picture of Skyway Dog employees (all girls). They have high grade points and are going to college. Yay for them!Screw the fact that the inside sitting area is small....5 stars!", "rating": "5", "date": [2008, 9, 11]}, "30": {"description": "Decent food, decent prices", "rating": "3", "date": [2010, 11, 2]}, "1": {"description": "The Skyway Dog House has been around since '69 and is known to the locals to have bargain-priced dogs.  The menu offers hot dogs, Polish, burgers, Italian sandwiches, and even other bites, such as the chicken filet/chicken Parm/fish filet sandwiches, pizza puff, and corn dogs.  I tried the Chicago Style Hot Dog & Fries, and the Maxwell Street Polish & Fries - both of the hot dogs were super fresh, super tasty, and topped to the maximus with the toppings - literally one of the best Chicago dogs I've had!  The fries were freshly-fried and definitely a steal with under $3-4!  I also tried their soft serve (swirl with the vanilla and chocolate) - it was creamy and yummy, and generously filled in a cone.  Service was really friendly and there's limited tables and counter seating, but it is mostly a take-out place.  There's also a small lot to park your car, but if it's filled, there's plenty of spots along 95th.  Check this hidden gem of a dog place out - you won't be disappointed! :D+Chicago Style Hot Dog+soft serve+bargain-priced!+friendly staff+small lot for parking", "rating": "5", "date": [2015, 8, 9]}, "9": {"description": "Been eating dogs here for 36 years. They know what time a day it is when it comes to turning out awesome dogs.", "rating": "5", "date": [2015, 4, 6]}, "26": {"description": "Hands down best hotdogs in Chicago! If you want a true Chicago Style hotdog with all the trimmings and fries.....this place is a must stop! Cheers!", "rating": "5", "date": [2011, 4, 8]}, "25": {"description": "2.5* Hot dog2* Italian Beef2* Italian Sausage3* Fries", "rating": "2", "date": [2011, 4, 16]}, "12": {"description": "Fan of this place for years, it is the place I go when taking a break from working on the boat in the off season to fill my tummy.Dog, delicious representative of the Chicago Dog.Fries, crispy and tastyService is always fast and friendly.CASH ONLY", "rating": "4", "date": [2012, 12, 27]}, "21": {"description": "Plump Juicy and extremely delicious... a must have hot dog !!!!", "rating": "5", "date": [2012, 4, 26]}, "17": {"description": "Been here a handful of times.  Chicago style hot dogs come with all the trimmings and yummy fries.  Food is cooked to order and I have always got mine hot.  The jalapeno poppers are also pretty good.  Customer service is great. Prices are reasonable.", "rating": "4", "date": [2013, 8, 27]}, "10": {"description": "This place been around for over 30 years and I think since I was a born. The Chicago style hot dogs are on point.. freshly steam poppy seed buns with fresh ingredients and a side of fries wrapped with the dogs. The Vienna Beef polishes are pretty juicy with a snap to every bite!  The hamburgers are okay, but I would prefer a little bit more seasoning on them. Pizza puffs pretty good when the oil is fresh, but my favorite are there cheese sticks and deep fried mushrooms! The only thing that I don't like about this place is that they don't accept debit cards it's only cash! They have an outside patio where you can eat your food, but it  needs to be updated. The Skyway hotdog sign doesn't light up and the outside sign been broken for years. The Skyway hotdog sign on top of the roof is halfway lit up. They do have a drive thru, but there is no sign telling you that it's there! This place would definitely make more money and attract more customers if they would just invest a little money into renovations.", "rating": "3", "date": [2015, 8, 2]}, "5": {"description": "The employees are very unprofessional. Blasting music in the back. Tried to order food in the drive thru and all I could hear was their music playing. Other then the bad service the food is really good!! Love the hot dogs, Italian beef, fries, and the pizza puff!", "rating": "3", "date": [2015, 9, 30]}, "35": {"description": "Addictive fries and delicious fully loaded jumbo chicago style dogs - talkin' Vienna beef, poppy seed bun, and the works - all your general quick dine fare here too, ie onion rings, mozarella sticks, jalapeño poppers, etc. In my opinion, even the Cokes taste better here.  You can get full for like $3-4.", "rating": "5", "date": [2009, 9, 20]}, "19": {"description": "Good as it gets for Hot dogs and such !  Nothing fancy inside or out its small clean and food has always been fresh and hot.   Its a easy place to swing in and grab a snack. and the people that work there are friendly........Enjoy !", "rating": "5", "date": [2014, 6, 2]}, "28": {"description": "This spot feels like the hot dog stand on the edge of forever. There is not much down in the area, but it is the gateway to Calumet Park. We stopped and had their special ... a jumbo dog with the works, a side of fries and a 16 ounce soda for $3.99. It was just fine. We ate in the car and were entertained by the half dozen cop cars with flashing blue lights in front and behind Phil's Kastle. Another day living in Chicago. Gotta love it!!!", "rating": "3", "date": [2010, 12, 10]}, "3": {"description": "Great dogs here. The kraut with mustard that I ordered came out on a steamed poppyseed roll that was very fresh. I really like that they serve the kraut hot. The fries were good. Overall a great little dog stand.", "rating": "4", "date": [2015, 4, 7]}, "33": {"description": "My favorite place for the classic Chicagah dog & fries.  This is the real deal.  Fast, friendly service without the attitude you get at other places.  See you there.", "rating": "4", "date": [2009, 11, 19]}, "43": {"description": "The cops are always here, which, for me, is just another indicator that this is a good dog joint.  Ever since the Route 66 trip, Justin and I have successfully avoided interstate highways, opting for less crowded routes with more local flavor.  The strip from Chicago to Southwest Michigan (41 to 12/20) certainly offers its fair share of local flavor through the southside lakefront neighborhoods (some in more disrepair than others), to the industrial neighborhoods of Northwest Indiana and their mom-and-pop gyros stands and Mexican joints, through Gary and the Dunes area...  There's a lot to see and it definitely takes longer than hopping on the highway, so we always end up starving on our trip.  Anyhoo--Skyway Dog House was like a shining oasis in the desert on our last trip.  We'd driven by a few other times--I loved the name and was encouraged by the po-po parked outside; this was clearly a place we had to try.  Survey says Skyway Dog House is great.  There was a constant flow of customers as we sat at the outdoor picnic tables, enjoying our cheeeeap Chicago dog, good fries, decent jalapeno poppers and a hefty Italian beef.  True, there were no sport peppers on the dog, but it was still tasty.  If I remember correctly, a regular hot dog and serving of fries is like, $1.33--the Chicago dog and fries might be $2.  I love cheap, good hot dogs.  Something about nitrates I can't seem to resist...So yeah, we've found a wacky place to feed on the long, winding road to Michigan.  Service is fast and friendly, there are a few seats along the counter inside this tiny place and the outdoor tables are a great spot for checking out the wild spinning rims on the cars at the intersection.  Good stuff.", "rating": "4", "date": [2007, 8, 24]}, "2": {"description": "Was in the area today and stopped by. The owner was in the kitchen and I have to say, total difference from my last visit. The hot dog was hot, condiments fit in the bun, which didn't fall apart.....tasty chicago dog with fresh ingredients..this, is how it should be..  Fries came well done and hot, as requested ..excellent. Friendly cashier. Quick service. I enjoyed this visit.", "rating": "4", "date": [2015, 4, 11]}, "18": {"description": "One of the best in the area....my go-to place when I am looking for a decent hot dog...not to mention its close to home for me so thus very convenient.  Also they served the hot dogs in steamed buns WITH fries....so more bang for your buck.Yes its not a very big place so yea the parking lot fills up quickly...thats OK as I'll take mine to go and drive to nearby Calumet Park and enjoy my meal on the lakefront.Added bonus: If you have a dog in the car with you, they offer a treat even for your canine pal....", "rating": "5", "date": [2012, 6, 11]}, "41": {"description": "Best place to get Chicago Hot-dogs! Luv this place and the price. All of the hot-dogs come with a good helping of fries. Just like others have said, it would be nice if the had built a large seating area. If they did this we would probably go more often. But they did end up building a drive-thru so that was cool.", "rating": "4", "date": [2008, 1, 25]}, "4": {"description": "Stopped by on a bike ride to Indiana.  Cash only but the killer prices make up for it.  I only got a chicago dog so not much to judge on. It was good and I hear the tamales are as well.", "rating": "4", "date": [2015, 7, 4]}, "6": {"description": "PLEASE! !!!! What a joke, they call themselves Chicago Skyway, they don't even have the GENUINE INGREDIENTS to make a Chicago Dog: No NEON GREEN RELISH. I'll go to a real Chicago doghouse that have the CORRECT CONDIMENTS.", "rating": "1", "date": [2015, 6, 8]}, "22": {"description": "i have been here a few times and the food is OK nothing more .On one recent occasion i went there w/ a friend and the girl taking my order was soo busy ( i was the only car in the drive thru and it was -2 so there were hardly any walk up's . we ordered chili cheese fries but all we got was chili. i felt that we weren't friends of hers and were peons and will never frequent this establishment again .One word of caution CHECK YOUR ORDER THOROUGHLY.", "rating": "1", "date": [2011, 10, 26]}, "15": {"description": "Great hot dog, Italian Beef, and corn dog. When they make them crispy, like I ask, great French fries. There are stools along a counter, and a couple of tables out side. However, you don't come here for the ambiance or service, you come here to get a good-sized, fairly-priced serving of Chicago street food, done right!", "rating": "4", "date": [2013, 8, 15]}, "20": {"description": "One of the best in the area....my go-to place when I am looking for a decent hot dog...not to mention its close to home for me so thus very convenient.  Also they served the hot dogs in steamed buns WITH fries....so more bang for your buck.Yes its not a very big place so yea the parking lot fills up quickly...thats OK as I'll take mine to go and drive to nearby Calumet Park and enjoy my meal on the lakefront.Added bonus: If you have a dog in the car with you, they offer a treat even for your canine pal....", "rating": "5", "date": [2012, 6, 11]}, "8": {"description": "Needed a quick hot dog- and there I was- Skyway Dog House- it was exactly what I expected. A basic south side hot dog joint. They served the perfect Vienna hot dog and even on a steamed poppy seed bun- I couldn't ask for more. But they give more- fries with the dog- I didn't want the fries but took them anyway. (one thing I have cut from own diet is french fries and chips) So, I gave a couple fries to my dogs, and then to a beggar on the street looking for spare change, he gladly took the fries.", "rating": "3", "date": [2014, 2, 2]}, "14": {"description": "Great little hot dog shack on the corner of oblivion. You step up to the counter like you are asking for your govt. check. Iron bars across the window, but these people are very polite and helpful. Good service. Standard grease shack food, until you get the \"shaggy polish\", which is now my favorite. Its a polish dog, with sauerkraut, grilled onions and some kind of cheese. All the dogs / sandwiches come with fries. The fries are just OK, not spectacular. There is a little picnic table area on the side to chill at, but for the best experience; what I like to do with my homey after we are done slanging light bulbs, is get some shaggy polish's, a Velma pizza puff and a bunch of bitter thoughts, take them all down to the beach, kick it and watch the waves while we get fat. Love.", "rating": "4", "date": [2013, 4, 30]}}, "neighborhoods": ["East Side"], "latitude": 41.7231174736979, "longitude": -87.5370521926168, "rating": "4.0", "times": {"Mon": ["10:30 am", "10:00 pm"], "Thu": ["10:30 am", "10:00 pm"], "Sat": ["10:30 am", "10:00 pm"], "Wed": ["10:30 am", "10:00 pm"], "Tue": ["10:30 am", "10:00 pm"], "Sun": ["11:00 am", "8:00 pm"], "Fri": ["10:30 am", "10:00 pm"]}, "price": "$", "categories": [["Hot Dogs", "hotdog"], ["Fast Food", "hotdogs"]], "address": ["9480 S Ewing Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Divey", "Has TV": "No", "Accepts Apple Pay": "No", "Takes Reservations": "No", "Good for Groups": "No", "Drive-Thru": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "44"}, "ginas-chicken-chicago": {"comments": {"3": {"description": "I've had their chicken and Italian beef. Their chicken is pretty good, not amazing though. Their mild sauce is great. Their Italian beef is disgusting, the beef is all slimy and gross. I couldn't even finish eating it. They also have fast service.", "rating": "2", "date": [2015, 4, 24]}, "1": {"description": "Gina's has great chicken & ribs.  I like the BBQ Sauce and it's always a treat. Once you know what you want it's best to just call it in & pick it up, it's just a take out joint.  I never had problems with getting sold re-heated food?  No greeting you with a smile, but excellent food....", "rating": "4", "date": [2015, 4, 18]}, "2": {"description": "I love the mild sauce that accompanies the chicken and fries. It's a great alternative to Hienie's Chicken", "rating": "5", "date": [2015, 1, 16]}, "5": {"description": "I agree with Jesse it is no Heienie's.  Its better!  Though the service can be a little slow at times.", "rating": "4", "date": [2011, 9, 13]}, "6": {"description": "The food is great, but in terms of being professional Gina's is far from it!. They say they open at 12:00 p.m., however, I called two different times both at 12:15pm and 12:25pm, but no one answered. When I decided to drive there they were closed! Forget about being kind. No smile, no greetings, just a stare. Good luck and eat well.", "rating": "2", "date": [2012, 3, 7]}, "7": {"description": "OK, so you have Hienies's Chicken on Torrence, and it is great.  But I've found another one.  Gina's Chicken on 106th St near Avenue \"O\". Gina's Chicken is very good.  Yes it's not Hienie's but just like Hienie's, the sauce seems to make it a bit special.  Yes, she has the Hienie's sauce, but if you want another taste sensation, try the Hot Bar-B-Que sauce.  It's really good.  How she mixes it is unknown to me, but it is a change from Hienie's and it is another flavor.  The Chicken is done just right and very tender.  The cole slaw needs just a little tweaking, but it compliments the chicken very well.  This is a strictly Take-out restaurant and No alcohol, but plenty of Soda.  Try it for a change of pace.", "rating": "3", "date": [2009, 11, 23]}, "8": {"description": "Great chicken, giant wings, and the hot sauce is amazing.", "rating": "4", "date": [2012, 7, 23]}, "9": {"description": "Delicious and the BBQ sauce is amazing!", "rating": "5", "date": [2012, 5, 30]}, "0": {"description": "Have you ever been hungry and was looking for a place to eat and you just didn't know what to get and you didn't want the usual?  That was me and then I saw a big sign that said Gina's Chicken!I was quite please. I ordered 10 wings for $10.99. The wings were well seasoned and cooked perfectly.  If I am in the area I will definitely go back end encourage you to go and check out Gina's chicken.", "rating": "4", "date": [2013, 9, 8]}, "4": {"description": "We drove all the way over there because we heard it was great chicken. The person who took our order was rude. The food was tasteless and old. You could tell they  had given us old chicken and fries that were just re-fried.  It was dry and had no flavor. The sauce is not all that.  Will not ever go there again. Spent $17 and was still hungry", "rating": "1", "date": [2012, 10, 19]}}, "latitude": 41.70248, "neighborhoods": ["East Side"], "categories": [["Restaurants", "restaurants"]], "address": ["3415 E 106th Street"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Quiet", "Delivery": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch"}, "longitude": -87.54065, "rating": "3.5", "price": "$", "number_of_reviews": "10"}, "o-haras-tavern-chicago": {"comments": {"0": {"description": "O'hara's is a comfortable neighborhood bar. The drinks are cheap, the bar tender attentive and the people great.", "rating": "4", "date": [2013, 2, 3]}}, "latitude": 41.70247, "neighborhoods": ["East Side"], "categories": [["Bars", "bars"]], "address": ["3541 E 106th Street"], "attributes": {"Has TV": "Yes", "Bike Parking": "Yes", "Good For Dancing": "No", "Happy Hour": "Yes", "Good for Groups": "Yes", "Outdoor Seating": "Yes", "Alcohol": "Full Bar", "Noise Level": "Average", "Coat Check": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.53725, "category": "Nightlife", "rating": "4.0", "price": "$", "number_of_reviews": "1"}, "reventon-latino-chicago": {"comments": {"0": {"description": "The worker there cecy is the friendliest person ever . Speaks Spanish and English . You can shop there for CDs , clothing , hats , soccer balls , pay your phone bill , buy phones and also send money to Mexico", "rating": "5", "date": [2014, 10, 30]}}, "latitude": 41.702461, "neighborhoods": ["East Side"], "categories": [["Mobile Phones", "mobilephones"]], "address": ["3653 E 106th St"], "attributes": {"Bike Parking": "No"}, "longitude": -87.534546, "category": "Shopping", "rating": "5.0", "price": "$$", "number_of_reviews": "1"}, "el-charro-san-francisco-chicago": {"comments": {"1": {"description": "I came in and ordered a chicken taco and bistec en salsa roja. Was very disappointed. The chicken is not even chicken breast. The bistec tasted old and it was a pretty small cut. The tortilas were microwaved, what's up with that? I sat there and waited for my food for about 18 minutes. Not cool. For 13.88 I spent I would've wished that I'd at least be full. Not happy I don't understand how it has great reviews.", "rating": "1", "date": [2016, 1, 27]}, "9": {"description": "One of the best Mexican restaurants in the area. Really enjoy their chicken tacos and enchiladas. Their horchatas and licuados are also delicious! Fast service but the servers could look a little more alive.", "rating": "4", "date": [2014, 8, 7]}, "23": {"description": "I have yet to find Horchata that I love more than the kind that I find here. Moreover, chips and pico de gallo/salsa/chiles are given with every meal when dining in - a little something I appreciate.Fantastic taste, price, portion, and service.", "rating": "5", "date": [2011, 10, 18]}, "5": {"description": "Stopped in during a work trip for some lunch.  Its a bit out of the way tucked away from most of the main streets.  They do not speak very good english so if you are not fluent in Spanish be ready to point.  Food was quite adequate not great but for a taqueria it hits the spot when you are craving tacos.", "rating": "3", "date": [2015, 4, 16]}, "25": {"description": "My husband and I never thought we would find a good Mexican restaurant on the south side. It is funny that we grew up in the area but I after living in Pilsen and the northside we never really needed to find a good restaurant on the other side until we moved back to the area. So we were introduced to El Charro by my mom. They have awesome Horchata and delicious gorditas. I was extremely impressed. I guess we don't need to travel to Pilsen for good Mexican food. I am looking forward to trying their enchiladas which I hear are also tasty. :)", "rating": "4", "date": [2010, 8, 30]}, "12": {"description": "Love this place food is delic. Never disappointed with food! Waitress can be a little rude but she won't keep me away. Great place for lunch or dinner with my family!", "rating": "5", "date": [2014, 8, 12]}, "21": {"description": "Awesome. If you're in the mood and area, must stop in for anything. Steak tostadas, horchata personal favs.", "rating": "5", "date": [2012, 11, 7]}, "16": {"description": "Here's a tip.If you like hair in your shrimp cocktail,charred taco meat,and pretty garbage service. You should come here.Other than that you should try New Chapalas down the street.Just opened up and the atmosphere is waaayy better.The food is phenomenon by the way.In all honesty I would only come here for the Horchata", "rating": "1", "date": [2014, 10, 3]}, "17": {"description": "Awesome. If you're in the mood and area, must stop in for anything. Steak tostadas, horchata personal favs.", "rating": "5", "date": [2012, 11, 7]}, "10": {"description": "They have great food anything you have here is great whether you dine in or take out it's good!!! Shrimp fajitas ,caldo de pollo and  their carne asada plate are my favorite !!!  Their food is five stars!!! But their waitress need a lot of improvement!!! They need manners and a smile on their face!!!", "rating": "4", "date": [2014, 8, 6]}, "11": {"description": "This is a great place to go eat if you're in the area their tacos de pastor are the best.", "rating": "5", "date": [2014, 8, 13]}, "26": {"description": "I eat here like 4 nights a week.  Seriously.They are open late and have quick, friendly service.  I especially like their tacos and licuados, so try those!  It's no fancy eatery but it's great to fulfill that Mexican craving!  I'll keep coming back for more.", "rating": "4", "date": [2010, 3, 7]}, "27": {"description": "I love this place when i'm craving mexican food. The food is really cheap. The service is good. The waiter knows us all and he memorized our orders already lol. i love the food so thats y they get 5 stars.", "rating": "5", "date": [2009, 3, 2]}, "0": {"description": "Saying I'm picky about my Carne Asada is an understatement. This place has the perfect Carne Asada meat, nice char on it, not tough, juicy, flavorful, quality meat never any gristle or fat, all perfectly trimmed off. I get it Mexican style with just cilantro onion and lime juice mmm all the flavors mingle together so nicely that way. Once I accidentally ordered it with everything which means lettuce tomato and cheese and I was so mad I think all that stuff, especially the cheese, ruins the natural simple amazing flavors of good meat with lime juice, it was still good with everything, not surprising, honestly everything is great here but the simple way I think is best when it comes to steak. Their shakes are huge and satisfying, their gorditas are also out of this world try it with either Asada or al pastor if you want something super rich, they have great servers, it's always clean, I just find no flaws in this place. I would come here for my Mexican food fix at least once a week when my mom was away in Mexico, I think that says a lot. This place is so underappreciated just because it's out of the way for most people but honestly come out here for the best tacos gorditas and Mexican goodies in general.", "rating": "5", "date": [2015, 11, 18]}, "20": {"description": "My favorite taco place ever!  The pastor, steak, and chile relleno tacos are the best I've ever had and they're SO CHEAP.  The standard red sauce for the tacos is phenomenal. Speaking of dining in, this place can easily seat 60 people, but if you want to place an order, just go to the register in back.  The restaurant is often full of Chicago cops during lunch.  So for those of you who think the neighborhood is unsafe, get over it.  Back to the red sauce. If you dine-in, it gets brought to you in an open dish with a spoon.  The dishes are usually very full, so I'm guessing once you're done, the sauce goes to the next table.  Which makes the germophobe in me want to zip myself in a hazmat suit, but you can always ask for sauce on the side. If you dine in, they do have menus and take your order at your table. You get free tortilla chips, too.Parking is tricky - street parking in front is often full, but you can park around the corner.ANYWAY, BEST TACOS EVER.", "rating": "5", "date": [2013, 1, 11]}, "19": {"description": "El Charro simply has THE best tacos al pastor I know!  Everyone I know loves this place because of their al pastor tacos. Everything in here is pretty good, but the main atraction for me is the pastor tacos.  The only off and odd beef I have with El Charro is in regards to their \"milanesa\" torta, which tastes ok, but its a pretty big turn off that its not even a real piece of steak, but rather a finely ground up beef concoction spread thinly to look like a breaded slice of steak. I dont understand whats the need is for that, when it would be easier to bread a nice thin slice of steak. This place is always busy, wether for take out or dine in and open late, and its been open and in business for a while now, so that says a lot.", "rating": "5", "date": [2013, 1, 21]}, "2": {"description": "I live in the Southeast Side of Chicago and this is a great place to order Mexican food and just a few blocks from my house. I typically order their burritos de carne asada and 99.9% of the time they do a great job. The last time I ordered the burrito it was a little soggy so I decided to order their gorditas de carne asada the following time I went in and let me say this: THEY ARE AWESOME! The gordita is not overly greasy and the gordita is thick and not thin and falling apart as i have experienced in other restaurants. If you are in the neighborhood and want authentic Mexican food stop by and have their gorditas! Also...they have bottled Coke from Mexico (which I love) - another perk! :-) Finally, if you are looking for good cheese fries (although not typical Mexican food) - is also very very very yummy!", "rating": "4", "date": [2015, 7, 18]}, "18": {"description": "I have yet to find Horchata that I love more than the kind that I find here. Moreover, chips and pico de gallo/salsa/chiles are given with every meal when dining in - a little something I appreciate.Fantastic taste, price, portion, and service.", "rating": "5", "date": [2011, 10, 18]}, "13": {"description": "I find it weird that only 5-6 people work there but it's a great place to eat ! I love their tacos , gorditas and agua horchata . You're missing out if you don't try it !", "rating": "5", "date": [2014, 10, 30]}, "4": {"description": "I came to this place with pretty high expectations based on the yelp reviews, and found that they has good food, but was disappointed because it didn't seem great to me. It seemed way too greasy, and I didn't think the horchata was anything special. I was actually very disappointed with the horchata since I asked the waitress if there were pieces of rice in it and she told me there was, but there actually wasn't. That wasn't really her fault as her English wasn't very good, and I'm pretty sure she didn't understand my question, but I was still very disappointed. This place is worth trying if your in the area and looking for good authentic Mexican food, just don't expect anything fantastic.", "rating": "3", "date": [2015, 2, 28]}, "24": {"description": "I have to show some love to my 'hood!  Although not all things (or persons for that matter) from the East Side deserve some love, El Charro certainly deserves a big 'ol hug and plenty of kisses!This place is a diamond in the neighborhood!  The Mexican food is always fresh and made to order.  I typically go for their Tortas, Tacos, or Gorditas (asada/steak, pollo/chicken, or milanesa de pollo/breaded chicken).  Their aguas frescas are so BOMB-tastic!  Yes, I said \"bombtastic!\"It's worth noting that their Agua de Horchata is the most prized possession of El Charro!  Seriously, I've had friends go there solely for a large (more like GIGANTIC) Agua de Horchata!  It's seriously that GOOD.  I may have committed this crime as well.  :/  Who gets just a beverage and no food?  Well, this Agua de Horchata is not your typical beverage!Prices are very reasonable and the service is nice!Side note: Sometimes if you go during weekday evenings, you'll see some pretty attractive police officers eating there too!  Haha, YES, I just went there.  ENJOY!Final Tally:  3 Stars for the FOOD and 1 star for the hottie officers!", "rating": "4", "date": [2011, 6, 21]}, "6": {"description": "Adequate Mexican food in an area of the city where adequate is often the best you can get. I had a burrito and a steak taco, and despite asking for them to go easy on the refried beans on the burrito, it was more beans than meat. The salsa is so-so, and the place is a small store front place you can easily drive by.", "rating": "3", "date": [2015, 3, 25]}, "22": {"description": "I had the chicken enchiladas verde to go which were good, the pico de gallo was nice and spicy, and the horchata is better than any other place. The previous compliments to the horchata are not exaggerated, mattered a little  something extra in there that makes it a little more rich, maybe vanilla? It's definitely worth trying.", "rating": "4", "date": [2012, 5, 12]}, "15": {"description": "One of the best places in this area. I like their gorditas de biztec or de pastor. They have great agua de horchata", "rating": "4", "date": [2014, 8, 14]}, "7": {"description": "I'm disappointed in this place! they used to serve good quality food, now it's just all about money to them. I use to order the steak nachos supreme back in the days and they used to give you a lot of chihuahua cheese melted over nice juicy steak! Now it's just tortillas loaded with beans and a little bit of steak and about a handful of cheese. I ordered a steak nacho supreme and I swear it was mostly all dried up tortilla chips with beans lettuce and tomatoes cilantro and onion I barely had any cheese or meat on it! For 10.95 it should be loaded!", "rating": "2", "date": [2015, 8, 2]}, "8": {"description": "\"The food is good stop by if in the neighbor.\"", "rating": "3", "date": [2015, 5, 15]}, "3": {"description": "I tried this restaurant for the first time this weekend.  With a taste for tacos on my mind I entered and immediately noticed how nice and clean the dinning area was.  The ambiance is bright with lots of natural light coming in through the clean windows.  The cooking area is in the rear and compact but efficient.  I was asked if a menu was needed - there are no carry out menus in sight - and was advised that the taco dinner was available to me although it was not on the menu.  The service was friendly and efficient, the clientele calm and quiet - at least at that hour - and the food was both delicious and reasonably priced.  I am always on the lookout for good restaurants on Chicago's south side and this was a good find.  I'll head back and try some of the other menu selections soon.", "rating": "4", "date": [2015, 9, 21]}, "14": {"description": "Run of the mill, but very quick. Steak tacos were alright, server was polite and quick. But he couldnt tell if I was mexican or what. I also kept switching between Spanish and English. So, I dont blame him. Salsa is crazy hot. Watch where your hands go after...", "rating": "4", "date": [2013, 6, 13]}}, "neighborhoods": ["East Side"], "latitude": 41.702434, "longitude": -87.534332, "rating": "4.0", "times": {"Mon": ["9:00 am", "11:30 pm"], "Thu": ["9:00 am", "11:30 pm"], "Sat": ["9:00 am", "1:30 am"], "Wed": ["9:00 am", "11:30 pm"], "Tue": ["9:00 am", "11:30 pm"], "Sun": ["8:00 am", "12:30 pm"], "Fri": ["9:00 am", "1:30 am"]}, "price": "$", "categories": [["Mexican", "mexican"]], "address": ["3655 E 106th St"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Casual", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "28"}, "kwan-chop-suey-chicago-2": {"comments": {"1": {"description": "Food is terrible... I had to throw away my $20 meal and ordered a pizza instead. Never going back.", "rating": "1", "date": [2014, 6, 13]}, "0": {"description": "I love the rice here , the only place I'll get the chicken rice . Also the egg rolls are big and delicious :)", "rating": "3", "date": [2015, 2, 19]}}, "neighborhoods": ["East Side"], "latitude": 41.7024439573288, "longitude": -87.5352081656456, "rating": "2.0", "times": {"Mon": [], "Thu": ["11:00 am", "8:00 pm"], "Sat": ["11:00 am", "9:00 pm"], "Wed": ["11:00 am", "8:00 pm"], "Tue": ["11:00 am", "8:00 pm"], "Sun": ["11:00 am", "9:00 pm"], "Fri": ["11:00 am", "9:00 pm"]}, "price": "$", "categories": [["Chinese", "chinese"]], "address": ["10611 South Ewing Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "2"}, "bamboo-lounge-chicago-2": {"comments": {"0": {"description": "Time has truly forgotten about this place.You drive by an old brick building on the corner of a not-so-nice neighborhood. The only indication that it's even a bar is that it has a small Bud Light neon. If you look closely, you might notice the antique Schlitz stained glass. Park the car next to the crumbling sidewalk with a 7 food pothole - it's time for a drink.Try and walk in - but the two front doors are locked. Just go around to the side door next to the half-torn down houses, garbage cans full of old clothes, and old marina on the Calumet River. Good, you finally found your way in - welcome to the 1950's. Your cell phone is temporarily out of service.It's poorly lit - maybe three lights in the whole place. Nothing's changed in here for decades. Beautiful antique ceiling, wooden back bar, and beer taps. If you look above the bar you'll notice a hanging bamboo structure where the bar gets it's name. Even a pool table if you are ready to throw down. Feeling lazy? Got a TV if you want to catch the game. They don't have Schlitz, but Old Style cans are only $2.50.There's several arcade machines tucked away in the corner which are unplugged to save money. Doubt they will ever be plugged in again. The heat is barely on, with the place hovering around a cool fifty-five degrees. If you're a VIP - they will give you a personal space heater on a stool. Their TV is so fuzzy that it makes standard definition look like a luxury. Most people stopped coming here when the bridge was closed in early 2011, and the people in the bar don't even like the neighborhood that they live in - one mile from Indiana. The floors and bar haven't been cleaned in years, but you can't tell because it's so dark. Credit cards aren't even a figment of anyone's imagination in this place. The outdated \"personal hygiene\" vending machine is the men's restroom toilet paper holder, and the faucet puts out a heavy drip every two seconds.This bar is one of the most depressing I've ever been to, however, at the same time it had an air of mystery and authenticity about it that you'd never get elsewhere.", "rating": "3", "date": [2011, 12, 29]}}, "latitude": 41.724834, "neighborhoods": ["East Side"], "categories": [["Dive Bars", "divebars"]], "address": ["9401 S Ewing Ave"], "attributes": {"Alcohol": "Full Bar", "Accepts Credit Cards": "No"}, "longitude": -87.537682, "category": "Bars", "rating": "3.0", "price": "$", "number_of_reviews": "1"}, "phils-kastle-chicago": {"comments": {"3": {"description": "Have you ever seen the Talking Heads video for Road to Nowhere? Driving down that barren expanse of road you will happen upon Phils Kastle. It's an old-fashioned, kitschy diner. It seems a little misplaced here, I would expect to encounter this place somewhere in the South, maybe as part of a road trip to New Orleans.So you desire a scone? How about a fritatta? HA! This is the east side. How about some real food. Wide menu. Great place for breakfast. They take pride in their gyros. Service has always been pleasant.", "rating": "4", "date": [2009, 10, 23]}, "1": {"description": "From the outside it doesn't look to inviting,  but don't be fooled. Yes by all standards it's outdated. The pros, super clean inside,  very friendly, good value, and most important the food was pretty good. I walked in there and it was spotless,  that  reassured me  about ordering food.", "rating": "4", "date": [2015, 7, 8]}, "2": {"description": "Hello,FOOD SNOB here.From the outside its a DIVE  but when you enter its a blast from the past.  Old fashion Diner.  For years I pass by this place and heard how good their burgers are.   Looks like they changed ownership.  Is now just your average Burger.  Had the Baby Monster Burger.  Came in a huge bun and the patty was 1/4\" thick but sorry to say not homemade as before.  I must say the Fries were Excellent.  And prices are very reasonable. They do have Breakfast.  Might try that next time if I'm in the area.", "rating": "3", "date": [2010, 9, 24]}, "5": {"description": "This place is great. I feel like I'm in a scene from The Deer Hunter every time I walk through the door. This is about as blue-collar working class steel-mill South Chicago as it gets. Yes, it's small, yes, it's out of the way, and it probably wouldn't hurt to wipe the place down with some heavy duty bleach once in a while, but that's what makes it so great. I live on the North Side, and I make the 45 minute journey down here JUST for this place. When friends from out of town come in, this is one of the places I try to take them.Mary is great, always greets you with a smile and a \"hi baby, what can I get you?\". It's great. I absolutely love coming here. It's about as unpretentious as you can get. The burgers are really good- get the monster burger with gyro meat added. It's fantastic!", "rating": "5", "date": [2010, 4, 14]}, "6": {"description": "I gotta tell ya, I'm a White Castle fanatic. That's right. \"Sliders\" don't gross me out; I'm addicted to chicken rings with honey mustard; and I adore their artificial flavored strawberry shakes. But going to White Castle can get a little repetitive, so when I want to shake things up a bit, I head to Phil's Kastle.This place has been serving \"homemade\" sliders on the east side since the '30s. Phil, himself, told me that little tidbit of info. (Although, I'm not sure if it was actually the same Phil that's been flipping burgers all this time---perhaps his pops started it??) Anyway, the Kastle is an old Greek diner, close to the lake, right by the famous \"Blues Brothers bridge\". But Phil's Kastle is NOT your typical Greek diner. You won't find any frozen GFS or Costco prepackaged foods here. Phil makes everything made-to-order from scractch, from his tasty breakfast sandwiches right down to his delicious burgers.I'm a fan of the double cheeseburger. It's like eating a \"crave case\" of sliders all squished into one bun. Two heaping beef patties are pan-fried in butter (i think! at least it tastes like butter!) and then smothered in grilled onions, cheese, and some kind of secret seasoning that makes the burger taste exacly like a White Castle. Top it off with a little mustard, ketchup, mayo, and some of Phil's crunchy hand-cut fries, and you might never return to White Castle again--especially when you can get a double monster burger, fries, and a pop for $3.99!For those looking for the true slider experience, try one of Phil's \"baby\" burgers. These little puppies are what makes him famous on the southside. Pint-sized versions of his larger burgers, these little greasy messes are oh-so-tasty!Go ahead and give Phil's a try. Phil's a nice guy and he makes one hell of a burger.", "rating": "5", "date": [2007, 8, 31]}, "7": {"description": "The food is just average, just like the service. Avoid it if possible. The prices are reasonable, but thats about it.", "rating": "2", "date": [2009, 3, 2]}, "0": {"description": "The place is a total dive on the outside.  And when you walk in, it's a total dive on the inside too.  Very consistent.  It's a medium to smallish diner sporting a lunch counter with stools and also a bunch of booths off to the side.  Everything is a little damaged because it's at least 50 years old.   It's like if you took a time machine from opening day to present day you'd be like...\"hmm, you got a new cash register\".  And that would be it.  I stopped in at about 3pm for lunch and ordered the double burger.  No one else was in.    The lady making it was very nice and was quite accommodating with my requests for extra ketchup and hot peppers and what not.  After that I had a grilled cheese sandwich for dessert.  On my way out she offered to refill my water bottle.  Nice.This would be a great place to have across the street from me.  I'd saunter in every now and then and have a grilled cheese sando, burger or whatever.  Then I'd be like, \"thanks alot..see you next time\".  And then I'd go home.   Wonderful. As it is, this dump is in the middle of nowhere right across the bridge from that Calumet Fisheries place on 95th Street.  I can't see how they can do much business.  Maybe 50 years ago the traffic around this area was different.  I don't know. But present day, it'd take an act of of Bourdain to boost business.  Which I think they would appreciate.", "rating": "4", "date": [2014, 4, 27]}, "4": {"description": "Phil's is like stepping back into the past, when Alan Ladd was making his movie in South Chicago in the 40's.  You will see everyone in there from yachtsman and Bank VP's to the blue collar workers and kids in the hood lookin' for a cheap burger. They have the baby Monster Burger for $1.49 with fries.  Great breakfast food, real Gyro's and the special is 3 for $10.00.  You have to try it, but just pretend you are on vacation in a small town, when in reality, you are in Chicago.  Near Calumet Park, 95th Blues Brothers Bridge and not far from the Skyway.  Enjoy...", "rating": "5", "date": [2012, 4, 1]}}, "latitude": 41.7232131958008, "neighborhoods": ["East Side"], "categories": [["Burgers", "burgers"]], "address": ["3532 E 95th St"], "attributes": {"Take-out": "Yes", "Has TV": "Yes", "Accepts Credit Cards": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Good for Kids": "No", "Attire": "Casual", "Waiter Service": "Yes", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Drive-Thru": "No", "Good For": "Lunch"}, "longitude": -87.5375823974609, "category": "Restaurants", "rating": "4.0", "price": "$", "number_of_reviews": "8"}}