{"bg-salon-chicago": {"comments": {"3": {"description": "Awesome place!  Organic products....very reasonable.  Easy to get appointment...love, love, love this place!!!", "rating": "5", "date": [2014, 8, 25]}, "1": {"description": "I have been going to BG Salon for about 5 years now! Jackie is great and always gives me top notch service! The environment is warm and inviting. People have complained about the parking I don't find it a issues since there is a huge Metra lot a block away you can park at for $2! As long as Jackie is there I will be there too! I have friends who have gone there and have been very happy ! I also just used BG Salon for my wedding! They were very flexible and accommodating !", "rating": "5", "date": [2013, 11, 2]}, "0": {"description": "I am a health freak, integrative nutritionist , don't use or eat anything toxic. My hair needed a touch up color and I didn't want to go to any salons.  Then I found this one in a holistic magazine , while grocery shopping.  Gave it a try and I fell in love, first with the owner , who I ended up talking to and found out she is as freaky as I am :) We hit it off from the start.  The girl who colored my hair, was super nice and knew her work .  I was nervous in the beginning, as anyone would be going in for the first time.  At the end of my appointment ,  I felt beautiful , but more than anything , my scalp didn't itch at all ,  there was no annoying product smell , when I showered , I didn't feel like all the chemicals are going down on my skin all over my body and making me itch. I just want to say , I LOVED the ENTIRE experience. Friendly staff, very accommodating, very authentic, knowledgeable, and genuine.  clean organic products that have no GMO's ! And that's a salon that I will keep going back to and recommend to all my friends", "rating": "5", "date": [2014, 3, 19]}, "2": {"description": "I came in as a walk in. I had my regular girl get sick on me and I needed a dye job ASAP!!! It was nice that they took care of me, although I didn't feel very welcomed or that they were even happy to take me on ... They all looked at each other, determining if and who was going to provide my services. No genuine smiles about having work ... I would've gone elsewhere. Lots of salons in the neighborhood...We are talking Edison Park/Norwood Park, but I'm not giving them 2 stars because of their lack of customer service.I'm giving them 2 stars because:I wanted my grey taken care, just wanted an all around dye job. According to their website $60 and up, but of course I was charged $70. According to the owner, it cost $70 to do an all around job, the roots are $60.... I just don't think the color I walked out with is worth $70... It's alright....", "rating": "2", "date": [2014, 8, 22]}, "5": {"description": "I went here as a walk-in one morning for a blowout. It was super fast and easy to get an appointment. the decor is very unassuming and it is a nice, quiet and cozy little place for a quick do. The salon uses only organic products and color, so I was a little enticed for a next trip which I will be sure to take. I loved this place is a hop, skip and jump from my abode and I don't have to drive or look for parking! Prices are very reasonable and the stylist I had was awesome to chat at while going under the brush!Highly recommend if you live in the neighborhood and need a quick pick me up.", "rating": "4", "date": [2012, 1, 4]}, "6": {"description": "I needed a new stylist and salon.  I checked out YELP because I wanted a salon that  used natural/organic hair color instead of chemical-laden ones ... I came across BG Salon in Edison Park and boy am I glad I did!!!  I tried another highly rated YELP salon - Mera - and while everyone was nice and they used natural products, I wasn't happy with the results.  I had highlights put in my hair, but no toner was used which left me with brassy highlights and dry hair. When I sat in Jen's chair, she asked me what I wanted to accomplish.  I said I wanted to remove the brassiness, add shine and asked if there was a way to color my hair so when the highlights started growing out I wouldn't have obvious roots. She said \"Absolutely.\"   She also explained the dryness in my hair was due to my hair cuticles being opened by the highlighting, but not sealed or closed with a toner or color.She brought out the color swatch book (BG had a lot more color options than Mera) and suggested both high & low lights that would accentuate the red/gold highlights in my brown hair while adding a base of my natural color to eliminate the root issue as well as add shine.  There was no chemical smell or tingling that happens sometimes with highlights.  I am ESTATIC with the results!  Jen is an amazing colorist. I also got my eyelashes tinted - again natural products and I love the results - it took only 10 minutes and cost $15.  My lashes are darker and I look like I have on some eyeliner! It makes my blue eyes pop! The results should last 4-6 weeks. The cost was reasonable and I feel great knowing my fabulous color came without a bunch of chemicals.Thanks YELP!", "rating": "5", "date": [2012, 6, 17]}, "7": {"description": "Not sure I want to give any stars.  Called me to inform me my stylist left, and was not currently doing hair, and to please come in at my appointment time as their stylist will be able to handle my appointment.  Called my stylist immediatley to find out that she did leave but to relocate to another business with PARKING. New owners are not knowledgeable in styling, handling clients of stylists.  They would tell people their stylist was booked and call them on the stylists day off and try to schedule them away from their stylist.  Unethical.  In Edison park it's kind of aggravating to go out to feed meter, move car in the rain while having your hair done.", "rating": "1", "date": [2013, 10, 30]}, "8": {"description": "I had a great experience at BG Salon and surprised by the negative reviews.  I made an appointment to get my hair colored and was interested in trying the organic products they use.  Jessica was my stylist and helped me feel at ease and worked with me to select a color that was very close to my natural color / skin tone. The color turned out beautiful without nauseating chemicals AND it lasted much longer than regular hair color!!  The staff were all very friendly and nice!  I will be going back!", "rating": "5", "date": [2013, 11, 15]}, "9": {"description": "I got lash extensions done on Friday.  I was VERY gentle with them, never picked at them, rubbed my eyes, I used NO oil-based cleansers, dabbed at my eyes to dry them. By Sunday, probably HALF of the lashes were off my right eye, and one or two were off my left. It is less than a week since I got them, and they are all but gone. They were supposed to last much longer. They didn't last the weekend, never mind a week-and with care, should have lasted a MONTH. I am beyond disappointed. When they were first done, they looked better, but they were not what I wanted. They were very long, but also, very wispy. This salon puts on OLD school lash extensions-not the modern ones that are now offered.  Everyone at the salon is very nice, it is a very clean place-but please, don't go here for lash extensions.  You will be very disappointed. I spent $55.00 for lash extensions that barely lasted a weekend, $70.00 with a tip. Definitely NOT WORTH IT.", "rating": "1", "date": [2013, 9, 5]}, "10": {"description": "Wow. I just had my first visit at the BG Salon, and I am very impressed. Kelly was the hair stylist that worked with me, and besides being friendly she is also very good at what she does. I got highlights (first time ever), and am very pleased with the outcome (especially since I had used henna for the past two years, and not other color would penetrate the hair anymore). I also got bangs (after many, many years), and I love them. She just did a great job. I think I found the place I can trust and enjoy for my future needs in hair care! Thanks a bunch Kelly!", "rating": "5", "date": [2009, 7, 21]}, "4": {"description": "I could go into more details about my experience but I am very particular with my hair color to be natural looking which other stylists have been able to do.  I tried - but we just weren't on the same page.   I found another organic hair stylist in the area who \"fixed\" my color and will fix my uneven haircut once it grows back.", "rating": "2", "date": [2014, 7, 14]}}, "neighborhoods": ["Edison Park"], "latitude": 42.002813, "longitude": -87.816578, "rating": "3.5", "times": {"Mon": [], "Thu": ["10:00 am", "7:00 pm"], "Sat": ["9:00 am", "3:00 pm"], "Wed": ["10:00 am", "6:00 pm"], "Tue": ["10:00 am", "6:00 pm"], "Sun": [], "Fri": ["10:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Hair Salons", "hair"]], "address": ["6704 N N W Hwy"], "attributes": {"Parking": "Street, Private Lot", "By Appointment Only": "No", "Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "category": "Beauty", "number_of_reviews": "11"}, "los-azares-mexican-grill-chicago": {"comments": {"1": {"description": "Not so happy they're not offering specials anymore. It was $1 tacos on Sunday and Wednesday. The tacos are good but very small.", "rating": "3", "date": [2015, 5, 19]}, "9": {"description": "Ok the Sunday and Wednesday $1.25 tacos are not the stripped down small size tacos you would expect from other places.  Los Azares does a great job of serving fresh food. The chicken is good, but the steak is better.  The barbacoa is good, as are the rice and beans.  Worth your time if you are in the mood for good food.", "rating": "4", "date": [2014, 12, 15]}, "23": {"description": "Hands down the worst tacos I've ever eaten. 2 out of the 4 were so greasy and soggy I ate them with a spoon. Every taco was bland. Could barely taste the difference between chicken, ground beef, or steak. I will never be getting food from Los Azares again", "rating": "1", "date": [2013, 2, 1]}, "5": {"description": "They were very busy and gave free chips and salsa while I waited. The tacos and burritos are great.", "rating": "5", "date": [2015, 11, 21]}, "25": {"description": "I don't know what happened to this place.  I was so addicted to their pastor tacos, but they must have changed the way they make them.  My husband picked some up tonight, knowing that I love them and the meat was like a paste.  It was DISGUSTING and completely inedible.  Hoping it was a fluke and that it's not something they have changed permanently.  So hard to find good Mexican, expecially on the northwest side of Chicago.  I'll give it a shot one more time, but holy moley, it was gross.  Imagine, a meat paste!  NASTY!", "rating": "1", "date": [2013, 1, 17]}, "12": {"description": "This place was a good lunch choice.  The rice and beans were surprisingly very good!  No complaints of the Horchata as well.  The steak on the torta was not my favorite but it was tasty.", "rating": "3", "date": [2014, 5, 24]}, "21": {"description": "Bland, bland and bland.  We had chicken tacos, nachos and chicken quesadillas delivered.  There was no heat or spice to any of it.  They forgot to include jalapenos for the nachos so those had nothing to redeem them either.  The salsa was too mild and there wasn't enough for all the food.", "rating": "2", "date": [2013, 5, 3]}, "16": {"description": "Just got my Fajitas from Los Azares Mexican Grill off of Grubhub. That was without a doubt the worst mexican food I have ever had. I threw it in the garbage, literally. The \"Steak\" was tuff as nails, and loaded with grizzle. The beans were straight from a can, with a dollop of cheese. The Horchata was also a sad excuse for the traditional mexican drink, tasting of heavy cinnamon and little other flavor. No effort at all. stay away from this place, I threw away $22.", "rating": "1", "date": [2013, 6, 14]}, "17": {"description": "Bland, bland and bland.  We had chicken tacos, nachos and chicken quesadillas delivered.  There was no heat or spice to any of it.  They forgot to include jalapenos for the nachos so those had nothing to redeem them either.  The salsa was too mild and there wasn't enough for all the food.", "rating": "2", "date": [2013, 5, 3]}, "10": {"description": "Decent steak tacos... Meat was not fatty but not super flavorful. On a summer day it was hot inside. My refreshing to eat Mexican food in a poorly air conditioned restaurant on a hot summer day. Staff was super friendly and fast. I'd eat there again but it doesn't beat other cheap tacos joints in the area.", "rating": "3", "date": [2014, 8, 29]}, "11": {"description": "I went here for dinner... I had the ground beef burrito with rice and beans.The filling in the burrito was very soft, almost like a paste. The rice was ok, it had just a little flavor. The beans also weren't that great.The people seemed very nice and friendly and the place was clean inside.The food didn't really appeal to me. I don't think I will be returning.", "rating": "2", "date": [2013, 8, 15]}, "26": {"description": "Food is good. I would order from here again if i was in the mood. Chicken is a bit on the salty side, the horchata has a ton of cinnimon in it, and the guac doesnt have much flavor-- AT ALL! But... none of it is actually bad tasting. I say if they could get their spices in order it would easily be a 4-5 star place.", "rating": "3", "date": [2013, 1, 16]}, "22": {"description": "Well, I was walking past after getting food from Siam Treasure and saw the sign for 1.00 tacos on Sunday.  Since I have never tried it, I said why not.  I haven't eaten all day and I can save one or the other.  I walked in and it was like I disturbed them from hanging out.  The guy taking my order was rude and when I ordered three tacos, he seemed annoyed because I ordered the \"special.\"  When they were making them, I could see that they were making only two, but I thought maybe there might be one on the make.  Well I was kind of given my bag with a grunt, and I left.  Much to my belief, there were only two in the bag.  It was like them sticking it to me because I ordered the 1.00 tacos.  Also, I got one green little sauce (it barely made it across one taco, but I ordered three).  Well, I know to walk straight pass this place when getting a hair cut, coffee, or going to the gem in that plaza Siam Treasure.", "rating": "1", "date": [2013, 2, 24]}, "0": {"description": "Food was average. Meat can use a bit more seasoning. Ordered through grub hub and they missed my special instructions for extra green salsa. I also paid for a soda that wasn't delivered, so that was a bit disappointing. Other than that everything was good.", "rating": "3", "date": [2016, 1, 28]}, "20": {"description": "Just got my Fajitas from Los Azares Mexican Grill off of Grubhub. That was without a doubt the worst mexican food I have ever had. I threw it in the garbage, literally. The \"Steak\" was tuff as nails, and loaded with grizzle. The beans were straight from a can, with a dollop of cheese. The Horchata was also a sad excuse for the traditional mexican drink, tasting of heavy cinnamon and little other flavor. No effort at all. stay away from this place, I threw away $22.", "rating": "1", "date": [2013, 6, 14]}, "19": {"description": "Excellent food! The tacos (onion and cilantro especially) are amazing. We love the tacos as well as their chips and salsa. Have yet to have a bad meal!!!", "rating": "5", "date": [2013, 11, 22]}, "2": {"description": "First time here .... Friendly Staff amazing food. I order the shrimp burrito!!! Tasty tacos not small either nice size", "rating": "5", "date": [2015, 7, 18]}, "18": {"description": "Let me start by saying that the man who took my order was delightful, he was very friendly!! The food on the other hand wasn't so delightful, very bland to say the least. I ordered a quesadilla which had hardly any cheese on it and I shared nachos with my sister. We ended up throwing almost all the nachos away because it was basically tortilla chips and shredded lettuce, there were literally 5 chips with cheese or beans on them (no joke)!!! She said her burrito was ok but nothing she would order again, she said it had no taste to it.", "rating": "2", "date": [2014, 7, 31]}, "13": {"description": "After a mid-day, midweek orthodontist appointment, my daughter and I planned to stop at Taco Bell quickly before she went back to school.  I wasn't in the mood for Taco Bell, but she was.  I'd seen Los Azares before and saw it again on this day. I made a split second decision decision and pulled in.  It was a Wednesday. Tacos are $1.25.  We ordered four steak tacos (which were a little higher priced), guac and chips, two Mexican sodas (one Pepsi and one Coke).  We were given chips/salsa while we waited for our food.  Our bill was $15.55 which I think is good and the food was even better.  Nice soft corn tortillas. The right amount of meat, cheese, lettuce and tomato on the tacos.   We asked for sour cream on our tacos and weren't charged extra. Finally, the guacamole is really good.  We arrived about 11:45.  By noon there was a decent line of pickups and in store dining orders.  Everything seemed to move smoothly.  My daughter was happy we didn't go to Taco Bell. We'll go back.", "rating": "4", "date": [2014, 9, 19]}, "4": {"description": "I have been going here for awhile and lately their accuracy on take out orders has gone downhill.  I usually order thru GrubHub and the last few times that I ordered they missed all of the special instructions.  It is pretty disappointing to get home and be ready for a nice meal and have a bunch of stuff missing.  They did offer to give me a discount on my next order but I will probably not be back.  Once is a mistake, a few times is poor service and I hate poor service.", "rating": "3", "date": [2015, 12, 2]}, "24": {"description": "Saw a sign outside for $1 Tacos... Stopped in... Good price, good food, good service. I'll be back again for sure!", "rating": "5", "date": [2013, 1, 23]}, "6": {"description": "This place is great! It may not be the fanciest Mexican Restaurant, but the food is good, and the service is also good. I've read some of the bad reviews here and these people are a bunch of entitled babies. If you want good Mexican food, quickly and reasonably priced, check it out.", "rating": "5", "date": [2015, 11, 12]}, "15": {"description": "If I could give 0 stars I would. Ive ordered from this place twice. The first experience they forgot the drinks to the order. Since this is the only mexican place that delivers in the area it was no big deal, just an inconvenience to have to wait. The second time was over this weekend and through grub hub. The deliver driver that was sent out to deliver the food gave my order to the person who lives downstairs. Same first name but different last name and did not check the order. So I called to explain to the manager that I never received any food. I was told by Jose that there was no manager tonight and  I would have to wait until monday to speak with someone. How is it that on the busiest days of the week theres no manager there. I explained to him the situation and told him all I wanted was a refund since I was out dinner and the cost of delivery and never authorized or signed for any charge. Dont you have to have a signed copy of the receipt to prove it was paid. Who just drops food off at someones apartment even when questioned? So whatever, this jose person told me he was going to call his manager and explain the situation. Fine, there was confusion I dont care I wanted my refund. So then he calls me back and tells me theres a problem because his deliever driver doesnt wanna come back to solve the error and he doesnt have a car... How in the world is this my problem. He then tells me that I cannot speak to the delivery driver because he doesnt speak that much English... Ugh, again not my issue and I have every right to speak with someone. He then told me there was nothing he could do and I should call grub hub. Once I did Grub hub contacted them and he told grub hub it was delievered already to my grandfather. I live in an apartment building never authorized any drop off to my grandfather and sure the hell dont even have a grandfather ALIVE let alone one to pick up my food. Overall this was the WORST WORST WORST experience ordering food. I love mexican but this management of this business is not worth mediocre food. ESPECIALLY for 30$ worth of two tacos! Ridiculous. NEVER will i order and advise anyone to simple not waste there time.", "rating": "1", "date": [2014, 11, 10]}, "7": {"description": "Meh. I ordered from here because my favorite place was closed. Well not only was the food not great, they also forgot half our order. I'll skip this restaurant next time.", "rating": "1", "date": [2014, 8, 20]}, "8": {"description": "The Hubs and I have been real good of staying on track to keep the pounds off but once in a while, I convince him to let us cheat. WIN!I just read the reviews below me. Maybe the ownership did a complete over haul of this spot. We walked right in and saw that the restaurant area at absolutely spotless. There were people eating there than seemed to be enjoying their dinner as well. Which is always a good sign. We were greeted by a cheerful employee by the name of Alfonso as we were looking at the menu, I asked him about the Carnitas. He proceeded to tell me to try em out for free. He made me and my hubs one to try. We loved it. It wasn't over cooked, not too much fat, crisped up a bit. How awesome of him to let us try it before we bought some. Alfonso told us that its dollar tacos on Wednesday and Sundays and that the menu is expanding. I made a few suggestions for him to possibly try making chicharrones Verdes or Rojo. He agreed to see if he can put that on their growing menu and he was so very friendly. The food came up fast. Our food came out delicious. The service was great because they went above and beyond to show us the quality of the food. The pricing is afforable, parking is plentiful, and its easy to get to.", "rating": "5", "date": [2013, 9, 4]}, "3": {"description": "The food here is ok personally I feel that they need to season their meat it's always bland they deliver late which is good when when you're hungry but i've definitely had better", "rating": "2", "date": [2015, 7, 15]}, "14": {"description": "I live near Los Azares and my family and I get food from there almost every week. We think the food is great. I really like Mexican food and they make good Mexican food! I like to  get the chicken tacos in the soft shell. They are moist and delicious. I LOVE their guacamole and chips. I swear their guacamole is made fresh every order. It is as good as some of the most expensive Mexican restaurants  I had had the pleasure to eat in. My daughter loves their rice and beans which are very tasty, and my son goes for their steak tacos. We usually get food to go, but if you wanted to eat in, the place is always very clean. The staff is friendly and welcoming, the prices are good, and the service is pretty fast considering they make it all fresh per order. You cannot go wrong trying it out.", "rating": "5", "date": [2014, 5, 3]}}, "neighborhoods": ["Edison Park"], "latitude": 42.0114017, "longitude": -87.8067849, "rating": "3.0", "times": {"Mon": ["10:00 am", "10:00 pm"], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "10:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": [], "Fri": ["10:00 am", "10:00 pm"]}, "price": "$", "categories": [["Mexican", "mexican"]], "address": ["7148 N Harlem Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Ambience": "Casual", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "27"}, "return-to-youth-chicago": {"comments": {"1": {"description": "Great place! Awesome facials, and products. Knowledgeable staff, the sauna really works to perk you up !", "rating": "5", "date": [2015, 9, 29]}, "0": {"description": "A great place to relax and a great way to treat yourself for a spa day.  Very friendly and knowledgable staff.  They offer infrared saunas, facials, massages and organic smoothies to name a few.  There is also a retail section to pick up beauty products, detox supplies and minerals and vitamins.", "rating": "5", "date": [2015, 12, 17]}}, "neighborhoods": ["Edison Park"], "latitude": 42.00298, "longitude": -87.81698, "rating": "5.0", "times": {"Mon": [], "Thu": ["10:00 am", "7:00 pm"], "Sat": ["9:00 am", "4:00 pm"], "Wed": ["10:00 am", "7:00 pm"], "Tue": ["11:00 am", "7:00 pm"], "Sun": [], "Fri": ["9:00 am", "4:00 pm"]}, "price": "$$", "categories": [["Skin Care", "skincare"], ["Vitamins & Supplements", "vitaminssupplements"], ["Massage Therapy", "massage_therapy"]], "address": ["6716 N Northwest Hwy"], "attributes": {"By Appointment Only": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Accepts Insurance": "No"}, "category": "Shopping", "number_of_reviews": "2"}, "salon-selvaggio-chicago-2": {"comments": {"1": {"description": "My stylist was Lexi (Alexandra). She did an AMAZING job. I went from a really long length into a short bob with highlights and she knocked it out of the park. I have very thick curly hair but she wasn't even phased by the challenge. I ended up walking out with a sleek, straight, fashion forward 'do.  I highly recommend her as a stylist and look forward to seeing her for trims etc in the future. The salon itself is very cool looking and not boring at all. I had my almost 4 year old daughter with me and they were very nice to her while she waited. They didn't mind her being there at all. The other stylists and owner (who is also a stylist there) seemed really nice and friendly too. Again I highly recommend this salon and Lexi. So glad I found this jewel in the Edison Park neighborhood!", "rating": "5", "date": [2013, 2, 24]}, "0": {"description": "I have been going to Madeline at Salon Selvaggio for about 4 years now and would not go anywhere else to get my hair cut. The staff at the salon are great! They are helpful and courteous at all times. Madeline is not only a great person, but the best hair stylist I have ever been to (and we are talking about 24 years of hair cuts). I recently decided to cut my long wavy hair into a short bob. Madeline did an outstanding job! I am now a believer in short hair and wish I would have done it sooner!Not only is the staff excellent and extremely knowledgable, but the salon itself is extremely well laid out. The salon gives a welcoming, chic vibe without being pretentious. Overall, I have no negatives about Salon Selvaggio and would recommend it to anyone looking for a great hair cut and style.", "rating": "5", "date": [2011, 12, 2]}}, "neighborhoods": ["Edison Park"], "latitude": 42.0045518, "longitude": -87.8072717, "rating": "5.0", "times": {"Mon": [], "Thu": ["10:00 am", "7:00 pm"], "Sat": ["9:00 am", "3:00 pm"], "Wed": ["10:00 am", "6:00 pm"], "Tue": ["11:00 am", "7:00 pm"], "Sun": [], "Fri": ["10:00 am", "6:00 pm"]}, "price": "$$", "categories": [["Hair Salons", "hair"]], "address": ["124 S Prospect Ave", "Ste 4"], "attributes": {"Hair Types Specialized In": "Asian Hair, Curly Hair, Coloring", "Parking": "Street", "By Appointment Only": "No", "Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "category": "Beauty", "number_of_reviews": "2"}, "smiley-nails-and-spa-chicago": {"comments": {"28": {"description": "I came in on a summer Tuesday morning. It was not super busy. It's a nice and big place. Clean and quiet. Well ventilated as you can't smell the chemicals. Seems like they are doing their job. Huge plus for this. Warm towels and a quick hand massage after pedi is a nice treat. Most likely I will come back. I'm doing 4 stars because sometimes is hard to understand when you call and conversations between employees is in a foreign language. Not a big deal - just something that could annoy some people.", "rating": "4", "date": [2014, 7, 22]}, "1": {"description": "So I'm a pretty regular customer here & I've started to try out new places in the area bc I'm getting tired of coming here & feeling super rushed by every nail tech or like they don't want to take any time or effort on my nails & toes! On top of that- the last time I was here & got a no-chip- it chipped on 8 out of 10 of my nails within 3 days (I came to get a few fixed & then just gave up)! Today while I'm here- I came with a friend & they started us at completely different times & we never even got to sit & chat, which was the whole point of coming together! Seriously getting disappointed about the situation bc I like to come & support local businesses- but the service & quality are not matching the prices here anymore! Guess I'll be frequenting the newer places popping up in PR or EP!", "rating": "2", "date": [2016, 2, 5]}, "39": {"description": "This is a beautiful salon! Bright windows, friendly staff, nice new TVs. And most important - clean equipment and space! It is a relief to find a place that you aren't worried you will get a bacterial infection (for reals).Got the OPI gel manicure for a wedding (in Lincoln Park After Dark) and it has been perfect for 2 weeks. I brought my mom here. This is my new spot. And there's parking in the rear - hooray!", "rating": "4", "date": [2014, 2, 8]}, "9": {"description": "This place offers great deals! I came in for my birthday, and got $15 off my bill.Sweet! I was also given a card that was valued for a free service with any purchase. Why free manicure yes!! The salon is clean, has a great variety of colors, including a variety of no chip options, and my nails looked great. I just may become a regular:)", "rating": "4", "date": [2015, 1, 12]}, "29": {"description": "A solid place. Stopped in here \"on a whim\" when I was running errands and wanted to squeeze in a pedicure. This was along my normal weekend errands route. I can't say anything really stuck out as being any different than similar nail salons. It was good, solid service and a nice environment. I was pleased with the results.", "rating": "3", "date": [2014, 7, 20]}, "23": {"description": "I love this place and the people that work there. They do such a great job! Every time I go there which is about every 2 weeks at the most. That's pushing it but sometimes the mani will last that long. The ladies do a good job with my cuticles and polish. Smiley's is clean, the work stations are clean. The employees are dressed sort of uniform. I feel like I can't say enough good stuff about this place. You must give it a try and then you won't be able to stop going there.", "rating": "5", "date": [2014, 10, 28]}, "5": {"description": "First horrible manicure experience here ever. I've been coming here since they've opened. Walked in at 1:57. Manicure done by 2:16 not busy. Male manicurist, heavier with glasses. Seemed in a major rush. Seemed like he was pissed that I didn't tip him $5 on a $15 manicure. Should have waited till the end to pay. Sloppy paint job, uneven filing, fuzz in my polish on my nails, no cuticle oil so it looks dry around my nails. Hope this isn't a sign of things to come.", "rating": "1", "date": [2015, 12, 17]}, "31": {"description": "Probably the cleanest and nicest salon I've been to. The atmosphere is super relaxing, and the owner and girls are very kind. You typically get some sort of quick massage with your pedi and/or mani, which is nice. The punch card is awesome, too. Four stars only because both of my no-chips lasted one week TOPS. I'm not sure if that's because it's OPI or what, because I left both times happy with the job they did, but it just didn't last long.", "rating": "4", "date": [2014, 6, 12]}, "25": {"description": "My daughter treated me to a mani-pedi here for my birthday and I was not disappointed. It is very clean, the equipment is all new,  and the employees were very friendly. While it was my first time there, I noticed regular customers were greeted very warmly greeted. Warm towels are used for both the mani and the pedi, which I love. I have had that at other places, but only at higher priced nail salons. For all these reasons, I cannot wait to go back!Your review helps others learn about great local businesses.", "rating": "5", "date": [2014, 8, 27]}, "12": {"description": "Love this place, my go to for no chips . The staff is very nice and courteous, and it is clean! I also enjoy the shoulder massages they give you after any mani or pedi. Don't forget to get their punch cards which gives you a free mani or pedi after so many visits!", "rating": "5", "date": [2015, 3, 9]}, "37": {"description": "My sister told me about this place. I never even knew it existed. It's near my house so I was happy to go check it out! The place itself is very clean. They have parking behind the building but it only has a few spots. There is plenty of parking on the side street, however so it shouldn't be an issue.I walked in and was greeted promptly. I had a reservation because I wasn't sure how busy it would be on a Sunday afternoon and because I'm 9 months pregnant and didn't want to sit around waiting! It wasn't very busy so they took me right away. The girl who did my pedicure was very sweet and helped me in and out of the chair. She made some small talk with me but not too much which was fine by me! She did a great job!The girl who did my no chip manicure was also very sweet. She also did a great job! I was also pleasantly surprised by the nice back and neck massage I received while my nails were drying!Overall I definitely recommend this place. Clean, friendly and reasonably priced!", "rating": "5", "date": [2014, 4, 7]}, "21": {"description": "First time going here, made an appointment for 4:30 on a Friday. Was pretty packed when I got there. The owner greeted me and I selected my no chip. The selection is decent, but my usual place in Elmhurst has many more. I waited 15 minutes passed my appointment time before I got to a chair, though they stated the removal of my previous no chip while I waited which I appreciated. The owner also was apologizing for the wait and in the meantime passed out thanksgiving gifts of this great smelling hand lotion they use-very nice touch and made the wait bearable. She was also great in helping me select a color, I liked the one she had on and we couldn't find it, she kept trying diff colors on me until she found it!I got a guy and he was really precise, did a fab job and gave an amazing neck/shoulder rub. Would def go back here 2 thumbs up!!", "rating": "5", "date": [2014, 11, 22]}, "16": {"description": "First timer today and I plan on coming back.The Appointment and Wait. I called at 9:06 am and got a 10 am slot. I walked in at 10:00 and was surprised to see how many people get their nails done on a Friday morning. I must be doing something wrong... Anyhoo, I went through the usual prompt \"check in\" (aka the awkward greeting/explanation to everyone who turns to look at the open door), picked my colors and sat down in their waiting area. There were 2 ladies already waiting before me but I was up next - guessing they were walk ins? Turned out to be a 10 minute wait for an appointment which isn't too bad for a busy time.The Service. Great execution on the polish. Clean lines and even coats. Hooray! It's seriously tough finding someone who gets this right. My cuticles usually get trimmed within a millimeter of bleeding out and the polish is a second thought. Glad I found someone who cares about the polish and doesn't maul my cuticles. There's the option to upgrade your service with a massage. I didn't upgrade but ended getting a quickie, gentle shoulder rub when I sat down at the drying station. I tipped $10 on my $40 ManiPedi. No idea if that had anything to do with it. Two other ladies joined me at the drying station; only one received a surprise shoulder rub so it doesn't seem to be a standard freebie.The Ambience. It's got a nice calming environment. Open, airy layout and soothing color scheme. I vaguely remember background music which reminded me of a yoga studio. There are 2 tvs on with closed caption running. Everyone seemed to take a cue from the vibe because the noise level was fairly low even though every manicure and pedicure station was occupied when I walked in.Looking forward to my next visit! I plan on bringing in a design to see if they have anyone to meet the challenge...", "rating": "5", "date": [2014, 9, 19]}, "17": {"description": "Love Smileys. Staff and owner are friendly, they greet you, do an excellent job and give great massages! Best nail salon around, hands down!", "rating": "5", "date": [2015, 9, 13]}, "10": {"description": "Great place! Friendly owners and staff! They are efficent,clean, and get you out fast if you are in a hurry!  Accommodate walk- ins quickly.They also give repeat customers little extras at holiday times! The massage that goes with the mani is wonderful! Also have punch cards so you can earn a free mani/pedi after so many visits. I have recommended this salon to many people. Reasonably priced too! It's a win win", "rating": "5", "date": [2015, 4, 26]}, "11": {"description": "This place is really nice as far as nail salons go. It is updated and modern on the inside, and very clean! They usually have at least 10 people working so there is rarely a wait (I've never waited longer than 5 mins and that was on a Saturday morning). They do an amazing job at painting nails. The only reason I didn't give 5 stars is because the last time I was there I got a no-chip manicure and it chipped in less than 3 days. This is the only time this happened so hopefully it was a one time thing.", "rating": "4", "date": [2015, 11, 10]}, "26": {"description": "I like this place! Very nice, very clean. I have been going there for 3 months.  I do manicure once per 2 weeks and it's look good all the time!", "rating": "5", "date": [2014, 8, 20]}, "27": {"description": "Overall it's a solid place to get your nails done in Park Ridge. Most tidbits have already been shared, but I'll run down my perspective:-The exterior is totally unassuming and a far cry from the sleek, modern and super clean interior.-The folks who work here are quiet and professional, so you'll definitely have more of a chance to enjoy the massage pedicure chairs or TV on in the background rather than ladies talking amongst themselves.-Their polish selection is about average - Essie and OPI. They did, however, have a pretty wide selection of colors for the gel/no chip manicures.-I saw a sign and setup for short neck/shoulder massages. -They accept credit cards for services AND tips.-Free parking right in front if you can score a space. Jut be careful backing in!-My pedicure ran me $30 and was pretty sweet with a scrub, lotion, hot towel and accurate paint job.If I find myself in nail need in PR, I'll definitely stop back in.", "rating": "4", "date": [2014, 8, 18]}, "35": {"description": "I haven't been to a nail salon in quite some time. A few months back I had a bad experience and took a break for a while. I have to say I am so happy I came across this place! Super clean, very pleasant nail technicians, comfy chars and my nails never looked better! Thank your Smiley! You have a customer for life!", "rating": "5", "date": [2014, 5, 4]}, "8": {"description": "Overall it's a solid place to get your nails done in Park Ridge. Most tidbits have already been shared, but I'll run down my perspective:-The exterior is totally unassuming and a far cry from the sleek, modern and super clean interior.-The folks who work here are quiet and professional, so you'll definitely have more of a chance to enjoy the massage pedicure chairs or TV on in the background rather than ladies talking amongst themselves.-Their polish selection is about average - Essie and OPI. They did, however, have a pretty wide selection of colors for the gel/no chip manicures.-I saw a sign and setup for short neck/shoulder massages. -They accept credit cards for services AND tips.-Free parking right in front if you can score a space. Jut be careful backing in!-My pedicure ran me $30 and was pretty sweet with a scrub, lotion, hot towel and accurate paint job.If I find myself in nail need in PR, I'll definitely stop back in.", "rating": "4", "date": [2014, 8, 18]}, "0": {"description": "Clean, bright and airy atmosphere.  Technicians are skilled and efficient.  I like the quick service; pedicure and no chip mani are done, and I am out the door in about an hour.  So I guess if you are looking for a \"spa experience\" maybe a different salon would be more to your liking  Also love the back massage afterwards.", "rating": "4", "date": [2015, 10, 12]}, "38": {"description": "I AM SOOOOOOO HAPPY I FOUND THIS PLACE, especially after trying several others in the area that were sub-par!!!!!  They've done an amazing job every time I've been in for no-chip manis and pedicures:) I always leave SMILING and HAPPY and would highly recommend them to anyone!!!!!!", "rating": "5", "date": [2014, 2, 12]}, "20": {"description": "I've been going here since it opened.  I have become increasingly uncomfortable with no English being spoken and lots of giggling back and forth.   On my last visit the technician cut my toenails (angled) causing  in growns.  I also had my eyebrows waxed and ended up with  3 burns that lasted a full week.", "rating": "1", "date": [2014, 12, 1]}, "19": {"description": "This place is a gem! It opened up about a month ago and I was looking for a new nail salon to go to. I'm really glad I gave this place a shot. When I first arrived, I noticed a small private lot located in the back of the salon. They share that parking lot with the neighboring stores. Luckily, I got the last spot in the lot. I had made an appointment at 12:15pm (even though walk-ins are welcome) and when I entered the salon, I was warmly greeted by the salon owners. They thanked me for coming and asked me to pick a nail color. SN&S carries both Essie and OPI products, which is great because I love both lines. As I waited for them to fill up the pedicure bowl, I looked around the salon and I was amazed at how clean it was. Everything was organized, and the salon was so peaceful. They painted it a very soothing mint color and soft music played in the background, which was great because I wanted to relax. They have 6 manicure and 6 pedicure stations, which is great if you have a big party. Bogi was the lady who did my pedicure. She was real sweet and took her time to perfect my nails. She also was really easy to talk to, which was also a plus. Emmie did my manicure and she too was wonderful. The entire staff was very friendly and professional. SN&S accepts cash, check, and credit cards. They prefer if you tip in cash, which many salons expect anyways.I highly recommend this place and I can't wait to go back there again!", "rating": "5", "date": [2013, 8, 16]}, "33": {"description": "Couldn't get in with my L_ _ Nails on Touhy/Lehigh so decided to give this a go.  Yes, decorating is nice but when I get a pedicure, I want the callus' off. No muscle.  Not sure if she was even getting the cuticles.  Touch was way too soft.  Didn't trim nails.  Left polish over the edge of big toe. Told them to forget my no-chip manicure, paid and left.  So tomorrow I will go to my regular, pay again for a great pedicure and know that I had something done. Live and learn.", "rating": "2", "date": [2014, 6, 6]}, "2": {"description": "Longest lasting manicure ever!I'm hard on my nails. Especially when traveling, I break nails in a nearly competitive fashion. I don't know what \"Mark\" did, but I asked for a mani-pedi (chose a vibrant green for the toes) and a French manicure (he offered thick or thin and I chose thin white line). After two weeks of lugging luggage, changing costumes, trekking through Scotland, this manicure took a beating. I even tore off the requisite thumb nails. But I can't believe the manicure clung on. Thank you, \"Mark.\" For all the thankless mani-, pedi-, and mani-pedis, may you and your children be blessed for a thousand generations. While the mani took a beating (best surviving mani I've had) the pedi looks even better (no lugging luggage with my toes).", "rating": "5", "date": [2015, 8, 17]}, "34": {"description": "Make this your nail salon of choice!  Not only is Smiley's clean and beautiful but the atmosphere is extremely relaxing.  Soft instrumental music was piped into the room and absent was the constant ringing of cell phones, blaring television and constant chatter of the customers.  Very calm and serene.Vicky did a wonderful job on my no-chip manicure and offered a back massage after my perfect nails were completed.  Absolutely!  She was sweet and paid careful attention to what she was doing.My no-chip manicure (OPI products as a bonus) was $35 and I will receive a free manicure on my birthday.  Take the punch card that they offer and you'll save $15 off of your 11th no-chip manicure.  Already looking forward to my return visit!", "rating": "5", "date": [2014, 5, 14]}, "32": {"description": "Beautiful salon and location. After reading many positive reviews I decided to give it a try. I had a nice experience there but it's been 8 days and my nochip has started to peel off on 3 different fingers.. I've gotten many nochips before and they never begin to peel this early on! :(", "rating": "3", "date": [2014, 6, 12]}, "18": {"description": "I have been coming to Smiley for over 2 years now and I wouldn't go anywhere different! Betty the owner always makes me feel very special, and all of the employees do a great job.  Sometimes there is a wait, but that is only because they are always busy.  This is a good thing, shows how good of a job they do! I will always go to Smiley!", "rating": "5", "date": [2015, 7, 28]}, "13": {"description": "Was hesitant to try at first, but I am glad I did.  Especially because this place is within walking distance from my boyfriend's house.  Both times I have been so far, I've had good experiences - nails looked great and everything was clean.  My new place in the area, for sure.", "rating": "4", "date": [2015, 3, 10]}, "4": {"description": "This place has gone completely down hill. Just left and not only did they file my nails too short. They gave me the Wrong shape. I took me an entire month to get the length i wanted and with out asking they destroyed that effort. They also can not do nail art, even the simple line i wanted. I am never going back.", "rating": "1", "date": [2015, 11, 25]}, "24": {"description": "First timer today and I plan on coming back.The Appointment and Wait. I called at 9:06 am and got a 10 am slot. I walked in at 10:00 and was surprised to see how many people get their nails done on a Friday morning. I must be doing something wrong... Anyhoo, I went through the usual prompt \"check in\" (aka the awkward greeting/explanation to everyone who turns to look at the open door), picked my colors and sat down in their waiting area. There were 2 ladies already waiting before me but I was up next - guessing they were walk ins? Turned out to be a 10 minute wait for an appointment which isn't too bad for a busy time.The Service. Great execution on the polish. Clean lines and even coats. Hooray! It's seriously tough finding someone who gets this right. My cuticles usually get trimmed within a millimeter of bleeding out and the polish is a second thought. Glad I found someone who cares about the polish and doesn't maul my cuticles. There's the option to upgrade your service with a massage. I didn't upgrade but ended getting a quickie, gentle shoulder rub when I sat down at the drying station. I tipped $10 on my $40 ManiPedi. No idea if that had anything to do with it. Two other ladies joined me at the drying station; only one received a surprise shoulder rub so it doesn't seem to be a standard freebie.The Ambience. It's got a nice calming environment. Open, airy layout and soothing color scheme. I vaguely remember background music which reminded me of a yoga studio. There are 2 tvs on with closed caption running. Everyone seemed to take a cue from the vibe because the noise level was fairly low even though every manicure and pedicure station was occupied when I walked in.Looking forward to my next visit! I plan on bringing in a design to see if they have anyone to meet the challenge...", "rating": "5", "date": [2014, 9, 19]}, "6": {"description": "I wish I could a zero rating.  I had originally written a review the day after my mani/pedi, but because of what has transpired in just a couple of days I deleted it. I didn't want to have anyone use my review as a reason why they go in there, as I paid $65 for what turns out as a lousy mani/pedi.I went in, for the very first (and last) time on a Wednesday.  I needed my mani to last a full two weeks, so I was getting a no-chip manicure.  I was dissatisfied with the pedicure I received because she tried cutting my ingrown toe nail with the regular clippers instead of some smaller ones.  It hurt and when I said \"ow\", she stopped cutting it and left it the way it was.  The pedicure felt very rush.  In fact, she didn't take off all of the red polish.  I decided to give her the doubt and let her do my no-chip manicure.She wasn't paying that much attention to my nails, as she was busy watching the World Cup game.  Keep in mind that I was getting a no-chip gel polish manicure.  Thursday night I noticed an air bubble in the polish of one of my nails and by Friday there were two air bubbles.  I've gotten these type of manicures for years and I have never had a nail break with these.  Well,  on Saturday, while on vacation, my thumb nails cracks right down the middle.  So I've wasted $65 and will need to have work redone, this time by someone who cares about what they are doing!", "rating": "1", "date": [2014, 7, 14]}, "22": {"description": "Best nail salon around.  They do a great job waxing, too!  I've been going here since it opened and recommend it to anyone and everyone.", "rating": "5", "date": [2014, 11, 8]}, "15": {"description": "A solid place. Stopped in here \"on a whim\" when I was running errands and wanted to squeeze in a pedicure. This was along my normal weekend errands route. I can't say anything really stuck out as being any different than similar nail salons. It was good, solid service and a nice environment. I was pleased with the results.", "rating": "3", "date": [2014, 7, 20]}, "7": {"description": "As far as nail salons go, Smiley is the best in the neighborhood. It's clean, spacious and very accommodating. The staff and the owners are very friendly. They have a great selection of colors, both no-chip and regular nail polish. How can you go wrong with a loyalty punch card and a free birthday manicure?! Did I mention to ask for Julie? She is the best!", "rating": "5", "date": [2015, 9, 26]}, "36": {"description": "This place is always so clean and the people are very friendly. I've come here multiple times and have yet to be disappointed. Where other nail salons rush and are not thorough, Smiley does the exact opposite. They even go so far as to give a neck and back massage while waiting for nails to dry.Prices are pretty standard but their service and job well done makes it worth every penny.", "rating": "5", "date": [2014, 4, 12]}, "30": {"description": "I wish I could a zero rating.  I had originally written a review the day after my mani/pedi, but because of what has transpired in just a couple of days I deleted it. I didn't want to have anyone use my review as a reason why they go in there, as I paid $65 for what turns out as a lousy mani/pedi.I went in, for the very first (and last) time on a Wednesday.  I needed my mani to last a full two weeks, so I was getting a no-chip manicure.  I was dissatisfied with the pedicure I received because she tried cutting my ingrown toe nail with the regular clippers instead of some smaller ones.  It hurt and when I said \"ow\", she stopped cutting it and left it the way it was.  The pedicure felt very rush.  In fact, she didn't take off all of the red polish.  I decided to give her the doubt and let her do my no-chip manicure.She wasn't paying that much attention to my nails, as she was busy watching the World Cup game.  Keep in mind that I was getting a no-chip gel polish manicure.  Thursday night I noticed an air bubble in the polish of one of my nails and by Friday there were two air bubbles.  I've gotten these type of manicures for years and I have never had a nail break with these.  Well,  on Saturday, while on vacation, my thumb nails cracks right down the middle.  So I've wasted $65 and will need to have work redone, this time by someone who cares about what they are doing!", "rating": "1", "date": [2014, 7, 14]}, "3": {"description": "I really wanted to like this place.. I went about 3 times over the summer. First 2 manicures were good, see my pic of nail art. (That deserves stars.) it was done by Namuk who I saw on my first couple visits and did a great job. However, my last visit in August was my final. My mom and I made appointments but we literally waited an hour to be seen. They did apologize and gave us a certificate for a free mani in the future, but then my nails were cut crooked, and this is when I noticed that utensils were being shared... Which is just the last straw for me. Cleanliness is my #1 priority at nail salon. I now go down the road to a place where everyone has their own instruments set side and labeled with their name.", "rating": "2", "date": [2015, 1, 11]}, "14": {"description": "This is my new favorite place for nails especially OPI no chip nails. There's a great color selection, the place is clean and the staff is professional and friendly.The girl who did my nails was very attentive. I didn't feel rushed and she did a great paint job. I'd recommend this place to everyone!They also give clients punch cards which gets you a free mani on your birthday and a free mani after ten punches.", "rating": "5", "date": [2013, 12, 18]}}, "neighborhoods": ["Edison Park"], "latitude": 42.011662, "longitude": -87.818977, "rating": "4.0", "times": {"Mon": ["9:00 am", "7:00 pm"], "Thu": ["9:00 am", "7:00 pm"], "Sat": ["9:00 am", "6:00 pm"], "Wed": ["9:00 am", "7:00 pm"], "Tue": ["9:00 am", "7:00 pm"], "Sun": ["10:00 am", "6:00 pm"], "Fri": ["9:00 am", "7:00 pm"]}, "price": "$$", "categories": [["Nail Salons", "othersalons"]], "address": ["7700 W Touhy Ave"], "attributes": {"Parking": "Private Lot", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "50"}, "chicken-inn-chicago": {"comments": {"12": {"description": "I've been ordering chicken from this place for over 15 years. Chicken in great and has been for many years... they chicken in very moist and not dry which we all love", "rating": "5", "date": [2014, 12, 25]}, "7": {"description": "This place has been around for a long time, it's been around before chicken became cool. The chicken is broasted, and moist. The slaw tangy and crisp, the rolls need help just the average white bread kind, I guess this is typical, however I'd like a biscuit instead. I'm not a fan of potato wedges, so to say whether they were good or not wouldn't be fair. Mashed is more my thing which they don't have either.Despite the couple of things that I like with chicken that they don't have, it's about the chicken, and it's pretty darn good, so I'll do the chicken and slaw.This place is way out of the way for me, however inlaws live close by, and sometimes I'm out this way for other reasons, so it's an easy pick up. Another great thing is that they're quick, real quick, nice!", "rating": "4", "date": [2014, 8, 23]}, "19": {"description": "If you like broasted chicken, GO HERE! Before you get out of your car you will start to drool from the delicious scents in the air.It's basically a hole-in-the-wall where you order your food and take it home. However, the chicken is the best I've had in quite a while. The potato wedges are perfectly seasoned and even the slaw was damn good.Soda is RC cola products in cans.Price cannot be beat for the value.Be aware that the parking isn't great, as the lot entrance is off Milwaukee. Getting in is easy, getting out....well wait for a gap in traffic.", "rating": "4", "date": [2011, 12, 30]}, "1": {"description": "I recall this would be our go to chicken place back when I worked at a nearby nursing home in Niles since the had delicious chicken! Broasted chicken is definitely better than the best fried chicken you can find elsewhere! The service was speedy and prices and portion are comparable to this other broasted chicken place along Elston and Foster Ave in Chicago! Unfortunately they don't have as many options for sides... The only bad thing is I was hoping the chicken would be cooked as I ordered so I can really savor the freshness;however, that wasn't the case since it took them less than 10 mins to prepare my 16pc chicken with side of coleslaw to go...Although I have to say that the broasted chicken was tender, moist, not greasy/oily, and very delicious just not too warm so still worth the buy!", "rating": "4", "date": [2016, 2, 12]}, "2": {"description": "The chicken here is on point. I've eaten here so many times and never have I been disappointed. You get it hot, the meat is juicy, and the skin has a nice crisp with a bit of seasoning too. This is a very small carry out place so call ahead for your order. If you want to feed a lot of people, they can make up to a 100 piece chicken order. Prices are reasonable for the quality and the service is pretty quick. Keep in mind that I only get chicken so I can't speak for the sides. Come here for some tasty chicken that you'll enjoy!", "rating": "4", "date": [2015, 12, 28]}, "9": {"description": "Being relatively new to the area and having a craving for fried chicken, my wife and I decided to give Chicken Inn a try.We got a 10 piece buffet box with rolls and potato wedges.  The exterior of the chicken was a bit on the greasy side, but the flesh was nice and moist. The potato wedges were quite large and not greasy like some I've had at other places. The rolls, however, were generic white bread type rolls without much flavor or substance. It's a shame that biscuits aren't an option.Overall, Chicken Inn was good, but unexceptional. I'm willing to give it another try and sample some different menu items.", "rating": "3", "date": [2014, 10, 2]}, "6": {"description": "We love Chicken Inn!  It's our favorite chicken - and we have tried them all.  Always good, quick to order, no frills and consistent.  The place is an old carryout joint so your need to keep expectations low for decor.  I have read some of the negative reviews and am scratching my head, because in our 5 years of patronage, we have never had a bad experience.  We only order chicken and cole slaw...never tried anything else.  Just ordered a box for a family party today and cant wait.", "rating": "5", "date": [2015, 11, 1]}, "18": {"description": "Best Cold Chicken Ever!!! 4 stars people! So, then imagine it hot.", "rating": "4", "date": [2014, 11, 8]}, "10": {"description": "I wasn't impressed. Ordered a chicken dinner white meat. There was really no flavor to the chicken or potato wedges. The coleslaw was the best part...the Chicken was moist but I've had better. Wouldn't eat here again.", "rating": "2", "date": [2014, 12, 6]}, "13": {"description": "Chicken Inn has been here forever so they must be doing something right.  Take out only.  Parking is limited but works.  Retro atmosphere is not the way I would describe it.  More like, badly in need of a renovation.  Everything is just old.  That's ok, but not cool and retro as one reviewer described.  It's all about the food right.  We ordered 50 pieces of chicken and potatoes for a kids birthday party. We picked it up right on time and drove it directly home.  No delays.  We liked the chicken. The chicken was tender and delicious with a flavorful light breading.  It's been many years since we ordered from here because we didn't like the potatoes last time.  Another reviewer said his  had \"a bit of a crunch on the outside and creamy in the middle.\"  That would be great.  Perfect.  Exactly how I like them.  Our were wet and soggy and a little under done in the middle.  That's how they were years ago and that's how they were today.  No one, and I mean no one, not even the kids ate more than one bite of the potatoes.My wife wanted to give it four stars because she liked the chicken, and I said one star so we settled on two.  Back to Browns I guess.", "rating": "2", "date": [2012, 10, 31]}, "16": {"description": "The Chicken Inn has a very cool retro sign and a lot of great reviews so I had to try it one night when I was desperate for a quick, close, good take out meal.  Its a tiny storefront pick up basically....  I tried the chicken & ribs combo with broasted potatoes per many other reviewers.     I have to tell you - I thought it was just ok.   After the glowing reviews I had pretty high expectations, and it came in as a bit disappointing.      The chicken was pretty darn ok, just not great.   It was moist and there was a decent amount of meat which are two positives..    They give you coleslaw which I tried a bite of - and thought was really bland.    The ribs were again - pretty darn \"ok\".    The broasted potatoes everyone raves about on here were not bad at all - just nothing in my opinion to write home about.   I guess I was just expecting more.   Would I go back....hmmm.  Well, I would probably go back if I had a rare craving for that type of chicken... because there really isn't any great competition around here  (to my knowledge) for that type of food. I also would totally consider them for catering!   Since I do think their chicken was pretty good - I would definitely consider ordering large quantities for a party - where I add my own sides/salads.    I think people would be satisfied.   Nut nut - I'm going to give this place a solid 3.  Not bad.  Just not extraordinary.", "rating": "3", "date": [2012, 6, 22]}, "17": {"description": "Some of the best chicken on the Northwest Side.  Sure one could drive 45 minutes south to get better chicken, but why bother?  This hits the spot and always a crowd pleaser.The side orders are okay, I think the onion rings are good, but otherwise not much else on the menu to talk about.  I think the chicken nuggets (i.e., chuggets) are weak at best.  Skip 'em.", "rating": "4", "date": [2012, 12, 27]}, "15": {"description": "Not sure what has happened to this place, but it's definitely not the same from a couple years ago.  There has always been teenagers running the back, so I don't want to blame them, but lately the food has come out not cooked all the way, soggy, and just very oily.  So oily that it actually ripped through the box they put it in.  So of course as soon as I get home, I had about 10 pieces of chicken on the floor.  I wish it was same place that I used to love back in 2011, but sadly it's not.  I also wanted to share a funny/odd/strange story with this place.  A few months ago I called at about 8:30pm, ordering about 15 pieces of chicken wings.  They told me that it will be ready in 10 minutes.  So I get there about 8:45 (place closes at 9 or that's what their website said) and I notice that it was somewhat dark in the strip mall it's located in.  Not thinking much, I drove up and started to park.  Then I looked inside and noticed the entire place was dark!  I see a big guy walking in the back, so I call to make sure that I 1) called the right place and 2) that they were open.The guy picks up, I say hello.. then he hangs up!  WTF?  So I walk towards the door, peep in, and start knocking.  Doors locked, lights off, and the place was closed.  WHAT THE HELL HAPPENED TO MY CHICKEN WINGS?!?!?!!?", "rating": "1", "date": [2013, 6, 18]}, "0": {"description": "Very good chicken:-Chicken:  good, juicy, skin/crust perfect balance of salt and seasoning, not greasy, very flavorful-Coleslaw:  very good - very much like a Browns chicken, creamy style-Broasted potato wedges: a little dry, not much flavor.  Reminded me of a regular potato boiled and cut into fourths.  Not spectacular, I'd probably try French fries next time.Conclusion:Over all the experience was good.  The review speaks for itself.  The only con is that it's kind of on the pricey side.4 piece dinner upgraded with two breasts instead of thy / leg $14.", "rating": "5", "date": [2015, 10, 19]}, "5": {"description": "Ordered box of 30 pcs. of chicken, with broasted potatoes & fried mushrooms Sunday at 11;30 for a party at 5:00.  It was delivered a little early (no problem - it was in a box that kept everything nice & hot.) and hassle free.  Delicious and much less hassle than cooking for my large family gathering.  Normally this group doesn't go for Fried Chicken - but this chicken is REALLY DELICIOUS and won everyone's thumb's up! Thanks Chicken Inn!", "rating": "5", "date": [2015, 9, 14]}, "11": {"description": "Overpriced chick shack carry out place. He two bored teenagers here see not helpful at all and there is a limited menu. No seating in this place and the chicken is not even that good. Not much else to say about this dump.", "rating": "2", "date": [2014, 9, 19]}, "8": {"description": "A legit stop if you're looking for kickass chicken. Always super juicy, never dry. Coleslaw is awesome. Delivery is very fast if you don't feel like picking up. Only gripe is the fries, they are always limp and soggy.", "rating": "4", "date": [2015, 4, 29]}, "3": {"description": "Chicken Inn is near perfect for what it is - hole in the wall greasy chicken stand.  This is pure, honest chicken.  No frills, no fusion or a hundred sauces to choose from.  The chicken is always hot, the breading always perfectly cooked and crispy, and the meat always moist and tender.When you're in a Chicken Inn mood, nothing else will do.", "rating": "5", "date": [2015, 7, 24]}, "14": {"description": "Got an 8 piece chicken box with no sides. Chicken was really good.", "rating": "4", "date": [2014, 10, 3]}, "4": {"description": "Very Disappointed !!! This was definitely over priced. I ordered a chicken dinner and as for the chicken it was fresh and hot but for the side I got the brosted potatoes but I received just 2 potatoes wedges. I wouldn't recommend this restaurant. I would of had better at Jewel !", "rating": "1", "date": [2015, 7, 27]}}, "neighborhoods": ["Edison Park"], "latitude": 42.0180283, "longitude": -87.8071671, "rating": "4.0", "times": {"Mon": ["4:00 pm", "9:00 pm"], "Thu": ["4:00 pm", "9:00 pm"], "Sat": ["10:30 am", "9:00 pm"], "Wed": ["4:00 pm", "9:00 pm"], "Tue": ["4:00 pm", "9:00 pm"], "Sun": ["11:00 am", "9:00 pm"], "Fri": ["4:00 pm", "9:00 pm"]}, "price": "$", "categories": [["Chicken Wings", "chicken_wings"], ["Barbeque", "bbq"]], "address": ["7536 N Milwaukee Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Divey", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Dinner"}, "category": "Restaurants", "number_of_reviews": "58"}, "siam-treasure-thai-restaurant-chicago": {"comments": {"12": {"description": "We ordered from Grub Hub and tried this place for the first time. We loved it! The Garlic Chicken is amazing. It is pounded out thin and sautéed in a light sauce. The vegetables are done to perfection. The egg rolls are now a favorite in my home, they are smaller, crunchy and taste fresh. The Pad Thai was delicious, i do recommend asking for extra lime because by the time you get it delivered it is a bit dry. Adding the extra lime takes care of the issue.Will order again", "rating": "4", "date": [2015, 3, 15]}, "7": {"description": "This place is hit or miss.  The first time was a success, good food and made timely.  My following order was 50 min late, no apology, bland and smaller portions.  My third and final order was via Grub Hub.  I liked ordering via Grub Hub cause at least I could see their full menu.  One of the dishes had \"ground beef\" and I asked for sliced beef on that entree.  They called right after the order was placed arguing who let me place an order like that.  Excuse me?  They said they never make exceptions and menu is as is.  I said that the other times I ordered no one said anything, just made it.  They said phone orders are not Grub Hub orders.  Which means that since they have to pay % to Grub Hub, they skimp on your orders.  And they do, the portions were half the normal small size.  Also, in the winter they use gas outdoor heaters inside, you could get carbon monoxide poisoning sitting there the fumes were so intense.", "rating": "3", "date": [2015, 7, 9]}, "19": {"description": "This has been my go to favorite Thai place for years.  The food is consistently good.  The staff always happy to see you and very friendly.  I garlic chicken and Pad see ew are my two favorites.", "rating": "5", "date": [2015, 11, 23]}, "1": {"description": "Cute little hole-in-the-wall date place! 1) Super casual atmosphere- when you're not up for dressing up and going some place that's fancy but still has yummy, filling food- this place takes the cake. The walls are brightly colored and the place itself is warm and cute. 2) Great service- very attentive and the woman (I believe she is the owner) treats her patrons like family. It had that homey family friend atmosphere- and was super laid back and causal. You can tell she really cares about her customers. They also include little Asian hard candies with your check so I thought that was a very cute touch that not many places do. 3) Prices- I believe for two people with drinks (BYOB and Tea) was around $30.00 which I say is pretty reasonable considering we ordered appetizers as well as two main courses. 4) Parking- very easy to find as this place is in a strip mall.5) Food- actually quite decent. It's not the BEST Thai food I've had, but it was decent for being a hole-in-the-wall joint. I did LOVE the the peanut sauce and would recommend it as it definitely was probably the best I've ever had. I was disappointed that they did not have any sort of coconut rice, but they do have coconut in their curry as traditional Thai places do. Definitely recommended for when you want someplace simple and casual but still good.", "rating": "4", "date": [2015, 10, 22]}, "2": {"description": "Ordered for pick up. This place has deceptively good pricing because the portions are small.The spring roll appetizer was very small compared to other Thai places, and it appeared to have been sitting in the fridge for a few hours beforehand. (Only in the suburbs can you get away with serving pre-made food.) Not a good way to start the meal.The entrees, pad see ew and green curry, were tasty, but small. I don't feel like two normal sized adults should be paying $23 only to still be hungry after finishing.The value proposition is just not there.", "rating": "2", "date": [2016, 2, 24]}, "9": {"description": "I came across this place because I was in the area and it received pretty good reviews. Our food came out at different times and by the time I got mine, my boyfriend's dish was already cold. I originally ordered the papaya salad with shrimp. However, the waitress brought out the wrong dish and she seemed annoyed when I told her I had ordered something else. She immediately swept the dish off our table and threw it on an empty table. She came out a few minutes later and said that they can't make papaya salad with normal shrimp but could make it with baby shrimp. I decided to just order something else so I settled on the basil beef. All of our dishes were small and my friend had to order another entree because he was still hungry after his dish. Overall, the food was okay but the service was terrible.", "rating": "2", "date": [2015, 5, 4]}, "6": {"description": "Love this place as our go to take out for dinner. The hostess is always pleasant to talk to, very polite and courteous. Food is awesome, even my picky kids love it. It always saves me from cooking dinner!", "rating": "5", "date": [2015, 12, 8]}, "18": {"description": "My wife and I came late on a Friday evening, a few minutes before closing - yet they greeted us with smiles and never rushed us.. Food was excellent! I had the Pad Thai and the wife had the Thai Orange Chicken. Will definitely be coming back.", "rating": "5", "date": [2015, 5, 9]}, "10": {"description": "I found myself running errands nearby after work and was starving by the time I was finished. Enter Siam Treasure.We called in our order, but the woman on the phone quickly thanked us and hung up before we could ask how long it would take. We kept shopping, and as we were driving to the restaurant, we got a call telling us our food was ready. Good service.Parking was fine - there's a small lot for the strip mall where Siam Treasure is located. Oh, and I didn't go in, so I can't comment on the ambiance, but there is a sign on the door that states this place is BYOB. As my husband was getting back in the car after getting the food, he mentioned a sign on the door said free eggrolls with a $20 purchase. Darn, we hadn't mentioned it, or known about it since we were first timers. When I got home, I saw the 4 eggrolls were in our bag. Extra star for them!We started with the crab rangoons. I have to say, they are up there with my favorites. Just the right amount of cream cheese and crab, plus they're more round shaped than triangle shaped, like usual. Way better to dip and cover in sweet and sour sauce.We then moved to the eggrolls, which were also different than a traditional eggroll. They were skinny and reminded me more of a fried spring roll than an eggroll. Still, good taste, and they were free!Moving on the the main dishes, I had the pad see ewe. It had a good amount of meat and broccoli in it, and the noodles were cooked just right. My sole criticism was that it lacked some spice. I didn't order it spicy or anything, so perhaps shame on me, but I do wish it packed a bit more in the flavor department. I did add some chili paste that came in a separate container and it added just what was missing.My husband ordered pad woon sen, and the dish was great. I loved the glass noodles, so delicate and small, but great taste. A good amount of veggies too.Prices were reasonable and in line with what you would expect. I think the rangoons were $4.50, the pad see ewe was $7.50, and the pad woon sen was $8. Again, FREE eggrolls!Man, I wish I lived a bit closer as getting up Harlem can be a pain during rush hour (prime dinner hour), but I will definitely be up for making the trek for the delicious food.", "rating": "5", "date": [2014, 10, 22]}, "13": {"description": "After years of living in the downtown area with multiple Thai restaurants within a mile of my home, moving back to the burbs made me realize how much I took great, fast Thai food for granted. I recently lucked out and found Siam Treasure where they serve excellent versions all of my favorite dishes.  The Pad Se Eu is not to be missed.  I recommend Siam Treasure for anyone looking for a great Thai meal in the Park Ridge/Niles area", "rating": "5", "date": [2014, 12, 16]}, "16": {"description": "I don't know how this place gets high ratings. I ordered online for immediate pick-up. When I arrived after 10 minutes, they hadn't even placed the order and was told to wait 10-15 minutes. The cucumber salad was ok - nothing unique. I ordered chicken pad thai and asked to make it spicy. Asides from a few red pepper flakes, there was no spice. And it was very bland. I think I could make better at home. I definitely will not go back.", "rating": "1", "date": [2015, 12, 5]}, "17": {"description": "I was in the mood for curry, and met a friend here. This was quite good. I got the mummon curry or whatever it's called. I know it started with an M. Wasn't very spicy, and was a decent portion. I even enjoyed the left overs :)My only complaint would be the kanam-Jeep. The onions or whatever is on top of them was dry, and crunchy. The dumpling like things were fine, but just that dry crunchy stuff took away front he moist, softness that I enjoy with that appetizer.Appetizer was served very close to our entree which I wish there was a bit of time between them. Better than them both taking forever, but that was something I like to see.No real complaints other than what I listed. Thai Iced Tea was made well. I asked if they could use coconut milk instead of their dairy creamer, and they said that don't do that. It was an expected response for me, but just a heads up for you dairy-sensitive folk.", "rating": "4", "date": [2015, 1, 5]}, "15": {"description": "Mom and pop Thai place with an ordinary, small seating area but friendly service and really good food.  Good quality, fresh vegetables are apparent from their cucumber salad to their red curry.  Portions are sized for a normal human being with a big appetite.  Prices are good and the people friendly.  I've been here several times and look forward to my next visit.", "rating": "4", "date": [2015, 6, 8]}, "0": {"description": "The family that owns this place are extremely friendly and polite.  The food is always outstanding. And always make you feel welcome.", "rating": "5", "date": [2016, 2, 20]}, "5": {"description": "Overall one of the best Thai restaurants I've ever visited! + Super sweet and attentive service!+ Clean dishes, glasses and utensils+ Decent lunch and dinner prices+ Unique dessert options+ Overall food quality was high+ Clean atmosphere with casual environment+ Asian hard candy with check, lychee! 22.44 + tip, for two full dishes (not lunch size), fried tofu appetizer and a Thai iced tea.Will definitely be back, and recommend whenever in the mood for a Thai food fix.", "rating": "5", "date": [2015, 6, 3]}, "11": {"description": "Excellent food!  Have not eaten in restaurant but have had take out for 10+ years.  Food is always hot, fresh and ready for pick up in a timely manner!", "rating": "5", "date": [2015, 10, 30]}, "8": {"description": "The best Thai food in the area..has never disappointed with the taste and flavours. Highly recommended", "rating": "5", "date": [2015, 11, 17]}, "3": {"description": "Place is awesome. Staff is funny, can't understand them half the time, but they're very nice.", "rating": "5", "date": [2016, 2, 15]}, "14": {"description": "The Thai iced tea tastes great except they fill the cup to the brim with ICE so you're basically paying ~$3 for ice with a little Thai tea.", "rating": "3", "date": [2015, 9, 2]}, "4": {"description": "Yes the people are nice, but the food is not so good. I ordered egg role and was given vegetable spring rolls. They were okay.  My shrimp crazy noodles had a nice spice and the shrimp seemed fresh but the noodles were all stuck together creating a big lump. Honestly, they were far from the best Thai I've eaten. The fried rice lacked flavor.  I've eaten here before and enjoyed it. While I was in the neighborhood I thought I'd pick up dinner. I won't be visiting this restaurant again.", "rating": "1", "date": [2016, 2, 23]}}, "neighborhoods": ["Edison Park"], "latitude": 42.0114288330078, "longitude": -87.8069915771484, "rating": "4.0", "times": {"Mon": ["11:00 am", "9:00 pm"], "Thu": ["11:00 am", "9:00 pm"], "Sat": ["11:00 am", "9:00 pm"], "Wed": ["11:00 am", "9:00 pm"], "Tue": ["11:00 am", "9:00 pm"], "Sun": ["4:00 pm", "9:00 pm"], "Fri": ["11:00 am", "9:00 pm"]}, "price": "$", "categories": [["Thai", "thai"]], "address": ["7152 N Harlem Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Casual", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "95"}, "mikes-barber-shop-chicago": {"comments": {"1": {"description": "Quality haircut at a good price.", "rating": "4", "date": [2012, 1, 23]}, "0": {"description": "Great neighborhood barber shop.  Good haircut and a straight razor trim. . . . doesn't get much better.", "rating": "5", "date": [2009, 6, 4]}}, "neighborhoods": ["Edison Park"], "latitude": 42.00218, "longitude": -87.81572, "rating": "4.5", "times": {"Mon": [], "Thu": ["8:00 am", "6:00 pm"], "Sat": ["8:00 am", "4:00 pm"], "Wed": ["8:00 am", "6:00 pm"], "Tue": ["8:00 am", "6:00 pm"], "Sun": [], "Fri": ["8:00 am", "6:00 pm"]}, "price": "$", "categories": [["Barbers", "barbers"]], "address": ["6680 N Northwest Hwy"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "No"}, "category": "Beauty", "number_of_reviews": "2"}, "xanna-salon-spa-chicago": {"comments": {"12": {"description": "Recently got my hair cut by Eva. She was very nice and listened to what I wanted. Did a fantastic job on my hair, beyond what I expected! I absolutely love my new style! I will be back!", "rating": "5", "date": [2013, 5, 15]}, "3": {"description": "Edison Park hidden gem!  Had a spa no chip manicure and pedicure by Eva. She gave exceptional service with great conversation.  I highly recommend this spa, it's quaint, friendly, attentive, and above and beyond service.   Look forward to my facial and hair services to follow soon.  They use high end Loreal products without ammonia or peroxide, highlights and color are recommended here as well.", "rating": "5", "date": [2015, 4, 23]}, "1": {"description": "The salon was fairly nice, but pretty dark (how can you see what you're doing). Place was super affordable at $35 for a wash and haircut. Didn't get a blow dry because it was so hot out.Eva was extremely nice, however my hair is a disaster! Left side is a perfect chin length bob with long layers. Right side is a long wedge. Uneven. Puffy. It's really bad. Should have waited to go to my girl downtown. You get what you pay for... I'd rather pay $100 for a haircut that always looks good, even 4 months after or wait. Will never go back. Options right now are wait for a grow out or go short.", "rating": "1", "date": [2015, 7, 22]}, "2": {"description": "This is my second trip to this salon/spa & my daughter & I couldn't be more pleased! We've both gotten cut/color & brows done! This visit I added a facial which was incredible!  The best facial that I have ever gotten!  Highly recommend this salon!  We are from Pittsburgh & I will more than likely return again!", "rating": "5", "date": [2015, 8, 20]}, "9": {"description": "This salon is a hidden gem!  I've tried many salons in park ridge and edison park.  Xanna is top notch on my list.  The atmosphere is intimate and relaxing.  My stylist, Sam transformed my hair to look glamorous and vibrant.  It's Soooo refreshing to find someone who can cut Asian hair!  I'm very happy with my new style!  Highly recommend this salon!!", "rating": "5", "date": [2014, 3, 29]}, "10": {"description": "Xanna salon is hidden gem and hands down the best salon in the Norwood Park/Edison Park area. The owner Hanna is so sweet and very accommodating. Irena has been coloring my hair for the past several months and I could not be happier. She is a perfectionist and takes her time. I am extremely picky when it comes to my hair, and she has never disappointed.", "rating": "5", "date": [2014, 3, 14]}, "4": {"description": "Manicures and Pedicures by Vicki are excellent and very well priced.  Especially love the new \"Naked Manicure\" I got last evening that actually helps nurture your nails.  Owner is available 24/7 to make appointments via her cell phone ... incredibly dedicated to customer service.  Conveniently located on NW Highway ... ample free parking behind.  So glad I followed Vicki here from her previous salon!", "rating": "5", "date": [2015, 8, 26]}, "6": {"description": "I had my hair cut by Eva for the second time last weekend and I am officially a huge fan of her and of this salon.  They got me in on a Saturday morning with pretty short notice.  When I got there, the owner took my coat and hung it up and offered me coffee and cookies which was really nice and unexpected.  I waited for maybe 5 minutes and then Eva took me right on time at 11 a.m. She makes you feel very comfortable and is very friendly but not overly talkative.  Best of all, a great haircut is only $35 which is not much considering some other salons in the area are getting away with charging $60!!!  I will be moving out of the Edison Park area in the summer but will definitely keep coming back here for my haircuts.  It's not easy to find a reasonably priced place with a stylist who is as nice and awesome as Eva!", "rating": "5", "date": [2013, 12, 24]}, "15": {"description": "3 hours for a basic manicure and basic pedicure. Way too long. Manicure lasted a while which is good.", "rating": "2", "date": [2011, 9, 28]}, "0": {"description": "Love my stylist Eva she always has wonderful suggestions and always very professional. The salon has a wonderful atmosphere everyone there is so helpful. Thank you Eva", "rating": "5", "date": [2015, 11, 20]}, "5": {"description": "Great atmosphere and great staff. The owner is amazing and always goes out of her way to make you feel special!!!", "rating": "5", "date": [2015, 2, 4]}, "13": {"description": "Hands down the best pedicure I've received in years. Luscious spa products that don't cause an allergic reaction in my skin, beautiful OPI polishes, a long and relaxing massage and nail polish that doesn't budge for weeks..which is an amazing feat for someone who works out 4 days a week. The salon is warm and inviting with a great progressive dance music coming through the speakers. Hannah and staff are very friendly and welcoming. This little Edison Park gem is not to be missed. I have yet to try a facial, but have heard rave reviews about Hannah and she uses Murad products. Excellent.", "rating": "5", "date": [2012, 3, 3]}, "11": {"description": "I'm very fussy who cuts my hair Lindsey the only one I trust to cut my hair I've been going to her since she started Great hair stylist. Brenda M", "rating": "5", "date": [2014, 2, 27]}, "8": {"description": "Love. ... love. .. I was basically a walk in at 4.45pm on Saturday,  they close at 6pm. I received a trim from an amazing stylist who was a bit chatty but gave me the best trim EVER!!! She maintained my style and did not over cut like most stylist do. Xanna was patient and warming throughout the service.  I started with a full leg wax that turned into a bikini, under arm and brow wax..... that was all trust and comfort in her! The session went over 2 hours and we left together after 8.15pm... best service! !! It's nice not feeling rushed and to be able to add more services.  She could have said \"no\" as most spa owners do when it's closing time.  Highly recommend and the price was more than reasonable for all the services I received!! I will definitely be back!!!!", "rating": "5", "date": [2014, 3, 22]}, "14": {"description": "Sam is the best stylist! Let him recommend a great style for you. He has the artist's touch with color and cuts. Go to Xanna!", "rating": "5", "date": [2014, 2, 20]}, "7": {"description": "Totally loved the service, top-notch approach to their business. The prices are fantastic, too! A very friendly owner, and the staff overall. Coming back.", "rating": "5", "date": [2014, 12, 6]}}, "neighborhoods": ["Edison Park"], "latitude": 42.0016244, "longitude": -87.8146541, "rating": "4.5", "times": {"Mon": [], "Thu": ["10:00 am", "7:00 pm"], "Sat": ["8:00 am", "8:30 pm"], "Wed": ["10:00 am", "7:00 pm"], "Tue": ["10:00 am", "7:00 pm"], "Sun": ["10:15 am", "1:00 pm"], "Fri": ["9:00 am", "7:30 pm"]}, "price": "$$", "categories": [["Hair Salons", "hair"], ["Nail Salons", "othersalons"], ["Skin Care", "skincare"]], "address": ["6650 N Northwest Hwy", "Ste 101"], "attributes": {"Parking": "Valet, Garage, Street, Private Lot", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Accepts Bitcoin": "Yes", "Good for Kids": "Yes"}, "category": "Beauty", "number_of_reviews": "16"}}