{"burger-king-chicago-48": {"comments": {"3": {"description": "As far as speed is concerned, this place is a disaster. They're ALWAYS under staffed any time I visit which results in extremely slow lines. Sometimes you have to wait 20 minutes for your food, and the employees always seem to have an attitude. On the bright side, the fries and the food are always fresh, and they accept coupons that come in those little Burger King booklets, which is a plus.", "rating": "2", "date": [2013, 6, 7]}, "1": {"description": "This Burger King is rude and lack any customer service.  They got the order wrong and when I returned all hell broke loose. They took the good back and refused me my money. And attempted to call the police on me. We waited 2 hours and all this time they lost thousand of dollars over a twenty dollars order.", "rating": "1", "date": [2014, 7, 21]}, "2": {"description": "HORRIBLE experience.  Closes before midnight, even though the drive-thru menu board advertises \"Open til Midnight or later\", which I won't take away points for, because that could mean at participating locations only.  So I didn't get to order anything on my first visit, however, my second visit I made sure to go during early evening hours, was asked to wait a few seconds to place my order by the drive thru cashier, waited at least five minutes to place an order, confirm the order, and be given my total.  Waited another five minutes to receive my food.  NEVER visiting this place again.", "rating": "1", "date": [2015, 2, 25]}, "5": {"description": "Went for the New Frappe cashier said they don't have the machine but the commercial advertising it has been airing for 3 weeks. Get it together people!!!!!", "rating": "1", "date": [2012, 8, 2]}, "0": {"description": "It's Burger King, not haute cuisine. Keeping that in mind, however..this place could stand for some help.Staff is so-so, the garbage inside and out can be a bit off-putting, even though I've never caught any whiffs of anything, but I'd definitely be on staff about dumping the cans, inside and out of this place more often than they do if I managed this place. I disagree with Baroness D. that the employees only show favor to people with no class. It's all about your attitude with them. If you walk in with your nose up, as if you are judging them, then they have a problem. It's not right, it's not fair, but it's been my observation, as while the service ain't the best, I've never been treated rudely or suffered any rudeness from them. Truthfully, I've never been to the bathroom here, as the garbage teeming in the cans pretty much told me to stay away. But, like my star rating says, I've experienced better.", "rating": "2", "date": [2011, 3, 25]}, "4": {"description": "I dread coming to this place for many reasons, but it is the closest fast-food restaurant to me, so I really don't have any other choice. Let me give a rundown of the reasons why I dread coming here:1. hypes hanging out inside and around this place2. horrible customer service3. employees have too much of a nasty attitude, and only show favoritism to customers who aren't like me (the customers they favor being those who have absolutely no class or nothing going on in their lives)4. restrooms aren't adequately stocked with toilet paper because the stupid, broke, lazy hypes steal it!5. not too fond of BK anyway, because many of the sandwiches and other staples they have are only for a limited time unlike McDonald's, White Castle, or Arby's, who keep their new additions permanently it seems.", "rating": "2", "date": [2011, 3, 10]}}, "neighborhoods": ["Englewood"], "latitude": 41.768604, "longitude": -87.644866, "rating": "1.5", "times": {"Mon": ["6:00 am", "11:00 pm"], "Thu": ["6:00 am", "11:00 pm"], "Sat": ["6:00 am", "1:00 am"], "Wed": ["6:00 am", "11:00 pm"], "Tue": ["6:00 am", "11:00 pm"], "Sun": ["6:00 am", "1:00 am"], "Fri": ["6:00 am", "1:00 am"]}, "price": "$", "categories": [["Fast Food", "hotdogs"]], "address": ["6900 S Halsted St"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Loud", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "6"}, "fire-jerk-jamaican-jerk-chicken-chicago": {"comments": {"3": {"description": "Man I love this place the salads , jerk, meat not jus chicken but fish also is scrumptious , good customer service, friendly people and u get what you pay for!!!", "rating": "5", "date": [2015, 3, 31]}, "1": {"description": "I read the reviews and headed south to this place. We ordered Jerk Chicken and Jerk Catfish with a side of Mac and cheese. Everything was dried out. The Mac and cheese was overcooked, dry and like a cake square. ODD.  I tried ... 2 stars because the staff was nice and the facility was clean.", "rating": "2", "date": [2016, 3, 4]}, "2": {"description": "This is my new go to spot, the food is fresh and tasty. The staff is very friendly which is hard to find on the southsideof Chicago. Great customer service, its awesome when the staff hands you your food and says \"Thanks for coming in\"  Please try the Mac Cheese you will not be disappointed, someone's grandma is in the back baking this tray of cheesy blessing. I usually call ahead and the ETA are always  beyond reasonable.", "rating": "5", "date": [2015, 11, 3]}, "5": {"description": "I got the jerk catfish. It did not taste or look like jerk catfish. The fish, cabbage, rice and beans were so nasty. I think the food had been cooked a while ago. They also did not have any seasoning on the food. I took three bites and threw the rest away. Not worth your money.", "rating": "1", "date": [2015, 5, 20]}, "6": {"description": "The best jerk and American food in the mid west. Representing New York, Chicago, and Jamaica... Management is very professional and courteous.. Love it all a must try...", "rating": "5", "date": [2015, 4, 9]}, "0": {"description": "Definitely will be my must go to spot when visiting Chicago. Fast service and delicious food huge portions definitely get your money worth.", "rating": "5", "date": [2016, 1, 16]}, "4": {"description": "I pass by this establishment every day heading westbound so I decided yesterday I wanted to try them.  Plus I had a taste for jerk chicken.  I reviewed the reviews on here and it seemed like a place to order from.  I wanted to review the menu before I called to place my order but I couldn't find one so I called and took my chances.  I spoke with a nice lady who explained what comes with the jerk chicken dinner and gave me a few meat options(white, dark or mixed).  She told me 10  minutes.  I arrived 25 minutes later.  The place is small, no place to eat in, limited parking.  Inside it was clean as well as the outside.  It's located in Englewood, near the corner of 55th & Halsted.  A rough neighborhood, but this gem is worth the visit.  Courteous service, neatly packaged.  Reasonable prices.  The food was delish.  The chicken was spicy already without the sauce.  The sauce was heavenly.  Mac & cheese tasted like my mother's(RIP mom).  The cabbage was multi colored with carrots mixed in there, loved it too.  The rice and beans had a sweet-like taste to it.  They also gave a slice of the Jamaican bread.  It was $10 and worth each bite.  I had 4 pieces of chicken there, I ordered the mixed chicken.  Leftovers for the next day.  U will not be disappointed.  I'm glad there's a jerk chicken place on the way home.  I support the independent businesses.  They will see me again soon.  Phone first so your order will be ready.  A couple of folks asked me how did I get my order so fast.  Lol.  Bon apetit.", "rating": "4", "date": [2015, 7, 16]}}, "neighborhoods": ["Englewood"], "latitude": 41.7944020905057, "longitude": -87.6446318998933, "rating": "4.0", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["11:00 am", "11:30 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["12:00 pm", "8:00 pm"], "Fri": ["11:00 am", "11:30 pm"]}, "price": "$", "categories": [["Caribbean", "caribbean"]], "address": ["754 W. Garfield Blvd"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "7"}, "webster-street-picture-frame-co-chicago": {"comments": {"14": {"description": "Posters not cutting it anymore...tired of hanging things with scotch tape...time to get your self  \"Framed \"as in artwork for a more grown up look in your home.  This tiny frame shop will lavish some attention on your photos or artwork  or whatever you have to hang or showoff and custom build a lovely frame without bankrupting your wallet and people will be amazed at your good taste or at least admire the frame.", "rating": "5", "date": [2007, 10, 18]}, "3": {"description": "I'm in love with the work that Richie and his wife Marsha have done for me- Framed All of my favorite photos of my Son. Using some awesome wood that I never even knew existed. I explained the style I was looking for and they hit it spot on! I can't help but to keep coming back! Great prices. Great timing. Great conversation. Great work! They've also done some work for my mom although her framing style is way different from what I like-  they did a beautiful job! Highly recommend this Bucktown Gem!  Yay for local businesses", "rating": "5", "date": [2014, 12, 5]}, "1": {"description": "Marsha was great to work with. After calling many local places to have a panoramic skyline pic we took from our boat frames with no mat but instead a glass edge to show through to our exposed brick; they hit the nail on the head. The frame looks great, they did a wonderful job and they were willing to negotiate on the price after telling them what some other shops has quoted. I am taking a diploma back today after going over mats and frames. Their selection is great and they are very knowledgeable.", "rating": "5", "date": [2015, 8, 2]}, "2": {"description": "I gave this review 5 stars because of the high quality, thoughtful attention to detail, and the overall experience of purchasing frames at this small business, established in the Bucktown neighborhood over twenty years ago and run by Marsha and Richie Pardo.  Both have artistic talent to match color and style to the work.Many picture frame stores will try and oversell you, but Webster Street Picture Frame Co. is an honest framer.", "rating": "5", "date": [2015, 7, 25]}, "9": {"description": "I will definitely go back here.  The man (I think his name was Richie) was very friendly, and the job was done in less time than promised and for cheaper than I expected.  I was surprised by how many framing shops were in the neighborhood when I moved here, and feel as though I lucked out picking this one.", "rating": "5", "date": [2012, 12, 19]}, "10": {"description": "Wonderful experience. Marsha, the owner, was pleasant and knowledgable. Great selection, AMAZING prices, and I love giving business to a local, family-owned business. My order was ready when promised. Will definitely be back for my next framing project!!", "rating": "5", "date": [2012, 7, 14]}, "4": {"description": "Just met with the ladies at Webster Street Picture Frame and we had a great time picking out matts and frames for a design project we are working on.  They were friendly, fun and kept our budget in mind when selecting frames.  Excellent service and great location!", "rating": "5", "date": [2014, 8, 9]}, "16": {"description": "I had a very good experience with this frame shop.  I brought in some fine art prints that I wanted archival framing for.  They gave me a very thoughtful consultation about various options.  Not only were they alot less expensive than the bigger shops - I felt they have my works more personal attention.  I was very happy with the finished products and I've been back as a result.  I feel better about their experience and personal attention versus other frame shops where inexperienced low paid college kids end up working on my stuff.", "rating": "5", "date": [2008, 11, 26]}, "6": {"description": "I called around to get quotes from three different frame shops and Marsha from Webster Street Picture Frame gave me the best quote for a golf putter I wanted to get framed in a shadow box for a gift.  Webster Street Picture Frame was super easy to work with and did a great job on the shadow box.  I'll definitely go back next time I need something framed!", "rating": "5", "date": [2013, 12, 31]}, "11": {"description": "I highly recommend going here for all of your framing needs. I know I will. Over the past few years a dozen or so frame shops opened up in the bucktown/wicker park area but this one stands apart from the others. It's a charming, no-frills, neighborhood storefront that is owner operated. Great service, quality work and good prices.", "rating": "5", "date": [2011, 6, 14]}, "12": {"description": "I will never recommend this frame shop to anyone. The job was not done in a timely matter. They would keep telling us that it would be ready the next day and waste our time when we'd try to pick it up because it wasn't even touched yet. Finally, the artwork we brought in was returned to us damaged. When we asked about the damages they were very angry and yelled at us to get out! Yes, they kicked us out!! We were accused of coming into their shop with the intent to argue with them. Ridiculous.There are plenty of other frame shops out there that I believe deserve your business more.", "rating": "1", "date": [2010, 1, 1]}, "5": {"description": "We went here because my husband lived around the corner for MANY years and we saw it on Yelp.  We had the most fantastic experience and we would highly recommend them.  The owners do everything there and they were able to give us many options and had a quick turn around on our 2 items.  They were very reasonably priced fort he work that they did and we will definitely be going back!!", "rating": "5", "date": [2013, 5, 7]}, "13": {"description": "If I could give this place negative stars, I would.  I found this to be such an unpleasant experience and felt that they were a shady business.I brought in delicate artwork that already had been framed, except that the glass had shattered during transportation to see if it was something that they could take care of.  They said that they were happy to look into it and give a try if possible.  I also brought in a poster to be framed.  They said, it'll be ready within a week and we'll give a call.A week and a half went by and no phone call.  No biggie.  I called and they said that they will work on it tonight, and to pick it up the next day.  But when I arrived for pick up, it still hadn't even been touched yet, to which they were apologetic and said they would definitely have it the next day.  Again, no biggie.  Here's where they really went down as the worst business I have ever personally encountered in my life.  When my husband and I came back yet again, the framed poster looked good, but they apologized that there was nothing they could not add glass into the already framed artwork.  Which was fine with me.  Until I opened it and looked inside...the once intact frames were falling apart at one corner, and there were sharp chips and cuts in different areas of the frame.  While paying for the poster, I casually asked about the damaged frame.  To my shock, the woman started getting accusatory and angry!  She said that we had obviously come in there to argue and that she would put up with no such thing.  Within a minute of trying to explain that we surely were not there to argue and was just asking about the damages (to which she of course said it was that way when i brought it in), she told us to get out of her store.  What was even more infuriating was that we were just saying just to forget about the frame and that we were leaving and never coming back, and she had to make it a point to stand by the open door and yell at us to leave.  Wow!!  I have never been kicked out of any place before...so this was definitely new to me. I would NEVER NEVER NEVER recommend this place to anyone!", "rating": "1", "date": [2008, 12, 27]}, "7": {"description": "I had 3 odd-sized Star Wars prints (shut it! I'm a fan. LOL) that I wanted to frame.First I went to Accentric. Nice enough. But, although, I'm a Star Wars fan I was not about to pay over $1000 for three frames. I went to Webster, next, because my sister gave me a coupon for 20% discount from there and it was only two blocks away. Marsha was very nice and helpful. I am pretty sure I didn't get 20% off frames because Marsha kept rounding down on stuff! So I'm sure my total was discounted more than 20%. LOL! My total for three frames at Webster was only about $100 more than ONE frame from Accentric.  The frames are made on-site too (in the back of the store)! If you ask Richie he'll show you his shop--very cool.One of the frames was cracked and they redid the frame in two days.Good people.", "rating": "5", "date": [2013, 10, 4]}, "8": {"description": "What a Bucktown neighborhood gem! When my boyfriend and I wanted to redecorate our apartment, we dug up some \"lost\" treasures that needed framing. Naive to the world of interior decorating and completely alien to the art of framing, I painstakingly searched every area super store, craft store, home store in search of cheap, ready made frames for my irregularly shaped pieces. Alas, I resigned myself to forking over extra money for custom framing - but where to go? After receiving a flyer on my door - mind you never once until then were any of the hundreds of flyers placed on my door relevant to me - I decided to take a peaceful stroll around the corner to visit the custom frame shop I passed hundreds of times before over the years. Always supporting the local businesses in the neighborhood (especially the bars), I decided to give them a try. The OPEN sign invited me to approach the garden unit, the faded sign at the door told me to ring the bell. I was pleasantly greeted by a friendly gentlemen whose name escapes me. He walked me through an informative consultation, laid out my options and price, And put my mind at ease and ale intendant anxiety I had about custom framing. As I walked out, I felt like a real adult - you know, that feeling you get when you buy your first mattress or sign your very first car loan. I truly entered the stage into adulthood of my late twenties. This will be my first stop next time I need someone framed. In fact, I can't wait to need something framed. Until then, I have two beautiful pieces of framed art on my wall because of Webster Street Framing.", "rating": "4", "date": [2013, 7, 1]}, "0": {"description": "While a very fancy piece, could be out of their league, this friendly neighborhood shop can quickly do a quality job on your favorite poster or wedding photos. They have a decent selection of frames and best prices in town. I brought in two professional group photos from a company trip to hang in my office wall. The gentleman who helped me was great. He helped me select a frame, took my order and turned it around in just a few days. I am trilled with the results. Because they are tiny, they may not offer the selection, nor the sophistication required to frame some collectible artwork but for everyday life 0 there is no place better:)", "rating": "5", "date": [2014, 9, 2]}, "15": {"description": "This place is great. The owner is down to earth and easy to talk to. She is knowledgeable about frames and gives you the time of day. Definitely not a rush through experience. Best of all, it's a small local business-I would rather give my money to them.", "rating": "5", "date": [2011, 3, 1]}}, "latitude": 41.921154, "neighborhoods": ["Bucktown"], "categories": [["Framing", "framing"]], "address": ["2115 W Webster Ave"], "attributes": {"Parking": "Street", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.680878, "rating": "4.5", "price": "$$$", "number_of_reviews": "17"}, "long-tung-chicago": {"comments": {"3": {"description": "I love the beef and shrimp fried rice the beef is so tender. The delivery is fast and I love that they are in paypal I can pay for my order easy.", "rating": "5", "date": [2014, 6, 10]}, "1": {"description": "First off this was my first visit... I so wanted to love on this place. The lady at the counter was nice i ordered seafood lo mein with broccoli and shrooms, small shrimp egg foo yung and egg roll...i patiently wait then she tells me food is ready...get bag(wondered why it was so heavy) but i know they package everything seperate...get home...yup wrong order i call and she tells me to bring it back. Im sort of upset but when i get there she smiles cause she's bagging up rice and i say is my food still hot and she smiled and gave me food. Mow taste...has good flavor but i dont care for brown sauce and noodles a bit sweet...i have had better but its worth a try!", "rating": "3", "date": [2014, 9, 18]}, "2": {"description": "Ordered dinner, driver stated he called however we never received a call. Manager stated she would send the order back in two hours. Seriously!  Very rude and tacky.", "rating": "1", "date": [2014, 10, 31]}, "0": {"description": "Awesome chinese food! I could give this place 5 stars on the beef fried rice and smoothies alone.. The smoothies are $3 and are huge with a wide variety of flavors and they even let you combine two for your smoothie without charging you extra.The sweet and sour chicken is decent, but the actual chicken inside of the batter was dry, so 3.5 stars for that.\\This place is definitely worth a shot if you're in the area and looking for good chinese food.", "rating": "4", "date": [2013, 7, 26]}, "4": {"description": "Love this Chinese food! It's not terribly expensive and it's full of flavor...I am a loyal customer !!!", "rating": "5", "date": [2013, 10, 13]}}, "neighborhoods": ["Englewood"], "latitude": 41.7802429199219, "longitude": -87.6444091796875, "rating": "3.5", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["12:00 pm", "10:30 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["12:00 pm", "10:30 pm"], "Fri": ["11:00 am", "10:00 pm"]}, "price": "$", "categories": [["Chinese", "chinese"]], "address": ["6237 S Halsted Pkwy"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "No"}, "category": "Restaurants", "number_of_reviews": "5"}, "hook-fish-and-chicken-chicago-3": {"comments": {"0": {"description": "Well, we had to get off the freeway for some gas - just could not make it back with what we had.  I heard a lot about the south side so we were a but skeptical.  Inside this gas station was a Hook Fish and Chicken. I was tired, grumpy and most importantly, hungry.  I love fish n chips so I decided to take a chance, even though my comrades were heckling me every step of the way.The menu is simple: fried fish and chicken.  The guy who helped me was super nice and friendly.  I was also taken aback.  He made conversation while I waited and was just, well, cool.The food was typical.  Great tasting (what fried food isn't!)  No problems the next day (if you know what I mean).  I would certainly return again.  Just shows that you cannot judge a fish by the gas station its in!", "rating": "3", "date": [2011, 5, 30]}}, "latitude": 41.78726, "neighborhoods": ["Englewood"], "categories": [["Restaurants", "restaurants"]], "address": ["810 W 59th Street"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Delivery": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Kids": "Yes"}, "longitude": -87.64541, "rating": "3.0", "price": "$", "number_of_reviews": "1"}, "pearls-nails-chicago": {"comments": {"58": {"description": "Pearl's Nails just got a new customer. I have tried out a couple places and always left disappointed but the service at Pearl's was great and I got what I wanted. They also have amazing offers that add more value to what you are getting. Definitely going back and highly recommend this place. I like the space and setting too and great place to bring your gf along for company!", "rating": "5", "date": [2014, 12, 1]}, "56": {"description": "The staff is here is very friendly. Large collection of colors. Had an appointment and was seen right away!", "rating": "5", "date": [2014, 12, 20]}, "29": {"description": "Pearl's is great. I love any place with hot stone massage. I've come here for the last two years for the birthday discount ($21 pedicure). I realized I didn't have cash for a tip, but she just swiped my card a second time to charge the tip.", "rating": "4", "date": [2015, 6, 2]}, "42": {"description": "This place is a joke! I was around the area with my bf and we decided to stop by this nail salon for my pedicure and eyebrow waxing. Before I start, I have to admit that one of the good things about this place is that they open on Sundays and I know not a lot of nail salons do. Anyway, I called beforehand for an appointment so I did not have to wait for long. I walked in and the lady directed me to the pedicure chair. First of all, I told her the massage chair was not operating correctly. Instead of trying to fix the situation, she brushed it off her shoulders and said it was probably broken. Second, she did not make the effort to cut my cuticles. The pedicure itself did not even last for 15 minutes. It felt like something I can do myself at home. After my pedicure, she told me to go this room for my eyebrows and then again, I was disappointed. The eyebrow waxing itself was a bigger joke than the pedicure. I told her I wanted a clean up for my eyebrows. She did five strips of waxing and DID NOT HELP ME SHAPE MY BROWS. She didn't tweeze the excess part of my brows. She didn't even help me trim it at all. Literally, 5 strips of waxing and told me I was done. I ended up trimming it and fixing it myself at home. I would've told her to fix it but that lady did not look like she knows what she was doing and I am not putting my eyebrows at risk and let her make it even worse than it already is. My boyfriend had a foot massage while he waits for me. He was not satisfied as well. The lady who massaged him did not put any strength/effort to his massage. He did not felt any pressure from her at all. I would not recommend this place to anyone. I was not impressed with my overall experience. It wasn't crazy expensive for my service but this place was super unprofessional and I can't believe I paid someone for a half-assed job. I am never coming back.", "rating": "1", "date": [2015, 4, 13]}, "23": {"description": "Service was great! They take them time to polish and ensure it is done correctly. The salon is clean and everyone is friendly. I am extremely particular and I thought they did an excellent job. The massages are great also!", "rating": "5", "date": [2015, 6, 18]}, "47": {"description": "Holy hell this place is amazing. Leg scrubs, neck massages, hot stones. Will definitely be coming back. Regularly.", "rating": "5", "date": [2015, 3, 21]}, "8": {"description": "I took my 5 year old daughter with me for a pedicure and they were so accommodating and helpful. They helped her find the sparkling colors she loved and made sure that she was comfortable. We both received great pedicures with awesome customer service!", "rating": "5", "date": [2016, 1, 17]}, "31": {"description": "Do NOT go here. I'd been here a few times for an eyebrow shaping (eyebrow wax), and they did excellent work, but I went there yesterday, and I noticed my skin was more sensitive than usual. I didn't realize it until I got home and got to take a closer look that the woman had ripped some of the skin from my eyelid off! This just shows carelessness on Pearl's part. I will never go here again.", "rating": "1", "date": [2015, 6, 1]}, "34": {"description": "Fantastic experience!  Best pedi I have had in years.  Carol was really attentive to detail and had such a caring touch.  Will definitely come back, especially with friends.", "rating": "4", "date": [2015, 5, 16]}, "16": {"description": "I went here spontaneously after eating breakfast with a couple of friends. Nice atmosphere & friendly staff. They offer free beverages and warm neck braces. They give great service. I will be back the next time I'm in the area.", "rating": "5", "date": [2016, 1, 26]}, "13": {"description": "So-so mani/pedi yesterday. Was a little rushed--despite no wait on a Saturday morning--and polish looks...okay. A few chips already--expect more than 24 hours before that starts! What was odd to me was when she ran my credit card for the $40 charge--asked if I wanted to put a tip on the card, and I said yes. Brought the charge slip back to sign and it was for $50. I asked why, and she said, \"Oh, you said put a $10 tip on the card.\" Um, no, I did not say to add a 25% tip for mediocre service. Would have tipped 20% anyhow and wasn't going to argue over a couple bucks, but that left a weird taste in my mouth. Not going back.", "rating": "2", "date": [2015, 11, 29]}, "11": {"description": "They fit me in today no problem and the pedicure alone has been great! I feel pampered and relaxed already with my ma manicure still to go!", "rating": "5", "date": [2016, 2, 13]}, "39": {"description": "Went here this morning with two girl friends - employees were friendly, quick, and made for an enjoyable experience. We got the weekday special with the mani-pedi combo and all three of us are happy with the visit", "rating": "4", "date": [2015, 4, 21]}, "37": {"description": "I love this place! I've been coming here for a few yes now with my daughter.  Everyone is always really nice. Lots of brands and colors to choose from. Plus u get a drink that is refillable with your mani/pedi and a quick but nice shoulder massage while you wait for you hands/feet to dry.", "rating": "5", "date": [2015, 5, 6]}, "0": {"description": "My husband wanted to get a manicure after working on his car for the past week. He decided to go for the mani-pedi package, and while I was waiting, he convinced me to get a manicure...something I'd never done before.I was a little worried when Kim started coming at my fingers with all the pointy and clippy tools at her disposal, but she was an expert, and I quickly relaxed with the heated neck pillow. All turned out well, and I felt very pampered with the care she took. Free sodas and hot tea too!My husband was still in the middle of his pedicure once I was done, so since there's no real waiting area, they put me in one of the massage/pedi chairs, turned it on, and left me there to chill while I waited. Nice finishing touch!As a guy, a manicure's not something that I'd probably do a lot, but if I'm ever in the area and my hands are looking a little scraggly, I'd easily drop in again. Maybe next time I'll even try a pedicure.", "rating": "5", "date": [2016, 2, 6]}, "38": {"description": "Very disappointed. My nails were done in 15 min. I got a no chip on Thursday and by Saturday they were ruined. Very sloppy job.", "rating": "1", "date": [2015, 5, 3]}, "51": {"description": "Loved my mani/pedi from Pearls Nails.  They were very accommodating for my party of 4.  If I'm in the neighborhood again, I'll go back.", "rating": "4", "date": [2015, 2, 26]}, "27": {"description": "I love this place! They offer a selection of free drinks, awesome massages and a great $35 mani pedi deal Monday through Wednesday. Very clean and very friendly. The perfect way to pamper yourself!", "rating": "5", "date": [2015, 6, 3]}, "32": {"description": "In the beg. I wrote a really good review because i wanted to get the discount that they were offering. However, I realized that they forgot a big part of the pedicure and I wasnt satisfied with that.. make sure you get the entire pedi because it seems that they rush through this process.", "rating": "2", "date": [2015, 5, 29]}, "54": {"description": "I highly recommend this salon. Myra is the best! It's a treat to come here and get pampered. Free drinks are a plus, there are great discounts, and my no chip looks great.", "rating": "5", "date": [2015, 1, 17]}, "48": {"description": "My wife brought me here to get my nails cleaned. Outstanding service. They were very nice and attended us right away. Great prices and complimentary drink", "rating": "5", "date": [2015, 3, 16]}, "44": {"description": "I absolutely love this place. They really take care of you. The hot stones for their pedicure is the absolute best. They have a variety of colors to choose from, all nice brands, and their staff is so friendly. Will keep coming back!", "rating": "4", "date": [2015, 4, 7]}, "24": {"description": "They did an amazing hot stone massage during my pedicure and we're super sweet about pushing back our appointment when we were running late. The manicure massage was so perfect to relax my hands and she even gave me a shoulder massage!", "rating": "4", "date": [2015, 6, 16]}, "7": {"description": "I love this nail salon! I live or work anywhere near it but alway make sure I go to Pearl's Nails because the service is amazing. Got a pedi and a no chip mani today. Got there a little earlier than my appointment and they took me early. The highlights were the pedi massage chairs, the leg stone massage and the shoulder rub during my mani.", "rating": "5", "date": [2016, 1, 16]}, "49": {"description": "Everyone who works here is super nice and friendly. Never have I had a better massage during a pedicure --- complete relaxation! And it's byob, bonus!", "rating": "5", "date": [2015, 3, 13]}, "40": {"description": "The spa pedi and no chip is amazing. Def my go to place! Service is organized and excellent!!", "rating": "5", "date": [2015, 4, 19]}, "53": {"description": "We came here to get our nails done for a friend's wedding. They were great! Lots of color choices and great service!", "rating": "5", "date": [2015, 1, 23]}, "30": {"description": "Easy to get to location and great service. Can't beat the massages in the mani pedi package, which is $35 on weekdays.", "rating": "5", "date": [2015, 6, 1]}, "46": {"description": "This place is my absolute favorite! I was fortunate enough to find them when I first moved here and lived close by. I tried a couple other places closer by when I had to relocate and immediately went back to Pearl nails. They do a wonderful job and the staff is friendly. Cici is the best and does such a great job on the no-chip manicure. I highly recommend this place. FYI, make an appointment. Walk-in's usually have to wait awhile.", "rating": "5", "date": [2015, 3, 24]}, "1": {"description": "Chicagoans - this is the place to go to get your nails done. I can only speak for the no-chip manicures, but out of the many no-chips that I have gotten in Chicago, Pearl's does the best. I am currently two weeks into a no-chip from Pearl's, and my nails still look perfectly polished. The service is great as well. The manicurists are efficient with the manicures, yet you still walk out feeling pampered. They have many week-day deals, and are willing to take walk-ins and day-of appointments.UPDATE: This no-chip manicure lasted 4 weeks! FOUR WEEKS! I will not be going anywhere else to get my nails done.", "rating": "5", "date": [2015, 12, 8]}, "55": {"description": "I went on a Tuesday and got a regular mani and pedi for $35. The mani didn't chip until Saturday! That has never happened with regular nail polish. The technician was great too! The only complaint was that it was dirty.", "rating": "4", "date": [2015, 1, 3]}, "9": {"description": "Bought a Groupon for the spa pedicure and it was awesome! They have free drinks while you get serviced and tons of colors to choose from. The pedicure came with a sugar scrub and hot stones which I love! I will definitely be coming back to this salon!", "rating": "5", "date": [2015, 12, 12]}, "26": {"description": "Well I've been there a few times and it's really cute in there. The service is descent except that the pedicures are kind of generic. I mean like when I get them they I normally feel really clean afterwards but here it just feels like there's oil on my feet.", "rating": "4", "date": [2015, 6, 9]}, "25": {"description": "I'm going to be all the way honest with you. The reason this place has so many good reviews is because they offer a discount when you do so. My girlfriend and I set up impromptu appointments for manis and pedis with them today at 3pm. We got there on time but weren't ween until about 3:20. Mira, a nail tech there, did apologize for us having to wait. We both say in the pedi booths, and while my polish is decent, my feet still have a lot of dry skin on them because they use those sponge sort of foot smothers in comparison to pumice or a metal type of skin slough-er. Otherwise decent job.Got a shellac no-chip and the color is beautiful and the paint job is okay. Maybe I'm picky about my nails, but I like the polish to cover my entire nail, including the clear polish. My nails were filed a bit uneven but overall not bad. While my nail job wasn't the best, I still tipped Mira we'll win", "rating": "3", "date": [2015, 6, 13]}, "12": {"description": "Nice and clean place, ice cold diet cokes on tap, good magazine selections....and the promise of a discount for a positive yelp review. Hm, what's missing in that? The service here is good but my main thing is quality of the paint job is what I'm in for, and I don't think it's unreasonable to expect a no chip manicure to last more than 4 days, but that's about what you get here. Don't be fooled by the positive reviews, just ladies looking for a discount. Lots of other nail places in the area to check out with better service and quality results. Sorry Pearls but I think we're done!", "rating": "2", "date": [2015, 8, 5]}, "59": {"description": "This has been my fourth or fifth time here since moving to the area. Each time I am very happy with the service and how my nails look! Everyone is very accommodating-- one time I came close to closing time and they were able to do both my no-chip mani and pedi simultaneously. Excellent customer service and consistently solid results with my bi-monthly no chip manicure. Make sure to bring cash!", "rating": "5", "date": [2014, 11, 30]}, "21": {"description": "I'm here right now. The young lady doing my pedi is very sweet and was good w/ the massage and is obviously trying to do a good job but her hands are shaking VERY visibly and her tools look dirty, her whole cart does, & the mani station is also really dirty.. The guy working beside her is saying sexually allusive inappropriate things to his client and my nails are not the greatest. No communication from my nail tech-she seemed upset-shaking like mid-earthquake. Had to have her redo some of the mani it looked so sloppy. The male tech's questioning and comments to his client were gross....asked her eye color and she said one color, then added they change color by her mood, so he gets all weird and says,\"Ok, when you're at home, naked, looking at yourself in the mirror, what color are they then? He also asked if she was a \"real ginger\"(GROSS PEOPLE) and started discussing someone's \"ginger fetish) ie men who obsess over f**king redheads.....it was making her & I both very uncomfortable. Wanted to make this my new nail salon but you couldn't pay me to go back, esp w/ the cleanliness issue!!!", "rating": "2", "date": [2015, 6, 25]}, "17": {"description": "I was able to get a manicure/pedicure as a walk-in right away which was great. It was affordable (40 dollars) wish I would've gone for the spa treatment at 60 dollars, but the technician didn't ask and he had already started so I didn't say anything. They offer some complimentary beverages which is a nice touch and a shoulder/neck rub while your nails are drying. I give it 3 stars because my big toe was smudged (which I didn't notice until I was gone) and my cuticles on my fingers were cut a little too low and bled a little/were inflamed.", "rating": "3", "date": [2015, 9, 16]}, "10": {"description": "After a great hard workout I was craving a great pedicure to top off my day so I went to pearl's nail salon. As I walked in they seemed very busy but told me it would only take 10 minutes for my boyfriend and I. It took 10 minutes exactly to get in a chair and soak in nice hot water. She ended my day when she gave me the best leg massage on earth. Almost fell asleep. I may add when you give a full review you do receive a discount but they for sure deserve a review because they always seem to amaze me! Have not had a bad experience since I have been coming here for a year now.", "rating": "5", "date": [2015, 10, 20]}, "5": {"description": "I have been here twice and plan on coming back a lot more. I've been very happy with both manicures. Efficient, friendly staff. Clean environment. Good selection of polish and prices are fair. You also get a neck warmer and shoulder massage which is a nice bonus. Highly recommend!", "rating": "5", "date": [2016, 1, 29]}, "3": {"description": "I had a great experience at Pearl Nails. The staff was very kind and the service was great!! I would certainly come back, because they did a great job on my mani & pedi.", "rating": "5", "date": [2016, 3, 2]}, "35": {"description": "I went to Pearls Nails for a mani pedi when I was visiting Chicago on a friends recommendation. They offered more services and perks than any other nail salon I've been to! A regular pedicure has hot stones and a scrub. They have TVs and will play E! or the Food Network, I don't watch tv that much so it was nice to relax and watch something I am interested in. Also they give you free beverages like sparkling water, soda, juice. Lots of color selections. For mani I got a gel color and it looks great. I would recommend this place to anyone living or traveling in Chicago.", "rating": "5", "date": [2015, 5, 12]}, "19": {"description": "My second time here treating my wife to a pedicure and I get sucked in every time to get a pedicure with her. This place makes men feel comfortable getting something done even if it's just a chair massage. This time around they popped open a bottle of bubble champaign and made mimosas.", "rating": "5", "date": [2015, 9, 6]}, "28": {"description": "Since trying pearls nails, I have not been to another salon! I have actually brought a few friends here to enjoy the experience. The customer service is usually amazing most of the staff is super sweet and attentive. They have a good selection of colors, and the free drink is always a plus. Weekday specials for $35 ? Sold!", "rating": "4", "date": [2015, 6, 2]}, "45": {"description": "I have gotten a no chip at a number of salons. Kim at Pearl's nails is by far the best! The care you receive off the bat is great! How they take care of you throughout your time is top notch! I will recommend  them to friends for years. I hope I never move!", "rating": "5", "date": [2015, 3, 27]}, "33": {"description": "My wife and I are here right now. This place is GREAT!!! I just got a pedicure for the second time in my life and it was awesome! My wife is got a mani-pedi! The prices are very reasonable and they offered us a complimentary drink!! You cant go wrong coming here to Pearl's Nails. #ExcellentService #Timely #Professional #Quality", "rating": "5", "date": [2015, 5, 22]}, "43": {"description": "Unfortunately I know that walking into any nail shop on a friday they will probably be busy. I did walk in asking if there was any time for a manicure pedicure and was told 'no we are full' in a snobbish rude manner, I was not asked if I would  like to come in at a later time or maybe tomorrow so I walked out. obviously if my business was not wanted there is no reason for me to come back. I had been there before over a year ago and had a good experience but this shows that they really do not care to retain customers. Truly disappointed since my first experience was a good one.", "rating": "2", "date": [2015, 4, 10]}, "2": {"description": "Avoid this place.When you get a manicure, your nails should be even and smooth at the end. This manicure was essentially half finished.", "rating": "2", "date": [2016, 3, 1]}, "18": {"description": "This place is my absolute favorite! I was fortunate enough to find them when I first moved here and lived close by. I tried a couple other places closer by when I had to relocate and immediately went back to Pearl nails. They do a wonderful job and the staff is friendly. Cici is the best and does such a great job on the no-chip manicure. I highly recommend this place. FYI, make an appointment. Walk-in's usually have to wait awhile.", "rating": "5", "date": [2015, 3, 24]}, "41": {"description": "This place is glorious! The staff are very friendly, and the service is efficient and very, very well executed. I swear I've never had a no-chip look this perfect and the pedicure is to die for! They use hot stones and lotion to massage your legs and feet...it is pure bliss! I highly recommend Pearl's nails. It's definitely my new go-to salon!", "rating": "5", "date": [2015, 4, 18]}, "52": {"description": "I have been here several times over the passed year to get my eyebrows waxed before today I have had awesome service and kept coming back.  I will never ever come back here. My wax was awful today. Took 15 minutes which is a bit long for a nail salon. They usually ask my how I would like my brows and this time they didn't. So before she started on me I told her that I would just like a shape up and that I likes my arch. She basically had no idea what I was saying so I probably should have stopped there but that was my fault . She totally butchered one eye brow and took off too much hair. The other one she didn't take enough hair off. She also decided to ignore the fact that I said I likes my arch. When she showed me after she was finished I told her what was wrong and she fixed it. After the second time I didn't even want her to fix it again because I was nervous because she made it worse. The whole time it seemed like she had no idea what she was doing. I decided to go to benefit after so they could try and fix them and they told me I needed to let them just grow out. Also I showed \"the cashier\" my $1 off coupon and she told me I also get 10% off for being a student. She told me it would be $8.50. I handed them a $10 and she than said oh sorry I mean $9.. Very back and forth on their work and not stable. I would not recommend a wax from this place.", "rating": "1", "date": [2015, 2, 13]}, "50": {"description": "Loved this place! I was a walk-in and only had to wait about 10 minutes. Everyone is friendly and the place is very clean, which is a must for me. It's perfectly located close to my school too. I'll be back :)", "rating": "5", "date": [2015, 3, 6]}, "4": {"description": "I'm going to be all the way honest with you. The reason this place has so many good reviews is because they offer a discount when you do so. My girlfriend and I set up impromptu appointments for manis and pedis with them today at 3pm. We got there on time but weren't ween until about 3:20. Mira, a nail tech there, did apologize for us having to wait. We both say in the pedi booths, and while my polish is decent, my feet still have a lot of dry skin on them because they use those sponge sort of foot smothers in comparison to pumice or a metal type of skin slough-er. Otherwise decent job.Got a shellac no-chip and the color is beautiful and the paint job is okay. Maybe I'm picky about my nails, but I like the polish to cover my entire nail, including the clear polish. My nails were filed a bit uneven but overall not bad. While my nail job wasn't the best, I still tipped Mira we'll win", "rating": "3", "date": [2015, 6, 13]}, "6": {"description": "This is the friendliest nail salon I have been to! Have Essie and OPI nail polishes and have great deals if you sign up to be on their free rewards program!", "rating": "5", "date": [2016, 1, 2]}, "22": {"description": "I had a great polish change here. I was surprised by the time and attention that was paid to my feet for only a $12 service. Filing, cuticles, a hot towel and a paint job was all included. I'd come again!", "rating": "5", "date": [2015, 6, 22]}, "15": {"description": "They do a great no chip manicure that lasts longer than any other nail salon I have gotten a no chip at. Excellent customer service and a complimentary hand massage is my favorite part!", "rating": "5", "date": [2015, 10, 19]}, "57": {"description": "Main reason why they only get two stars is due to their lack of organization and communication. I had asked for a signature spa pedicure and somehow they forgot the signature part and gave me a regular pedicure instead, what a disappointment except my sister got the signature pedicure and it wasn't worth the extra $15! Don't do it, she finished before us even though we started same time and she paid more. Ha!I go to get my nails done to relax, all the employees were hectic and didn't even offer us a drink in the beginning. Our pedicures were interrupted multiple times.The guy at the front who checked us in and out was super nice though so that's the only main reason why they get two stars. The pedicure was okay for $30 but that's actually pretty expensive for just a regular pedicure.... Never coming back, way more places to go in the city that are actually good", "rating": "2", "date": [2014, 12, 19]}, "20": {"description": "Nice and clean place, ice cold diet cokes on tap, good magazine selections....and the promise of a discount for a positive yelp review. Hm, what's missing in that? The service here is good but my main thing is quality of the paint job is what I'm in for, and I don't think it's unreasonable to expect a no chip manicure to last more than 4 days, but that's about what you get here. Don't be fooled by the positive reviews, just ladies looking for a discount. Lots of other nail places in the area to check out with better service and quality results. Sorry Pearls but I think we're done!", "rating": "2", "date": [2015, 8, 5]}, "36": {"description": "Definetely recommend this place! I got a no chip manicure last Thursday at Mario Tricoci that didn't last a week... I went to repair a nail at Pearls before my honeymoon, and they didn't charge me even though I didn't get my original there. Reservations are a good idea!", "rating": "5", "date": [2015, 5, 11]}, "14": {"description": "This place is a joke! I was around the area with my bf and we decided to stop by this nail salon for my pedicure and eyebrow waxing. Before I start, I have to admit that one of the good things about this place is that they open on Sundays and I know not a lot of nail salons do. Anyway, I called beforehand for an appointment so I did not have to wait for long. I walked in and the lady directed me to the pedicure chair. First of all, I told her the massage chair was not operating correctly. Instead of trying to fix the situation, she brushed it off her shoulders and said it was probably broken. Second, she did not make the effort to cut my cuticles. The pedicure itself did not even last for 15 minutes. It felt like something I can do myself at home. After my pedicure, she told me to go this room for my eyebrows and then again, I was disappointed. The eyebrow waxing itself was a bigger joke than the pedicure. I told her I wanted a clean up for my eyebrows. She did five strips of waxing and DID NOT HELP ME SHAPE MY BROWS. She didn't tweeze the excess part of my brows. She didn't even help me trim it at all. Literally, 5 strips of waxing and told me I was done. I ended up trimming it and fixing it myself at home. I would've told her to fix it but that lady did not look like she knows what she was doing and I am not putting my eyebrows at risk and let her make it even worse than it already is. My boyfriend had a foot massage while he waits for me. He was not satisfied as well. The lady who massaged him did not put any strength/effort to his massage. He did not felt any pressure from her at all. I would not recommend this place to anyone. I was not impressed with my overall experience. It wasn't crazy expensive for my service but this place was super unprofessional and I can't believe I paid someone for a half-assed job. I am never coming back.", "rating": "1", "date": [2015, 4, 13]}}, "neighborhoods": ["Lincoln Park", "DePaul"], "latitude": 41.93129, "longitude": -87.6493, "rating": "4.5", "times": {"Mon": ["10:00 am", "8:00 pm"], "Thu": ["10:00 am", "8:00 pm"], "Sat": ["9:30 am", "7:00 pm"], "Wed": ["10:00 am", "8:00 pm"], "Tue": ["10:00 am", "8:00 pm"], "Sun": ["10:00 am", "6:00 pm"], "Fri": ["10:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Massage", "massage"], ["Nail Salons", "othersalons"], ["Waxing", "waxing"]], "address": ["2676 N Halsted St"], "attributes": {"Parking": "Street", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Accepts Insurance": "No", "Wheelchair Accessible": "Yes"}, "category": "Beauty", "number_of_reviews": "234"}, "checkers-chicago-6": {"comments": {"1": {"description": "Besides the horrible attitudes, the service is tolerable. Almost all of the staff act as if they don't want to be there.  They rush you through your order in the drive thru. It doesn't matter if you know what you want exactly or taking a literal second to decide.  The only reason to come back is the fact that this is the only checkers within reasonable distance.", "rating": "2", "date": [2014, 12, 30]}, "2": {"description": "I sat in the drive thru for 20 minutes which was annoying since the drive thru is suppose to be express. The car in front of me was sitting joking with 2 window workers who I believe dished out free food and drinks! But anyway, I ordered a number 8 meal which is popcorn chicken breast. Once I got to the window the cashier handed me my food and I asked for BBQ sauce and she told me it's .50 per sauce. So I'm pissed that she never told me that when I first placed my order. What restaurant don't include sauces for meals that require them?! Chicken nuggets, popcorn chicken, and chicken rings always include at least one sauce at Wendy's, White Castle, Burger King, and  McDonald's BUT not  Checker's....And to top it off my fries were old!", "rating": "1", "date": [2014, 6, 28]}, "0": {"description": "I went there tonight and the woman at the drive thru was very friendly, and the service was quick. This location I was finally able to try the banana milkshake, every time I go to the one on 55th they never have their shake machine working.", "rating": "5", "date": [2016, 2, 28]}}, "latitude": 41.7722036096477, "neighborhoods": ["Englewood"], "categories": [["Burgers", "burgers"], ["Fast Food", "hotdogs"]], "address": ["6705 S Halsted"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Good for Groups": "Yes", "Takes Reservations": "Yes", "Delivery": "No", "Outdoor Seating": "No", "Drive-Thru": "Yes", "Good for Kids": "No", "Has TV": "No"}, "longitude": -87.6443120464683, "category": "Restaurants", "rating": "2.5", "price": "$", "number_of_reviews": "3"}, "soul-vegan-chicago": {"comments": {"3": {"description": "We love Soul Vegan foods and are thrilled they are always on hand at our local Whole Foods in Hinsdale! We enjoy the BBQ, Jalapeno dip, mac and cheese and the steak wrap.", "rating": "5", "date": [2015, 12, 7]}, "1": {"description": "I haven't been able to eat at the restaurant but I have been eating the refrigerated meals for lent.  With that being said it is crazy yummy.   I was completely duped by the mac n cheese.  What I liked the most about it was that none of the flavor was lost but none of the cholesterol was there either!!!  I repeat NO CHOLESTEROL.  I wasn't a fan of tofu but i guess I was wrong and I am sooo glad I gave it a try.  I might order a tray of the mac n cheese for Easter Sunday.  I almost forgot I also tried the unchicken salad.  The texture was perfect and the flavor was great.", "rating": "5", "date": [2016, 2, 28]}, "2": {"description": "Obsessed! Amazing vegan food. I discovered it at Whole Foods and had them cater an event.  Very delicious! Great staff, too.  I can't wait to try all of their foods.  Their online catering menu looks amazing!  Highly recommended.", "rating": "5", "date": [2015, 9, 9]}, "5": {"description": "I never expected convenience food to taste this good nor did ever imagine I would write a review on food I picked up in the deli area of Whole Foods.  I was looking for a few quick , healthly lunches to have on hand and stumbled across their unreal chicken wrap.  I make a special trip to Whole Foods every week to stock up.  I echo the other reviews on the lasagna and Mac and cheese..to die for whether you are a vegan or not.  I can only imagine how good the food is in the restaurant.", "rating": "5", "date": [2015, 2, 19]}, "6": {"description": "I had to look up Soul Vegan on here after I finished the Jerk Chicken wrap I purchased at Whole Foods. It was absolutely delicious!! I'll be back to try the other wraps made by these people.", "rating": "5", "date": [2015, 1, 12]}, "7": {"description": "Thought I had died and gone to heaven when I tried the BBQ Delights - am following the Whole Food Plant based regimen to reverse heart disease-and the ingredients on package did not include any oil or fat.  However I noticed an oil residue on plate after I heated it in microwave so called Soulvegan and person I spoke to said that there was oil in it and was surprised that it was not included in list of ingredients. Said he will correct that  -- meanwhile I'm posting this warning. But for anyone else who does not have to worry about oils,fats, - it sure is finger lickin' good.", "rating": "5", "date": [2015, 2, 25]}, "8": {"description": "I don't care if you are vegan or not.  If you eat the lasagna and aren't in love with it, you are dead inside.  I absolutely love their lasagna and their BBQ ...    I would eat both of those dishes from soul vegan before anything.  It is literally the best fake meat lasagna you will ever have.  It might be the best lasagna you have ever had meat or not.. it makes it very easy to be vegan.", "rating": "5", "date": [2014, 4, 25]}, "9": {"description": "I get the Soul Vegan lunches where they are sold around locations in Hyde Park (Treasure Island, Open Produce, UChicago campus).  Their meals are extremely tasty and filling, so you will enjoy whether you are vegan or not.  My favorite it the BBQ tofu, greens, and mac and cheese.  Then mac and cheese is AMAZING.  I am a native southerner, so this is high praise from me.", "rating": "5", "date": [2013, 1, 31]}, "0": {"description": "This place is awesome. Love the food- it's very tasty and there are a variety of options on the menu. The way things are seasoned it tantalizing to your taste buds. I recommend the tofu jerk wrap- jerkfu wrap for lunch and the coconut cake. You will try it and be shocked it's veggie food! Totally delicious. Service is excellent and a gem in Chicago.", "rating": "5", "date": [2015, 12, 7]}, "4": {"description": "SOOOO AMAZING! The only way I will ever go to the Taste of Chicago and deal with the crowds is if this place is there! They have amazing comfort food! Their sauces are the best and the fake meat is delicious!", "rating": "5", "date": [2014, 4, 4]}}, "neighborhoods": ["Englewood"], "latitude": 41.7799263, "longitude": -87.6438828, "rating": "5.0", "times": {"Mon": ["9:00 am", "5:00 pm"], "Thu": ["9:00 am", "5:00 pm"], "Sat": [], "Wed": ["9:00 am", "5:00 pm"], "Tue": ["9:00 am", "5:00 pm"], "Sun": ["9:00 am", "5:00 pm"], "Fri": ["9:00 am", "5:00 pm"]}, "price": "$", "categories": [["Specialty Food", "gourmet"], ["Vegan", "vegan"], ["Cooking Classes", "cookingclasses"]], "address": ["740 W 63rd St"], "attributes": {"Take-out": "Yes"}, "category": "Restaurants", "number_of_reviews": "10"}, "my-nail-com-chicago-2": {"comments": {"58": {"description": "I love this place so much! It's further than any other nail place around me but they do such a good job and are so friendly I don't mind the longer travel time.I made the mistake of going to the one off the Brown line and it made me actually miss this place, ha!Highly recommended, especially if you're having one of those days, they'll make it all better :)", "rating": "5", "date": [2014, 4, 22]}, "56": {"description": "So I'd love to give this place a higher rating because I like the atmosphere and the lady working the front was very nice and accommodating. However, the no-chip manicure I got was horrible. I understand that I was there an hour before they closed and I do realize that people are tired and want to go home so even though I was annoyed at being rushed out of there, I SORT of...KIND of was understanding. Even though the girl doing my nails smeared lotion on my hands and then just wiped it off because she didn't feel like giving me an actual hand massage or rubbing the lotion in. All while checking her cellphone and giggling over text messages (such a pet peeve..so unprofessional). But when I got home and actually saw the bubbles and imperfection on my nails I was livid!!  I can't believe I spent $70 + tip for such a crappy mani/pedi on the ONE DAY where I got off of work early. Not to mention this was my birthday gift to myself. What a waste. I wish I had painted my own nails...", "rating": "2", "date": [2014, 5, 12]}, "29": {"description": "I was extremely impressed with this salon! Clean and inviting atmosphere, very organized, and they have someone managing appointments and the flow of people inside. There is someone at the front who will check you in, tell you an estimate wait time, and then seat you when you're ready. It's BYOB, so feel free to bring some champagne in for a girls day! They also ask if you'd like a water or drink right up seating you, very attentive! My pedicure turned out great, with warm lavender water, exfoliation and massage, and PROPER tools used when cleaning up the polish (versus when they take their finger and just wipe it off with their nail). The color selection is abundant, and at the end, they gave me a little shoulder massage! Definitely will be coming back and highly recommend!", "rating": "5", "date": [2015, 4, 25]}, "42": {"description": "Because I absolutely LOVED my experience here at My Nail.com last year, I decided to make another trip here when I went to visit my cousins in Illinois last month.Okay let me just say how memorable my experience was last year. My cousins live in the suburbs... meaning... they live about 40-45 minutes from the city. We could've easily driven about 5 minutes from my cousins' place to get our nails done, but I was adamant that we go to My Nail.com. My cousin was obviously annoyed. She couldn't fathom the idea that one would actually waste 40 extra minutes of time and gas to paint some nails when there was a perfectly decent nail salon a few minutes from her place.We were about 5-10 minutes late for our appts and the owner was so cool about it. She's seriously one of the friendliest business owners I've ever met. Even during really busy/peak hours, she was cool, calm, and collected.This place was as clean (if not cleaner) as my last visit here. We were offered drinks!The nail technician working on my nails asked me from time to time if I liked how my nails were coming out (very sweet).And the one working on my busted ass feet (poor thing) did everything she could to make me feel comfortable and not embarrassed about coming in with the most dreadful calloused feet anyone has ever seen.Okay skip to about an hour later after getting our mani/pedi...My cousin apologized to me for giving me an attitude earlier.I made her drive 40 extra minutes and she actually apologized to me. Does this sort of maybe paint a picture in your head about how great this place is?", "rating": "5", "date": [2014, 9, 17]}, "23": {"description": "Service is good! The host is very welcoming and your nail service comes with a free drink :) my nail specialist got the no chip done pretty quickly and well. Paid about $40 for no chip, including tax and tip. I had to come back here to get them removed. The price is $5 no matter you got your nails done here or not.", "rating": "4", "date": [2015, 6, 28]}, "47": {"description": "I got a pedicure. Thought it was just fine. Unlike some of the other posts, they used a pumice stone and all that good stuff for my pedicure. Planning on going back", "rating": "4", "date": [2014, 8, 11]}, "8": {"description": "Ever have an experience at a local business and believe Ashton K. was going to come out of a corner with a ton of cameras because the only logical explanation for the bizarre experience you're having is that you're being Punk'd? Well, I did. A MUST READ!! So ladies, if you workout hard, run, and/or perform strenuous athletic activities like I do, you know you're going to end up with ingrown nails, calluses, and corns from time-to-time. When I walked in, I told the check-in attended I was there for my appointment. I told her I had a really painful ingrown nail that would need to be removed asap by someone who knows how to do so. She guided me to a woman named \"So-Pee\", not really  sure how it's spelled but it's like Sophie without the \"fee\" sound. Anyways, my appointment was for a Mani/Pedi. I was taken to the pedicure chair first which seemed dirty and unhygienic. Gross. The water she prepared for me was lukewarm, not even a sliver of comforting hot, bubbling water to make you feel relaxed, in fact...no bubbles @ all. The pedicure was done in a blink of an eye. She was so eager to get done and in such a rush that it literally took 20 minutes from start to finish; I timed it. I told SoPee as well about my ingrown. She merely picked at it a bit with her device and said that was that. I asked, \"are you sure it's gone?\" She said \"oh yeah!\" And rolled her eyes at me with a huge attitude!! Wtf??  She then \"scrubbed\" my feet with a pumice stone for a total of 20 second on each foot. Please, people, look @ my pics. She didn't do a thing, no dead skin was removed, nothing. It was like she was rubbing my feet for  second with a rock instead of actually scrubbing. My 10 year old cousin could do better than SoPee. After I was done, I was taken over to the manicure chair. The little tray with rocks was so dirty that the water was a weird, cloudy color. The manicure took 15 minutes, and just like the pedicure, was done so poorly and with zero efforts. I had brought my OWN POLISH and she refused to paint all the way back to the cuticle (salons do this so that you could go back sooner). I asked her to do that and she refused, still. My nails looked like they were painted by a child, no joke. At the end of it all, I just wanted to GTFO of there ASAP. I was drying my nails when the owner came up to me and asked me how I heard about them. I told her it was through a Yelp Elite event I attended where they were giving out gift certificates so I wanted to take advantage and try them out in-store. After telling her that...the owner, not once, asked me how my services were. If she had, I would've gladly had diarrhea of the mouth and told her what a lousy nail tech she has on her staff. Even though my pedicure was discounted, I wouldn't go back to this place even if it was free! I came home and had to scrub my own feet and take out the ingrown nail myself. My favorite part of my   mynail.com experience was when I opened that door and left that establishment. Ashton K., I still have faith you were hiding in there somewhere for that hour I was succumbed to this place. Awful, just awful.", "rating": "1", "date": [2015, 3, 5]}, "31": {"description": "Ever have an experience at a local business and believe Ashton K. was going to come out of a corner with a ton of cameras because the only logical explanation for the bizarre experience you're having is that you're being Punk'd? Well, I did. A MUST READ!! So ladies, if you workout hard, run, and/or perform strenuous athletic activities like I do, you know you're going to end up with ingrown nails, calluses, and corns from time-to-time. When I walked in, I told the check-in attended I was there for my appointment. I told her I had a really painful ingrown nail that would need to be removed asap by someone who knows how to do so. She guided me to a woman named \"So-Pee\", not really  sure how it's spelled but it's like Sophie without the \"fee\" sound. Anyways, my appointment was for a Mani/Pedi. I was taken to the pedicure chair first which seemed dirty and unhygienic. Gross. The water she prepared for me was lukewarm, not even a sliver of comforting hot, bubbling water to make you feel relaxed, in fact...no bubbles @ all. The pedicure was done in a blink of an eye. She was so eager to get done and in such a rush that it literally took 20 minutes from start to finish; I timed it. I told SoPee as well about my ingrown. She merely picked at it a bit with her device and said that was that. I asked, \"are you sure it's gone?\" She said \"oh yeah!\" And rolled her eyes at me with a huge attitude!! Wtf??  She then \"scrubbed\" my feet with a pumice stone for a total of 20 second on each foot. Please, people, look @ my pics. She didn't do a thing, no dead skin was removed, nothing. It was like she was rubbing my feet for  second with a rock instead of actually scrubbing. My 10 year old cousin could do better than SoPee. After I was done, I was taken over to the manicure chair. The little tray with rocks was so dirty that the water was a weird, cloudy color. The manicure took 15 minutes, and just like the pedicure, was done so poorly and with zero efforts. I had brought my OWN POLISH and she refused to paint all the way back to the cuticle (salons do this so that you could go back sooner). I asked her to do that and she refused, still. My nails looked like they were painted by a child, no joke. At the end of it all, I just wanted to GTFO of there ASAP. I was drying my nails when the owner came up to me and asked me how I heard about them. I told her it was through a Yelp Elite event I attended where they were giving out gift certificates so I wanted to take advantage and try them out in-store. After telling her that...the owner, not once, asked me how my services were. If she had, I would've gladly had diarrhea of the mouth and told her what a lousy nail tech she has on her staff. Even though my pedicure was discounted, I wouldn't go back to this place even if it was free! I came home and had to scrub my own feet and take out the ingrown nail myself. My favorite part of my   mynail.com experience was when I opened that door and left that establishment. Ashton K., I still have faith you were hiding in there somewhere for that hour I was succumbed to this place. Awful, just awful.", "rating": "1", "date": [2015, 3, 5]}, "34": {"description": "I made an appointment for a mani pedi on Valentine's Day and had a great experience. Everyone was so friendly, helpful, and professional. When I entered they offered me a drink, and we're extra accommodating as I had a cut on my ankle from earlier in the day and they got me fresh band aids after the pedi was done. Both the pedicure and shellac manicure were excellent, and they really took the time to do their best even though the salon was very busy for the holiday. I would certainly go back!Edited to add: My no-chip manicure chipped within a week of going, so I called and they were able to fit me in to get it fixed. It was very nice of them and again they made sure to take their time doing a good job on the nail repair. Just one more reason I will use them again!", "rating": "5", "date": [2015, 2, 15]}, "16": {"description": "Excellent service and attention to detail.  We walked in with a group of 6 girls and everyone was taken care of promptly, but none of the technicians were rushing either.  We all were very happy with our manicures!The salon is very clean and well maintained and all of the techs are well dressed and have clean hands and nice nails too.  At some salons the nail techs hands are horrific.  Not the case here!I'm from out of town, but if I lived here I would make this my regular nail salon for sure.", "rating": "5", "date": [2015, 10, 31]}, "13": {"description": "This nail salon had availability for 4 girls on short notice on a rainy Saturday, so we went with it.  We all opted for a regular manicure, which cost $15.  The ladies were all very nice, and efficient.  They have a large nail color selection which is always a plus.  I really enjoyed that they offered various beverages, AND you have the option of BYOB.  My favorite part of the nail appointment, was after we went to dry our nails, I was given a small shoulder rub.  I just wish that part lasted longer!", "rating": "4", "date": [2015, 11, 3]}, "11": {"description": "Probably my new favorite nail salon in the city. Called on a Sunday morning to see what they had available for appointments and had my pick of times. Was almost 10 minutes late but they got me in no problem and I didn't get any attitude for stink-eye for being late.This place is super clean and super cutely decorated. It seems like sometimes salons have little gnats flying around, or you feel like the tools are dirty, not this place. Never saw anything gross or smelled anything gross.The polish selection is great too, and super organized, which I appreciate.Got a regular pedicure (only problem here was I didn't feel like I get enough of a massage, will ask for more next time) and a regular manicure and had the same girl for each, was super quiet but sweet, really allows you to relax.Will be a regular from here on out!", "rating": "5", "date": [2015, 8, 13]}, "39": {"description": "It was my daughters birthday and I had been doing some research on a good nail salon in the area to get a gift certificate for mani/pedi for a birthday gift.I contacted Susie at My Nail.com. She was so nice and left me with such a good impression that I ordered the no chip mani and pedi gift card, which she sent to me since I was not able to pick it up. My daughter went and the services were very good. The only thing was the little extra that Susie promised me to make my daughter's birthday gift a little more special.When I called to mention this to Susie, she apologized profusely and rectified the situation on the spot. She really cares that your experience at the salon is a wonderful one. I was very impressed, as was my daughter with the next visit.Thank you Susie, for making my daughter feel special and the superb mani/pedi.We will most definitely continue to use the services as well as recommend this salon to friends and family.Thanks so much!", "rating": "5", "date": [2014, 12, 3]}, "37": {"description": "I made an appointment this morning after seeing all the rave reviews and noticing that it was right around the corner from my hotel.   It took twenty five minutes before I was worked on because of a bridal party. Knowing of the party coming in at open, I wish they would've given me a more realistic appointment time. But I stayed. Less than three hours later and I had chipped nails. And no, I did not take a pottery class or wash dishes with a Brillo pad after. Even with a five dollar off certificate for a future service, it just doesn't make sense to give this place another shot.", "rating": "1", "date": [2014, 12, 26]}, "0": {"description": "Oh my gosh, oh my gosh, oh my gosh you guys!! Ok be prepared because I'm about to gush about this place because I just had the best no chip ever. The staff is so accommodating and sweet! Talk about amazing customer service. You get offered a beverage when you check in and they move your purse/other odds & ends around for you if you need to change stations. And the purse hooks...they have purse hooks at each station! Genius. I can't believe that after all of the other times that I've splurged on my nails, this is the first joint to have purse hooks so that I don't have to put my purse on the floor (I'm superstitious, ask around & someone will let you in on the urban legend)! Oooo yeah & don't even get me started on the massage capabilities of this staff = killer! The atmosphere is amazing & I haven't even mentioned the quality of my no chip *speechless head shake* stunning! My final word: make sure you pop in here & treat yourself. We all have to take time out of our busy schedules & have a minute for ourselves. I know the next time that I feel the need for a \"Me\" day, I'll be making a b-line to Mynail.com! Tip: hit this place up on Wednesday for a pretty righteous no chip special. Hell, they even have a no chip quality guarantee if you sign up for their free membership card!", "rating": "5", "date": [2016, 1, 28]}, "38": {"description": "I've never been here before but was walking by, looked at my hands, and realized I needed it bad.  What a great decision!  They got me in immediately for a manicure.  My technician, Anna, not only did a wonderful job on my nails and cuticles, but gave me an amazing arm and hand massage with two kinds of oils and a lotion.  She didn't care for my choice of nail polish brand and suggested another. I went with her recommendation and am so glad I did.    As I was sitting there, someone came around who was handing out cozy holiday socks as a gift to all their customers today.  Crazy!  I can't say enough good things about my experience here.  Even though it's out of my way a bit, I will be making it my regular nail spot from here on out.", "rating": "5", "date": [2014, 12, 20]}, "51": {"description": "My first time getting a pedicure ever, and it was great! They did a great job and were so nice! They also gave me a shoulder massage while my toes were drying! I'm definitely going back there.", "rating": "5", "date": [2014, 7, 13]}, "27": {"description": "I received a gift certificate for a mani pedi here and was one of the best I've had. They have a great polish selection and had all the newest collections. I didn't have an appointment and was serviced right away even though it was a Saturday at noon. They offered a beverage which was really nice. They are very attentive and care about their customers. Highly recommend!", "rating": "5", "date": [2015, 5, 24]}, "32": {"description": "3.5 stars....but...whatevs.So I used my trusty booking site PrettyQuick (check out my blog link for $$$ off) for a no chip mani and regular pedi heren because I was in the area running errands and its super easy to book online and on the go!  BONUS!!The guy at the front is SUPA customer service man.  I dont know why, I really liked him.  Seemed to really get it...I just wished I had a better nail experience.The staff...well, they were OK.  The pedi was pretty average.  The no chip mani was ok as well.  I wish she would have done a better job with the shaping and cleaning up my nails.  Needless to say, the offer free fixes of the no chip if its within a week.  Three of my nails chipped.  I went back today to get it fixed and two of the three have already chipped...7 hours after getting them fixed.  She did a poor job putting the polish back on and while its a nice concept...I just dont think its great to get a few nails polished.  Who has the time...basically I wasted the 45 mins at this place to get my nails repainted just to have them chip again today.  Bah", "rating": "3", "date": [2015, 2, 24]}, "54": {"description": "I don't live near this salon but I won't go anywhere else for my nails now. They are just so consistently excellent and as an added bonus, the service and experience they provide while you are there is always lovely. It is a always a real treat for me to get my nails done here.", "rating": "5", "date": [2014, 6, 15]}, "48": {"description": "This place is by far the best place to get your nails done in the city. I have lived all over the city so I have had my fair share of nail salons but this place takes ultimate top spot. The location is so convenient and it is super clean inside. The nail techs do a FANTASTIC job and will fix your nails if they chip within a week. Whenever I go in there, the owner is there and she is so friendly and accommodating. I've gabbed to all of my girlfriends and now they come here to get their nails done.Definitely call ahead but they can usually get you in fairly soon.", "rating": "5", "date": [2014, 8, 7]}, "44": {"description": "I recently had a spa pedi and regular mani here.  I was so looking forward to my service based on the many positive reviews I read here on Yelp and also on the nail salon's overall rating.  I really wanted to like this place but I was actually very disappointed with my service.  My overall spa pedicure experience , in general, was very rushed and lacked attention to detail.  I was in and out of the water in 15 minutes.  My toenails were carelessly filed so that I had to request they be refiled.  The work done on my cuticles also left much to be desired.  There was absolutely no work done on the calloused areas of my feet, even though I specifically requested a special callous treatment.  In fact, when I made an appointment I was told they treated callouses.  I really didn't feel pampered or like I had received a \"spa\" treatment.  Besides, I was busy coaching the nail tech through the pedicure process so I couldn't really relax.  The pedicure I received was one I could have done at home on myself!  This kind of pedicure might work well for the person who's feet are nearly perfect and don't require much work.  People, like me, who need more work done on their feet might do well to find another salon for a pedicure.  As for my manicure, it was just okay, but definitely better than the pedicure.  Although my nails looked nice for 3 days, it took only 2 days before my cuticles started to peel badly and look worse than they did before I had the manicure.  That was disappointing.  I selected one of the organic polishes, one of the ones with a $3 up charge, and it took forever to dry in the salon.  That was a mistake.  I will say that the owner was very friendly and quite accommodating.  The selection of colors was up to date and vast.  I thought the complimentary drinks were a nice touch.  However, I will probably not waste my time giving this place a second chance.", "rating": "2", "date": [2014, 9, 16]}, "24": {"description": "First time going: was fantastic. I made an online appointment and when arrived was promptly seated with a beverage of my choice. I'm not sure what the women's name was that I had but she was excellent.I had the spa mani and pedi. Great clean environment. Wonderful job on both; I highly recommend the spa pedicure if you only do one.Great bath salts and lotions; you get the parrafin wax with it too and great selection of opi and Essie polishes. Very relaxing. I thoroughly enjoyed myself and would go back.I didn't feel rushed at all, looks like a great place to go with someone as well, and the massages on my legs, hands, feet, arms, and the shoulder massage while drying (quick) were so well done, felt great.", "rating": "5", "date": [2015, 6, 19]}, "7": {"description": "Monday winter special no chip mani and reg pedi for $60: Holy wow, batman! The pedi massage was amazing by Pearl!!! I think my eyes actually rolled back into my head. The hot towels and sugar scrub was also great but her technique is well seasoned. The nochip mani was also very good and fast! I can't believe they use real vitamin e pills to massage the hands. Also some delicious smelling spray that seems to sanitize and hydrate or prep the nails.I have worked in nail salons for years and am thoroughly impressed. They even have the latest collections by OPI.  Will be back for Pearl!", "rating": "5", "date": [2016, 2, 29]}, "49": {"description": "After 3 years of living in Chicago I finally found the a nail salon I will return to. It's clean, affordable, and they do an excellent job. As soon as I walked in I was greeted and had my pick of almost all colors Essie offers and many OPI polishes as well. I was seated almost immediately in a comfy massage chair and was offered a beverage of my choice. Auggie gave me the best pedicure I've had since moving here. She was very thorough at trimming my cuticles and removing dry/dead skin. The massage was excellent and the hot towel wrapped around my calves at the end was the icing on the cake.I'll definitely be a repeat customer.", "rating": "5", "date": [2014, 8, 7]}, "40": {"description": "I love this place and am so happy to live nearby. I have been quite a few times (probably around 15 thus far), and have never had a bad experience. The no-chip manicures are wonderful -- I have had one last three weeks, and even then the polish was still in great condition, I just needed to have them redone since they were growing out! The fact that the salon is never empty should be a testament to how good it is; people love coming here. Staff is always friendly and accommodating, offering a drink when you walk in and taking your coat. The rewards card is also awesome, I have gotten $10 off my no-chip manicures a few times. If you haven't yet, you should definitely check it out!", "rating": "5", "date": [2014, 11, 19]}, "53": {"description": "Everyone was very nice here.  You can tell they work hard to keep their salon clean and modern.  The head gal was going and changing out the water on every fresh flower vase and basically was going around making sure everything was in place.  The pedicure was not rushed and very detailed.  My french manicure was done great and lasted.  Im certainly going back!", "rating": "5", "date": [2014, 6, 30]}, "30": {"description": "Came here a couple of months ago to get a no-chip manicure for a vacation and was left strongly disappointed and felt cheated. The young man was the one who did my nails and was so distracted by his iphone that he seemed unable to focus on doing his job and instead texted throughout. I asked to get white done and when I left I could still see my nails underneath. The color and thickness was so uneven and bubbly in areas and thin in others. Luckily I kept my receipt and they honored the deal that if it chips within a week they'll fix it because it chipped in two places within two days. A different lady fixed the problem nails but i'm still unhappy and never going to return.", "rating": "2", "date": [2015, 3, 19]}, "46": {"description": "This salon is fabulous. The staff is friendly and their work is meticulous. With a complementary beverage, candy, and massage you can have a relaxing experience. The no chip lasts for two full weeks as well.", "rating": "4", "date": [2014, 8, 14]}, "1": {"description": "UPDATE:In the two weeks since I've been here, I've noticed a couple things I'm notnthrilled about, so I wanted to do an update. I've noticed my hands have had quite a few hangnails. And my a few, I mean 8. My cuticles are pretty snagged up, and the peeling of my nails is bad. On top of that, the heels of my feet are disgusting. I don't expect my feel to be baby smooth two weeks after a pedicure, but I had noticed they weren't too smooth within hours of my service, and they've gotten so much worse since. I was literally scrapping them in the shower to try and remove some of it. I've had a few mani pedis, but I've never had this problem before. Is it the weather? Maybe. I'll possibly try them again and see what happens. ORIGINAL REVIEW:Iwent in for a Mani pedi. Nice little birthday gift to myself, and it was a nice way to spend the credits I had on Whittl. The man at the front was super nice. Took my coat, and offered me tea. My nail tech wasn't that pleasant. No hello or anything, just went right to work. I'm not one for small talk so it didn't bother me that much, but at least a greeting and a smile or something would have been nice. She kept looking around while doing my nails, like I was wasting her time or something. But for the actual nails, she did a good job. After not doing much of anything to my nails for a couple months, they were in some rough shape. Now they're smooth and I'm loving the polish. I liked the mini massage at the drying station, and the older lady that helped me into my shoes and coat was nice. I also liked that they put a little bag over my feet so that my shoes didn't wreck my polish. The only issue was that my feet became sooo itchy during my 2 minute walk home. It subsided after a few minutes but it was awful during that short time. All in all, I did like the place. More so than another nail shop I went to a little south on Clark. I booked my appointment, paid and tipped all online so that wasn't a hassle. The place didn't reek of chemicals. I got a pretty nice mani pedi for a decent price. If you're not looking for an exceptionally attentive high class spa experience, this is a good place to go. And if you haven't tried Whittl to book and pay for appointments online, you should! Signing up gives you a nice little discount, too. whittl.com/invitation/B5…", "rating": "4", "date": [2016, 1, 29]}, "55": {"description": "I'm moving close to this place soon and have a feeling I'll be coming back...many times.The service was impeccable. I was kind of in a rush, but they got another technician to do my mani while I was at the pedi massage chairs.The owner was fussing over me with quick-dry drops, and they practically dressed me so I wouldn't smudge my nails. My mom also commented on how great $40 was for a mani/pedi combo. (Side note: my mom is frugal, so this is saying something.)A free drink, candy, and attentive, meticulous technicians makes this my new fave place.", "rating": "5", "date": [2014, 5, 17]}, "9": {"description": "3.5 stars....but...whatevs.So I used my trusty booking site PrettyQuick (check out my blog link for $$$ off) for a no chip mani and regular pedi heren because I was in the area running errands and its super easy to book online and on the go!  BONUS!!The guy at the front is SUPA customer service man.  I dont know why, I really liked him.  Seemed to really get it...I just wished I had a better nail experience.The staff...well, they were OK.  The pedi was pretty average.  The no chip mani was ok as well.  I wish she would have done a better job with the shaping and cleaning up my nails.  Needless to say, the offer free fixes of the no chip if its within a week.  Three of my nails chipped.  I went back today to get it fixed and two of the three have already chipped...7 hours after getting them fixed.  She did a poor job putting the polish back on and while its a nice concept...I just dont think its great to get a few nails polished.  Who has the time...basically I wasted the 45 mins at this place to get my nails repainted just to have them chip again today.  Bah", "rating": "3", "date": [2015, 2, 24]}, "26": {"description": "I was originally going to a nail salon on Broadway, but having moved a little further north, it was time to change it up. As most gals know, this is terrifying. Finding a nail salon is almost like finding a hair salon. One wrong move and you are no longer a customer. So, after reading the reviews on Yelp, I decided to give this place a try.My best friend and I walked in and we were instantly greeted. We gave our names as we had made appointments and they told us they were ready to take us back for our pedicures. Their color selection is HUGE! I have not been to another salon with such an expansive array of colors and polish brands. After selecting our colors, we went back and got seated, drinks were brought to us, and we got to relax. The only negative I could think about the pedicure is that the massage chairs were acting funny. It kept stopping every 30 seconds, which made me more anxious than relaxed. Aside from that, the pedicure was great. JoJo took her time, and my toes looked great. The only criticism is that she filed my nails a bit too short, but like all things, they will grow. JoJo also did my nails. They were great. She listened to what I wanted, and executed exactly what asked. She also took her time, so I never felt like she was in a hurry.All in all, this place was great. They have a rewards program, but I'm not really sure what it is. I did get a card where they printed my visit information on there. I will have to ask next time.If you are looking for a great place in lakeview, definitely check this place out. I would recommend making an appointment, as walk-ins did have to walk about 15-20 minutes. However, it was also Memorial Weekend, so that could have something to do with it.Mani-Pedi was $40.", "rating": "4", "date": [2015, 5, 26]}, "25": {"description": "It was alright. I'm giving it 4 stars because the service was great, butthe atmosphere is lacking. Chairs are on top of each other and the decor is just sad. I just felt crowded.", "rating": "4", "date": [2015, 5, 26]}, "12": {"description": "Where do I begin with mynail.com... Let's start with Suzy, the sweet and adorable owner of this salon. She is as sweet as she is fashionable, always greeting me with a smile and waiting on me hand and foot. She's a huge reason I keep coming back.The service is always impeccable. I usually come in for no chip manicures, and every single technician I've worked with has been efficient without sacrificing quality! One time, I also had nail art done for a special occasion. The tech who did it had all sorts of fun and pretty stickers and wands to bring a little extra pizazz to your hands!In short, if you're looking for a little me time, go to this salon! You'll come out feeling refreshed, and your hands/feet will thank you for taking the time to go!!!", "rating": "5", "date": [2016, 1, 15]}, "59": {"description": "My goodness, this place is the worst. I don't understand all the positive reviews; it's possible that they are from people who know the owner(s). The worst service I've ever experienced in my life. I could tell from the beginning that it was going to be awful; the salon was completely silent when I walked in the other night, and both the person at the front and the pedicurist had major attitude about having to work that night. I was made to feel like I wasn't wanted in there. When I've gone to salons, usually there are at least a couple people talking and looking like they are enjoying their experience. It felt really, really odd--like a sweatshop of applying nail polish. It really put a damper on my night. I wouldn't go there again, even if given a deal. I guess with the good location, they don't need to worry about providing a nice experience, but I'd rather pay more for a nice, relaxing experience--or just do my nails at home!", "rating": "1", "date": [2014, 4, 7]}, "21": {"description": "I came here on Monday to get a no chip manicure and pedicure. The place was dead. The ladies were friendly and offered me a water when I walked in. However, it took them 2.5 hours! This wouldn't be a huge deal if they were busy, but no one was there.  Instead of multi tasking between my mani and pedi, the technicians sat and played on their phones. A little annoying but I could've probably gotten over it. Although, after sitting there for two hours , I got home and my manicure ended up chipping 3 hours after we left. Very disappointed with the service I've had my no chip for a week and half. Prettymuch all but 3 nails, have Chipped. When I'm paying $86 for a service, I want to want to make sure I'm getting  my money's worth. Unfortunately this was not the case.", "rating": "1", "date": [2015, 7, 28]}, "17": {"description": "Service is good! The host is very welcoming and your nail service comes with a free drink :) my nail specialist got the no chip done pretty quickly and well. Paid about $40 for no chip, including tax and tip. I had to come back here to get them removed. The price is $5 no matter you got your nails done here or not.", "rating": "4", "date": [2015, 6, 28]}, "10": {"description": "A shoulder massage while my nails dry? I don't mind if you do. And thank you. These people are professional, courteous and talented. The salon is clean and tastefully decorated with bold drenching of orange and red with splashes of bright yellow. Some might say these colors are not \"calming\". But who cares? I think it's beautiful! I also think the crystal chandeliers add a perfect touch of whimsical elegance. The team here really thinks of every little thing for your comfort, from offering a beverage upon arrival, right down to the warm towels they wrap around your arms and calves after massages. Most nail salons will give you a bit of a massage, but these folk really go all out on this step. Don't forget to ask about their frequent client card, which enables clients to earn 5% back on all purchases. The 5% back is a flexible store credit that is simply loaded on the card. I say \"flexible\" because the store credit can be used at any time, no matter how much or how little you have accumulated.", "rating": "5", "date": [2015, 8, 9]}, "5": {"description": "Love this place for a gel manicure. However, anytime I get a regular manicure here, no matter how long I sit under the dryer, it gets wrecked. I sat for a solid 20 minutes today. The man who works the front desk (he is awesome) came to suggest that they had to be dry, sprayed them and sent me on my way.  About an hour later they still had not hardened fully. After a few hours, three of my nails had indents and one was bubbling.  Such a bummer.", "rating": "3", "date": [2016, 3, 4]}, "3": {"description": "I think this may be my favorite nail salon in my 'hood. They are always able to accommodate an appointment, they have a TON of selection for colors and I'm almost always able to stretch my no-chip to 3 weeks because they do such a good job. I also appreciate that they seem to take customer service seriously here, too. They always take your coat, ask you if you'd like a beverage and make certain you're situated and comfortable. This is not the closest nail salon to me, but I make the effort to travel there because of experience. Loads of reviews, but I just wanted to add my positive two cents here. I", "rating": "5", "date": [2016, 3, 8]}, "35": {"description": "I was excited to try this place after seeing all of the great reviews-- I'm always looking for a great place in my neighborhood to get a no-chip manicure.  The service was very good as several others have mentioned- I was offered a beverage and the woman at the front desk and technician were very friendly.  The manicure process itself was good- there was no wait (on a Saturday afternoon) and the woman was very meticulous in applying my polish.  They also do a nice hand massage at the end which I enjoyed.  Unfortunately, 8 days after I got my manicure, 3 of my nails have chipped- one extremely significantly (about 1/5 of the polish) and the other 2 with minor chips along the edge.  I frequently get no-chip manicures and have them last for 3+ weeks: only needing to get them removed because of outgrowth. Further: this place cost $40, where most places in the area cost $35.  I'm willing to pay extra if the manicure is excellent and lasts- but that was not the case.  With 6 other nail salons within 2 blocks of my nail.com, I will definitely not be returning.", "rating": "2", "date": [2015, 1, 19]}, "19": {"description": "Booked a pedicure here using Whittl (great service) and came in this past Saturday. Mynail.com does a nice job and is very clean but in my opinion this is not a shop that goes above and beyond when it comes to the little things that make a pedicure special (pumice stone, salts, massage). I also think this spot is a little higher priced for a pedicure than others in the area ($30). All in all they got the job done but not sure I'll be back any time soon.", "rating": "3", "date": [2015, 2, 16]}, "28": {"description": "Always a great time! They will not let you walk out until you are completely satisfied! My friend is very impatient and kept dinging her nails and they were very understanding and fixed the ones she smudged!", "rating": "5", "date": [2015, 5, 18]}, "45": {"description": "I used to love this place! However, they must've recently hired a new crop of technicians to keep up with the growing demand... and unfortunately, the attention to detail has vastly declined. In my last four visits, I've dealt with rushed pedis (where the tech is clearly just going through the motions), bubbly/chipped polish and overgrown cuticles. When I try to point out my preferences during the mani/pedis, I've been greeted with some annoyed responses from the techs. Also, I like to wait until the end of my service to tip my tech (as opposed to tipping before the polish has begun). One tech seemed so bothered by this that she rushed through my polish and skipped my complimentary shoulder massage during my nail dry. Hopefully, this salon'll get back to their glory days soon.", "rating": "2", "date": [2014, 9, 3]}, "33": {"description": "Booked a pedicure here using Whittl (great service) and came in this past Saturday. Mynail.com does a nice job and is very clean but in my opinion this is not a shop that goes above and beyond when it comes to the little things that make a pedicure special (pumice stone, salts, massage). I also think this spot is a little higher priced for a pedicure than others in the area ($30). All in all they got the job done but not sure I'll be back any time soon.", "rating": "3", "date": [2015, 2, 16]}, "43": {"description": "Usually I love this place but do not come here near closing. I came tonight and was the last person to leave. I felt rushed because all the girls wanted their tips and left. My pedicure was not dry all the way. The gentleman did not check them, just sprayed down the toes, put on Saran Wrap and put my shoes on. Got home to wrecked polish. If you are in that much of a hurry to get out early, lock the door. Oh and no shoulder massage period.", "rating": "2", "date": [2014, 9, 17]}, "2": {"description": "Nail.com has been my go-to place for several years. This place consistently offers a quality service, which is hard to come by! When I step in to the salon, I know I am in for some much needed TLC, and I never leave dissatisfied. I lived in Baltimore for almost two years and cried inside when I went to nail salons out there... they never even came close. I usually get the standard pedicure which is extremely relaxing. I can't emphasize enough how great the leg/foot/arm/hand massages are. I am a huge fan of the regular and gel manicures. I will say that they regular manicures here look so good they almost look like gel manicures anyway. I did start getting gel manicures recently, and I love them equally as much. I've never had a complaint or issue with anyone or anything during my many, many many visits. Also, I've read some reviews about how mani/pedi's take a while...but I prefer when people take their time with a mani/pedi... I come in to relax, and would hate it if I felt rushed in and out! Great customer service, employees, quality, nail color selection... nail.com, you've nailed it! (ha...ha...)", "rating": "5", "date": [2016, 1, 15]}, "18": {"description": "I was originally going to a nail salon on Broadway, but having moved a little further north, it was time to change it up. As most gals know, this is terrifying. Finding a nail salon is almost like finding a hair salon. One wrong move and you are no longer a customer. So, after reading the reviews on Yelp, I decided to give this place a try.My best friend and I walked in and we were instantly greeted. We gave our names as we had made appointments and they told us they were ready to take us back for our pedicures. Their color selection is HUGE! I have not been to another salon with such an expansive array of colors and polish brands. After selecting our colors, we went back and got seated, drinks were brought to us, and we got to relax. The only negative I could think about the pedicure is that the massage chairs were acting funny. It kept stopping every 30 seconds, which made me more anxious than relaxed. Aside from that, the pedicure was great. JoJo took her time, and my toes looked great. The only criticism is that she filed my nails a bit too short, but like all things, they will grow. JoJo also did my nails. They were great. She listened to what I wanted, and executed exactly what asked. She also took her time, so I never felt like she was in a hurry.All in all, this place was great. They have a rewards program, but I'm not really sure what it is. I did get a card where they printed my visit information on there. I will have to ask next time.If you are looking for a great place in lakeview, definitely check this place out. I would recommend making an appointment, as walk-ins did have to walk about 15-20 minutes. However, it was also Memorial Weekend, so that could have something to do with it.Mani-Pedi was $40.", "rating": "4", "date": [2015, 5, 26]}, "41": {"description": "I used to love this place.  But at my last visit, my polish was really messy around my cuticles. My nail tech (I didn't get her name) tells me she can't clean it up bc it's a no chip....it's already set!  Then when I got home that evening, she had made the Polish on one nail so thick that part of it peeled off!  I will definitely be finding a new nail salon.", "rating": "1", "date": [2014, 11, 5]}, "52": {"description": "Have been living in Lakeview for over 4 years and just tumbled across My Nail Salon now. Wish I had sooner. I live off of Belmont & Racine and have tried the other Salons near me and others near my work in the loop.  Never really has a preferred one till now. I like Tsegi to do my nails when she is available but I have had service from a couple of others too. Very pleased with all the results. Highly recommend this place. They are always busy but they have a lot of employees so the wait is usually never long too.", "rating": "5", "date": [2014, 7, 2]}, "50": {"description": "I have to say that this is hands down the best place in Chicago to get your nails done.  Warning: they don't do any artificial nails (other than no chip), but that's ok by me.  They are so nice and friendly from the moment you walk in.  You are completely taken care of, offered a drink and given a mini-massage at the end of your service. Oh, and the nails always turn out fantastic.A few tips:- There is sometimes a wait so if you are in a hurry definitely call ahead to make an appointment- They have a sort of rewards card where you earn $ for every visit that you can redeem towards any service - definitely ask for this if they don't offer it to you", "rating": "5", "date": [2014, 7, 30]}, "4": {"description": "Ka-Kaw---the sound my feet make when it's time to get a manicure-----although it's fall and time for the toes to be underwraps in Chicago----there's nothing like getting a good pedicure so my dry feet don't end up cutting up the bedsheets or people in bed...First time here and happened to walk in on a Wednesday just in time for their mid-week special--$35 for regular mani/pedi.  It was definitely busy and I wasn't even expecting to get in---15 mins later my cracked out tootsies were soaking in the warm whirlpool.  I had one person start my pedicure and another person finished my pedicure and did my manicure.  Both were very meticulous and I must say my crazy feet and hands feel and look much better.  Decent color selection and there were a variety of upgrades that could have been done but just opted for the regular since I had to be somewhere after after.I was offered a shoulder massage while my nails were drying and that was quite lovely.  Since I didn't plan well---I didn't have opened toe shoes---so they plopped on some little plastic baggies over my toes and then I was off on my way---nice little detail touch---that saved my pedi from getting jacked!  When I'm in the area again, would definitely visit this place again.", "rating": "4", "date": [2015, 11, 27]}, "6": {"description": "this is my regular mani/pedi spot and yesterday my experience was sub-par. the pedicurist was super slow (she took way too long). the manicurist was a bit harsh, the experience was more painful then pleasurable. When it came time to leave, normally the staff is super helpful, yesterday the girl just watched me put my shoes and socks on - which resulted in two nails being ruined. but at that point I just wanted to leave.", "rating": "2", "date": [2016, 3, 3]}, "22": {"description": "HANDS DOWN (get it!?), my favorite nail salon in the city. Very fairly priced, extremely friendly service, shoulder massages(!), awesome color selection. I've been here a bunch of times already and haven't had one bad experience, no matter what shape my nails were in before I sat down. I live way far away now but my boyfriend still gets his hair cut in Lakeview, so I always make sure to accompany him just so I can get a manicure here. Can't wait to go back!", "rating": "5", "date": [2015, 7, 15]}, "15": {"description": "I have had several mediocre experiences here, and the only reason I kept going back is because it is so close to where I live and I just really wanted it to work. Unfortunately, today was the last straw. The owner and the front desk staff have always been absolutely wonderful and accommodating (which is why I'm giving more than one star), but certain of the nail technicians are rude, arrogant, and don't know how to give a proper manicure.  This review is based mainly on my experience today. I got a no-chip manicure. One of my biggest pet peeves is when the nail polish doesn't cover the entire nail - especially at the base of the nail. I understand that it shouldn't touch the cuticle, but there shouldn't be so much space that it looks like I got my manicure a week ago. When I asked my manicurist not to leave a space at the base because it looks grown out, she seemed confused as to what on earth I could be talking about, made a face, said something in another language to the manicurist next to us, and then told me \"eventually they'll grow out anyway.\" (Not sure what that's supposed to mean, or how it relates to how my manicure should look TODAY.) But, despite her seeming disagreement with my request, she did fix most of the nails. When the manicure was done, I noticed that there was something pointy stuck in the nail polish on one finger. I asked her to fix it, to which she replied that it can't be fixed. She again said something in another language to the manicurist next to us, and that manicurist scooted over, saw the issue, acknowledged that it can be fixed, and filed down the pointy thing sticking out of the nail polish.  My manicurist then began repainting my nail, and since I noticed that there was a big space between the cuticle and the polish at the base of my nail, I asked her to please paint it beginning at the base. She looked up, gave me a condescending look, and said \"I am.\" When this was all finally over, she stood up, said I'm done, and walked away. No thank you, no bye, no happy holidays, etc. I am not sure what prompted her to be so rude and condescending. I'm not a difficult customer. I am not confrontational, I am polite, I don't have over-the-top expectations, and I certainly wasn't rude or mean to her today. But, when I get a manicure, I expect it to look a certain way, especially when it's a no chip manicure that's supposed to last me up to two weeks. At the very least, I expect a relaxing experience and a skilled manicurist, because that's the reason I'm doing this anyway.  I guess I'll just have to find a new salon for this kind of service.", "rating": "2", "date": [2015, 12, 23]}, "57": {"description": "Let's get one thing out first--they do great pedicures. And everyone is very nice. But I was looking for an artificial nail manicure, called beforehand to make sure, and then made an appointment because they said they do them. And in the middle of my pedicure, they tell me they actually don't do the artificial nails. Annoying, to say the least. And they also do no chip manicures, but not pedicures. How hard is it to put no chip polish on toes?", "rating": "2", "date": [2014, 4, 24]}, "20": {"description": "A shoulder massage while my nails dry? I don't mind if you do. And thank you. These people are professional, courteous and talented. The salon is clean and tastefully decorated with bold drenching of orange and red with splashes of bright yellow. Some might say these colors are not \"calming\". But who cares? I think it's beautiful! I also think the crystal chandeliers add a perfect touch of whimsical elegance. The team here really thinks of every little thing for your comfort, from offering a beverage upon arrival, right down to the warm towels they wrap around your arms and calves after massages. Most nail salons will give you a bit of a massage, but these folk really go all out on this step. Don't forget to ask about their frequent client card, which enables clients to earn 5% back on all purchases. The 5% back is a flexible store credit that is simply loaded on the card. I say \"flexible\" because the store credit can be used at any time, no matter how much or how little you have accumulated.", "rating": "5", "date": [2015, 8, 9]}, "36": {"description": "My favorite nail salon ever! The staff is so friendly and every manicure and pedicure I have had has been done very professionally. Though I haven't been as many as some others, the owner of the salon always recognizes me and really genuinely wants you to have the best experience possible! The salon has an up to date design, is very clean, wonderful staff, and a good vibe about it always. Quality services, and an incredibly relaxing time. Today I went in for an emergency fix on one nail, and though they were incredibly busy, the owner made sure to sit me down right away and got my nail taken care of in no time! Very pleased with MyNail.com and will continue to recommend and bring friends! :D", "rating": "5", "date": [2014, 12, 30]}, "14": {"description": "I am a regular at this salon and if I ever move I will be very sad. I have never had a bad manicure or pedicure at this salon. The owners are very kind and very clean. They always offer a beverage, coat service, and offer spa quality treatments at affordable prices. They also participate in Pretty Quick which is lends discounts for services!", "rating": "5", "date": [2016, 1, 20]}}, "neighborhoods": ["Lakeview"], "latitude": 41.9396782, "longitude": -87.6506271, "rating": "4.5", "times": {"Mon": ["10:00 am", "8:00 pm"], "Thu": ["10:00 am", "8:00 pm"], "Sat": ["9:00 am", "7:00 pm"], "Wed": ["10:00 am", "8:00 pm"], "Tue": ["10:00 am", "8:00 pm"], "Sun": ["10:00 am", "6:00 pm"], "Fri": ["10:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Nail Salons", "othersalons"]], "address": ["3170 N Clark St"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "277"}, "deli-king-chicago": {"comments": {"3": {"description": "Very flavorful. My husband I had the sandwiches which we ate a day later. Believe it or not, they were excellent. I'm curious to taste it fresh and hot. I've heard nothing but great things about this small storefront gem and every compliment lived up to itself. FYI there aren't very many items in the menu, I guess they keep it sweet and simple. There was a bit of a wait but it wasn't unbearable. Many were picking up food which allowed them to go in and out so I assumed they called ahead. 5 stars because there aren't many food options (outside of chain fast food places) available in our neighborhood. I love supporting blk business owners.", "rating": "5", "date": [2016, 1, 16]}, "1": {"description": "I will keep this simple. I never leave bad reviews but when you call in advance and you still wait 25 plus minutes during your 30 minute lunch break that is ridiculous. On top of that, they don't tell you they can't accept credit/debit cards so you have to go down the street to a sketchy currency exchange to get cash (which they card you an additional fee). Only to have to wait additional time. I had someone walk in 10 mins after me, order her food, and pay the cashier on the side (illegal) before I even got my food.", "rating": "1", "date": [2016, 2, 24]}, "2": {"description": "I gave four stars because i got the king...which is cornbeef, turkey pastrami and itlaian turkey and overall it's a delicious sandwich! They would've gotten five stars but folks...i want fresh ingredients, the lettuce was wilted and discolored why even use it? I would've preferred you tell me you have no lettuce!The home fries and their sauce was bomb! And while i'm a pickle person they don't have the deli pickle there pickle is no more than a sour pickle cut into spears...yes i'm weird to notice that! Overall good go see for yourself! See pics", "rating": "4", "date": [2015, 8, 14]}, "5": {"description": "The food is usually awesome. The burgettes are to die for. The customer service is god awful. This isn't the first time, I've dealt with bad service here, but this is the last straw for me. They are very rude to customers with allergies and do not take allergies, seriously. Today, I called in a pick up for two tacos, no onions. I get home and both orders have onions. I return, it takes me about 15 minutes to walk from my house to deli king. The young lady who took my order the first time did not inform the cooks about my wrong order, so I had to wait 20 minutes for my order to be remade. One of the cooks ask me if I want sauce on my fries and I ask for mild sauce, along with jerk sauce on the tacos because the previous order was dry. He began to inform me that no sauce comes on the tacos, only salsa, I remind him that the salsa has onions. He gives me this oh well look and I proceed to ask for a side of jerk sauce again. He  laughs says some snide remark, I let him know he is acting very rude and has poor customer service. He proceeds to tell me that \"customer service is up front.\"  \"You made yourself customer service, when you decided to approach me, the customer,\" was my response. He walks behind the grill laughing  along with one other cook. I spoke to the owner on the phone but as usual, he is never remorseful about the bad service. I frequent this place a few times a month, but after this taunting and humiliating experience, I will not be returning. And to think, I actually tipped this time. Deli King should take some pointers from the Sizzlin Skillet, they've always been polite and knows how to send out a correct order or two or three. Two stars is for the good food.", "rating": "2", "date": [2015, 9, 29]}, "6": {"description": "OH WOW! If you don't get to this diamond in the rough then you don't know what you're missing. I just left this place and order a Panini, Beef Burgett, The Jerk Chicken Nacho Supreme, the Jerk Chicken Tacos, and the Jerk Chicken Pasta.Now I'm going to be honest as a foodie. I wasn't to thrilled with the Panini, because when you think Panini you think flat and wide and packed full of heaven. This was more like a 6in Jerk chicken sandwich, but it was still good the flavors are there. The tacos were ok and fulfilling, but I've had better, but the pasta, the Burgett, and the Nachos. Oh baby are something to definitely talk about, and they offer this dessert called the Crazy apple pie, or I think that's what he said. Let me tell you. It should sold worldwide. This dessert is better than life itself, and then when it's all over don't choose one of their sodas that they sell. You have to, have to get the Queens Passion to wash it all down with. All in all I heard of this place through word of mouth and drove from the west side this afternoon to see what the fuss was about. I can honestly say that they are sitting on a gem here and I will be certainly coming back again. Being more specific to tackle that sandwich that they call The King that simply sounds scrumptious. Get over to this place people you won't be disappointed, and the most important thing is everything was made fresh so you might have to wait a bit for your order, but if you're like me then that is always a good sign, because I don't want anything that you can just reach behind the counter and serve me. Til next time people, and continue to eat good!", "rating": "4", "date": [2015, 4, 19]}, "7": {"description": "Get the corn beef an pastrami on croissant.  Best meal on the menu in my opinion", "rating": "4", "date": [2013, 9, 8]}, "8": {"description": "Food is tasty and affordable and having turkey, seafood and chicken options are also a plus.  The jerk chicken pita, tacos (beef and turkey), and turkey on croissant are the items I come back for.  The turkey slider had great flavor but the beef slider was a bit dry, tough and overcooked.  The hubby also feels the fries could be better but I enjoy them because they are fresh cut.  The downside is that they state on the awning that they deliver, which is not the case.  They also need a website or at least post a menu on yelp or menu pages.  I've been telling people at my gig about this place but they can't go online to look at the menu and someone tried to have them fax a menu to our job and the woman stated that they didn't have a fax machine.....soooooo.....yeah, thats the type of establishment you're dealing with.  They have a good product but they still have a ways to go on the business side.  But keep in mind they are relatively new and may need to work out the kinks (fingers crossed)", "rating": "4", "date": [2014, 4, 29]}, "0": {"description": "I'm planning a baby shower for my sister and one of her strange request was to get Jerk Chicken Pasta Salad for the menu . I did my research and found out that Deli King made it . I wanted to try the pasta salad before I ordered it for the baby shower . So Before I came I called b/c I didn't know how long it would take to make . The man who answered said there was no need to call my order in the pasta was already made.Cool.When I arrived to Deli King they weren't busy . But they seemed to be preparing a meals to go sell around the city . Employees were going in and out to a car but each one greeted me with smiles . I appreciated that but I had to wait like 10 minutes to order and another 15 minutes to get my food . I was upset and asked what was taking so long . One of the employees said the chicken wasn't ready . Really ?!? But when I finally got the pasta it was in a small container but let me tell you that pasta was soo scrumptious !! The pasta salad is very well seasoned with kick to it . We also got queen passion drinks to which are highly recommended The Jerk Chicken Pasta Salad is $5 . If you want it catered it's $45 half pan and $75 for full pan per the owner!!", "rating": "4", "date": [2016, 2, 8]}, "4": {"description": "Call ahead because service is slow! This small, take-out, neighborhood restaurant is a must taste! I appreciate having other alternatives than fast food which dominates this neighborhood. This Black ran restaurant serves some absolutely tastey meals. The serving size are small but oh boy yummy!! My favorite is the hermajesty and the jerk salmon on croissant.", "rating": "4", "date": [2015, 11, 30]}}, "latitude": 41.7653819918633, "neighborhoods": ["Englewood"], "categories": [["Delis", "delis"]], "address": ["410 W 71st St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Good for Kids": "No", "Attire": "Casual", "Has TV": "No", "Good for Groups": "No", "Takes Reservations": "No"}, "longitude": -87.6354852318764, "category": "Restaurants", "rating": "3.5", "price": "$", "number_of_reviews": "9"}, "dream-cafe-and-grille-chicago": {"comments": {"1": {"description": "My taste buds were begging for some Home of the Hoagy but they're not re-open yet so my mom suggested \"Dream Café\" & I'm glad she did. Service was a little slow but totally worth it because the food was hot (just like I like it).  We order the egg roll trio; all good but I really enjoyed the jerk chicken, then the Mac-n-cheese, the collard green was my least favorite.  We also order the chicken chicken tacos and they were Ah-mazing! I really want to try the chicken chili next time. Support local small businesses!!!", "rating": "4", "date": [2015, 11, 28]}, "9": {"description": "In my terminator voice. . I'LL B BACK!! . Hummm.. I order so much stuff my bill wasn't even $23 bucks.. Good food at a downtown quality.  . Forgot to try the desert. .. Damn Damn Damn Ginna!!! It's kool u have plenty of time.. A new edition to Englewood. .... Luv the creative art work.. Some lady came in 3 times for the lemonade. . I'll b bk n make sure to try that baby out .. Next time..... Next time.. !!!", "rating": "5", "date": [2015, 6, 25]}, "23": {"description": "My mom and I went here last night (02/13/15) to try it out and we absolutely loved this place!!! We live in neighboring Chatham so it's great that we have a place like this so close to home. The food was amazing! We had the trio of eggrolls (collards, mac & cheese and Jerk chicken). We didn't care too much for the one with the collard greens, but the other two?! OMG we could have eaten a plate full! I had the Moraccan Chicken with mashed potatoes. I was stuffed! The food was so amazing! The portions were great too. My mom had the Asian BBQ glazed chicken with asparagus and the mashed potatoes. I liked mine better, but hers was good too. She loved it tho! She said she'd go in there just for the asparagus and she's convinced they made the potatoes just for her. The service should also be noted. The men at the counter were so nice! We had never been here before and they were patient with us going over all the items. There was even a guy who walked in behind us and tried to get the staff's attention over us (we're little) and the man at the counter was not having it. We really appreciated that! Things like that have definitely detered us from places. The decor is really nice also. We loved the artwork on the walls and tables. The chalkboard menu was so cute too!!! Bottom line...we're definitely going to come back to this place! Do yourself a favor and go!", "rating": "5", "date": [2015, 2, 14]}, "12": {"description": "It's refreshing to find a place with unique food in my neighborhood. I had the trio egg rolls  jerk egg roll, collard green egg roll and the best was the mac & cheese egg roll. I also ordered the french fries they were alright they were a little too under cooked for me. Now that peach cobbler cheesecake that was absolutely delicious. I will be back..", "rating": "5", "date": [2015, 2, 19]}, "21": {"description": "Food is really fresh and good.  I had the moroccan chicken with macaroni.   The macaroni is unbelievably delicious.   The moroccan chicken was good also.   I had the collard egg roll but I did not like it but I don't like collard greens anyway so don't go by my opinion on that item.  I appreciate a business that uses locally sourced items & that offers healthy alternatives in an area that is a food desert and only offers unhealthy fast food.", "rating": "4", "date": [2015, 2, 18]}, "16": {"description": "I really like this place and I will definitely I be back. I had the \"Supreme Dream Eggroll  Trio\" I liked the collard greens and the Mac and cheese the best! I also had the Jerk Tilapia sandwich and the peach cobbler cheesecake. I called my order in and when I arrived it was hot and ready, I love that there is someplace w/ such great food in the area that is so close to my job! The only reason why they didn't get 5 stars is because when I called the guy said that fries came w/ my sandwich but they were not there when I looked, but I ordered so much food I was too embarrassed to call back and confirm weather or not I was missing fries or if they were extra and it was a misunderstanding :) The place also looked clean and the staff was friendly and answered my questions the place had several customers who were also polite. I felt safe entering and exiting, alone which is important in this neighborhood!", "rating": "4", "date": [2015, 4, 9]}, "17": {"description": "I stopped by Dream Cafe and Grille today. I tried the egg roll trio. Just my opinion but the macaroni and cheese egg rolls stood out. They were absolutely delicious!", "rating": "4", "date": [2015, 6, 13]}, "10": {"description": "A friend and I found this place on accident because we were in the area and looking for a good lunch place. The 4.5 star rating and one dollar sign drew us in, but the warm welcome, amazing service and jazz music kept us there. Before the food was done, the chef came over to talk to us and thank us personally for coming. Our food was MAGICAL. Everything was made from scratch and you could taste the difference. I'm usually not a huge french fry fan, but I tried one from my friend's plate and it literally changed my life. So grateful to have found this gem!", "rating": "5", "date": [2015, 11, 13]}, "5": {"description": "My mom and I went here last night (02/13/15) to try it out and we absolutely loved this place!!! We live in neighboring Chatham so it's great that we have a place like this so close to home. The food was amazing! We had the trio of eggrolls (collards, mac & cheese and Jerk chicken). We didn't care too much for the one with the collard greens, but the other two?! OMG we could have eaten a plate full! I had the Moraccan Chicken with mashed potatoes. I was stuffed! The food was so amazing! The portions were great too. My mom had the Asian BBQ glazed chicken with asparagus and the mashed potatoes. I liked mine better, but hers was good too. She loved it tho! She said she'd go in there just for the asparagus and she's convinced they made the potatoes just for her. The service should also be noted. The men at the counter were so nice! We had never been here before and they were patient with us going over all the items. There was even a guy who walked in behind us and tried to get the staff's attention over us (we're little) and the man at the counter was not having it. We really appreciated that! Things like that have definitely detered us from places. The decor is really nice also. We loved the artwork on the walls and tables. The chalkboard menu was so cute too!!! Bottom line...we're definitely going to come back to this place! Do yourself a favor and go!", "rating": "5", "date": [2015, 2, 14]}, "11": {"description": "Omg!!!! It is so hard to say what my favorite thing is because every time I try something new it becomes my favorite!!!! So far it is the Collard Green and the Mac & Cheese Egg Rolls!! The Jerk Chicken Egg Rolls are great too but the other two are heaven!!!! Lol!!!!This place is such a great addition to the neighborhood!!", "rating": "5", "date": [2015, 3, 3]}, "22": {"description": "Moroccan Chicken & brown rice ( I'm all about my white rice all day) is Yummy. Can't wait to try it all. Specifically for  the tilapia... I'll totally be back. Thanks Dream.", "rating": "5", "date": [2015, 2, 16]}, "0": {"description": "I work at a warehouse close by, and realized we had something of an undiscovered treasure two blocks away.We sampled a variety of dishes, including Moroccan Chicken, Corn Poppers (fritters), Jerk Chicken Egg Rolls, Mac and Cheese Egg Rolls, as well as the salad with grilled chicken, wings, and a chicken sandwich.  Everybody was satisfied (huge portions to share), impressed, and happy.  Except for the guy who didn't get any because he already \"had lunch\".  Amazing experience, and the chef, Russell, has a head full of great ideas.  Great experience, can't miss it!", "rating": "5", "date": [2015, 12, 22]}, "20": {"description": "It's refreshing to find a place with unique food in my neighborhood. I had the trio egg rolls  jerk egg roll, collard green egg roll and the best was the mac & cheese egg roll. I also ordered the french fries they were alright they were a little too under cooked for me. Now that peach cobbler cheesecake that was absolutely delicious. I will be back..", "rating": "5", "date": [2015, 2, 19]}, "19": {"description": "Moroccan Chicken & brown rice ( I'm all about my white rice all day) is Yummy. Can't wait to try it all. Specifically for  the tilapia... I'll totally be back. Thanks Dream.", "rating": "5", "date": [2015, 2, 16]}, "2": {"description": "Had Asian-style salmon with unbelievable cornbread and delicious greens. Lots of food. Lots of yum.", "rating": "5", "date": [2016, 3, 5]}, "18": {"description": "The eggroll trio is a creative menu item that I would highly recommend for anyone who wants a taste of a bit of everything. Friendly staff and a nice departure from the kinds of restaurants that used to be the main staple of this neighborhood. Great addition to black owned businesses in the community.", "rating": "4", "date": [2015, 5, 14]}, "13": {"description": "The food is phenomenal, the service great, I highly recommend this place. Try the veggie tacos!", "rating": "5", "date": [2015, 3, 26]}, "4": {"description": "Delicious! Had the egg roll platter (Mac and cheese, collards, and jerk chicken egg rolls) and the jerk tacos. All were great, but my favorite was the mac and cheese egg roll with ranch dipping sauce. So good! Generous portions, super nice and friendly staff, beautiful murals. Planning on having them cater some work events!", "rating": "5", "date": [2015, 12, 14]}, "6": {"description": "Dream cafe was everything the name says. A dream!Grandmas chicken dinner was really filling and hit the spot with a side of collard greens, you can't go wrong. At the same table I had comments that the mac and cheese was the best ever!Salmon was not a disappointment either, very fresh and tasty!You're not gonna go wrong with great food and awesome hospitality @ Dream Cafe!!!!!", "rating": "5", "date": [2015, 8, 23]}, "15": {"description": "I am Asian. Ok..part asian. Doesn't matter. I am the supreme authority on eggrolls just because my people have been eating eggrolls for thousands of years. So you can take my word on what I am about to say here. As soon as I had bitten into their mac n cheese eggroll, I almost cried. Cried in delicious delight. Why? I felt my people's domination of the eggroll might be  over. Mac n Cheese eggroll? PURE GENIUS. Why had my people never thought to put this in an eggroll? I then devoured the jerk chicken eggroll. So good in the sriracha sauce. My  asian mom puts sriracha in everything yet it never occured to her to put it in a mayo dipping sauce. Excuse my slang from the 1990's..but that was the BOMB  DOT COM! Oh my...would someone be taking my mother's place in eggroll making? My people's fate was signed, sealed and delivered after finishing off the collard green eggroll which I  dipped in the ranch sauce. Ok..ok,, sorry mom.  Also sorry my fellow Asians...best eggroll in the city no longer belongs to anyplace in Chinatown or any asian place in the entire MIDWEST. It's in Englewood. I'm Asian. I'm the model minority. We don't lie. This is truth. The Asian stamp of eggroll approval is given to Dream Cafe and Grille!", "rating": "5", "date": [2015, 2, 20]}, "7": {"description": "When I venture to the south side, my friends never want to eat with me, cause they all eat meat. Finally! A place where I can eat healthy & my friends can satisfy their carne cravings. Hey! I was here on Monday and had real veggie tacos, with grilled veggies, of course I asked them to hold the cheese & sour cream. But the tacos were hella good, and cheap too. I was full, and my tacos were full of flavor. My meat eating friend loved her meat & cheesecake. Visit this place... Good food...parking...and the tables are artistically decorated by local children, now that's love!#southside #vegan #localart", "rating": "4", "date": [2015, 6, 18]}, "8": {"description": "Great environment for good food good service and polite people. My first time here and I will be going back.", "rating": "5", "date": [2015, 6, 2]}, "3": {"description": "Very friendly service, clean and one of the owners promised they would start offering fried pickles...yahhh! Ok now my review...simple this time! The mac n cheese egg roll was good with dipping sauce and the steak was tender on my sandwich but the sauce(a1) took over...i will try the other egg rolls...next!", "rating": "3", "date": [2015, 9, 4]}, "14": {"description": "Nicest guys in the world, and great food (morrocan chicken. Just do it). I wanted to eat everything they had. Chef cares deeply about his craft, and the staff was friendly, low-key, and welcoming. Go.", "rating": "4", "date": [2015, 5, 6]}}, "neighborhoods": ["Englewood"], "latitude": 41.7836683175906, "longitude": -87.6443660259247, "rating": "4.5", "times": {"Mon": ["11:00 am", "8:00 pm"], "Thu": ["11:00 am", "8:00 pm"], "Sat": ["11:00 am", "8:00 pm"], "Wed": ["11:00 am", "8:00 pm"], "Tue": ["11:00 am", "8:00 pm"], "Sun": [], "Fri": ["11:00 am", "8:00 pm"]}, "price": "$", "categories": [["American (New)", "newamerican"], ["Caribbean", "caribbean"], ["Burgers", "burgers"]], "address": ["748 W 61 St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Good For": "Dessert", "Attire": "Casual", "Ambience": "Casual", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Drive-Thru": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "24"}, "goodness-greeness-chicago-2": {"comments": {"0": {"description": "Amazing fresh, local organics. It's great that they work with so many local farms too.", "rating": "5", "date": [2014, 7, 19]}}, "neighborhoods": ["Englewood"], "latitude": 41.7854118347168, "longitude": -87.6406631469727, "rating": "5.0", "times": {"Mon": ["6:00 am", "3:00 pm"], "Thu": ["6:00 am", "3:00 pm"], "Sat": ["6:00 am", "1:00 pm"], "Wed": ["6:00 am", "3:00 pm"], "Tue": ["6:00 am", "3:00 pm"], "Sun": ["6:00 am", "1:00 pm"], "Fri": ["6:00 am", "3:00 pm"]}, "price": "$$", "categories": [["Fruits & Veggies", "markets"], ["Grocery", "grocery"]], "address": ["5959 S Lowe Ave"], "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "No"}, "category": "Food", "number_of_reviews": "1"}, "63rd-nails-chicago": {"comments": {"1": {"description": "Went to Kennedy King College for a one day conference and decided to get my nails done across the street from the school instead of being stuck in traffic on my way home, all I can say is that I should have gotten stuck in traffic. I got a no chip manicure here and it didn't last a week, not to mention my nail tips got a dark ring around them (see photo), I think the nail technician skipped a step in the process because I've never experienced that before. Maybe they're better at acrylic nails but I definitely wouldn't recommend getting a no chip here. The sign for this place is called 63rd Nails and isn't spelled out Sixty-third.", "rating": "2", "date": [2014, 7, 20]}, "0": {"description": "Their so nice and the lady even helped me with my son.", "rating": "5", "date": [2014, 9, 23]}}, "neighborhoods": ["Englewood"], "latitude": 41.7798997, "longitude": -87.6424351, "rating": "3.5", "times": {"Mon": ["10:00 am", "7:00 pm"], "Thu": ["10:00 am", "7:00 pm"], "Sat": ["10:00 am", "7:00 pm"], "Wed": ["10:00 am", "7:00 pm"], "Tue": ["10:00 am", "7:00 pm"], "Sun": [], "Fri": ["10:00 am", "7:00 pm"]}, "price": "$", "categories": [["Nail Salons", "othersalons"]], "address": ["6237 S Halsted St"], "attributes": {"Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Bitcoin": "No", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "2"}, "dunkin-donuts-chicago-179": {"comments": {"3": {"description": "This review is for the morning shift because i have never been there in the afternoon.Also i have never been in the actual store. I use to go all the time but i rarely go know because the man that is taking orders through the drive through i think his name is Javier has attitude and sucks in taking orders. He is so rude and he never lets you know to move on to the next window. He doesn't repeat the order so you don't know if he heard you or not. I do not like this DD for nothing sometimes we don't have a choice and have to stop and grab some coffee. I tried to give him the benefit of the doubt but it never fails he is always a jerk. I really dislike this DD. once again this is for the morning shift through the drive through.", "rating": "1", "date": [2015, 6, 6]}, "1": {"description": "Is always busy  (it must be good :)) The breakfast good is great for those slow mornings when I don't have time to eat thing at home.", "rating": "4", "date": [2014, 6, 9]}, "2": {"description": "This location is around the corner from my house, I try to support the businesses in my community, this one however this morning was my last. Thanks to the jerk, Javier M. who works the drive through. Javier is forever rushing customers and never listening to the order which causes him to place a Bacon egg and cheese order instead of steak egg and cheese; i don;t eat pork, I don't purchase pork and this jerk sells and fixes me a pork sandwich. I will never go back to this restaurant until Javier is gone. Waiting to speak with the Owner. If you must stop here, take the few extra minutes to go inside. Going through the drive-thru will have you frustrated and with the wrong order.", "rating": "1", "date": [2015, 7, 13]}, "0": {"description": "I've been to this Dunkin Donuts numerous times, and its by far the best location I've been to. Not only do they have a drive thru, but their employee's are friendly and serve you with a smile. This is one of the newer locations, and its typically well stocked and tidy.My iced coffees have always been flavored to my liking with just enough cream and sugar and the donuts are always fresh even at 5pm. Their hashbrown rounds are delicious!Good job guys!", "rating": "5", "date": [2013, 7, 30]}, "4": {"description": "I'm impressed w every visit!! If you're a regular, they know what you want! Food is always hot, coffee made perfect, they are lightening fast & the customer service is great! This is certainly one of my favorite locations!", "rating": "5", "date": [2015, 3, 3]}}, "latitude": 41.780243, "neighborhoods": ["Englewood"], "categories": [["Donuts", "donuts"], ["Coffee & Tea", "coffee"]], "address": ["6237 S Halsted St"], "attributes": {"Outdoor Seating": "No", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.644409, "category": "Food", "rating": "3.0", "price": "$", "number_of_reviews": "5"}, "sikia-chicago": {"comments": {"3": {"description": "I really, really want to rate this rest. higher because of the mission. But, too often I eat here and am disappointed. I recently ate here and had a wonderful chicken breast sandwich. I went again two days later with coworkers boasting how good the place is. Unfortunately, the chef of the day replaced chickeb breast with chicken thighs!!!. The sandwich was horrible and slimey. The problem seems to be that the manager Jorlie (sic) seems to walk around talking and sitiing with campus staff. She totally ignores other patrons and never seems to interact with the students. We tried to speak with her and she pretty much ignored us. The students seem t need better supervision.", "rating": "2", "date": [2013, 4, 6]}, "1": {"description": "Sikia is a restaurant attached to the Washburne Culinary Institute and manned by students and supervised by experienced faculty chefs.  I had never heard of it before taking a job in the Englewood area and I have to say, if it were located in the Loop, it would be packed every day.  The concept is designed to allow the students to gain valuable kitchen and front of the house experience but the gain is really for the diners.  Three days a week, the restaurant offers a three course gourmet meal for well under $10.  I'm not overstating the presentation, this is gourmet food prepared by tomorrow's top chefs.  If you've got the time, get out to 63rd and Halsted and take advantage.  Lots of free parking.", "rating": "4", "date": [2013, 2, 7]}, "2": {"description": "Last weekend, I was part of a parent's group that hosted a private workshop for our children to teach them about social graces and it was held at Sikia. All of the moms were delighted with what we found. The waitstaff was attentive, the prices were reasonable, the decor was attractive and the food was wonderful. Keep in mind that we were dealing with children - the menu was butternut squash soup, fried chicken, mac & cheese and corn on the cob, and sweet potato pie with ice cream. Even the sweet tea was delicious - a kind of spiced tea. We were all impressed and vowed to come back and recommend Sikia to everyone we knew.", "rating": "4", "date": [2009, 10, 14]}, "5": {"description": "We went here for Valentine's day dinner. They are part of the Washburne Culinary Institute so the cooking, serving, etc. is all done by young people studying the hospitality business. Sikia is a Swahili word for a synthesis of sensory input, a nice interesting name for a dining room. Sikia features a lot of African dishes but on this occasion their Valentine's special menu sounded too good to pass up, a multi-course not particularly ethnic affair which I assume gave them a chance to practice various kitchen disciplines. On the appetizer sampler plate, we especially enjoyed the grape encased in goat cheese and rolled in pistachio. The salad featured grilled quail, how cool is that! This was followed by two, yes, two entrees: salmon with morel sauce (I'm tellin' ya!) on saffron risotto with asparagus; and lamb glazed with pomegranate molasses and fig, over mashed potatoes. OK, the execution was not entirely perfect, both could have been a little less cooked, but this was still a wonderful couple of courses and quite a deal. The lamb sauce was definitely one of the more interesting and delicious things we'd eaten in a long time. The triple whammy dessert was exciting too, a flourless chocolate cake, a peppery chocolate panna cotta, and a chocolate sorbet (attractively non-creamy). It's BYOB, though they did toss in a glass of some so-called champagne. Their interior decor is a bit on the dry side and could use some livening up and personality. But anyhow, we were impressed; it was a more than satisfying meal, very enjoyable for the special occasion, a surprising find a few miles south of us down Halsted, and it was our pleasure to sponsor in some small way these future chefs and restauranteurs (our server, for example, hoped to start a catering business after serving some apprentice time at a restaurant or two).", "rating": "4", "date": [2009, 4, 13]}, "0": {"description": "Great Food and Service Always! I work nearby so I visit often, the food and service are  always consistently very good, make sure that you tip!! The students work really hard.", "rating": "5", "date": [2015, 10, 18]}, "4": {"description": "One of two restaurants located on the south side, owned by the City of Chicago, this place is a much needed outlet for the area. Love the simple, yet chic African decor. At first, I thought the dry attitude of the host/server was going to dampen our mood, but he turned out to be one of the absolute best (and he is a recent graduate of King Kennedy College Culinary program - has better customer service skills than most seasoned wait staff). He made small talk with us, checked on us periodically and even offered us a private tour of the culinary schools' state of the art facility. And he kept us laughing the entire night! The food was great. Loved the goat and peanut stew! Full of flavor and oh so creamy.They even have live jazz on the weekends which I will definitely be back for! Don't forget to BYOB, they do not and will not be getting a liquor license!", "rating": "4", "date": [2010, 3, 30]}}, "neighborhoods": ["Englewood"], "latitude": 41.7799263, "longitude": -87.6438828, "rating": "4.0", "times": {"Mon": [], "Thu": ["11:00 am", "1:00 pm"], "Sat": [], "Wed": ["11:00 am", "1:00 pm"], "Tue": [], "Sun": [], "Fri": ["11:00 am", "1:00 pm"]}, "price": "$$", "categories": [["American (New)", "newamerican"]], "address": ["740 W 63rd St"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Takes Reservations": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Dogs Allowed": "No", "Good for Groups": "Yes", "Good for Kids": "No"}, "category": "Restaurants", "number_of_reviews": "6"}, "wendys-chicago-26": {"comments": {"3": {"description": "New beautiful building and parking lot but same old bad horrible service. I've frequent this location three times since it reopened. I've only used the drive thru and I go after work so very long line. I could have went in but I waited in the comfort of my car listening to music for about 20 minutes each trip. My order has never been wrong but my encounters with the drive thru employees have been horrible. No need to have a new outside if the inside is horrible. My last visit I was not given a receipt for my purchase so I asked for one. The drive thru employee stared at me and said \"The machine ain't workin.\" She was upset that I asked for a receipt for my purchase that is due to me. What makes it even worst is that the manager was behind her and did not intervene. If this type of behavior continues to exist this location will be filled with bad behaviors and not just employees but also people hanging out which will defeat the purpose of rebuilding the restaurant. Corporate needs to know about this.", "rating": "3", "date": [2015, 6, 24]}, "1": {"description": "What a great new start.I just had to come check out this new Wendy's.I'm very pleased that I did.The parking lot is much bigger. And from the outside the new look it great and you can spot this place out from the expressway.When I walked in to my surprise the dining room area is huge with plenty of tables and chairs. So nice and bright with a free Wi-Fi  setting areaThis is a new Wendy's built from the ground up in the same location.How great is that.The service that I received today was very nice. I was pleased with my food and most of all my hot fries.Good job Wendy's welcome back.Keep up the great service.", "rating": "4", "date": [2015, 5, 4]}, "2": {"description": "Just drove past this place and I see it's torn down in order to build a new Wendy's.   I don't care how shiny the new building is, if the service is like the old one, then I won't be going there either.  And speaking of service, the old Wendy's was horrible.  Where do I begin?  Long lines.  Poor service.  Slow service.  Wrong orders.  And I love going to places where they have to buzz you into the restroom. Back when I was a kid, Wendy's used to be good, but over the years they have shrunk the size of everything while raising the prices.   I doubt I'll visit the new Wendy's in this location.", "rating": "1", "date": [2014, 7, 27]}, "5": {"description": "I love Wendy's, and unfortunately, this is the closest one to me a majority of the time lately. No matter what you order, they make you pull up and wait for them to bring the food out to you, and continuously stick this baking sheet out of the window to reset the timer, which is crazy. One time I even had a fruit fly in my cup. You know those really really tiny ones that are annoying as hell? Yeah, that. Disgusting. If you can help it, go to the one on 87th.", "rating": "2", "date": [2013, 7, 26]}, "6": {"description": "This place is SLOW.  They keep their drive-thru numbers low by sticking a large baking sheet out the window to reset the timer, just watch as you pull from the first window to the second - usually at night.  The service is rude and food is rarely fresh.", "rating": "1", "date": [2013, 3, 15]}, "7": {"description": "The MOST unprofessional staff at any Wendy's that I ever visited, ANYWHERE!Today at approximately 2:15pm, after a nice woman took my money at the first window, I was literally thrown my food (by a man) without as much as a hello. After waiting at the window afterward, the woman working the pick up window asked me \"What chu waiting foe?\" I told her the type of drink I ordered, she got it, and handed it to me without an apology, or even a considerate departure statement like, \"have a nice day\", or the sort. Food is average, service is SUPER TERRIBLE, and the area is dangerous. You would do better eating elswhere.", "rating": "1", "date": [2013, 5, 2]}, "8": {"description": "I don't normally eat fast food but when I do, I prefer somewhere else. They do the cooking sheet trick which is shockingly annoying especially when they advise you to park your car to their closest door so that someone will walk out with your food after a 10 minute wait.", "rating": "2", "date": [2013, 7, 8]}, "0": {"description": "New Building! same old staff.  Love the Wendy's chain but this one is Slowwww!Do not go if you have a tight lunch hour.Parking is abundant because many do not want to eat inside.The staff is slow and if you ask for any customization on a burger be prepared for multiple HUH's.  The place is brand spanking new and the staff still can't keep up with removing full trash bins and litter under tables.The chili was watered down and not even filled to the normal amount which is about 3/4\" from the top of the container.The fries were hot and the burger was rather tasty.if you go between 11:30a.m -1:00 pm you will wait in a long line at one point it was 15 people deep. The wait came out to about 14 minutes give or take a second.This is Englewood so it is a food dessert and Wendys is not the spot for quick clean service.", "rating": "2", "date": [2015, 5, 5]}, "4": {"description": "It should be called Slow Food !!!!   Horrible service and long lines.  We deserve better.", "rating": "1", "date": [2015, 10, 23]}}, "neighborhoods": ["Englewood"], "latitude": 41.7946464, "longitude": -87.6324692, "rating": "2.0", "times": {"Mon": ["9:00 am", "4:00 am"], "Thu": ["9:00 am", "4:00 am"], "Sat": ["9:00 am", "4:00 am"], "Wed": ["9:00 am", "4:00 am"], "Tue": ["9:00 am", "4:00 am"], "Sun": ["9:00 am", "4:00 am"], "Fri": ["9:00 am", "4:00 am"]}, "price": "$", "categories": [["Fast Food", "hotdogs"], ["Burgers", "burgers"]], "address": ["242 W Garfield Blvd"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Loud", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "No"}, "category": "Restaurants", "number_of_reviews": "9"}, "harolds-chicken-shacks-chicago": {"comments": {"1": {"description": "This Harolds is the epicenter of action on Halsted between 70th and 75th streets. Depending on the day you will see 'working girls', men who manage working girls, wannabe gangsters and hip hop artists, old men and ladies, drunk people wanting to hit on you, random people selling bars of dove soap and bootleg films, local politicians and the like. Then there's me, who just openly admits to traveling great distances for fried chicken. Great fried chicken that is.This Harold's, short of the one on 87th street, is the best I've come across in Chicago. Some say that the one in Hyde Park is the best, but they fail to take into account the consistency of the chicken at that location...it's just not. Obama might have had it, but I've had more chicken then I care to admit, and I also know that I've had it be bad. This is not the issue at this Harold's.This location is laid out simply, a few booths to sit in and eat (if that is your thing), a long bench, a television that may or may not be working and the ordering counter that is outfitted with thick glass or plastic, as is standard in all the Harold's. The service isn't always the best, but if you realize that it's fried chicken, not oysters, it's not that big of a deal. They don't take debit for transactions less than $10, so don't forget your cash. Also, if you call in, doesn't matter, as they won't actually cook your food until you arrive and pay. They used to do that, but I guess people weren't showing up...kinda sucks, as waiting here sometimes is not a fun experience.", "rating": "3", "date": [2011, 3, 31]}, "2": {"description": "All Harold's Chicken Shacks are not equal, let me start with that statement.  This review is for the one located at 73rd & Halsted.  What makes it unique?  Late evening hours for a Harold's in the 'hood...open on the weekends until 1:30, during the week until 11:30.  They also take credit/debit!  Who would have thought?  But beyond all that the chicken is great, always well prepared!  Desserts and sides cannot always be guaranteed to be in stock, so call ahead and ask.  Even if they take a phone order, until you show up and pay it won't be started...so be prepared to wait anyway.  Service is fast, efficient and friendly... If you love fried chicken, you will love this place!", "rating": "4", "date": [2012, 5, 14]}, "0": {"description": "Harold's chicken HITS THE SPOT!!!! Whenever Im rolling thru Englewood and its around that time IM DEFINETELY STOPPING.I've loved Harold's since I tried it the first time.Never disappoints.Get me a half chicken with mild sauce and a 40oz of MGD and IM ALL GOOD!!! Follow that up with some CUSH!! Happy camper!!!", "rating": "4", "date": [2012, 11, 19]}}, "neighborhoods": ["Englewood"], "latitude": 41.7611066, "longitude": -87.6444825, "rating": "3.5", "times": {"Mon": ["11:00 am", "11:00 pm"], "Thu": ["11:00 am", "11:00 pm"], "Sat": ["12:00 pm", "12:00 am"], "Wed": ["11:00 am", "11:00 pm"], "Tue": ["11:00 am", "11:00 pm"], "Sun": ["12:00 pm", "11:00 pm"], "Fri": ["11:00 am", "12:00 am"]}, "price": "$", "categories": [["Fast Food", "hotdogs"], ["Chicken Wings", "chicken_wings"]], "address": ["7310 S Halsted St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Good for Groups": "No", "Drive-Thru": "No", "Good for Kids": "No"}, "category": "Restaurants", "number_of_reviews": "3"}, "kusanya-cafe-chicago": {"comments": {"28": {"description": "I like that this place exists and I truly hope that they thrive in this location. They serve Bridgeport coffee and all the menu items are available all day. They have pastries and  sandwiches and a few other items. I decided on a coffee and a slice of chocolate cake.  Phil was very nice (and  easy on the eyes if I do say so myself). It's just a cool place to sit and have coffee and maybe read the newspaper, whatever your fancy.  I plan to frequent it more once my schedule permits.", "rating": "4", "date": [2014, 5, 25]}, "1": {"description": "Rosa J. believes that every community deserves a inclusive, inviting, and \"empowering\" spot to hang out.  Kusanya Cafe is an Englewood represent, located on the southeast corner of Green and 69th. St.  I do have to admit the surroundings are a bit sketchy, even though I don't anticipate immediate danger during the daytime.  The cozy joint is absolutely nice to get coffee and light lunch fare at reasonable prices.  I saw many regulars take advantage of the free wifi and bright sunlight to get work done.  I had the \"Ham Master Jay\" sandwich made-to-order by the friendly young lady at the register.  It was executed impeccably and tasted delicious.  Together the large, 20oz. latte and the sandwich cost less than $10 after tax.  After visiting various coffee shops in the city, Kusanya is one of the most inexpensive places I know.  If you happen to be the area or need to grab a quick bite nearby, Kusanya is an excellent choice.  The nearest El station is the CTA 63rd./Halsted Green Line.  For CTA buses, #8 (Halsted) and #67 (67th./69th./71st.) are in close proximity.", "rating": "4", "date": [2016, 2, 17]}, "9": {"description": "Wow, so good.  this place has great bbq chicken sandwich, fresh squeezed orange juice, and is a non profit.", "rating": "5", "date": [2015, 8, 31]}, "29": {"description": "This is a great place. You can tell the owner really cares and isn't just trying to make money. Their donuts are awesome and the green tea (raspberry green) is delicious. Great music always playing and the baristas are friendly and welcoming. Warm place with quality food and drink and good service. The owner came up with a pay it forward option. You can add a buck or two to your bill and then the next person that comes in gets a free drink. So cool to sit by the register and watch people be generous and other people receive!", "rating": "5", "date": [2014, 5, 17]}, "23": {"description": "What a great place! They're owned by a non-profit organization and make the most delicious coffee.  I tried their iced decaf fully expecting the usual crap coffee that is decaf.  I had to ask twice if it was decaf because it was so delicious.  They use the espresso machine for decaf and it great addition.  The staff is super friendly and their day old donuts are cheaper but still amazing. I scarfed them down in a very unladylike fashion.", "rating": "5", "date": [2014, 9, 3]}, "5": {"description": "Awesome decor and comfortable feel! Food service is extremely slow! Super slow... Smh... I guess thats why they have the books... Speed up the food and its a five star for me!! Oh food and drinks are good!", "rating": "3", "date": [2015, 11, 14]}, "31": {"description": "The new local gem of Englewood!! The iced chai was delicious! Perfect balance of tea & milk. Also yummy is the broccoli cheddar soup!! Really a must!! The friendly service & relaxed ambiance, along with the healthy & trendy meal options will keep you going back for more!!!", "rating": "5", "date": [2014, 4, 25]}, "25": {"description": "Awesome decorum good prices and they are very kind.  Their ingredients are fresh and delicious.", "rating": "4", "date": [2014, 7, 22]}, "12": {"description": "Very nice and lively.  Enjoyed the artistic touch.Nice conference work table in the back.", "rating": "4", "date": [2014, 9, 10]}, "37": {"description": "On Tuesday I saw on Facebook that a new Coffee Shop was opening in Englewood.  Yay.   I shared the info with friends.  Saturday morning I hopped on a southbound RedLine to 69th.  While waiting for a westbound #67 bus I chatted with fellow commuters about how much faster the RedLine is running since the track improvements.I knew the cafe was in the next block when I jumped off at Halsted and 69th.  Instinctively I checked out the north side of the street for 825 W.  Typical northsider mistake because on the south side odd numbers are on the south side of the street.  It's a lovely corner location with exposed brick walls and lots of big windows.There were a lot of people for 2 pm on a Saturday afternoon.  A fellow patron approached me as I stepped up to place my order and \"paid me forward $2.\" A very friendly ice breaker option.  Of course I waited for the next person to pay them forward $2 as well.  I chose a hearty bowl of corn chowder because I was starving so I will have to check out the lattes next time I visit.  I told a friend that one of the sandwich options is a \"Tuna Turner.\"  He laughed and suggested that they should offer an \"Ike Tea\" to go with it.Nice place.  Nice people.  Happy to have a landing place when I'm visiting Englewood.", "rating": "5", "date": [2013, 11, 23]}, "21": {"description": "Nice addition to neighborhood. Coffees have great flavor- smooth without bitter aftertaste. They also have smoothies, sandwiches, salads and breakfast options. They also have yoga on Monday evenings and host a variety of other community events including poetry readings, storytelling and music performances. Love the pay it forward option.", "rating": "5", "date": [2014, 9, 24]}, "16": {"description": "What a nice place!!!!! Everything I tried was really good.Loooooved the baked oatmeal.You know they put in effort.Their food and service reflects that.I wish them much success.I'll definetely return.Wish there was a cafe like this by my house!!!! lol", "rating": "5", "date": [2014, 11, 22]}, "17": {"description": "The mocha that smoothed down my throat today was maybe the best coffee I have ever had, apart from a cup served to me in an Ethiopian home a few years ago. Coffee: A+Ambience: A+Customer service: A+And bonus points for loving the Englewood neighborhood!I am headed back tomorrow.", "rating": "5", "date": [2014, 3, 19]}, "10": {"description": "I love local small businesses.  especially ones that are on the south side.  So today I woke up and my throat felt all closed up where I was having trouble swallowing.  I already work from home, so going to a coffee shop is no big deal in order to break of the monotony.  Anyways, I could have gone to starbucks, but I already had this place bookmarked, and I had the time, so I packed up and headed over there.   This was around 7:30 am, so it wasn't too crowded.  I stayed about 2 hours working, but I also I wanna talk about the food.  Well, I don't really drink coffee often, so I have no idea what to order.  But I did want some tea and I got a REALLY big cup of green tea with honey in it.  And to tell the truth, my throat did start to open up when I left.  I also ended up getting some grits.  Now grits aren't usually the type of food you find in a coffee shop, but given the reviews of this place, I had to try them out, and my grits were really good.  I had bacon and cheese in mine, and they really hit the spot.   Prices are very good here as well.  My tea was only about $2 and my big bowl of cheesy bacon grits were like $3.  They also had donuts for like $1 each and day old donuts which were 2 for $1.  There were assorted muffins and sandwiches available as well.  Also, this coffee shop is really nice looking.  But not in a starbucks type of way.  It's the type of vintage looking shop you'd expect to see up north or on the near west side.  I read it's a non-profit owner as well.  Anyways, this won't be my last visit, as I plan to come back and try some other items on the menu.", "rating": "5", "date": [2015, 9, 2]}, "11": {"description": "I love the comfy coffeehouse ambiance, the friendly cute guy behind the counter, that it is in Englewood, and the fact that it is community owned and run! They serve pretty much the gamut of coffee and tea offerings, as well as some unique breakfast items  (baked oatmeal, paninis, house-made granola), fruit smoothies, sandwiches, soups, salads, and baked goods. Sandwiches  haves cutesy/kitschy names like Mozz Def, Tuna Turner, Bernie Mac & Cheese, etc. The Chicken Funkadelic Panini is delish and worthy of an encore! The blueberry muffin was moist, flavorful, and full of love. The chicken noodle soup will be remembered fondly until it is in season again.Kusanya apparently means \"to meet, or gather\" in Swahili, and Kusanya Cafe is providing a place for its patrons to do just that!", "rating": "4", "date": [2014, 6, 25]}, "26": {"description": "After passing by this place several times I finally decided to stop in and WOW!  I'm hooked for life.  On my first visit, I tried the Ice Mocha and Lupe Tabasco - hooked.  Second visit a regular coffee and another Lupe Tobasco.  Third visit, coffee and donut.  This is my morning spot from now on.  They even take phone orders so you can run in, get your grub, and keep it moving.  I'm so happy to see that the owners decided to locate their Cafe here.  From the cars I see parked along the street, and the number of hipsters and police sipping lattes and eating oatmeal in the morning, I'm pretty sure they'll be around for many years to come.", "rating": "5", "date": [2014, 6, 26]}, "27": {"description": "I love the comfy coffeehouse ambiance, the friendly cute guy behind the counter, that it is in Englewood, and the fact that it is community owned and run! They serve pretty much the gamut of coffee and tea offerings, as well as some unique breakfast items  (baked oatmeal, paninis, house-made granola), fruit smoothies, sandwiches, soups, salads, and baked goods. Sandwiches  haves cutesy/kitschy names like Mozz Def, Tuna Turner, Bernie Mac & Cheese, etc. The Chicken Funkadelic Panini is delish and worthy of an encore! The blueberry muffin was moist, flavorful, and full of love. The chicken noodle soup will be remembered fondly until it is in season again.Kusanya apparently means \"to meet, or gather\" in Swahili, and Kusanya Cafe is providing a place for its patrons to do just that!", "rating": "4", "date": [2014, 6, 25]}, "35": {"description": "The mocha that smoothed down my throat today was maybe the best coffee I have ever had, apart from a cup served to me in an Ethiopian home a few years ago. Coffee: A+Ambience: A+Customer service: A+And bonus points for loving the Englewood neighborhood!I am headed back tomorrow.", "rating": "5", "date": [2014, 3, 19]}, "8": {"description": "Love this little cafe.  Sandwiches are delicious, I will be visiting here on a regular basis.  Only issue is there is only street parking and there are no other options besides sandwiches and wraps.  The day old donuts are even delicious.  Glad to see a black owned business in this neighborhood that's not rundown or a liquor store", "rating": "4", "date": [2015, 8, 24]}, "0": {"description": "An Englewood Gem! Outstanding service and great ambiance. I've tried almost all of the hot drinks and all were great. Great prices and way better drinks than Starbucks (which I do patronize often). Fresh pastries and breakfast sandwiches served as well. Cold pressed juices were phenomenal. If you're in the neighborhood you must stop by, or make a special trip and see for yourself.", "rating": "5", "date": [2015, 12, 14]}, "20": {"description": "This is a really nice cafe with a great vibe. The overall ambiance was great with the music in the background and the artistic look to the place with the seating. A variety of coffee, teas, and also some sandwiches, including French Toast. I had the French toast which was delicious and the OJ was freshly squeezed and just as delicious! Quality service.", "rating": "4", "date": [2014, 10, 3]}, "19": {"description": "On Tuesday I saw on Facebook that a new Coffee Shop was opening in Englewood.  Yay.   I shared the info with friends.  Saturday morning I hopped on a southbound RedLine to 69th.  While waiting for a westbound #67 bus I chatted with fellow commuters about how much faster the RedLine is running since the track improvements.I knew the cafe was in the next block when I jumped off at Halsted and 69th.  Instinctively I checked out the north side of the street for 825 W.  Typical northsider mistake because on the south side odd numbers are on the south side of the street.  It's a lovely corner location with exposed brick walls and lots of big windows.There were a lot of people for 2 pm on a Saturday afternoon.  A fellow patron approached me as I stepped up to place my order and \"paid me forward $2.\" A very friendly ice breaker option.  Of course I waited for the next person to pay them forward $2 as well.  I chose a hearty bowl of corn chowder because I was starving so I will have to check out the lattes next time I visit.  I told a friend that one of the sandwich options is a \"Tuna Turner.\"  He laughed and suggested that they should offer an \"Ike Tea\" to go with it.Nice place.  Nice people.  Happy to have a landing place when I'm visiting Englewood.", "rating": "5", "date": [2013, 11, 23]}, "33": {"description": "Great place to eat and hang out! I had the barbecue chicken salad sandwich, I know sounds weird right? It was delicious! Great atmosphere and it isn't simply an escape from the surround neighborhood but celebrates all that's good in the hood.", "rating": "5", "date": [2014, 4, 9]}, "2": {"description": "I love this place. I come in once or twice a day. The quality of their coffee is beyond expectations. The other guys have nothing on them. The ambiance and decor are wonderful. Cozy and inviting with a very friendly staff. This is not a \"fast food\" place. Don't expect speedy service. Expect great service. Go Kusanya!", "rating": "5", "date": [2015, 11, 21]}, "34": {"description": "Great coffee!!! A welcome treasure to....the GD motherland?! Who would have thought?", "rating": "4", "date": [2014, 3, 27]}, "32": {"description": "Free wifi, great homemade yogurt, excellent coffee and even better service!! Kusanya is a real jewel in this community!!", "rating": "5", "date": [2014, 4, 16]}, "18": {"description": "Nice addition to neighborhood. Coffees have great flavor- smooth without bitter aftertaste. They also have smoothies, sandwiches, salads and breakfast options. They also have yoga on Monday evenings and host a variety of other community events including poetry readings, storytelling and music performances. Love the pay it forward option.", "rating": "5", "date": [2014, 9, 24]}, "13": {"description": "This was one of the best tomato basil mozzarella sandwiches I have eaten in a long while. Crisp bread, great balsamic vinegar dressing and fresh ingredients. My latte was also excellent - wonderfully made with very flavorful coffee. Will be back again!", "rating": "5", "date": [2015, 4, 14]}, "4": {"description": "I love it here. The ambiance is dope and the people are extremely accommodating. I haven't any complaints. I've eaten here once (Funkadelic Chicken Sandwich) and it was tasty. I also ordered a peanut butter cookie which was just okay. I highly recommend it as a place to visit. Whether alone to chill, to study, or with a group of friends/colleagues.", "rating": "4", "date": [2015, 8, 6]}, "24": {"description": "My co-workers ordered from here a couple of times and I'm always impress. The sandwiches and soup are great! Is a really nice place to have close to work. The prices are fair also.  I plan to stop there one day for a donut at breakfast time.", "rating": "4", "date": [2014, 8, 21]}, "6": {"description": "A coffee oasis in a desert of Starbucks and Dunkin Donuts! Mellow and welcoming vibe, industrial decor, great place to relax with a latte. Took the recommendation of another yelper and was not disappointed: the Mos Def sandwich was super yummy. Also, appreciated the books for kids on he bookshelf so our 5 and 3 year old could be occupied while we enjoyed the excellent latte. Thank you!", "rating": "5", "date": [2015, 8, 10]}, "22": {"description": "Very nice and lively.  Enjoyed the artistic touch.Nice conference work table in the back.", "rating": "4", "date": [2014, 9, 10]}, "15": {"description": "This place is dope!! Great space, music, and decor, & apparently they have community yoga here too?? The staff people were all super nice. And their food is poppin too, I had the \"Chicken Funkadelic\" sandwich and the potato bacon soup and they were so good. Bless u Kusanya Cafe. I'll definitely be back.", "rating": "5", "date": [2015, 12, 15]}, "7": {"description": "I found a gem in Englewood. I love everything about this cafe. It's so cozy, the people are welcoming, the artistic atmosphere is attractive and it's such a great gathering place. I had an opportunity to have a very short conversation with I'm assuming one of the stakeholders or operators (who ever he is) but I learned that the cafe is a nonprofit organization and has no one person as the owner but the people of Englewood are owners. Love it. I'm a fan.  KUSANYA cafe", "rating": "5", "date": [2014, 11, 5]}, "36": {"description": "The service is warm, friendly and aims to please. The drink items are refreshing (my favorite is the dirty chai, which is house-made and mixed with a shot of espresso.) I also like the lemonade because it's fresh squeezed from real lemons. I am very glad this place is in my neighborhood. The people of Englewood deserve a place where they can have good food and high quality service. The owner is intent on providing good service to ANY who comes in and it shows. Yay, Kusanya!", "rating": "5", "date": [2014, 2, 7]}, "30": {"description": "I just can't find a better Americano anywhere in the city. Locally brewed in Englewood.  The pay it forward for $2 is a beautiful system for paying for a strangers coffee that comes in after you. Make sure you do that!", "rating": "5", "date": [2014, 5, 2]}, "3": {"description": "I really liked the decor, the art work, and the build out with exposed brick of this place. It's great that they located in Englewood, this space is needed there. Ilike the pay it forward. As a vegan the menu was a challenge for me. My hot chocolate with soy milk was great though. Free wifi, great space to get a little work done. It they had more vegan options I would increase the stars.", "rating": "3", "date": [2015, 2, 16]}, "14": {"description": "I appreciate this place for being bold enough to be located in such community!! I did a counseling session here, that's how nice it is! I'll be back!;)", "rating": "5", "date": [2015, 1, 2]}}, "neighborhoods": ["Englewood"], "latitude": 41.7687978, "longitude": -87.6455986, "rating": "4.5", "times": {"Mon": ["7:00 am", "5:00 pm"], "Thu": ["7:00 am", "5:00 pm"], "Sat": ["7:00 am", "5:00 pm"], "Wed": ["7:00 am", "5:00 pm"], "Tue": ["7:00 am", "5:00 pm"], "Sun": [], "Fri": ["7:00 am", "5:00 pm"]}, "price": "$", "categories": [["Cafes", "cafes"]], "address": ["825 W 69th St"], "attributes": {"Has TV": "No", "Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Wheelchair Accessible": "Yes", "Delivery": "No", "Outdoor Seating": "Yes", "Alcohol": "No", "Caters": "Yes", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Accepts Bitcoin": "No", "Ambience": "Casual", "Dogs Allowed": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Breakfast, Brunch"}, "category": "Restaurants", "number_of_reviews": "38"}, "white-castle-chicago-6": {"comments": {"3": {"description": "I went to this White Castle this past Sunday, and man oh man, one thing that made my visit so memorable and made me willing to give this location a 4-star rating is the sweetness of the cashier who served me. I had a cold and head pain accompanying it, so I came here to purchase a milkshake to take with some aspirin to ease the pain. Yes, that helped later on, but the cashier suggested some hot tea after I said that I was trying to ease the cold. She gave me lemon and honey to go with it, and a drink carrier so I could carry my tea and shake to my church. That was so nice of her. I'll definitely return to this location again in the near future, all because of her.", "rating": "4", "date": [2011, 4, 20]}, "1": {"description": "Consistant with other white castles but where else can you see guys shooting at each other and dope being sold as you tasting those little morsels? Level 2 vest is fine since they can't shoot anyway but do make sure you're armed and have at least 1 backup magazine.", "rating": "3", "date": [2012, 8, 31]}, "2": {"description": "If you ever want a laugh, come here on a weekend late night. Just be sure to keep your foot on the brake and your car in drive as the crowd waiting can be a little weird. The food here is typically white castle and even though the drive thru lines can get long, staff is not unfriendly and they bat a great average of charging you correctly for the right order which always is hot.", "rating": "3", "date": [2011, 3, 24]}, "0": {"description": "There is absolutely nothing wrong with this White Castle. They take your order and get it to you as soon as possible. Sometimes they only have 2 employees working so you may have to wait a little longer for your food, but the food is always hot and fresh and I have never been given stale fries. My only gripe is that they only give you ONE marinara for a 5 piece cheesestick and my French toast sticks were overcooked once.", "rating": "4", "date": [2013, 7, 26]}, "4": {"description": "Yay for sliders. I'm sold. Greasy steamy goodness. We need some on the west coast. Though not sure if chicken should come in ring form but hell I ate one.", "rating": "4", "date": [2007, 4, 14]}}, "latitude": 41.77291, "neighborhoods": ["Englewood"], "categories": [["Fast Food", "hotdogs"], ["Burgers", "burgers"]], "address": ["6646 S Halstead"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Delivery": "No", "Outdoor Seating": "Yes", "Alcohol": "No", "Caters": "No", "Good For": "Lunch", "Attire": "Casual", "Waiter Service": "No", "Takes Reservations": "No", "Good for Groups": "No", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.64496, "category": "Restaurants", "rating": "3.5", "price": "$", "number_of_reviews": "5"}, "mana-gourmet-products-chicago": {"comments": {"3": {"description": "FINALLY got the chance to taste the original Banana-Mana!!!! It's DELICIOUS!!! really creamy yet light; I can't wait to try the other flavors!", "rating": "5", "date": [2011, 7, 11]}, "1": {"description": "I used to always get the original Mana at J &J's Fish. When I saw that they had their own location with additional flavors, I'm like yes! I got a chance to stop by today. According to the menu that I picked up at the restaurant, this is actually Mr. Allen's Sweet Shop(The Jerk Spot) and also home of Banana Mana. It's a small spot that is only there to serve its purpose of churning out good food so don't look for aesthetics!  I was served by a very nice gentleman(Mr. Allen?). I noticed in one of the reviews someone mentioned a restroom. When you walk in there's the order window and a door next to it which opens into the kitchen. I was in and out but on my next visit I'll have to inquire about the bathroom because there may be seating in the back as well. Who knows? I ordered a small tip-$6, an original Mana-$2.50(for Granny) and a banana walnut bread Mana-$2.50.  Listen, I haven't had rib tips from a restaurant that have tasted this good in a loooong time. There was nothing special about them. They were just seasoned well and suuuuper tender-very well made. The sauce was more like a semi glaze. I liked the cut as well. It was good. Only 3 of the tips made it home with me. A slice of bread and some sport peppers came with the tips. Shrugs.  They also serve links, jerk chicken,  a few sides like greens, mac & cheese and red beans & rice. I was there less than 10  minutes. I'm definitely going back for some tips.", "rating": "5", "date": [2015, 4, 3]}, "2": {"description": "They only serve one thing but they do it well--MANA! It's between custard, ice cream, and pudding--served either chilled or frozen. Tucked away in Englewood, at 1022 1/2 W 63rd, they have the best banana pudding I've ever had (just don't call it Banana *pudding* around them). They're always adding new flavors and are also expanding their distribution of original banana mana throughout the south side. You, however, can only get all of their wonderful flavors at their storefront. Reese's Banana Mana is certainly a desert destination.", "rating": "5", "date": [2013, 2, 9]}, "0": {"description": "If I could give the mana 10 stars I would. This is so delicious. See you don't understand. This is my favorite thing in the world. I've tried many and I mean a ton of placed. Oh my y", "rating": "5", "date": [2016, 1, 6]}}, "neighborhoods": ["Englewood"], "latitude": 41.779922, "longitude": -87.650665, "rating": "5.0", "times": {"Mon": ["11:00 am", "7:00 pm"], "Thu": ["11:00 am", "5:00 pm"], "Sat": ["11:00 am", "7:00 pm"], "Wed": ["11:00 am", "7:00 pm"], "Tue": ["11:00 am", "5:00 pm"], "Sun": [], "Fri": ["11:00 am", "7:00 pm"]}, "price": "$", "categories": [["Desserts", "desserts"], ["American (New)", "newamerican"]], "address": ["1022 1/2 W 63rd St"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Delivery": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "4"}, "furniture-city-norridge": {"comments": {"3": {"description": "I can't say anything bad about Furniture City.  We are always greeted by a friendly face and consistently treated with respect.  They have some very unique and custom pieces and it's nice to know I won't see my furniture is someone else's house.   The prices are very reasonable and the service is always great.  The delivery guys always are careful and great about setting everything up.I honestly can't say enough good things about this family-run business! Highly recommended!", "rating": "5", "date": [2012, 11, 4]}, "1": {"description": "You have to love these non-chain stores...and in this case, furniture stores!  This place has good quality stuff!I know one of the pieces of furniture in addition to my entertainment center are from here...I just can't recall which.  My entertainment center was bought here almost 10 years ago, been through a few moves and is still in great condition.  They really sell quality stuff here!  You can shop from their catalog in addition to what they have in the store.  The staff here are always super friendly and helpful and NOT at all pushy and sales-like.  I visited with my mom again yesterday, she had to purchase a new unit  to accomodate a larger tv and they were having an anniversary sale.  Wandering in here made me really want to update my furniture in my home, and their prices are not bad at all!I definitely recommend coming here...you will not be disappointed.", "rating": "5", "date": [2015, 10, 19]}, "2": {"description": "I love the people as well as the furniture at Furniture City!  I bought my click-bed (alternate version of a sofabed) from them back in August of this year. They have a vast selection of furniture. Julie Sommers did a wonderful job of helping me find what I was looking for. I opted to make payments & have it delivered upon completion. I actually paid it off early (within a month) and they were perfectly fine with my random & early payments. Delivery was right on time, the movers were very cool & cautious with the furniture. I'd strongly recommend shopping with them.", "rating": "5", "date": [2014, 11, 27]}, "9": {"description": "This place is as good as it gets.  Forget Harlem Furniture, or any of these big chain stores.  These people care.  These people give great service.  These people are just great!!I have purchased furniture from them for over 15 years, and they are truly the best in the business.  Great prices!!", "rating": "5", "date": [2011, 12, 6]}, "10": {"description": "Great furniture, helpful workers and best of all free delivery!  Highly recommended.", "rating": "5", "date": [2011, 9, 3]}, "4": {"description": "If I could give more stars, I would!! These people are the best of the best!! They listen to your needs, aren't pushy, and if they don't have what you want they look for something! They let you shop around by giving you the space you need. Best of all, I love that they support American economy- the majority if their products are American made!!  I can't say enough great things about this gem of a furniture shop!! There is no delivery fee, and will match (and beat) other prices!! The possibilities are endless at Furniture City!!", "rating": "5", "date": [2014, 3, 27]}, "6": {"description": "Disappointing.  We bought a couch and loveseat here \"on clearance\" and the guy would not come down on the price at all, even though we had bought a desk and chair a few months earlier.  Then they deliver it and it is damaged, nicked the wood trim.  The delivery guy tried to get me to sign off that it was in perfect condition but I wrote on the paper that it was damaged.  A few days later a guy comes back with a marker to color in the damages and a week later the marker fades away and the nicks are visible again.  So our new furniture already looks like crap.  Worst part of it all?  A month later we see an ad for Ashley Furniture for our same couch and loveseat for THREE HUNDRED DOLLARS LESS PLUS FREE RUG, COFFEE TABLE AND TABLES AND LAMPS.  We feel ripped off and will never shop there again.  Look elsewhere for a better deal, these people could not care less about you.", "rating": "1", "date": [2013, 6, 23]}, "12": {"description": "Best prices on furniture i know of.  My parents have bought everything from their from our couches to tables and desks.  The people their are really nice and always lower the pirce for you.", "rating": "5", "date": [2005, 8, 31]}, "5": {"description": "We just bought a house so we have been working with a lot of different companies in terms of buying new furniture.  Furniture City was by far the best.  My mom found them in an effort to buy us a new kitchen table.  Their customer service from day one was excellent.  I will make sure to visit again the next time I need new furniture.", "rating": "5", "date": [2014, 8, 28]}, "11": {"description": "Jerry and the staff have been super friendly each time I've worked with them. They are one of the few businesses that accept layaway. Though the store looks small, they move a lot of furniture and have a great selection through catalogs. Plus, the prices are reasonable. I live in Lake County and they have no problem delivering to me.", "rating": "5", "date": [2009, 9, 11]}, "8": {"description": "My husband's family has been shopping here for 50 years, and 10 years for me.  Bought a couch and chair today. Fantastic service -- they actually remember what we've bought in the past.  Love to patronize wonderful shops like this.", "rating": "5", "date": [2013, 3, 24]}, "0": {"description": "My girlfriend and I were in the market for a new sofa.  We did some initial research and found the type that we wanted, that being a Chaise sofa.  First, we hit up a chain store that was in our area.  The prices were a tad high and the quality of the couches were sub-par.  After dealing with an incompetent salesman for a few minutes we decided to head out for lunch near our next step.We then ventured into Furniture City.  I had lived in the area my entire life but never stopped in.  We were greeted by the sweetest lady ever.  She showed us the couches they had in stock that fit what we were looking for.  We sat on some and decided to buy!  It was also their 55th Anniversary sale so we got a pretty good deal!After some quick paperwork we paid for the couch, found out that the shipping was FREE and were on our merry way.  We'll definitely be stopping in again when we need to make another furniture purchase!", "rating": "5", "date": [2015, 10, 21]}, "7": {"description": "So nice to know that a family owned small business can not only survive but thrive in todays big store environment!  While small, this store packs a lot of options into the space they have and they carry items you just cannot find at other places.  Operating on the northwest side for decades, they understand the variety of homes in the area and put us at ease immediately as we were looking for couch sectionals for our basement but feared that nothing would fit through the small basement entry we have.  Came to find out that the items we liked could be assembled in the home so no need to worry about cramming the fully assembled pieces down the stairwell.  The items we chose, a power couch and power loveseat, were also completely American made by a family owned company in Indiana.  Our order took about 3 weeks to be made and once they came in we scheduled free delivery and set-up for the next day.  The crew of 3 very professional members of the Furniture City store (not contractual movers) arrived on time and had everything put together in a matter of 20 min.  Family owned, American made products, fairly priced and on time delivery all add up to a full 5-star experience.  Highly recommended!!!", "rating": "5", "date": [2014, 12, 6]}}, "latitude": 41.9584199, "categories": [["Furniture Stores", "furniture"], ["Mattresses", "mattresses"]], "address": ["4300 N Harlem Ave"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.80765, "times": {"Mon": ["9:00 am", "5:00 pm"], "Thu": ["9:00 am", "5:00 pm"], "Sat": ["9:00 am", "4:00 pm"], "Wed": ["9:00 am", "5:00 pm"], "Tue": ["9:00 am", "5:00 pm"], "Sun": ["12:00 pm", "4:00 pm"], "Fri": ["9:00 am", "5:00 pm"]}, "rating": "4.5", "price": "$$", "number_of_reviews": "13"}, "magic-nails-nail-supply-chicago": {"comments": {"0": {"description": "I've gotten a pedicure here three times. The first two times were flawless, but the last time I also got a mani. The mani was decent at best, but I probably wouldn't get another one here. It chipped after 2-3 days  and she did a pretty sloppy job which I don't understand because her pedicures are great, she just spends about an hour doing them which sometimes can be annoying. They have a lot of color selections and pedicures are only $20.", "rating": "4", "date": [2013, 7, 26]}}, "latitude": 41.77555, "neighborhoods": ["Englewood"], "categories": [["Nail Salons", "othersalons"]], "address": ["6514 S Halsted St"], "attributes": {"By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.64502, "category": "Beauty", "rating": "4.0", "price": "$", "number_of_reviews": "1"}}