{"sweet-miss-givings-chicago": {"comments": {"12": {"description": "Found the Sweet Miss Givings truck outside my office one day.  Got a vanilla cupcake with vanilla icing...the cupcake itself was SUPER moist and was by far the best part!  The icing was good, not amazing, but together, they made the cupcake a great purchase!   I'll definitely go back everytime the food truck is around my building at work!", "rating": "4", "date": [2011, 7, 29]}, "3": {"description": "I've passed Sweet Miss Giving's at the French Market, but never thought to try their cupcakes.  I had a chance to try some at the Food Truck Summit, which took place under tents in the midst of some craptacular rain & hail.  It was super crowded, but luckily the two dessert trucks had the shortest lines.  I got a huge Red Delvet cupcake and a Turtle brownie.  Double ca-ching!  The cupcake was a lot larger than typical places and it was damn good.  The red velvet cake was super moist and the cream cheese frosting was crucial.  I just wish I got two.Their brochure says they donate half of their profits to help the formerly homeless and disabled people at the Chicago House.  But the guy at the truck and the packaging says they now donate all of their profits.  Pretty cool.", "rating": "5", "date": [2011, 4, 20]}, "1": {"description": "Back when I was being edumucated, before the days of the the food truck frenzy and the French Market, Loyola carried treats from Sweet Miss Giving's in the disgusting food court. I was never there to get a greasy slice of pizza or a gross cheeseburger. I was there for a bottle of water and a humungo brownie!What makes Sweet Miss Giving's better than the other gazillion bakeries out there? It is not just how delicious the yumyum treats are! Check out their mission. This organization helps give homeless people jobs *and* supports HIV/AIDS education.Get your philanthropy on *and* get a sweet treat? How can you go wrong?", "rating": "4", "date": [2012, 4, 11]}, "2": {"description": "Here's my story about Sweet Miss GIving's...(note: Please see the fabulous Emily D's review for background, mission, etc. It's quite stellar.) Half of proceeds to go to charity, AND they participate in job training programs to get peeps back on their feet. Now, order the brownies. It's your civic duty. Ok, back to story. My mom is the sweetest woman in all the land. Truly. Just right down the middle, she's the best. So naturally, she does nice things for me on her birthday...being that I am her favorite oldest daughter. (and only daughter, but pay no mind). She actually did some research on Yelp, came up with Sweet Miss Givings...and ordered a dozen (yeah, luckily I have some people to share with, or I'd have a cupcake gut for my 27th year of life.), and had them delivered to my abode on the day of my birth. And then, someone stole them. Yes, some cupcake thief STOLE MY MOTHERF'in cupcakes that my sweet mother sent me for my birthday right out of the lobby. So, as Sharon (my mom) called me several times throughout the day expecting \"yeeeeeeeeeeee!\" and \"thank youuuuuuuuuuuu!\" she was met with idle chit chat, like a normal day. So finally, by the end she just told me she had sent them, and we figured out that the infamous package stealer had preyed upon my box of goodies. (it's a chronic problem in my building, bastard). As she'd been in touch with SMG, she let them know the super depressing dealio. Then I got a call from their business manager.Him: Hi! Your cupcakes got stolen? Me: (sad face) yes. Him: Why don't you come in for a bakery tour, and we'll unveil our holiday menu to you? Me: (ears perk up), oooooo, ok!So, this past week I stopped in with my Little Sister (yelp.com/biz/big-brother…) for a bakery tour. AND, we got to try the most marvelous punkin cheesecake (seriously) AND some stellar Molasses cookies, with real ginger, and um....REAL superiority. Best ever.I know exactly where I am ordering my holiday goodies from this year (puhlease, I'll leave the baking to the pros, you'll all thank me), and they deliver in all of Chicago, even outwards to the far suburbs for a small extra fee. (Plus, they ship nationwide). And, dear package stealer...You've become my new mission in life. Unfortunately for YOU, I am somewhat tenacious when it comes to cupcake justice. Yeah, you've gotten away with some other random stuff of mine, but cupcakes from my mother? Your klepto-ass is going down. So I'll be visiting here: yelp.com/biz/the-boring-… for some spy equipment. Sweet Miss Givings VIctory! Sharon wins. I win. Jamara wins. And, the package stealer LOSES. To Be Continued...", "rating": "5", "date": [2009, 10, 10]}, "9": {"description": "Cupcake domination. It's upon us. Many of us Yelpers are smitten with our favorite dens of sugary bliss, and covet their delectables until we're frothing with frosting. And some of us have had enough of the craze, to whom I say, \"How can you be serious?\"Boutique cupcakes are beautiful baubles to be sure. But I've found a bakery that doesn't just satiate sugar cravings. Rather, Sweet Miss Giving's gives back to the community. . . in a major way.SWG is a bakery and jobs program that donates 50 percent of its profits to the formerly homeless and HIV/AIDS-affected men, women and children of Chicago House. In its five-year existence, more than 250 participants have benefited from the job training and placement services. SWG teaches employable skills in baking, packaging, customer service and delivery, all under the tutelage of master bakers. Cupcakes just got so much sweeter. My first experience with SWG couldn't have been better. They don't have a store front, rather any of their yum yums are delivered right to your door. That's right. You can eat cupcakes in your pajamas. Fresh cupcakes. Without lifting a finger. To quote Jim Gaffigan, \"I guess I'm not showering today.\"I chose to pick a dozen minis up for a recent trip to Michigan. I fumbled with the directions and wound up going in the wrong entrance which turned out to be a saccharine surprise, as I got escorted through the high-tech, stainless steel kitchen where bakers and students alike were hard at work on all sorts of concoctions: praline brownies, banana cream pie muffins, gingered pear scones.Yeah, it ain't just cupcakes. Understanding Chicago's collective cupcake mania shows no signs of slowing down, I implore to give into your cravings. . . and give back. Now you can. No excuses. Just do it.TIP: Don't just stop by. . . to my knowledge, there's no ready-to-eat treats. You have to pre-order through the Web site, and I'm going to try delivery next time. But picking up is a seamless process!", "rating": "5", "date": [2009, 4, 15]}, "10": {"description": "If you are hosting a coporate lunch or breakfast and are looking for a fantastic place from which to order your breakfast items or lunches, you can't go wrong with Sweet Miss Givings.  High Quality.  Great tasting,  at a competitive price.The brownies and the red velvet cupcakes are to die for.", "rating": "5", "date": [2010, 9, 3]}, "13": {"description": "Everything is so good and for a great cause too. Love the Turtle Brownies, Red Velvet Cupcakes, carrot cupcakes, Pear Ginger Scones...oh who am I fooling I love it all.", "rating": "5", "date": [2011, 1, 25]}, "16": {"description": "SMG truck showed up by my work Wednesday... Had a coconut cupcake (Seasonal)... Great flavor and size especially since part of profits are going to charity. I'm looking forward to next week to see how the chocolate and red velvet are... Glad that I can get my sugar fix all while helping out a great cause!", "rating": "5", "date": [2011, 4, 22]}, "6": {"description": "When I got off the El the other day after a long hard day at work, I was thrilled at the idea that I was two blocks closer to home.  But when I saw the Sweet Miss Givings truck waiting outside the station displaying all its goodies, my heart lept!  Oh joy!!!There was NO WAY that I could pass this by, even if I was scheduled to work out with my trainer that evening.The gentleman in the truck was very friendly and helpful, explaining all the offerings, then assisted me in narrowing my choices down to three items:  one dozen Mini Red Velvet Cupcakes, a German chocolate brownie, and a White Chocolate Chunk Cranberry cookie (which he said was the best thing he's ever tasted).  The total was $19 which all goes to charity.He was right - the White Chocolate Chunk Cranberry Cookie was TO DIE FOR.  I forced myself to eat it slowly, savoring every morsel.  Believe me, this was tough...  If there was really such a thing as a Cookie Monster, her name would be Marjorie.Out of the kindness of my heart (plus I didn't want to consume these alone in one sitting), I brought the Mini Red Velvet Cupcakes to work the next day.  After the experience with the cookie, it was no surprise that my co-workers and I basked in the euphoria produced by these tasty little treats.  This was by far the best Red Velvet cupcake I have ever encountered!  The cake itself is moist and delicious, and the frosting --- oh so creamy with just the right sweetness.I am saving the German Chocolate Brownie for later --- which of course, I will let you all know about.  I couldn't wait to write this review and get the word out!Sweet Miss Givings is doing a wonderful thing by raising money to raise people up.  They are spreading the love by selling products that taste like they are made with love.Bottom line ---  give me Sweet Miss Givings any day!", "rating": "5", "date": [2011, 4, 23]}, "15": {"description": "Great food. Well made. Great cause!", "rating": "5", "date": [2011, 9, 8]}, "0": {"description": "I've had Sweet Miss Giving's at the French Market and was lucky enough to try the truck at the Food Truck Summit. I love Sweet Miss Giving's because their sweets are awesome plus the money goes to a great cause. You just can't go wrong there. Not to mention, both times I have gone plus when I was at the truck, service was just amazing. The guys working there are super friendly and knowledgeable about the mission and the products.Everything I have tried is always good from Sweet Miss Giving's! From the truck, I got a brownie and a cupcake. I really wanted the Devil's food cupcake but the girl in front of me in line took the last one! Sadface. I had a big ol' yellow cupcake with chocolate frosting which was delicious! I love the thick, sugary frosting and the moist cake. Yums!I also tried the Cream Cheese brownie to switch it up and it was fantastic! So decadent and full of chocolate goodness. It was such a nice surprise from a place I though was known for their cupcakes.Love Sweet Miss Giving's and all they do for their community! I highly recommend them and look forward to trying more myself!", "rating": "5", "date": [2011, 5, 1]}, "5": {"description": "I had some of the velvet cake from the Sweet Miss Giving's truck.  Very convenient as they are right outside my workplace!The cake was great, and the cream cheese frosting... delicious.  Prices are a tad higher than a velvet cake can be, but heck they donate a portion to charity, so it's all good!", "rating": "4", "date": [2011, 3, 26]}, "11": {"description": "Ok...SMG gets a 5 for what they are all about for sure!  But this is about food too right?! =]]Osi V, my ma and I stopped here, soaking wet at the Food Truck Summit at Goose Island.  They were one of only like three trucks who still had stuff to sell at only 7:40 PM!  My mom and O went over and picked up a couple brownies, 2 red velvet cupcakes (which were very generously sized) and a dozen minis (carrot, vanilla, chocolate).  I tried everything we got and the definite stand out, by far, was the red velvet.  Very, very moist with an amazing frosting on top.  Just a little chocolatey for what I think a red velvet should be...but hey...that's just my opinion...and it wouldn't stop me from getting another one! =]  The brownies were good, nothing special, but nice and moist.  But the big disappointment for me was the minis...they were super dry and the frosting on top was really hard...you could tell the chocolate cake was a good cake, but it was definitely overcooked, probably because it was the miniature size.  I would like to try a bigger version to compare.  But I am also a cupcake snob over here since I believe to make some of the best...so I am really not trying to be mean...just honest.  I still love you SMG!!  And I def plan on stopping by your truck sometime when my kids let me venture back out to the city!", "rating": "4", "date": [2011, 4, 21]}, "8": {"description": "Sweet Miss Giving's - the perfect name for such a place - sweets where 50% profits goes to those in need....such cleverness. My review is for the small Sweet Miss Giving's booth in the new French Market in downtown.  Amongst a row of sweets/desserts, Sweet Miss Giving's stood out with its simple display of cupcakes, brownies and muffins.  On my first visit to the french market, i was too full to try the red velvet cupcake that i had eyed on my stroll around. Fast forward 2 weeks later, after a tremendously LONG week at work and yet tremendously satisfying lunch at another french market vendor, i plopped down my 3 dollars (oh what a steal!) to grab THE last red velvet cupcake (lady literally took away the red velvet tag after my purchase).  Phew, made it just in time.  I got the cupcake to go and it came in clear basket carton made especially to house cupcakes.  I must have looked uber happy because a random person walked up to me and demanded where i got my cupcake!I saved the cupcake to share with the BF for dessert after our friday night dinner date and yes, it was quite a perfect ending.  Not overly sweet but perfectly creamy cream cheese icing over the red velvet cake, which was a bit on the dry side but had a very interesting texture (almost nutty) but still delicious. Anyways, a rather long story to review one simple red velvet cupcake...but as sweet miss giving's would say: Even better than flowers and chocolates when you are looking for a gift for your sweetheart....", "rating": "4", "date": [2010, 3, 5]}, "4": {"description": "So I decided to update my review after some serious consideration. I don't like to lead people astray so I want to clear some things up. The red velvet cupcake is still one of the best if not THE best I've ever bit into. So a gazzilion stars for that.The brownie we ordered was moist but nothing really special. We also ordered a dozen minies and I hate to admit it but they were too dry for likings. Which is understandable since they're smaller but I would not get them again. Now with that said being said I would walk miles to get me one of them red velvet babies in my mouth. Which would be a good calorie burning walk pre-cupcake. =p SMG gets two thumbs up from this lady, well in this case 5 stars.", "rating": "5", "date": [2011, 4, 25]}, "14": {"description": "At Emily D's recommendation, I tried Sweet Miss Giving's.  I sent a dozen mini cupcakes to my brother, who wasn't feeling well.  I wanted to send him something, I don't like sending boys flowers, and freshly baked cupcakes seemed like the perfect idea.  I'm so glad this place exists!  He was delighted to receive the cupcakes and said they were \"awesome.\"  And I felt all fuzzy inside knowing I'd made his day and supported a good cause.", "rating": "5", "date": [2009, 5, 15]}, "7": {"description": "My review for Sweet Miss Givings is based only my experience with the treat truck that I discovered parked near my car while I was leaving school one day a couple weeks ago.  Unable to turn down a cupcake that seemed so clearly placed in my path by some sort of divine intervention, I purchased a carrot cake cupcake.  The price was 3 dollars, which was fine for the size and quality of the cupcake.  However, the employee in the truck said that they are only 3 dollars when on college campuses, and are 5 dollars ordinarily.  Hmmm.  5 dollars is too much, I think.  Their flavors are pretty standard (chocolate, red velvet, carrot cake, etc) and while it was certainly a quality cupcake, I wouldn't pay 5 dollars for one.  That's more than your average cupcake boutique, by a dollar at least, and the cupcakes don't live up to that price difference.That said, it was a really good carrot cake cupcake.  Also, they donate a certain percentage of their profits to support homeless Chicagoans, which is awesome.  I guess if I'm going to overpay for a cupcake, I want it to be for a good cause!  In summary, if you see the cupcake truck in your path, it was meant to be.  Some greater force in the universe thinks you should buy a cupcake.  Don't fight it!", "rating": "4", "date": [2011, 2, 22]}}, "neighborhoods": ["Goose Island"], "latitude": 41.9044990539551, "longitude": -87.6558456420898, "rating": "4.5", "times": {"Mon": ["7:30 am", "7:30 pm"], "Thu": ["7:30 am", "7:30 pm"], "Sat": ["8:30 am", "6:00 pm"], "Wed": ["7:30 am", "7:30 pm"], "Tue": ["7:30 am", "7:30 pm"], "Sun": [], "Fri": ["7:30 am", "7:30 pm"]}, "price": "$$", "categories": [["Desserts", "desserts"], ["Street Vendors", "streetvendors"]], "address": ["1229 N Branch St", "Ste 123"], "attributes": {"Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "17"}, "bryn-taylor-style-chicago": {"comments": {"3": {"description": "I worked with Bryn on a closet cleanse and then on subsequent shopping excursions. She is savvy and chic and is able to immediately show you how clothes can look amazing on whatever your body type may be.  She knows where to find what you need with the budget you have available.  She spent a lot of time putting outfits together, while helping me part with those items I never should have purchased in the first place. Time spent with Bryn is well worth it. I really did my research before working with Bryn and she exceeded expectations.  Start with a closet cleanse - you won't be sorry!", "rating": "5", "date": [2016, 1, 12]}, "1": {"description": "I always look forward to my appointments with Bryn.  She's professional, relevant, and a pleasure with whom to work. I can always rely on her to take my unique personal style and fill the gaps in my closet, not just reflect her own tastes or the current vogue.  Love her!", "rating": "5", "date": [2016, 1, 5]}, "2": {"description": "I selected Bryn because I liked her website and I've been extremely pleased with her services - she is very personalized (i.e, listens to what my needs are, works with what I have, and makes fantastic suggestions) and then puts together combinations I would never have thought of - it's like tripling my existing wardrobe.  She also has showed me places to shop I was completely unaware of, where I've bought incredibly great clothes that are reasonably priced.  It's boosted my confidence and freed me to be able to concentrate on things that are really important - I no longer have to worry about whether I am wearing something that really isn't quite right.  I have suggested her to friends, who also have been really happy with her.  I would recommend her without any hesitation.  Working with Bryn has been one of the best decisions I ever made!", "rating": "5", "date": [2016, 1, 7]}, "0": {"description": "I loved working with Bryn. I hired her to do a closet edit and then we went shopping together a few weeks later. She really listened to what I was looking for, and helped me cull some clothes that were nice, but completely wrong for me - I needed that permission! Within minutes, she was showing me how I could wear some other pieces that I loved but had never figured out how to wear, so I had new outfits before we even started shopping. On our shopping day, she had picked out pieces in advance, so I felt like we got a lot of quality time in. She showed me how to wear some things that I'd avoided but just needed adjustment to work well on me. Most important - I walked away with a fantastic jump start on a new wardrobe that met my needs, and pushed me in a couple of places where I wanted to try something new. Her services are huge value for the money, and I would recommend Bryn to anyone who asks.", "rating": "5", "date": [2016, 1, 5]}}, "latitude": 41.9036674499512, "neighborhoods": ["Goose Island"], "categories": [["Personal Shopping", "personal_shopping"]], "address": [], "attributes": {"By Appointment Only": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.6571197509766, "category": "Shopping", "rating": "5.0", "price": "$$", "number_of_reviews": "4"}, "goose-island-shrimp-house-chicago-chicago": {"comments": {"58": {"description": "Completely ghetto joint across the river from what was once the Cabrini Green housing projects on Division St.. You can't eat there...it's dirty...it's very unappealing...BUT, don't be intimidated!  Park on the dark street, head inside, order a pound of jumbo shrimp, a pound of fish nuggets, 4 hot sauces and 2 x 7UP's and you'll be glad you did.  If you go on a Friday or Saturday night you'll be waiting awhile (standing), but it's worth it.  They even have a big picture window so you can keep an eye on your car!  Don't be a wuss...visit this charcoal-covered gem and keep it in your back pocket.", "rating": "5", "date": [2012, 1, 31]}, "56": {"description": "best fried shrimp in the city, and i have tried most, been going here for over 10 years now- always the same, always awesome!  Dont try much else there, all you need is the scrimps, and some cocktail sauce, and hot sauce- done! fried shrimp heaven. there is a reason they have been there almost 40 years!", "rating": "5", "date": [2012, 4, 4]}, "29": {"description": "Went last night.  Not at all what I expected.  The breading was heavy thick coating that was gross. I couldn't tell the difference between the jumbo shrimp and catfish.  The catfish still had the bones in it and was undercooked.  I did like the Clams. That's about it.", "rating": "1", "date": [2014, 4, 10]}, "42": {"description": "Shrimp house is right down the road and from all the reviews we decided to give it a try for lunch. About 5 of us order about 5# shrimp, 1/2#oysters, clams, fries, almost everything. I think most of these 4-5 stars are just having a nostalgia moment. The food was OK at best, oysters were downright scary.Breading was thick but shrimp size was good, just not much flavor. Goose Island sauce is just cocktail sauce (over priced). Won't be back except maybe for the clam strips. They seemed to be breaded differently which makes me think right from the freezer into the fryer from Gordon's fisherman.", "rating": "1", "date": [2012, 11, 3]}, "23": {"description": "I got a pound of skrimps and clam strips. The shrimps tasted good, the breading was ok. I came here during lunch. The service was fast and they hooked it up with shrimp. I couldn't come close to finishing it. The hot sauce is on point, probably my favorite part.", "rating": "4", "date": [2014, 9, 3]}, "47": {"description": "Some of the best fried shrimp I've ever had.  The Goose Island Sauce is a MUST. The hot sauce is also fantabulous.  You can call ahead, but if its late enough it only takes them about 10 minutes to throw your order together.  And don't worry, you won't get shot.  Well, most likely won't get shot.  Park right out in front, run inside, order your shrimp and enjoy.  I like the jumbo. The \"pros\" seem to order the regular.  I have yet to order the regular size. Jumbo are $12 a pound, regular are $8.50 a pound.  All I know is, when shrimp are so good that you are happy to eat the tail, then these are some damn good shrimp.  You will enjoy!", "rating": "5", "date": [2012, 8, 20]}, "8": {"description": "I mean it's kickass fried shrimp. Like really Fred. And the hot sauce isn't hot but more like a southwestern tangy deliciousness. It's in the middle of nowhere and there's no seating so take that for what it is. The wait is around 15 minutes but there's arcade games. I want to go back and eat the fish chips because everybody's doing it.", "rating": "5", "date": [2015, 5, 21]}, "31": {"description": "I heard great things about GISH and that the jumbo shrimp were delicious and the best in Chicago. So, I drove all the way from the Southside of Chicago and paid $69.72 for 3 lbs of shrimp, 1lb of catfish, 3 orders of lunchroom cookies, and 6 pops. Oh and 3 extra sauces!  If you enjoy jumbo heavy, heavy, cornmeal breading on your shrimp then you will love this place. I myself found the shrimp to be the nastiest shrimp I've ever eaten. The hot sauce is some kind of weird color that was unrecognizable, didn't even touch that. The only good thing I can report is the Sprite was delish.", "rating": "1", "date": [2014, 2, 12]}, "34": {"description": "This place has been around forever!I remember my aunt and uncles would always talk about coming here after being out partying on weekends. I remember being a teenager eating the leftover shrimp they could not eat and I enjoyed the hell out of it.I decided to stop by recently for nostalgia sake. I ordered 1/2lbs of jumbo shrimp. I always enjoy checking out old establishments that have signed pics of local and world celebrities. Shaq, Lisa Raye, local news reporters and countless others have donated their John Hancocks to the wall of fame here. My food didn't take very long to come out and I hopped in my car and drove home. I was excited to try the shrimp I hadn't eaten in almost 20 years. Once home I ripped the damn bag open and saw my big ass shrimp which caused the hunger to rise. There was too much breading on the shrimp which made it difficult to eat and it definitely affected the taste in a major way. Not as good as I remember it. The hot sauce definitely added flavor to the overly breaded shrimp and would probably be good on anything fried.People behind the counter are really cool. Parking here should be easy as there is street parking in front. The place is virtually in the middle of nowhere with nothing else to eat until you drive about a mile west on Division. I would definitely try the place again, but I prefer Lawrence Fisheries shrimp.", "rating": "3", "date": [2013, 10, 13]}, "16": {"description": "Probably worth it for the experience alone. Come here after a long night, park outside, get your shrimp in a bag, then sit in your car and eat it while watching all sorts of characters do the exact same thing you just did. The shrimp is interesting. No one is lying here when they say they're huge! And the tails are still on, but breaded so easy to accidentally ingest. The breading is really thick but not particularly flavorful. Clam strips are the same thing... but clam strips. Fries were good in the way that only fries stuffed in paper bag can be, but they really need salt. It seems like a lot of people like the hot sauce, but I just thought it was ok.", "rating": "3", "date": [2014, 7, 13]}, "13": {"description": "I love Goose Island but I don't understand why is closed it's supposed to be open till 4 a.m.", "rating": "4", "date": [2015, 8, 31]}, "11": {"description": "Stick to the basics--fried shrimp, fries, soda.  All were great and all were cheap.  The catfish was cheap too, but it was so laden with chunky bone pieces (like, the size of a quarter or larger in some cases) that I would skip the catfish next time.  Called ahead and all was ready in 20 minutes...and, you can't beat the prices:  a pound of shrimp, a pound of catfish, two orders of fries and a soda was done for less than $20.  Very plain interior so no place to dine in.  Solid!", "rating": "4", "date": [2014, 11, 16]}, "39": {"description": "The best things on the menu are the regular shrimp and the scallops, make sure to ask for the scallops to be cooked dry so they aren't soggy.  And you've got to go for the hot sauce...it's the perfect marriage.  Always call ahead, waiting there can take forever when it's busy.", "rating": "4", "date": [2012, 12, 5]}, "37": {"description": "Flame biz, real Chicagoans know whats up, negative reviews on here are from lames that just moved here. Goose Island & Hagens is the best fried shrimp & scallops in town.", "rating": "5", "date": [2013, 5, 22]}, "0": {"description": "Come here late at night and get some cheap fried food.People seem to love or hate the breading.  I for one like it, but it's THICK!Do yourself a favor and try the frog legs.  Delicious.", "rating": "4", "date": [2015, 11, 27]}, "38": {"description": "Um. No.Some people (who very much tickled my fancy) painted such vivid word pictures of stopping by Goose Island Shrimp House and bringing it home for dinner and of love and life and happiness... Well. I gushed! I had to stop there on my way to M's.I easily parked on the side of Division (for free!) and went into this hole in the wall place. I thought, \"Down the rabbit's hole and into wonderland!!!\" Freakin' exciting! Folks were leaning against the counter and the wall. There were two arcade games and no chairs. No tables. The counter was as tall as my shoulders. There were snap shots on the walls of [of what I assume to be] pron stars and family members. The floor was dirty.I ordered a pound of jumbo shrimp. The person after me got catfish. I asked him if it was good and he said that everyone he knows loves it. I added 3/4 pound of that to my order and asked him to throw in two Goose Island sauces ($1 each) for the heck of it.I stood around for long, long, long minutes. I texted M, \"I'm getting us dinner now. :-) get excited!\" I watched people order and pick up their food. I noticed that they all paid with cash. I wondered if it was a cash only place? I wouldn't put it past a hole in the wall joint to be a cash only place. Then again, there weren't any signs ANYWHERE that indicated such. Besides, cash only places usually have an ATM and this place only had those two arcade games. I walked to the opposite side of the room to see if I could possibly see the kitchen. I couldn't.Then they brought my order to the counter and I timidly started to hand over my debit card. Cash only. I asked where I could get cash. He said at the gas station over the bridge and to the left. Scrap that idea! I drove a half mile to a free ATM (free for me, at least) inside of K-Mart and then drove back. I paid $20.27. I got my food and brought it to M's.Up until this point, I believe that I would have given this place four or five stars if the food was nearly as amazing as what was described to me. But HECK NO. Both the shrimp and the catfish were both breaded and were indistinguishable from one another by a quick once over. The shrimp still had the shells on the ends and the catfish had bones in it. M called it a day after only a few bites but I wanted to power through.The breading was pretty thick and heavy. I think it might have been made with cornmeal. It had good flavor, but was too much. Eventually I started dissecting it by removing the breading to expose the shells and bones so that I could remove them before they poked my tongue and crunched in my teeth. M watched me sympathetically. She offered to make something else for me and tried her hardest to get me to give up on it.All I can say now is that those people who recommended Goose Island Shrimp House to me must have different tastes that me. I wonder if they knew that shells were on the shrimp or that bones were in the catfish? I haven't a clue, but I know it's not for me.", "rating": "1", "date": [2013, 4, 4]}, "51": {"description": "Hmmm, has their batter changed?  I hadn't been to Goose Island since college days in the mid-late 90's but always remembered it as delicious.  I went today and got a pound of jumbo shrimp.  I always remembered their batter as similar to a rich version of a beer batter - light and crispy on the outside and a little soft on the inside.  What I got today was much different and the only comparison I can think of is the outside of a hush puppy.  Much harder and thicker - similar to what you find on frozen fried fish that you would buy at the grocery store.  It was still a tasty shrimp but nowhere near as delicious as I remember and certainly not worth leaving the house to drive my pregnant, shrimp-craving self to pick some up.  The 3 star rating is due in part to my nostalgia for the place.", "rating": "3", "date": [2012, 5, 23]}, "27": {"description": "Probably worth it for the experience alone. Come here after a long night, park outside, get your shrimp in a bag, then sit in your car and eat it while watching all sorts of characters do the exact same thing you just did. The shrimp is interesting. No one is lying here when they say they're huge! And the tails are still on, but breaded so easy to accidentally ingest. The breading is really thick but not particularly flavorful. Clam strips are the same thing... but clam strips. Fries were good in the way that only fries stuffed in paper bag can be, but they really need salt. It seems like a lot of people like the hot sauce, but I just thought it was ok.", "rating": "3", "date": [2014, 7, 13]}, "32": {"description": "Fried shrimp. regular shrimp is perfect, they have jumbo too if you like it big. they have a bunch of other fried seafood but I have only gotten the shrimp (its their name after all...)i got 3 pounds and took it to a party and was mister popular. the sauces are all good, they have bottles of hot sauce for sale too, the guy at the counter suggested an awesome one. cash only. hole in the wall. take out only. call ahead. if you dont understand these things stay away and leave it for us who appreciate it.", "rating": "4", "date": [2013, 11, 10]}, "54": {"description": "These have to be the biggest Jumbo Shrimp I have ever seen or  ate! OMG! it is like eating a steak. I can only eat 2 of them. I have been stopping in at this place over the years when I am in Chicago and nothing has changed which is good but for newbies the experience could be good or bad. The atmosphere is get in and get out so call ahead. The place is not fancy but the Shrimp is good!. Now I am not a fan of their shrimp sauce because it is too tangy for me so I carry my own sauce with me if I want to tear right into the bag and start eating once I get in the car.", "rating": "4", "date": [2012, 4, 13]}, "48": {"description": "DELICIOUS, cheap seafood. I'd recommend to anyone. Call ahead, because it will take forever for your food.I love the clam strips.", "rating": "4", "date": [2012, 6, 23]}, "44": {"description": "Love the Shrimp. Best afterhours meal hands down", "rating": "4", "date": [2012, 10, 4]}, "24": {"description": "Love their scallops and their hot sauce. You can't beat them for what you get. Their freshness is the best on all they offer", "rating": "5", "date": [2014, 8, 31]}, "7": {"description": "My dad has been coming here since 1975 and they still taste like they used to after a long day of working in the factory. Huge shrimp in delicious hot sauce! If you're mad about the jk credit card thing, go to an atm!", "rating": "4", "date": [2015, 11, 25]}, "49": {"description": "EPIC WINI've been going here for years. This is a Chicago classic. Every time it's exactly the same delicious taste. Awesome fried fish. The fried oysters are my favorite.It's not super cheep or expensive, and it's to go only, so you stand around waiting for them to call out your order.. There is plenty of street parking right in front. This place just does it right. PeriodI'll be coming back for years to come. Thanks guys!", "rating": "5", "date": [2012, 6, 14]}, "40": {"description": "Food was ok. Nothing so good I'd go out if my way for and not so bad that I'd never go back again.", "rating": "3", "date": [2012, 11, 13]}, "53": {"description": "I wish it wasn't such pain in the a$$ to get to this place.  This small restaurant is located on division between 2 bridges and the traffic is almost unbearable.  Nevertheless, this is probably one of the best shrimp places I've ever had a pleasure to devour (trust me, I've been all over the world)I usually call ahead and order 1/2 to 3/4 lbs jumbo shrimp and 1/2 of catfish.  What makes it so good is the breading.  I don't know that the mixture is, but it's cripsy on the outside, and soft/moist/juicy on the inside.  I've never had a bad meal from this place, but only thing I've ordered are the shrimps and catfish.  I might order some fried oysters but after reading JT's review, it might not be a good idea.  Hot damn man, their hot sauce is pretty good too!  I was pretty skeptical about hot sauce at a seafood joint since every hot sauce I've tried around chicago has been..... straight up garbage.  In the end, this is probably my favorite place to get fried shrimp and catfish so far, I know few other places (lawrence fish market) I need to try but so far, this is it for me!  And parking ain't a problem either, it's in middle of industrial area so there are tons of free street parking.  But call ahead so you don't have to wait in line for too long.Peave out homie.Oh yeah.  CASH ONLY!  1 pinball machine and 1 arcade with pac-man and galaga installed.  You can play while you wait if you want to.", "rating": "5", "date": [2012, 4, 19]}, "30": {"description": "Goose Island is going to that spot either you mess with it or you don't.  Its really no grey area.  If you are a late night, food junkie that doesn't want to pay alot of money, Welcome to Goose Island.  Because their shrimp is great and they give you a lot for your money.  Its cash only but for 5-10 bucks (depending on the size of your order), you'll tons of great tasting shrimp in a paper bag and can be on your way.  If you are the type who doesnt like hole in the wall spots and wants breadsticks with your shrimp, pass on Goose Island.  As I said before the shrimp is great but place is a true hole in the wall.  Its Cash Only and no where to sit.   And its not an ATM near so keep that in mind when you stumble in there off a Friday night bender.  But if you just want good food, hit an ATM in route and go.", "rating": "4", "date": [2014, 3, 12]}, "46": {"description": "I order the jumbo shrimp, they are nice sized but i wish there was just a little less breading on them. i like their shrimp better than lawrences the scallops are the bomb! perfect size taste and breading love love love them. i only really like tater sauce didnt use the sauce they gave me", "rating": "4", "date": [2012, 8, 20]}, "1": {"description": "The best and biggest fried shrimp ever. I have gone here every Friday for lunch during Lent, and the shrimp are fresh and amazing. This is a carry out joint and it does not have an ambiance, just a counter where you order. I always order the jumbo shrimp with cocktail sauce. AMAZING.", "rating": "5", "date": [2016, 3, 5]}, "55": {"description": "I can't believe that Goose Island has gotten alot of good reviews!!! Let me start off by saying that 20 years ago this place was rocking. I have heard that 35 years ago that it was even better. I remember my mama taking me here in 1991,  I  was 10 years old. It was so soooo good. I recently went in their to get that taste of nostalgia...I would have better off going to Chuck-e-Cheese!!  Those were the worst shrimp I have ever had. It was a below average sized shrimp with a ton of tasteless breading to make it look Jumbo. Flavorless, Overcooked, and that tasted old as hell!!! They should be ashamed of what Goose Island has become!!!!!!! Damn Ashamed!!!", "rating": "1", "date": [2012, 4, 10]}, "9": {"description": "Literally the best seafood in Chicago. Way better than Lawrence's! I always get half pound of regular shrimp and two orders of clam strips with the hot sauce. Tastes super fresh. I've had a half order of jumbo shrimp and those things are huge. Some may say too big but I didn't mind it. You just need to be ready for how big these shrimps are or else you will be caught off guard lol. Cash only. No seating. Strictly coming for the food. And that's 100% fine with me.", "rating": "5", "date": [2015, 3, 19]}, "26": {"description": "G.I.S.H. is a unique Chicago experience, though not for the faint of heart. You gan get the regular shrimp or the JUMBO 6 count to the pound shrimp here. I know of no where  else that serves these jumbo monsters in the Chicago area. This is walk in; carry out only. No place to sit and eat. Parking on the street only. The place looks \"grungy\" but I have never heard anything about health problems with the food. The shrimp do tend to be \"over breaded\", and over cooked, for the most part, but the trick here is to ask for everything \"LIGHTLY BREADED\", and \"LIGHTLY FRIED\". You may have to wait a little longer, but it's worth it. I suggest bringing your own bottle of hot sauce or the like, and a salt shaker. I used to be able to take my bag of shrimp and walk up to \"LIFE'S TOO SHORT\" and eat them with a beer, but that place doesn't exist anymore. Another tragedy. So there it is. Follow my suggestions and you will have a great experience.", "rating": "4", "date": [2014, 7, 20]}, "25": {"description": "If you haven't had it, your missing out the best fried shrimp. So good the line speak for it's self", "rating": "5", "date": [2014, 7, 26]}, "12": {"description": "The food here is good. The service staff is rude and the wait time is high. Especially if you go at night when most people crave seafood anyway. If its late forget about it, just go to white castle. There will be long lines. There have been times I wanted it so bad that I waited and there have been times the wait wasn't worth it and I just drove away. I tried to call in my order to avoid the line and they refused the call in. So I will rate this ok because I love the food but I am not a fan of the service.", "rating": "3", "date": [2015, 5, 19]}, "59": {"description": "Two words: JUMBO SHRIMP!  I absolutely love this place.  Just grab your food and go.  Call ahead though because most of the time, they take forever.  It's not really a place you want to hang out at and wait for your food.  The Jumbo Shrimp is so good though.  i also tried the frog legs but they were nothing to write home about.  The canned pops are always ice cold too.  All you need is a half pound (or pound) of jumbo shrimp and a can of Root Beer.  :)", "rating": "5", "date": [2011, 11, 14]}, "21": {"description": "I feel like I am the only one that thinks it is just \"ok\". I was so excited because it is a staple in Chicago. The shrimp have a lot of breading on them. My partner liked the fish chips. I honestly think Shrimp Express in Cal City is so much more fresh and does not have all the batter.", "rating": "3", "date": [2014, 10, 17]}, "17": {"description": "All you need to know is after partying in the Clubs or a Bar, Goose Island is the Spot to Hit on the way Home. Never in my life have I tasted better Shrimp and yes that includes Lawrence's! The Clam strips are off the Hook as well and don't be shy to try their Frog Legs!! Seafood is more expensive regardless where you go so the prices shouldn't be a concern. You'll get Quality and Quantity! The Goose gets nothing less than 5 Stars!!", "rating": "5", "date": [2015, 3, 29]}, "10": {"description": "Not a fan, the shrimp are fried to hard & it scratches the inside of my mouth. I am a shrimp lover.", "rating": "2", "date": [2015, 8, 14]}, "5": {"description": "Been here once, the food compares to Captain B's in Cicero very much(possibly same owners)only exception is this place is a shit hole!", "rating": "3", "date": [2015, 6, 18]}, "3": {"description": "Love love their fries shrimp and fish chips.   Their seasonings are on point and the sauces to dip the seafood is super tasty", "rating": "5", "date": [2016, 2, 26]}, "35": {"description": "Exactly what you think it is: a hole in the wall, cash only, and deep friend goodness. Pretty simple menu, pretty simple food. Staff is nice, food comes out pretty quick - the call in business seemed to be booming, and there were a lot of regulars in there as well.Breading seems to be cornmeal and is laid on nice and thick. Everything is breaded (tails included), and everything goes well with the sauces they hand out. It isn't your normal Chicago fast food place - definitely worth a trip.", "rating": "4", "date": [2013, 10, 9]}, "19": {"description": "If you haven't had it, your missing out the best fried shrimp. So good the line speak for it's self", "rating": "5", "date": [2014, 7, 26]}, "28": {"description": "The best fry shrimp in Chicago,and at $9.00 a pound.I havebeen going to GOOSE for 40 years and Tony and the guys are the best.", "rating": "5", "date": [2014, 4, 23]}, "45": {"description": "Expensive and not very high quality. The counter people were very friendly, but way too much breading for my taste.", "rating": "2", "date": [2012, 9, 22]}, "33": {"description": "Either you get it or you dontThis is a cash only hole in the wall, evidenced by signs that say 'cash only' and have pictures of credit cards with a red X through them. This place defines hole in the wall and defines the neighborhood before it was gentrified.Dont pass on the fish chips.  They are the best thing there.  Although a lot of my friends like the shrimp. I order a pound bag for $5 and that is a LOT of food.", "rating": "5", "date": [2013, 10, 24]}, "43": {"description": "Was walking home on Division from Ashland and the only enticing eaterie that popped up on Yelp was this place. The only storefront as far as the eye could see, 9pm, in the middle of a dark street.. probably not a great place for a girl to go alone... but everyone (staff & patrons) was so nice!Got the catfish and fries.. excuse me it was only $4? I only got the 1/2 lb catfish but it was like 5 huge pieces. Catfish itself tasted pretty fresh and was yummy enough, but the breading was kinda flavorless and a bit too thick, and there were a couple pieces with lots of bones. I got the hot sauce which helped but wasn't a huge fan of that either. Fries could use seasoning.It was certainly not the greatest food but for the price and the hours it's open, can't be beat.", "rating": "3", "date": [2012, 10, 5]}, "2": {"description": "This place might not look like much but in this case looks are definitely deceiving. All in all everything I've ever ordered is always fresh and delicious. As a matter of fact they have the best damn frog legs this side of the Mississippi. I didmt like their hot sauce but other than that this place rocks. Guys behind the counter are good with the customers, get the order right, and get you out as quick as they can. I also have to say the quality of food for the price is amazing. There's no skimping here. Don't really care if its a cash only place. Maybe if you have to use your credit card you really can't afford it anyways. Bon Appetit", "rating": "5", "date": [2016, 2, 6]}, "18": {"description": "This place has been around forever!I remember my aunt and uncles would always talk about coming here after being out partying on weekends. I remember being a teenager eating the leftover shrimp they could not eat and I enjoyed the hell out of it.I decided to stop by recently for nostalgia sake. I ordered 1/2lbs of jumbo shrimp. I always enjoy checking out old establishments that have signed pics of local and world celebrities. Shaq, Lisa Raye, local news reporters and countless others have donated their John Hancocks to the wall of fame here. My food didn't take very long to come out and I hopped in my car and drove home. I was excited to try the shrimp I hadn't eaten in almost 20 years. Once home I ripped the damn bag open and saw my big ass shrimp which caused the hunger to rise. There was too much breading on the shrimp which made it difficult to eat and it definitely affected the taste in a major way. Not as good as I remember it. The hot sauce definitely added flavor to the overly breaded shrimp and would probably be good on anything fried.People behind the counter are really cool. Parking here should be easy as there is street parking in front. The place is virtually in the middle of nowhere with nothing else to eat until you drive about a mile west on Division. I would definitely try the place again, but I prefer Lawrence Fisheries shrimp.", "rating": "3", "date": [2013, 10, 13]}, "41": {"description": "I used to frequent this place years ago, I stopped going there when I discovered Lawrence Fisheries.  Way better.", "rating": "1", "date": [2012, 11, 3]}, "52": {"description": "The shrimp is the  star of this place  HUGE  tasty and filling .I love the ocean scallops personally which also are huge and wonderful and full of flavor .While i am not a fan of their sauce everything else I have ever purchased from this establishment seems to please my palate and doesn't kil my wallet and that important in my book .There is one problem parking and  navigating  the area but is definitely worth it once you get there .", "rating": "3", "date": [2012, 5, 16]}, "50": {"description": "I pass the shrimp house 5 days a week and today was my first visit. I of course yelped ahead and read some reviews. Here's the nitty gritty: - CASH ONLY - take out only - call ahead (it gets busy in there) - decent prices - huge jumpo shrimp and great oysters!I called ahead to pick up my order in time for my boyfriends lunch break. The man who answered was very polite and friendly, which is unusual for phone orders, so I had a good vibe already! Everything was ready when I got there and I paid $23 for a pound of huge, delicious fried shrimp, a half pound of oysters, fries, 2 cans of pop, lemon juice, hot sauce, and their signature sauce. I have always gone to Lawrences on Lawrence, but now I think I found a more convenient, affordable and tasty new shrimp house!", "rating": "5", "date": [2012, 5, 23]}, "4": {"description": "Another company that can't move Into the 21st-century cash only??? what a joke Oh I forgot to mention no firearms allowed on premises for all you Pro gunners  So as far as the food is concerned I can't even comment on that", "rating": "1", "date": [2015, 8, 6]}, "6": {"description": "Haven't been in a while, but it should be on your late night list. It's a hole in the wall, so have an open mind. If you don't appreciate such places, then don't go. If you do, don't have a dang attitude. Focus on the food, not the décor.", "rating": "4", "date": [2015, 10, 11]}, "22": {"description": "I went here today i must say the jumbo shrimps are good but the have to much breading.also i tried the froglegs,in fish chips it all taste the same.", "rating": "3", "date": [2014, 9, 9]}, "15": {"description": "Goose Island is going to that spot either you mess with it or you don't.  Its really no grey area.  If you are a late night, food junkie that doesn't want to pay alot of money, Welcome to Goose Island.  Because their shrimp is great and they give you a lot for your money.  Its cash only but for 5-10 bucks (depending on the size of your order), you'll tons of great tasting shrimp in a paper bag and can be on your way.  If you are the type who doesnt like hole in the wall spots and wants breadsticks with your shrimp, pass on Goose Island.  As I said before the shrimp is great but place is a true hole in the wall.  Its Cash Only and no where to sit.   And its not an ATM near so keep that in mind when you stumble in there off a Friday night bender.  But if you just want good food, hit an ATM in route and go.", "rating": "4", "date": [2014, 3, 12]}, "57": {"description": "The Jumbo Shrimp is the bizness!!! I loved the food. Where else in Chicago can you still get a can of pop for 65 cents? At least around the Northside? They were friendly and the food was hot and delish! Definitely will be going back! I have read some reviews on here about the place being \"ghetto\" All in all it is a shrimp and fish shack!!! This is not some 5 star restaurant, it is the same type of shrimp and fish shack you would encounter in the deep south like in New Orleans or Houston (I know because I have been). So relax, get your food and STFU!!!!", "rating": "4", "date": [2012, 3, 5]}, "20": {"description": "I have been coming here since I was a child and it had always tasted the same and been fresh and delicious! The shrimp and scallops are my fav's! Oh and it's cash only!", "rating": "5", "date": [2014, 10, 31]}, "36": {"description": "Delish.  Love the Smelts with a little hot sauce mixed with the Cocktail sauce.If your looking for fine dining or a healthy salad, this is not the place. If your looking for a whole in the wall to pick up delicious fried Jumbo Shrimp or Smelts, this is the place.As others described, it's best to call the friendly staff to place your order ahead of time..", "rating": "5", "date": [2013, 6, 7]}, "14": {"description": "Goose Island Shrimp House Chicago, has been in the same location for well over two decades.  They have celebrity pictures on the wall.I've eaten at this restaurant for many, many years.  I usually buy the jumbo shrimp.  They are HUGE, and not over seasoned with salt, or breading.  The shrimp are de-vained and clean.  Prices are reasonable.  This is NOT a sit down fancy restaurant.  This restaurant is well worth the drive if you're craving big fresh jumbo shrimp.  The customer service is not so great, but the food is delicious!!!", "rating": "5", "date": [2015, 8, 17]}}, "neighborhoods": ["Goose Island"], "latitude": 41.90327, "longitude": -87.65301, "rating": "3.5", "times": {"Mon": [], "Thu": ["11:00 am", "4:00 am"], "Sat": ["11:00 am", "5:00 am"], "Wed": ["11:00 am", "4:00 am"], "Tue": ["11:00 am", "4:00 am"], "Sun": [], "Fri": ["10:00 am", "5:00 am"]}, "price": "$", "categories": [["Seafood", "seafood"], ["Fast Food", "hotdogs"]], "address": ["1013 W Division St"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Good For": "Late Night", "Attire": "Casual", "Wheelchair Accessible": "No", "Ambience": "Divey", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "No", "Drive-Thru": "No", "Good for Kids": "No"}, "category": "Restaurants", "number_of_reviews": "116"}, "j-and-s-photo-service-chicago": {"comments": {"3": {"description": "Wow.  After rushing around in traffic and getting stuck in construction, they understood where I was coming from and waited 15 minutes after closing in order for me to grab headshots needed that day.  When Joe found out I had an audition 45 minutes later, he said this was just like the scene in Magnolia (he was shocked I hadn't seen it, but I can't do everything right) and yelled, \"Nail it!\" as I left.  Yep.  Actors in Chicago are right.  This place is the best of the best.", "rating": "5", "date": [2015, 10, 29]}, "1": {"description": "Great people doing great work!", "rating": "5", "date": [2016, 2, 13]}, "2": {"description": "LOVE this place! I go here all the time for my headshots. The guy here is awesome and helps me out a lot! I recommend this place if you need pictures or headshots printed out. Prices are really good and they get the job done right and quickly! THUMBS UP!", "rating": "5", "date": [2016, 3, 5]}, "9": {"description": "Headshots", "rating": "4", "date": [2013, 1, 14]}, "10": {"description": "Excellent customer service, affordable and easy in and out with parking. We have been customer for 5yrs and always treated as well as day one. Thanks, Jay!", "rating": "4", "date": [2012, 6, 23]}, "4": {"description": "Love this place. I've had four rolls of 35mm film processed here and the results were far beyond anything I could've expected from my unskilled hands and it's 100% due to their work. I will continue to have my film processed here for as long as I'm in Chicago. Their prices are great but in the end, if you're an occasional film photographer, then it's the end product that really matters and these guys transcend any other place I've been. Just a note. They do take credit card but they'd prefer you to use cash if your order is under $10.", "rating": "5", "date": [2014, 10, 20]}, "6": {"description": "I called in for a last minute job on a Saturday, and they accommodated me with ease and professionalism.  I was able to email my image to them, and they completed a small number of prints within an hour or so. They made sure to get my approval of the print before printing as well. When I arrived before closing, my order was ready, and the owner was friendly. Their entrance is in the back, where the parking is. Their prices are listed on their website as well, and they're fairly reasonable for the quality. I was very pleased with my experience.", "rating": "5", "date": [2012, 9, 15]}, "12": {"description": "I am a freelance makeup artist in the city. I moved back to Chicago a few months ago and needed some portfolio (9X12) prints done to update my book. I looked for reviews and came across J&S Photo and people were raving about Jerry and Sharon so I thought I would give the business a try. Now I am the one raving about J&S Photo!! I wish I had work to drop off here everyday just so I can see these amazing people. The service is excellent and the quality of the prints are great. The turnaround is so quick and the prices are very competitive. After only one visit they remembered me which is rare in customer service. I have been back 3 times and will continue to take any photo work to them! Jerry and Sharon you are appreciated. Thank You.", "rating": "5", "date": [2011, 1, 5]}, "5": {"description": "Gorgeous, durable paper. They put my name on a landscape head shot, and it looks professional and sleek. Quick turnaround--less than a day for 25 prints with no retouching. Will order again!", "rating": "5", "date": [2014, 5, 21]}, "11": {"description": "I've used J & S several times over the past few years for headshots and have always had a good experience.  They are remarkably nice, extremely easy to work with, and the quality is excellent.  I don't recall if I've used their rushed services, but their regular service seems quite fast to me.  I will use them again.", "rating": "5", "date": [2012, 10, 20]}, "8": {"description": "Fast.  Professional.  Competitively priced.J&S printed my newest color headshots and they turned out beautifully.  The paper and color quality was wonderful and they were ready in three days.  I will definitely go back for all my headshot reprints.", "rating": "5", "date": [2010, 1, 14]}, "0": {"description": "If I could give these guys 100 stars, I would.Friendly, willing to help, fast, and skilled. Grateful I met them! Best photo developing in Chicago!", "rating": "5", "date": [2015, 12, 22]}, "7": {"description": "Love these guys. They've printed two rounds of my headshots now and I'm going to be sending them portfolio prints very soon. Couldn't be nicer.", "rating": "5", "date": [2013, 5, 18]}}, "neighborhoods": ["Goose Island"], "latitude": 41.9000232, "longitude": -87.648101, "rating": "5.0", "times": {"Mon": ["8:30 am", "5:30 pm"], "Thu": ["8:30 am", "5:30 pm"], "Sat": ["10:00 am", "2:00 pm"], "Wed": ["8:30 am", "5:30 pm"], "Tue": ["8:30 am", "5:30 pm"], "Sun": [], "Fri": ["8:30 am", "5:30 pm"]}, "price": "$$", "categories": [["Photography Stores & Services", "photographystores"]], "address": ["1000 N Halsted St", "Ste 103"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "13"}, "restaurant-depot-chicago": {"comments": {"1": {"description": "I don't own a restaurant, but my friend does and so I jumped at the chance to run an errand for him to see what goes down on the inside. Well, imagine a food-only Costco with massive steel dollies and about anything your little culinary heart could desire. It's like a wonderland of what you need to get your restaurant up and running for the day. You do have to pay for the stuff, but it's wholesale pricing since you buy in extreme bulk. I haven't been to any other stores like this, but I will say it's laid out in an idiot proof fashion and although the lines get extremely long at check out, they work magic to keep 'em moving in an orderly fashion. Not sure what the membership dues are, but if you can grab a friends card and need to purchase a jar of pickles the size the Bean Restaurant Depot is where it's at.", "rating": "5", "date": [2015, 7, 17]}, "9": {"description": "I hate this place. The management is horrible and treat their staff poorly. It is it organized very well and ownership does not really invest into the store. Indiana there isn't one thing I hate about my job more than the requirement that I come here twice per week", "rating": "1", "date": [2013, 11, 8]}, "23": {"description": "As a restaurant owner, we shop there twice weekly for produce, etc., and you can't beat the freshness.  I love going into the super size refrigerated rooms in the summer for fresh vegies  and it's a great place for meat and poultry.   Of course, you need a food and/or liquor business license to even go thru the door, but it basically has every supply you would ever need for the food industry.  The check out lines can be long and tedious and it never ceases to amaze me how surly those check-out girls can be.  There are new ones all the time...I guess it's hard to find good help in the area.  And, oh yeah, they need a better staff in small wares.", "rating": "4", "date": [2007, 6, 17]}, "12": {"description": "love this place for the selection and prices!", "rating": "4", "date": [2013, 11, 16]}, "21": {"description": "this place is AMAZING!  Went here for the first time yesterday.  Luckily, we were with a regular shopper who was able to show us around.  I could have spent all day in here, really.  Where else can you buy a 150lb wheel of cheese or an ENTIRE frozen lamb?? yeahWish they had a little more variety in the bulk molasses and liquid smoke.  The liquid smoke I picked out, \"Castella Hickory Smoke,\" around $5 for a gallon, turned out to be absolutely DISGUSTING!  Anything you'll ever need for your restaurant/bar is here.  Went at 5pm on a Wednesday, the place was pretty empty and NO LINES!", "rating": "4", "date": [2009, 5, 22]}, "16": {"description": "Beware of people in a hurry with big carts.I could spend hours in here just wandering around and thinking about things to do with a 50 lb bag of chili peppers and a vat of mustard.  Now so will you.I found a big box of Andouille that was cheap-o and not half bad.Other words of advice:  -don't go on a holiday weekend -keep your food geekery in check and don't gawk (yes, that is a WHOLE goat) -don't block the aislesGet yourself an industry hook-up and go!", "rating": "4", "date": [2009, 10, 1]}, "17": {"description": "Until I got my membership to this place, I thought Costco was the King of the super size.  not even close.Want a 25 lb. solid block of chocolate?  Sure... milk or dark?  Want a box of assorted plastic flatware...1500 pieces?  Sure...white or black?  Medium or heavy weight?  The list goes on.  It's membership for people in the industry only, but tag along with a friend.  That 25 lb block of chocolate is gonna be my gag gift for a few this coming holiday season.  :-)", "rating": "4", "date": [2009, 10, 21]}, "10": {"description": "This place is great for business owners.  An amazing selection of everything.  When we went here, they had a bunch of samples right when you walked in.  Give yourself a lot of time your first time here..... you'll need it!  Also, grab some ice packs for your cold goods on the way out, a lifesaver when it hits 100 degrees!", "rating": "5", "date": [2012, 6, 20]}, "5": {"description": "I love it here, I love it here, oh yes I do, I love it here.  Not really anything else much to say at the moment.  It's heaven for me.  I also appreciate how NICE they are to me all the time.  Because they are.", "rating": "5", "date": [2014, 10, 13]}, "11": {"description": "Looking to snag yourself a sexy Chicago chef??  Then come here on a weekday around noon-ish, when this place is full of local chefs buying everything from #5 containers of mascarpone, whole fish, live lobsters, and ginormous rolls of plastic wrap.  Their prices are very good.  $2.50 for a quart of cream!   A pint at the grocery store costs more than that.  The store is huge and you will get lost.  So ask the nearest hunky chef to help you out and be sure to get the name of the restaurant he works at.", "rating": "4", "date": [2009, 2, 8]}, "22": {"description": "Looking to snag yourself a sexy Chicago chef??  Then come here on a weekday around noon-ish, when this place is full of local chefs buying everything from #5 containers of mascarpone, whole fish, live lobsters, and ginormous rolls of plastic wrap.  Their prices are very good.  $2.50 for a quart of cream!   A pint at the grocery store costs more than that.  The store is huge and you will get lost.  So ask the nearest hunky chef to help you out and be sure to get the name of the restaurant he works at.", "rating": "4", "date": [2009, 2, 8]}, "0": {"description": "If you work in the restaurant industry in the Chicago area, then it's likely that you'll have hit up Restaurant Depot AKA Jetro. This is a true warehouse that offers fresh, frozen, meats, fruits, veggies, beverages, containers, etc. - all in bulk.This is not Costco, so don't come looking for a TV or a mattress. If you're a serious restauranteur, then this is where anybody that works the kitchen goes. Need a 100 lb bag of rice? Check. How about a box of 9,000 napkins? Good. How about an entire box of chicken breast? OK, let's roll.If you're still on board with all this, some words of advice... pull the cart. Don't push it.", "rating": "5", "date": [2015, 11, 5]}, "20": {"description": "Dude. It's like the Disneyland of all things wholesale food and booze... A complete redefining of the happiest place on Earth. Fabulously expansive, ridiculously cheap, amazingly stocked. Love, Love, Love. I could spend hours here.... and I have!! Where else can you seek out a 70lb wheel of Grana Padano calling your name (loudly) at a mere $4.00 p/lb, an actual block of Plugra European butter for just a buck, a whole box of Andouille sausage for $7... the list goes on. They have fresh produce up the ying yang, an array of proteins, utensils, breads, pastries, catering mumbo jumbo, beer, liquor, condiments, canned goods, super high end frozen seafood, Eli's cheesecakes, drums of hot sauce, chocolate sauce, weak sauce - kidding - and all of the above at an absolute fraction of the price of it's closest competitor, Costco. So why just 4 stars? Because it's a private wholesale establishment accessible to restaurant owners and caterers ONLY. If you don't have the special 'get into the depot' provided card, then you ain't gettin' in Sucka! I'm not lucky enough to have said card, but fortunately, I have a great friend that does and hooks me up on occasion generously. Do yourself a favor and find a friend like this STAT!!! If you do get in, take note: people here will literally run you over and not think twice - they're looking to get in, get out, and get back to their restaurant with their newly acquired awesome goods. While you may be all wide-eyed and bushy-tailed at the splendor that is the depot, the regulars don't take kindly to rubberneckers. Look the part... Walk fast, stay to your side of an aisle and stock up on the Boucheron Goat Cheese sitting behind you for pennies on the dollar.", "rating": "4", "date": [2009, 5, 27]}, "19": {"description": "this place is AMAZING!  Went here for the first time yesterday.  Luckily, we were with a regular shopper who was able to show us around.  I could have spent all day in here, really.  Where else can you buy a 150lb wheel of cheese or an ENTIRE frozen lamb?? yeahWish they had a little more variety in the bulk molasses and liquid smoke.  The liquid smoke I picked out, \"Castella Hickory Smoke,\" around $5 for a gallon, turned out to be absolutely DISGUSTING!  Anything you'll ever need for your restaurant/bar is here.  Went at 5pm on a Wednesday, the place was pretty empty and NO LINES!", "rating": "4", "date": [2009, 5, 22]}, "2": {"description": "When I was 3, my cousin Jutta came to visit from East Germany. She applied for a tourist visa with her husband but they refused to let him travel with her because they feared they wouldn't return.The Berlin Wall was still up in 1988 and times were tough. If you complained about meat being overcooked, my grandpa, who fought in WWII would say, \"It's tougher where there isn't any!\" Well, as a satellite state of the Soviet Union, there really wasn't jack shit in the GDR. They were supposedly a Demokratische Republik but communism had them in an iron curtain chokehold.It was abundantly apparent how cut off they were from the rest of the civilized world if you took a tour of their grocery stores. Shortages of what we'd consider easily accessible goods were the norm and there was little to no variety because of the government's refusal to import. After standing in long lines, you pretty much had to take what you could get, and that was assuming there was anything left to be given.While my cousin was in town, my aunt showed her around. A regular grocery store wasn't on the list of American attractions to familiarize her with, but it's one place they happened to stop and she wept when she saw all the choices. My mom joked it was a good thing she hadn't taken her to Byerly's because she probably would have completely lost it in an upscale supermarket that boasts live lobsters and carpeted floors.I'm here to say that it's a far better thing we didn't have an \"in\" with Restaurant Depot / Jetro Cash & Carry at the time because Jutta most definitely would have had a \"Moscow on the Hudson\" style breakdown of epic proportions (myspace.com/youremembert…).Granted, there might not be as many brands as you'd find in conventional shops, but just about everything is sold in bulk and the place is packed with row after row of top to bottom shelving stocked with candies, canned goods, whole animals, jugs of cooking oils and spices, giant containers of condiments, and perhaps the epitome of capitalism, Coca-Cola by the case. This is pretty much where savvy restaurateurs in the Chicagoland area come to get almost all of their cooking needs met.This is a giant wholesale warehouse and you can only get in if you're associated with the restaurant/catering/foodservice industry and have their membership card. It's meant to be a place away from the public eye where owners and employees can come to purchase items they use in their places of business.  It puts Sam's Club and Costco to shame in the food department. Tell me where else you can get a dressed lamb for $80 or a laundry hamper sized bag of green peppers for a couple bucks. My most memorable purchase was a 10lb slab of beef Ribeye for about $40.By no stretch of the imagination is this store pretty, but it is practical. Items are relatively easy to locate, but the checkout line can be a hassle. The cashiers ring everything up and often times there's some type of pricing error that needs to be fixed and/or they make you wait for a security person to count out the items individually. The time it takes is annoying mostly because many of the products are perishable and waiting around in line doesn't do them any good. Luckily they have pretty good business hours of operation, so you can sometimes plan to do your shopping during quieter times.", "rating": "4", "date": [2013, 9, 9]}, "18": {"description": "Might be a great place for cheap pricing, but if you are a current customer I suggest you check you bank account .. the company data records were hacked last month and RD is now just sending out letters informing customers that their personal bank accounts may have been compromised.  kmov.com/news/just-poste…restaurantdepot.com/Cust…", "rating": "1", "date": [2011, 12, 10]}, "13": {"description": "Two lies I have told myself: A) I loathe exclusivity. Actually, I like it when it includes me. B) I dislike mega-stores-they raise my blood pressure. Restaurant Depot makes me a liar on both counts. It is restricted to those in the food business, but every visit is for me a trip to Disneyland. This place is SO huge, it's Costco on steroids. And of course, it has BIG portions of just about everything (but you can still buy a small can of beans, too.) You have to take a large trailer type thing if you are going to buy more than you can carry. There are no mini-carts because many customers are buying for hundreds and shopping for a restaurant week. There are wheels of cheese so large I could use them as spare tires for my Scion. And the biggest jars of pickles and olives you have ever seen.  The inner square of the place is surrounded with 30' sheets of thick plastic curtain, because it is one humungous refrigerator room that you can walk around in. Like you're an ant and you wandered into your own fridge. Very freaky!Needless to say, the prices are great. Some items are 25% of what you might pay in a grocery store. Some are not, But it almost makes it worth jumping through all the hoops you need to to become a caterer or a small food biz, so you can take little day trips to this culinary Disneyland. They allow you to bring friends and family, and they are friendlier and more helpful than Mickey and Goofy and Snow White combined.I take back everything negative thing I've said about big box stores. I LOVE this place!!!  And having that special card which lets me in.", "rating": "5", "date": [2010, 3, 22]}, "4": {"description": "I walk by the front of this place twice a day in the amount of garbage in front of their parking lot disgusts me. Take care of your property. The inside is also messy and unorganized", "rating": "1", "date": [2015, 7, 23]}, "24": {"description": "A warehouse store that does require a membership, this location specializes in foods for restaurants and stores. We've come here with my husband's card from work and gotten some deals on pop, meat (froze a ton) and syrup for making Lattes. Fun to shop once, if you can get in.", "rating": "4", "date": [2005, 7, 14]}, "6": {"description": "Thank the Lord for RD. It's not often in life (at least, it's not for me) that one has need of 50000 gallons of lemonade, 34956078 plates, 338 lbs of popcorn, numerous assorted other items, and more napkins than you can shake a stick (or a forest; oh, the irony) at. But, I found myself there. And, I was near to lose my mind. Seriously.Since I had not yet met Panda to represent for me (I am in love; youtube.com/watch?v=X21m…), I had the next best thing: a friend with a membership, room in his car and time to spare. If you come here, come ready. Come ready to work out (the carts are big, the produce is big and the bulk is heavy), come ready to deal with temps (large amount of cold and frozen goods = wear covered shoes and long sleeves), come with a purpose (this place is too big and too packed with people to dawdle; stay focused and committed to your mission), and come with good credit (even though everything is priced at cost, when you're buying q959w34rt number of items, you need a lot of cash or, in the alternative, a freakum dress and hooker heels).All in a days work, people. Let's keep it moving.", "rating": "5", "date": [2010, 9, 27]}, "15": {"description": "Dude. It's like the Disneyland of all things wholesale food and booze... A complete redefining of the happiest place on Earth. Fabulously expansive, ridiculously cheap, amazingly stocked. Love, Love, Love. I could spend hours here.... and I have!! Where else can you seek out a 70lb wheel of Grana Padano calling your name (loudly) at a mere $4.00 p/lb, an actual block of Plugra European butter for just a buck, a whole box of Andouille sausage for $7... the list goes on. They have fresh produce up the ying yang, an array of proteins, utensils, breads, pastries, catering mumbo jumbo, beer, liquor, condiments, canned goods, super high end frozen seafood, Eli's cheesecakes, drums of hot sauce, chocolate sauce, weak sauce - kidding - and all of the above at an absolute fraction of the price of it's closest competitor, Costco. So why just 4 stars? Because it's a private wholesale establishment accessible to restaurant owners and caterers ONLY. If you don't have the special 'get into the depot' provided card, then you ain't gettin' in Sucka! I'm not lucky enough to have said card, but fortunately, I have a great friend that does and hooks me up on occasion generously. Do yourself a favor and find a friend like this STAT!!! If you do get in, take note: people here will literally run you over and not think twice - they're looking to get in, get out, and get back to their restaurant with their newly acquired awesome goods. While you may be all wide-eyed and bushy-tailed at the splendor that is the depot, the regulars don't take kindly to rubberneckers. Look the part... Walk fast, stay to your side of an aisle and stock up on the Boucheron Goat Cheese sitting behind you for pennies on the dollar.", "rating": "4", "date": [2009, 5, 27]}, "7": {"description": "If you own a restaurant or nightclub, Restaurant Depot has the same euphoria as that Costco has to their members.Upon entering, you will need to swipe your membership card, then you can proceed to shop.  This warehouse has it all.... liquor, meats, canned foods, fresh vegetables, flowers, and any type of cooking wares you may need or want.The warehouse is very well thought out and planned.  The aisles are wide.  The prices seem to be very reasonable for the quantity that you may be required to purchase.  The carts are a little hard to maneuver but manageable.It's a cool place to go to if you have a chance.", "rating": "4", "date": [2012, 5, 30]}, "8": {"description": "The pacific romaine lettuce ( pink package) is disgusting. The packages are full with flies, and I mean not small fruit flies. Large disgusting flies! Does someone have to get seriously sick before they discontinue selling it? These flies cary parasites and some of them were still alive when I opened the package. Its unbelievable! Do NOT ever buy lettuce from there is my advice!", "rating": "1", "date": [2014, 11, 7]}, "3": {"description": "Is it possible to fall madly in love with a store??  It has to be, I'm in love with Restaurant Depot.  My main squeeze WAS Costco, but sadly, Costco and I may have to cool it because I can feel that I will be spending more and more time with my new main squeeze Restaurant Depot.I was literally dizzy when I went in here, so much to see, so much I wanted - all in one location.  Baking supplies, baking ingredients, tons of cheeses, frozen products section to die for, candy in bulk (not just typical stuff, but some candy I didn't even know they sold in bulk - anywhere)!  Great selection of containers (which come in handy during the holidays - family can take leftovers home in \"to-go\" containers, not my Tupperware.I loved that although most stuff is sold in large bulk - there were many items that could be purchased individually... like the loaf of Gonnella bread, and the bottle of Chili Lime Cholula.  But for other stuff that is sold in large quantities - it's a great opportunity to pitch in with family an share the bounty.I am lucky that I know someone with a membership - so I can tag along while they get their stuff...this place is the BOMB!", "rating": "5", "date": [2013, 11, 3]}, "14": {"description": "I have a love/hate relationship with Depot.  I love it when I want to go there and look for lots of awesome stuff to make my life easier or to help a friend or to assist a client in all their event planning needs.  I hate it when I have to go there because someone forgot to order one or two of the things that are essential to operating a kitchen or executing an event.Open to the trade only, it is the Mecca of the small business owner/restauranteur/caterer.  Prices often less than the big bully on the playground Sysco and frequent sales that make me wish I had a freezer the size of a football field.  Need disposable tongs? A chafing dish? 5 to 1 Vienna beef hot dogs? A goat? BSBs (that's boneless, skinless breasts of chicken to you folks)  Yeah this is the place.  50 pounds of onions, carrots or Japanese Panko?  Yep, its here.In a hurry? Don't bother, as it can be a time consuming process. One should always remember to wear appropriate jacket if you plan on spending any amount of time in the refrigerated section and you have breasts.  Just saying, although for some reason, the guys are extremely helpful when I forget.   Bring cash, and make sure everything has a bar code otherwise you will be shocked by the cashier screaming \"I NEED A NUMBER!\"", "rating": "5", "date": [2009, 10, 11]}}, "neighborhoods": ["Goose Island"], "latitude": 41.90488, "longitude": -87.654283, "rating": "4.0", "times": {"Mon": ["7:00 am", "6:00 pm"], "Thu": ["7:00 am", "7:00 pm"], "Sat": ["9:00 am", "5:00 pm"], "Wed": ["7:00 am", "6:00 pm"], "Tue": ["7:00 am", "6:00 pm"], "Sun": ["9:00 am", "3:00 pm"], "Fri": ["6:00 am", "6:00 pm"]}, "price": "$$", "categories": [["Wholesale Stores", "wholesale_stores"]], "address": ["1030 W Division St"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "25"}, "office-concepts-chicago": {"comments": {"1": {"description": "We had a terrible experience with Office Concepts.  When our Steelcase furniture finally arrived, the crew that was dispatched to assemble it had no idea how to do it.  What was supposed to be a book case with lockable compartments turned into a monstrosity with left-over pieces that they had no idea how to assemble.  The workers were gruff and ignorant.  They didn't put down any coverings on the floor or furniture and put their dirty tools all over the brand new upholstery.  The Office Concepts rep had to come with an office administrator and clean up the mess the next day.  The counter they were supposed to install was ordered incorrectly twice and had to be redone.  The whole process took months from start to finish.  Steelcase was not responsive either when we made them aware of the situation.  I've learned my lesson.  Check out other options -- even CB2 and Ikea -- before going the Steelcase / Office Concepts route.  NOT WORTH IT!  VERY DISAPPOINTING!", "rating": "1", "date": [2013, 9, 28]}, "0": {"description": "I had a very positive experience with Office Concepts. Office Concepts' showroom / main office is straight out of a Streelcase brochure, modern and professional. Greg Fordon, the account executive (i.e. salesman) I worked with was extremely helpful. I never felt like he was \"selling\", he listened to me and gathered several chairs for me to compare without too much gabbing. As a professional economist, what is most important to me is making good use of my time and money. After selecting the Steelcase Gesture chair, I contacted several other dealers asking for quotes for a specific set of specifications. OfficeDesigns in Northbrook, where I had purchased a $1,500 Knoll Life chair a few years ago quoted me their \"best price\" of almost $500 more than Office Concepts. Everyone else's price was significantly more than Office Concepts'.The customer service I received after making my order was exemplary. Greg replied to most of my emails within minutes and when we ran into an issue with Fedex's delivery, he offered to have to chair immediately picked up from the Fedex center and delivered to me ahead of the Fedex truck. Since my chair was delivered fully assembled, I cannot comment on Office Concepts' assembly crew. What I can say is that their selection, prices, and customer service exceeded my expectations.", "rating": "5", "date": [2014, 4, 22]}}, "latitude": 41.9024097, "neighborhoods": ["Goose Island"], "categories": [["Office Equipment", "officeequipment"], ["Interior Design", "interiordesign"]], "address": ["1142 N North Branch"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.6547587, "category": "Shopping", "rating": "3.0", "price": "$$", "number_of_reviews": "2"}, "flaming-wok-n-grill-chicago-2": {"comments": {"58": {"description": "This is actually Pakistani-Indian food (I thought it was going to be Chinese or something).I stopped here on my way home from Weed Street; it is phenomenal late-night eating, as attested by the seven or eight cabs parked in front of it.My girlfriend and I had the \"frontier chicken,\" which was fresh and delicious, with a very satisfying burn. Throw in some lamb rice and a spinach/potato curry, and a medium-sized meal for two people was only $10 (we bartered down from $12).Service was fast and courteous, and the place was very clean. They're not trying to create much of an ambiance, but it has a very authentic exotic feel to it. Everyone was super friendly, even if they didn't speak English very well. Definitely one of my new favorite places to eat late at night.", "rating": "4", "date": [2010, 7, 16]}, "56": {"description": "I joined Yelp to write a review about this place.  This place is as wonderfully close to the Subcontinental tradition of the \"Dhaba\" as I have ever seen--small roadside restaurants in farm country where the food is so fresh you can smell the earthiness. Granted, in Chicago, you can't get it that fresh, except for the bread, that is FRESH.  When you sit down to eat, they start making the dough to make the bread that they're about to serve you.  The naans are extraordinary, people in India would be jealous.  And when had with their chef's special frontier chicken, it is as if they simply took happiness and mixed it in with your food.The rest of the food can be hit or miss.  But this place is CHEAP; if you don't like something, just get another dish.  Don't expect much service, lest you have any shame for having the owner's small sons set your table for you when they're helping out at the place.  Very likely, you'll be grabbing your own plates and utensils and  setting your own table.  But after paying some ridiculously small amount of money for feasting like royalty, you'll find a warm, fuzzy feeling also deposited in your stomach.", "rating": "5", "date": [2010, 10, 26]}, "29": {"description": "This place absolutely satisfied my craving for really well-spiced and fresh chicken tikka with that perfect blend of spiciness and not too thick or watered down raita. They give two whole chicken legs, which is rare to be seen..most places will give only one leg that skimps out on the meat, and it's also served with fresh naan and the raita mentioned above and a side of salad. All that for only 10 bucks. It's neat how they have a different menu each day with some of the more popular items available everyday. I've been there twice and saw chicken biryani and the tikka available but saw different items I could order each time. They have specials for each day as well. The second time I went, I took my friend along with me. He loves to munch down on food even though he may not have the most eclectic appetite. Quantity is always an issue for him, however I can say that Flaming Wok 'n Grill surely filled him up. We took two appetizers -- two samosas and an order of pakora, and for the main course we had two naans with one order of chicken tikka and one order of chicken biryani (it was a little dry) but delicious nonetheless, and of course it came with raita and salad. All of this cost about 27 dollars. It was well worth our money and time. The restaurant may look shady from the exterior and the seating or decoration isn't too great inside. It is however open 365 24/7 and you'll see a lot of taxi cabs standing outside all the time. But please do step inside to have their food because it'll be a shame if you don't give it a try. Sure you can go to Devon to have Indian-Pakistani foods but there you won't get the friendly, one-to-one easy-going, homely vibe from their owners and/or staff there. The manager of the restaurant came to my table personally and was very polite and asked if we needed anything and told us to let him know if we had any questions. Lastly, this place is Zabihah Halal as it clearly says on the windows. If you're Muslim, it's also nice to know that they have prayer accomodations inside and they hold Jummah prayer as well. There's also plenty of parking on the street across from the restaurant.", "rating": "5", "date": [2013, 10, 17]}, "42": {"description": "We have been back multiple times and everything is so good. Be sure to get the frontier chicken and the grilled chicken tikka. The daal (lentils) are also very good. We love this place. The owner is also very friendly! Yum! This is our go to Indian place now.", "rating": "4", "date": [2012, 5, 7]}, "23": {"description": "Do not eat here. I just left after being ripped off. I ordered garlic naan, some lamb, 2 pastries (I asked for one but he gave me 2 and charged for both), and rice. This somehow came out to $17.00. He said the lamb and regular naan cost $10 plus $2 extra for adding garlic, the two pastries $1.50 each, and the rice $2.00. I've tried by now I'm being purposefully overcharged but I don't say anything because I'm not in the mood to argue. When I finally get the food, THERE'S NO RICE. I ask him and he says it wasn't included in the $17.00. I ask how much each item was and he completely changes the prices. I'm pissed now that he's not only stealing from me but treating me like a complete moron. I point how his complete change in story and remind him of when he asked me what type of rice I wanted- white or red? (I said red). Now he says oops I'll give you a dollar back. Wow. I say no you're gonna give me rice and I'm not gonna pay any more for it. He says no, I'll give you a dollar back. I'm now pissed. Eventually he gives me plain white rice and I leave. I should have demanded my money back but I was starving and needed food. And now the kicker: the food sucked. Like I said, avoid this place. They will literally steal from you.", "rating": "1", "date": [2014, 8, 25]}, "47": {"description": "This is the best Indian food I've ever eaten. The manager is an amazingly gracious host and the food is unparalleled. And to top it off, it's 24 hours. A 24 hour restaurant that's better than any standard hour dinner place. Stunning.", "rating": "5", "date": [2011, 11, 12]}, "8": {"description": "This place seems to be the spot for Indian and Pakistani comfort food.  The fiance and I came here after an event at Kendall College (across the street), just to check out what all the excitement was about.  This place is VERY casual.  In fact, it has NO ambiance.  You just order your food, they bring it to you, you eat, and you leave.  Prices are very good and food is VERY tasty.", "rating": "3", "date": [2014, 12, 30]}, "31": {"description": "My roommate and I order food so he could celebrate Eid with some friends and I wasn't happy about the experience. It all started when the call was made to place the order. Unfortunately the person that answered the phone didn't speak English was struggling to understand me (I'm of South Asian descent, but do not speak Urdu). My roommate who does speak the language called and ran into the similar situation. After the communication struggle, the order was placed and a set time was given for pickup (because they don't deliver...go figure). When I got there (a few minutes late on purpose) the order was not still ready and had to wait another 15 minutes. I know that the worker felt bad for the delay and he was kind enough to give me some sweets while I waited. Once we got the good home and served it, we found the quality to be mediocre. Granted, this is not a fine dining establishment, but I would the naan didn't get hard after 15 minutes. If you're looking for drunk food, this is your spot. Otherwise, I'd pass.", "rating": "1", "date": [2013, 9, 25]}, "34": {"description": "As good as it gets late at night. Five of us went and had tons of food for under 10 dollars a person. Owner got us to try new dishes for free and it was all delicious. One of the few places you can count on for amazing food after everything closes.", "rating": "5", "date": [2013, 5, 28]}, "16": {"description": "Order takeout, don't try to order delivery or eat in here - when we came in we asked for a menu and they couldn't even find any and directed us to the wipe board on the wall. If you don't know what anything is, just take a look at the items in the buffet behind the glass and pick what you want. DEFINITELY recommend the Naan, it was made fresh and completely delicious. Had the Chicken Masala and the Lentil Curry - both sauces definitely up to par (still feeling the subtle burn!) They have a rotation of daily dishes, so looking to go back on a different day and see what's out. If you're a fan of no-nonsense curry it's definitely a great spot.", "rating": "4", "date": [2015, 3, 8]}, "13": {"description": "Great place to go have Indian food after a late night party. Feels great to have Indian food so late in the night.", "rating": "4", "date": [2015, 8, 13]}, "11": {"description": "A local cabby joint that's open 24 hours... Overall not that impressed with any meals other than  the frontier chicken... we tried the chicken biryani, roti which was not fully cooked, butter chicken and butter panneer. The wait was a bit ridiculous and they did overcharge us but management was quick to take the charges off without any issue which is why I srill gave this place a 3 star... probably won't go back unless I'm craving the frontier!", "rating": "3", "date": [2015, 1, 1]}, "39": {"description": "This place is awesome! It's like you stepped through a portal right into Pakistan. The owner is super nice and always puts the best combination of dishes together for us. And the fresh baked nan is spectacular!", "rating": "4", "date": [2012, 9, 19]}, "37": {"description": "Ok folks here is the low down on this place.   It is a basic  cabstand restaurant. It is not fine dining.That being said, the food is great!!!   Real deal Punjabi cooking.  Forget the menu, go there and ask them what is good today. They make different dishes every day. I have been there many times, and the food is fresh and taste like eating at great roadside dive in India or Pakistan.Nearly everyday they have fresh made biryani, a rice dish that takes several hours to make. It is really good.It is not fancy, its not table service, what it is though is good food made by people who know how to make these dishes.  If you enjoy Indian food, go there. If you don't know much about Indian food go to a place with a buffet.  This place is best for people who know good food. Its a dive, and one of my favorite dives.I grew up around such places, and can say the owner is a really nice guy, and the food is fresh.Go there if you have a sense of adventure and don't care it is a dive.", "rating": "4", "date": [2013, 1, 12]}, "0": {"description": "I'll admit - I was intimidated at first. Pretty sure they just took over a Chinese restaurant, and never bothered to change the name. The place doesn't look the nicest, and the way to order is to essentially point at one of the 6-8 chafing dishes behind the counter and cross your fingers. English is not a first language for anyone there, and some communicate better than others. All that said - the food rocks. The price is great, and the Naan is bar none, I could eat that all night. I recommend the lentils when they have it.", "rating": "4", "date": [2015, 11, 4]}, "38": {"description": "I am usually very patient, but I created a Yelp account today just to review this restaurant because I've never been so disappointed.  DO NOT ORDER ONLINE.  I waited 2 hours, called the restaurant, and a non-English speaking person picked up \"Hello?\".  \"Hi, is this Flaming Wok n Grill?\" and he responds with \"no\".  At this point I think I've gone dilusional and checked the phone # 20 times to make sure I dialed correctly.  I call back again and no answer.  I wait another 20 minutes to call back and the same guy who doesn't speak English tries to talk to me which I then was begging to talk to someone who could actually understand me.  The entire time, the restaurant took the order and no one delivered until I called.  I'm guessing they made the food and just left it there sitting for 2 hours because it was COLD when they finally delivered it.  I had to microwave all the food and the naan was so stale, it was harder than chewing on beef jerky.  You would think that after not delivering after 2 hours, delivering stale, cold food they would have enough decent service to refund the delivery charge or do SOMETHING other than just take my money and run.  Worst experience I've ever had which caused me to create this Yelp account and review this place.  Horrid.", "rating": "1", "date": [2012, 10, 7]}, "51": {"description": "Went here with friends for dinner. I wish I could tell you what I had, but it was just a table full of delicious food to me. Pretty inexpensive, I'll call it an Indian diner :)", "rating": "3", "date": [2011, 5, 7]}, "27": {"description": "Their food is great. Very authentic and their spices are just right. I wish that they would have a larger selection of dishes.  Its a great place to come and eat if you are looking for something that is authentic and not to mention tasty.  I wish they would keep their menu consistent because it's always a \"i hope they have my chilli chicken today\".", "rating": "4", "date": [2013, 12, 24]}, "32": {"description": "Best North Indian, Pakistani, and/or Hyderabadi food in greater Chicago. From Clay oven, downtown to Cool Mirchi in Suburbs. From Devon to West Loop, you won't find so authentic, so natural, so low salt, and so delicious food. Staff and people here are friendlier than ever.", "rating": "5", "date": [2013, 9, 23]}, "54": {"description": "Two stars on Yelp means \"Meh.  I've experienced better.\"  My experience isn't quite so stellar, but anything less than two seems really harsh.  I'd love for a late night authentic Indian delivery place to succeed, so I hope I can change this review one day to a higher rating.I was craving some Indian food late one Saturday midnight after an ill timed nap, and Grubhub told me that Flaming Wok was the only place delivering.  I'm still an Indian food newbie, so I don't know what to order, but I do know I like some butter chicken.  The guy who answered told me they were out of butter chicken, so I told him to pick whatever he thought was good under the conditions that it isn't too spicy, and knowing I love me some butter chicken, and up to $20.  He did exactly that, and threw in some extras too, which had me really excited as I waited for the delivery to show with my Indian food presents.  All together with tax, delivery fee, and a good tip, I paid $30.I don't know if they normally do delivery, it didn't seem like it, and I think  it was the owner who did the delivery, so on one hand I appreciate them making the effort, but on the other hand, maybe they shouldn't do delivery until they are ready.  I had to find my shoes and put on a coat over my pajamas to go outside to the street, and get the delivery from his car.  I probably wouldn't have cared if the food was really good.Unfortunately, the two main dishes were very cold.  One was actually refrigerator cold, which makes me wonder if they literally grabbed some left overs from out of the fridge.  I don't know how else it could have been that cold.  I am down for some home cooking Indian food, but dang.  I don't pay that much money for home cooking leftovers!  I still wouldn't have cared too much because I do have a microwave, if the food was good.Unfortunately, neither dish was anything like butter chicken, no trace of the delectable, savory curry that I LOVE.  And the dishes were extremely spicy.  So my guidelines of 1. I really love butter chicken, and want something similar, and 2. not too spicy, were not fulfilled.  Plus the free extras were just two pita pieces of bread, an odd assortment of veggies as if for a sandwich, and a tiny container of green sauce.  My boyfriend and I poked at the veggies for a few moments, in confusion, like \"what the heck is this for?\", it didn't stand alone, and it didn't seem to go with either the chicken in tomato or the chicken and rice dish.I think the owner knew he didn't provide his best foods, which is what I was expecting when I let him pick for me, because when I told him I'd leave a Yelp review, he hollered out the car that next time it would be better or something like that.I don't know if I am going to risk more money seeing if that is the case, though.  I was pretty disappointed with my midnight Indian food fix.  My boyfriend ate a little bit of the chicken and rice dish, but I could tell he was wondering what the heck I was thinking when I ordered from here.  He absolutely refused to even try the chicken in tomato sauce dish that had come super cold.  (When I say tomato sauce, I do NOT mean delectable creamy tomato curry sauce, just plain, jane tomato sauce.  Or stew.)  Maybe another late midnight evening I will give them another chance, but only if they have butter chicken on the menu.Reading some of the other reviews on here, I don't know if they offer everything on their menu all of the time, so they might need to be more clear on that concept... which isn't a bad concept if it is understood correctly!", "rating": "2", "date": [2010, 11, 14]}, "48": {"description": "The smells lured me in. I was working an event across the street and the good smells kept wafting over which led to tantalizing thoughts of indulging in flavorful, spicy curries and fresh baked naan. The smells lie. This place is filthy. The food is so-so. At least the naan was fresh but I could still never recommend this place. There wasn't a menu to look at, you just kinda look at the trays and point to what you want. The chicken dish I got was fatty, greasy and had tons of tiny bones. Prices aren't clear. And no, those aren't fancy candied raisins displayed right above the cash register, it's a fly trap strip COVERED in dead flies...and my head almost touched it.Health Department, can you hear me?", "rating": "1", "date": [2011, 10, 18]}, "44": {"description": "The owner is charming and so clearly deeply in love with his wife and her food.  He boasts that she can make anything found in India, and make it her own, and do it very well.  Some of the dishes will fall flat, and as they're both from Hyderabad it's no surprise that the massive trough of biryani is a real highlight.I guess there's a menu, but it's not worth bothering with.  Food's better in the evening when the turnover is high, and you should stick to the dishes of the day.  Ask for a plate of everything, it's worth it.  There are things that show up that I've never seen elsewhere, and the cab drivers who make it their hangout seem to know and love them by heart.  I encourage you to keep an eye out for mirch pakora (that is, battered and fried green chilies) with a brown filling, rather than a potato one.  The taste is incredible, and the filling is vegetarian, despite seeming otherwise.Some of the cab drivers I spoke to said they thought the food sucks, but it sounded like that's mostly a regional thing.  I feel some pity for the owner because it's a pain to get to the place with the bridge being closed and all the nearby construction.  But once you're there, you won't have any trouble finding a cab to get you back wherever you're going next.I was passing through Chicago from the west coast to the east by train and was taking a brief respite in the Near North.  The place had the kind of comments on Foursquare that made it seem like it might be something special, so I swung by, and it was.  Two weeks later, headed in the other direction, I went out of my way and rushed around frantically to find time to stop by.  There's so many things I want to eat in Chicago, that I won't find easily elsewhere, but I can't really imagine not making time to stop in here.  It's comfort food, it's well done, it's eclectic, and it's friendly.  And the owner doesn't mind helping you figure out who's willing to take a quick fare to Union Station at the end of a mellow meal.If you don't like the gritty cafeterias of poor neighborhoods in big cities with loads of cab drivers, I guess you should stay away, but none of those things will hurt you.  If you order food you think of as Indian, the kind of stuff you'd find in any mediocre Punjabi restaurant, you might be disappointed.  If you let the owner, the chef, or you eyes guide you, and order what people who know the cuisine would, and eat it with paratha or chapati rather than naan, you'll almost certainly leave happy.Some things are a miss, and that's always going to be the case in a place so dynamic, catering to such a wide variety of palates, from such a broad set of regional cuisines.  So get a little of everything and try not to mind too much if one thing among many sucks.", "rating": "4", "date": [2012, 2, 11]}, "24": {"description": "I ordered for delivery. It took 1.5 hours for the food to arrive. I also got 1 wrong item and was shorted 1 \"side\". I contacted the restaurant through Yelp and received no response.Food-wise, it was pretty good. Definitely 4 stars.I probably won't be ordering again due to the long delivery time though. At least the food was hot when it arrived. I wouldn't hesitate to dine in if I was in the area.8/17/14 edit: Out of options and craving Indian. I placed my order at 9:48PM. 11:10PM rolls by and still no food.I call the restaurant and some guy who cannot speak English very well struggles to have a conversation with me and eventually hangs up on me. I call back and someone else picks up. Tells me that the manager who delivers the food is not in today so they are not delivering. I demand a refund and the guy gives the phone to the person I spoke to earlier and we struggle with the language barrier yet again. Then I get the other guy back on and he tells me to call back around 1-2AM so I can speak with the manager... ARE YOU KIDDING ME??? I told them I'll figure it out on my own. Luckily GrubHub customer service is awesome, refunded me the money and gave me some credit for my next order. GH even said they called to confirm my order for delivery and they said OK.Super frustrated and super hungry. Will never consider ordering from here again.", "rating": "1", "date": [2014, 7, 16]}, "7": {"description": "Absolutely awful. The first thing I did after eating their food is write this review. I went in on a Thursday night to get take out and this is what happened.1. They barely gave us any food compared to the food you get when you dine in- 8 kababs, enough chicken for one person and 4 soggy uncooked parathas for $44. 2. They took over half an hour.3. They kept trying to upsell the food. I kept having to tell them to remove things from my order that I didn't order.4. There was hair in the food.DO NOT GO HERE. GO TO SHAN RESTAURANT. SOOOOO MUCH BETTER and CHEAPER!!!!", "rating": "1", "date": [2015, 7, 30]}, "49": {"description": "This has to be the worst experiences.  I tried them 2 times.  One in person, the other for delivery and both times are a great disappointment.  Delivery took about an hour and a half (I live .3 mile from them).  The deliver guy would not go up and parked 2 blocks away from the front door.  I have to walk to his car and pay.  The order was incomplete.  Missing desert and other items.  I didn't even bother to call and complaint.  And as for the food itself?  Nothing to be hype about.  I've given up on this place.  Order at your own risk.", "rating": "1", "date": [2011, 8, 5]}, "40": {"description": "The food is too gud..reminds me of the homemade kadhi..try the chilly chicken and pan bida. Everything is good.", "rating": "4", "date": [2012, 9, 7]}, "53": {"description": "This place is a hidden gem.  Fast, good and cheap.  Open 24 hours.  Very courteous owner.", "rating": "5", "date": [2010, 11, 30]}, "30": {"description": "Don't bother with their online menu (on their website and Grubhub). It lists the dishes they have according to the day of the week but it is not accurate. While it is true that dishes here rotate daily, the best thing to do is to walk in with an open mind and look/ask what items they have for the day. If you're ordering for delivery, I suggest you call them and ask them what's cooking for that day instead of looking at the online menu on Grubhub because that is inaccurate. Such is how this old-school Pakistani/Indian diner operates. If you can overlook this, this place offers you a very authentic and no-frills experience.I like this place a lot. Majority of their customers are cabbies and we all know that cabbies flock to authentic joints. The day's curries and food are placed in metal trays behind the counter and customers peek over to see what they have that day and place their orders. The lady then scoops them onto a plate (or box, for take out). For those who complained about \"food already sitting out\" on the counter, well, this is how it's done in many parts of Asia and even in Turkey. It's a very common concept where vendors or restaurants cook pot loads of dishes and put them in metal trays for customers to pick what they'd like to have for their meal. I felt like I was in Asia again with this true down-to-earth experience.We've tried the lamb korma, chicken frontier, and vegetable dish. Really enjoyed them all and can't wait to return on another day for other dishes.Update: Returned for a second visit and tried the chicken tandoori masala, aloo gobi, vegetable briyani, chicken korma, samosa, and pakora. All delicious and tasty.", "rating": "4", "date": [2013, 10, 7]}, "46": {"description": "Love this place.Haven't had a lot of time to sit down and do any Yelp reviews in a few months, but enjoyed my time here so much that I had to write something to try and up the stars.The reviews that are super critical of Flaming Wok I think just don't get it. If hole-in-the wall type, genuine Indian-style service isn't what you're looking for, you really have a number of other typical Americanized Indian restaurants right down the street where you won't get whatever just ruffled your feathers here.I also recommend coming here to take advantage of its 24 hour open doors. I went from around 3-4AM on a Sunday morning to see the place pleasantly packed. Yes, there is no menu on display, but as my roommate and I looked lost, the owner beckoned us over to the counter. Yes he showed us the area where the food sat out, warming and did ask if we've had Indian food before (more polite than not, if you ask me - how's he to know?). He pointed out what was what, and suggested a few. We didn't know how much anything would cost, but I'm sure if you asked he wouldn't have lied. If you didn't care to ask, I don't see anyone getting indignant over $7-8 food that comes in heaping portions. The naan is indeed amazing, and whatever two things we pointed to were also delicious. At the end of our meal he asked if we wanted some salad, brought it over, and told us he'd be right back with something he thought we'd like. This was after he'd brought us our check. He returned with what the place calls \"Frontier Chicken\" that, despite our stuffed bellies, was really great. I told my friend that all the chicken in our dishes was probably the most tender and moist for its price that I had ever had. Really - everything has been cooking for so long it falls right off the bone.The man actually also served us himself, telling us to sit down when I got up to get some glasses of water.What I really loved about the place: The fact that the sort of uncomfortable smell of spices and maybe even a little grime just hits you in the face as you walk in. The place was crowded with people you could tell visited the place often. Why? most of the patrons reached over the counter with their plates and served themselves. The table next to me was full of four men eating with their hands (how it's done in the motherland) - always amazes me how well they can clean up their plates! A man next to us told us he hadn't seen us around before, and then urged us to take a delivery menu home with us.So, you may have to serve yourself with your own utensils, napkins, and water glasses (who hasn't done that before). You may find the smell a little funky, and the place not immaculate. You may not have a menu with prices, or 4 star table side service, and might now even know what you're eating. But the food is great, the owner eager to feed you, and the atmosphere probably the closest to India that I have felt in a long time.", "rating": "4", "date": [2011, 12, 3]}, "1": {"description": "First let me start by saying this place is quite disgusting and I should have been able to tell by looking at the outside before going in. I work down the street and stopped in after for dinner. The food was not good and as others have mentioned overpriced. Will not be coming back.As if this was not bad enough I park near this place sometimes if I cant find a spot closer to work since it is zoned for free parking on Halsted. I came out the other day to find soup was poured all over my car. I spoke with a colleague of mine who also parks near here occasionally and found out the same thing happened to his car! The owner obviously feels like he owns the street parking here and is doing this to anyone's cars who are not his Taxi driver clients which is ridiculous!", "rating": "1", "date": [2016, 1, 12]}, "55": {"description": "The absolute worst dining experience of my life. When authenticity means filth and bad food, I happily will accept a fraud.I don't like to pay $8 for stale biryani with a few stray bits of dry meat. I don't like to pay $7 for curry chicken that is more fat than chicken and more grease than curry. And the steamed rice was offensive to the eyes and taste buds. It was all mush and zero flavor. And my date found a hair in her lunch.Flaming Wok now accepts credit cards, but the card machine shares a phone line with an actual phone, which never was put down by the woman who appeared to be in charge. If you're charging $7 for instant rice and fatty chicken, you can afford another phone line.Avoid this restaurant at all costs.", "rating": "1", "date": [2010, 11, 3]}, "9": {"description": "This place just did me so dirty, I am sorely disappointed and would like to challenge management to rectify the wrongs they have committed toward me.I ordered delivery tonight, like any other night in the loop. I was told I would wait for an hour, a time period I deemed appropriate for a meal this anticipated. You could imagine my dismay when I lacked my order, 1.5 hours after I ordered it.So I called the store, and the person on the other end only seemed vaguely aware of my order. He told me that he'd have to switch out the chicken puffs for samosas in order to save time - I was okay with this. 10 minutes later the driver calls asking me for directions, apparently google maps isn't standard issue for the delivery industry these days.The driver leaves the food in THE LOBBY, we were only informed by our nice doorman. We open the packages, only to find that they stiffed us on our replacement samosas, they FORGOT THE NAANS, and our food was cold and stale. Overall my experience was ABSOLUTELY TERRIBLE. To make matters worse, I tipped via grubhub ahead of time. I am very upset with my experience and would like management to respond to me ASAP.", "rating": "1", "date": [2015, 9, 14]}, "26": {"description": "Found a fuckin hair in my food. Fuck this place. Someone better call the health department", "rating": "1", "date": [2014, 1, 12]}, "25": {"description": "Delicious food and great service. I especially liked the fresh naan and the okra.", "rating": "4", "date": [2014, 2, 27]}, "12": {"description": "Bad food and service. Tried to charge extra in the final bill.force you to buy bottled water.", "rating": "1", "date": [2015, 8, 2]}, "59": {"description": "I just hit yelp to find this place overall is ranked 4 stars.  I am shocked.  I've passed this place a bunch of times and always wanted to give it a shot and tonight was the night.  Let me preface this with the fact that I LOVE Baba Palace.  I'm not a picky eater, and I have no problem with food of all varieties.  This food however, was not good.  The guy who I assume to be the owner, microwaved everything we got INCLUDING THE RICE which tasted closer to minute rice than fresh.  The only thing that wasn't nuked was a couple naan we got which actually were pretty good.  We were summoned to pick up the food plate by plate as it was pulled from the microwave.  Also, the portions were small, and the meat (both mutton and chicken) was 80% bone. I eat Indian and Pakistani food regularly, and I have no issues with bones.  But this was mostly bone.The owner seemed nice enough, and I hate to blast a place that so many people obviously have liked.  I just cannot fathom why.  I actually had to verify the picture matched the place I had just eaten at.I say if you want some cheap Indian/Pakistani fare head a little further down chicago and eat at Baba Palace.  It never fails to please, and it's a bit cheaper.", "rating": "1", "date": [2010, 6, 3]}, "21": {"description": "A local cabby joint that's open 24 hours... Overall not that impressed with any meals other than  the frontier chicken... we tried the chicken biryani, roti which was not fully cooked, butter chicken and butter panneer. The wait was a bit ridiculous and they did overcharge us but management was quick to take the charges off without any issue which is why I srill gave this place a 3 star... probably won't go back unless I'm craving the frontier!", "rating": "3", "date": [2015, 1, 1]}, "17": {"description": "Its open 24/7 and serves Indian food and just a block away from The MID", "rating": "3", "date": [2015, 5, 8]}, "10": {"description": "Best place about this place is, it remains open 24 hours. Food was good and portion was generous for price range.", "rating": "4", "date": [2015, 12, 10]}, "5": {"description": "After a late drunk night out we tried something diff then typical pizza or gyros. This spot is open 24hrs, you won't see your typical 3am crowd here. Instead you will see this place filled with cabbies, most likely watching cricket. It's pretty low key a \"dive\" or Indian diner you might say. There really isn't a menu just a dry erase board on what they are serving. We usually get the frontier chicken which is amazing, with naan or parathas. If you are not a fan of Indian food you will prb not be a fan of this place. This place is not fancy, food is not over the top,its homey with good prices, but if your craving Indian while ur drunk this will deff hit the spot! I don't drink chai but my friends say it's great here. Overall deff worth a stop if ur trying to find late night or early morning grub !", "rating": "3", "date": [2015, 3, 9]}, "3": {"description": "Before you read the review below, note that the door man of our building refused to let the delivery guy in due to the concern and safety of the tenants. Can you believe that? Here are the details:I ordered 3 items via Grubhub. They called me to tell me that one of the items was \"out\". So we negotiated on an alternative. About an hour later, I get a call from the driver who asked me where i live. Why didn't he have my address from grubhub order? Anyways, I gave him my address.Driver asked me to meet him at the front of the building. I told him i couldn't because my small baby is sleeping in the apartment. I asked him to deliver to my apartment.The delivery guy walks into our building, and started yelling at the door man. The door man didn't let him in the building because he said the guy was rude and he didn't want someone rude inside the building due to th SECURITY issue. This has never happen to us before.The guy called me and yelled at me. I asked him to leave food at the front desk and went to pick it up. Food was not what i ordered. Out of frustration, I threw the food away.All this took 2 and a half hours.I am going to call better business bureau. I order from grubhub almost weekly. This has been the worst delivery experience i've ever had on grubhub.", "rating": "1", "date": [2015, 12, 17]}, "35": {"description": "This place is wonderful. Fresh naan made to order and the most authentic Indian food you will find in Chicago. Cheaper and better than any place on Devon. No, it's not the cleanest place ever. No, the staff speak do not speak much English. No, there is no menu. So what?! Their food is frickin' delicious, cheap, and fast.If you aren't a prissy snob, you will love this place. I am ALWAYS the only white guy in there. Not to mention the only non-cab-driver. That says something. Something good.", "rating": "5", "date": [2013, 4, 30]}, "19": {"description": "I ordered for delivery. It took 1.5 hours for the food to arrive. I also got 1 wrong item and was shorted 1 \"side\". I contacted the restaurant through Yelp and received no response.Food-wise, it was pretty good. Definitely 4 stars.I probably won't be ordering again due to the long delivery time though. At least the food was hot when it arrived. I wouldn't hesitate to dine in if I was in the area.8/17/14 edit: Out of options and craving Indian. I placed my order at 9:48PM. 11:10PM rolls by and still no food.I call the restaurant and some guy who cannot speak English very well struggles to have a conversation with me and eventually hangs up on me. I call back and someone else picks up. Tells me that the manager who delivers the food is not in today so they are not delivering. I demand a refund and the guy gives the phone to the person I spoke to earlier and we struggle with the language barrier yet again. Then I get the other guy back on and he tells me to call back around 1-2AM so I can speak with the manager... ARE YOU KIDDING ME??? I told them I'll figure it out on my own. Luckily GrubHub customer service is awesome, refunded me the money and gave me some credit for my next order. GH even said they called to confirm my order for delivery and they said OK.Super frustrated and super hungry. Will never consider ordering from here again.", "rating": "1", "date": [2014, 7, 16]}, "28": {"description": "The food here is great!Try the Chicken Boti or the Grilled Talapia!We have been coming here for years, its great Indian/Pakistani food!I believe they are open 24hrs a day.", "rating": "4", "date": [2013, 12, 23]}, "45": {"description": "Love this place.I've eaten here several times. The owner is always a riot to order from. There's no menu, so I just point at what i want.I wish it was a bit cleaner, but I guess it just adds to it's charm.", "rating": "4", "date": [2012, 1, 6]}, "33": {"description": "Their food is delicious. Sadly, the delivery experience has been so terrible that I have to give them a low rating. We ordered from grubhub from this place. They charge $5 for delivery which is higher than the others in the area. Their estimated processing time is 1.5 hours and on top of that they are at least 20 more mins late every single time! What is most bizarre is that every time we have received food different than what we order. Sometimes they will call us to say \"we are out of butter chicken. we are sending you frontier instead\". but sometimes, they dont even tell us and change the order!! I find this so odd that I don't even know what to say. Yesterday, instead of 3 orders of pakodas, we received 3 samosas. When I asked the person he said \"oh if we run out, we send samosas\". First, I would have ordered samosas if that is what I wanted and 2nd, how about freakin letting your customer know that you are sending something different? Not once have they compensated in any way for the inconvenience. I should have paid attention to their long list of 1-star rating on grubhub!After 4 such incidents, we will probably never order delivery from them again. Maybe their dine-in is a completely different experience.", "rating": "2", "date": [2013, 8, 9]}, "43": {"description": "This place is so much fun! Maddy (the owner I believe) is so cool, and the food rocks. You don't even order off a menu you just have Maddy bring you stuff.  All of the regulars eat with their hands, which is fun to see, and the naan is SOO good. Long story short, it's an experience!  And for the price (about 9 bucks per person), the amount of food you get and its deliciousness are top notch. I will now be a regular, although I think I'll continue to use a fork.", "rating": "5", "date": [2012, 2, 14]}, "2": {"description": "I visited \"Flaming Wok n' Grill\" on Sunday January 3rd, 2016 at approximately 2:00am. The restaurant has a paper menu listed on Yelp and also i received the exact menu in the restaurant. It show as follows: Full Meal $9.00 Full Order 8.99 Half Order 6.99. The owner starts recommending a lot of food and writes everything he says down so i stop him and say: \"I'll have 2 Full Meals of Chicken Tikka\" (it's an indian restaurant) and i point at the menu. He brings me what i wanted and an infinite amount of Naan. So in the end we expected to pay $18.00 + tax. The owner then brings us a $50 bill and charged us A La Carte for every item, and when we asked why in the menu doesn't reflect that his response was that \"His prices on GrubHub are the correct ones\". I tell him i want to pay the advertised price; he gets mad and calls the cops on me saying im trying to steal from him. I allow him to call the police. The Police come and super nice guys tell him that he has to charge us what he's advertising, so in the end he's forced to charge us the $18+tax but this was 35mins after we were supposed to have left. By the way this establishment is filthy and the employees didn't wash he hands and started making naan.", "rating": "1", "date": [2016, 1, 11]}, "18": {"description": "Don't bother with their online menu (on their website and Grubhub). It lists the dishes they have according to the day of the week but it is not accurate. While it is true that dishes here rotate daily, the best thing to do is to walk in with an open mind and look/ask what items they have for the day. If you're ordering for delivery, I suggest you call them and ask them what's cooking for that day instead of looking at the online menu on Grubhub because that is inaccurate. Such is how this old-school Pakistani/Indian diner operates. If you can overlook this, this place offers you a very authentic and no-frills experience.I like this place a lot. Majority of their customers are cabbies and we all know that cabbies flock to authentic joints. The day's curries and food are placed in metal trays behind the counter and customers peek over to see what they have that day and place their orders. The lady then scoops them onto a plate (or box, for take out). For those who complained about \"food already sitting out\" on the counter, well, this is how it's done in many parts of Asia and even in Turkey. It's a very common concept where vendors or restaurants cook pot loads of dishes and put them in metal trays for customers to pick what they'd like to have for their meal. I felt like I was in Asia again with this true down-to-earth experience.We've tried the lamb korma, chicken frontier, and vegetable dish. Really enjoyed them all and can't wait to return on another day for other dishes.Update: Returned for a second visit and tried the chicken tandoori masala, aloo gobi, vegetable briyani, chicken korma, samosa, and pakora. All delicious and tasty.", "rating": "4", "date": [2013, 10, 7]}, "41": {"description": "I will take the can of coke please. After all it is marked on the website as a 'popular item'.  Where do I begin? They sing Happy Birthday well! The owner is very nice. Although a chatterbox. I am not sure where I will use the knowledge of the long stemmed white rice coming in a barrel for $25 is better than the asian $5 a barrel kind, but thanks for the info. The food was okay. It was our first time trying Indian. (We thought we were eating Asian Cuisine....that's what the awning outside the restaurant says). We couldn't understand anything the gentleman was saying when we walked in - I am sure we ate goat, alligator and chicken all in one slosh. There was metal silverware in tubs along the counter, yet they made us eat with not 2, but 30 plastic spoons. Thanks for the plate of carrot chips, onion chunks and jalepenos...what do you want me to do with these? Remember, if you do go in there, the sink behind the counter is for employees ONLY. Enjoy!", "rating": "2", "date": [2012, 6, 22]}, "52": {"description": "This is definitely the best Indian food I've ever eaten.  The naan was ridiculously good and fresh, and the rest of the food was very authentic and delicious as well.  This place is also run by probably the nicest people you'll ever do business with.  I would go here before I'd go to any other Indian joint in the city.", "rating": "5", "date": [2010, 12, 11]}, "50": {"description": "I have mixed feelings about this place. I just went here for the first time yesterday and there was no menu whatsoever. Some food was already sitting out. When we go to order, we're asked if we've ever eaten Indian food before (yes, of course we have) and if we like lamb or chicken and that's it. Then he tells us to sit down and he'll take care of it. What? What am I getting? How much did I just spend?Regardless, we stay and wait. The food came out and the naan was really fresh, the chicken was really good and so was the lamb (lots of bones and fat though). We also got a small plate of fresh veggies and a sauce to cool everything down. The food was actually pretty good, but seeing where it's cooked just kind of grossed me out being that it didn't look too clean.On top of that. We waited forever to pay. There was a whole group of people praying inside, which I thought was cool, but we couldn't interrupt their concentration because they would have to repeat their prayer  5 more times. We did talk to the owner for a bit (I think) who kept trying to explain everything to us, which was helpful. It was just more awkward than anything.Overall, it could have been a very unique and cool experience, but it was in a pretty shabby, run down place and it just left me feeling annoyed and awkward. I think if I were to come back it would be on a strictly take, out basis.", "rating": "2", "date": [2011, 5, 20]}, "4": {"description": "The boy was hungry and there was no food at home so we stopped in while we were driving on Halsted. I was a bit reluctant to try because I have heard some not so great stories from 5 years ago. We ordered some keema (ground beef curry) with naan and chicken biryani to go. The biryani was a decent amount of food and made for great leftovers. The keema was slightly greasy and they didn't give us a lot as I would have expected. It good with some steamed rice we had at home. Everything was spiced okay and wasn't too overly greasy.the place itself was decorated to feel more welcoming...at least more than other cabbie joints.", "rating": "3", "date": [2015, 8, 3]}, "6": {"description": "Since I was only visiting my brother in the city for less than 24 hours, we decided to stay in and just catchup. He suggested this place since it was nearby, so we decided to walk to the place and check it out.You know you are in the right place when you are the only non-cab driver customers in the joint.If you are looking for a good Mediterranean food, this is the place! They got multiple choices base on how daring you are when venturing on the flowchart of spiciness. Their naan bread are all completely handcrafted and freshly served right out of the stone-bakery device (I don't know what it's called). They will not disappoint!", "rating": "4", "date": [2015, 3, 16]}, "22": {"description": "This place seems to be the spot for Indian and Pakistani comfort food.  The fiance and I came here after an event at Kendall College (across the street), just to check out what all the excitement was about.  This place is VERY casual.  In fact, it has NO ambiance.  You just order your food, they bring it to you, you eat, and you leave.  Prices are very good and food is VERY tasty.", "rating": "3", "date": [2014, 12, 30]}, "15": {"description": "I ordered food and specifically stated breast of chicken, even saying switch the dish if it was not breast of chicken, what was delivered was greasy and not breast of chicken, two legs and thigh meat no sauce just pure grease. I ordered two different naan and only received one, the order was delivered by a taxi cab who called for me to go down to the street for it. I am not eating any of it. Annoyed they could not get it right!", "rating": "1", "date": [2015, 7, 13]}, "57": {"description": "I had been wanted to try Flaming Wok for awhile now, but an bad experience at Baba's Palace was somewhat traumatizing (check out my review) that I have been a bit cautious about attempting anything unknown when it comes to Indian & Pakistani food (and I'm Indian & Pakistani, so I know how it goes down....).  That being said, I came a few weeks back with I had late night craving biryani and my mom was nowhere to be found.  Very good biryani and the chicken tikka (with the bright red seasoning prepared on the grill) was delicious.  It tasted just like my mom's when she marinates the chicken really well and throws it on the grill.  I didn't try any of the other dishes, but I'll come back and update my review.The food took awhile for carry out, but I can tell they take pride in preparing their food for their customers.  Just sit back and watch some PakTV while you wait :-)", "rating": "4", "date": [2010, 9, 2]}, "20": {"description": "Interacting with Flaming Wok n' Grill is fruitless. I ordered dinner on grub hub from Flaming Wok 'n Grill. Dinner never showed up.I called the restaurant and the employees had never heard of \"Grub Hub.\" Eventually, after sitting on the phone with Flaming Wok for five minutes I was informed that \"we don't accept online orders\" and invited to come into the store to place an order. I explained that my credit card had been charged. Only to have the clerk request I call back in an hour to rectify the charge...", "rating": "1", "date": [2015, 1, 19]}, "36": {"description": "I went here for a late lunch on a Friday afternoon. My friend and I went in- he told me to order the chicken kabob, and I did. It came in two varieties, differently spiced, with a bowl of lentil soup, chickpeas, and several pieces of naan.We ordered at about 1:15. We sat at a table for about five minutes, but were asked to move. The staff moved all the tables and chairs to one end of the dining room and began to clean the floor. My friend and I sat at the counter and watched as prayer mats were laid on the floor. At about 1:30, after our food arrived, we watched as several men entered, removed their shoes, and began to participate in a Muslim prayer. The guy next to me explained that it was the Islamic Sabbath. The restaurant had become a mosque, and by the time my friend and I finished our very good meal, about twenty men were praying towards Mecca. One man chanted some prayers, and incense was lit, the smoke wafting over our seats.My friend and I didn't want to be disrespectful, but seeing that other people at the counter kept eating, we did as well. We continued our conversation quietly, but one guy had a reasonably loud conversation on his phone, food kept being cooked with a loud sizzle, and diners came and went as the prayer service continued.I wish we had known that the Flaming Wok n' Grill became a mosque on Friday afternoons. It's an odd environment to eat lunch in, however good the food is. The incense wasn't ideal either, as it overpowered the scent and flavor of the food.", "rating": "3", "date": [2013, 2, 1]}, "14": {"description": "Frontier chicken is my favorite...delicious rice and the best naan I've had! Food for the soul, late night...all right!", "rating": "5", "date": [2015, 4, 11]}}, "neighborhoods": ["Goose Island"], "latitude": 41.8988266, "longitude": -87.6476898, "rating": "3.0", "times": {"Mon": ["4:00 pm", "3:59 am"], "Thu": ["4:00 pm", "3:59 am"], "Sat": ["4:00 pm", "3:59 am"], "Wed": ["4:00 pm", "3:59 am"], "Tue": ["4:00 pm", "3:59 am"], "Sun": ["4:00 pm", "3:59 am"], "Fri": ["4:00 pm", "3:59 am"]}, "price": "$", "categories": [["Indian", "indpak"], ["Pakistani", "pakistani"]], "address": ["903 N Halsted St"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Casual", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Dinner, Late Night"}, "category": "Restaurants", "number_of_reviews": "83"}}