{"wendys-chicago-34": {"comments": {"1": {"description": "Wendys has a 1.99 after 4pm kids meal promo right now. So I order 2 kids meals, but later notice Ive been charged 3.69 for one and 3.29 for the other. I go up to the register and ask the cashier how much the kids meals were, and she says \"theyre 1.99 after 4pm.\" I got these at 5pm and I show my recipt to show the overcharge. She asks the girl who took my order about it, and said person comes over like she couldnt have been bothered about this, even though it was her f.n mistake in the first place. She opens up the register and gives me 2 dollars and leaves. This is less than Im owed. I should have explained to her (sloooowly) that 3.69-1.99=1.70, and 3.29-1.99=1.30, for a total of 3.00. So I let the first girl know that I ordered 2 kids meals and what I am owed is more than 2 dollars. She calls the second girl again and tells her. Moody comes and does the same again, opens the register and rudely pushes 2 dollars at me. First, she gave me too little back and then she gives me too much back, but the obvious part about this is that shes the one who made the mistake in the first place, but has a nasty attitude when shes politely told about it. Thats why my rating reflects solely the employee.Ive been here a hundred times before and all has been good, but this just felt wrong.", "rating": "1", "date": [2013, 1, 21]}, "2": {"description": "Had a recent visit here and won't be going back. Had coupons for free cheeseburgers. My 80 year old mother used one and forgot to mention to the cashier no mayo. Cashier gave her obnoxious looks and was completely rude. I reported her to corporate right after we got home with the goods. The food was nothing to write home about either.", "rating": "1", "date": [2011, 10, 26]}, "0": {"description": "Pretty typical Wendy's restaurant. The food is usually fine. Sometimes the buns are stale and the service is slow, but nothing so terrible that it stops me from enjoying a twice monthly Jr. Bacon Cheeseburger and a Chili salad.", "rating": "3", "date": [2013, 1, 15]}}, "latitude": 41.6810549, "neighborhoods": ["Hegewisch"], "categories": [["Burgers", "burgers"], ["Fast Food", "hotdogs"]], "address": ["3516 E 118th Street"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Formal (Jacket Required)", "Waiter Service": "No", "Has TV": "Yes", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.5377192, "category": "Restaurants", "rating": "1.5", "price": "$", "number_of_reviews": "3"}, "club-81-too-chicago": {"comments": {"3": {"description": "Went last Friday to this strictly Polish restaurant looking for fish and seafood for Lent. Neat old dive bar as you walk in the door. Smallish old bar with a couple of TVs around the room and a couple of bar-height tables scattered about. Won't hold a ton of people but makes for a nice and familiar watering hole to enjoy a few drinks or wait for a table in the attached dining area right off the bar. The menu in the dining room was filled with fish and seafood choices...with some chicken, hamburgers, and ribs offered. They seem to really specialize in fried foods...whether chicken or potatoes or breaded green beans. We went for the fried perch dinner and the crab cakes. The fried perch was the hit of the evening...nicely done little filets with a light breading...the dinner included little quarter cups of cottage cheese, cole slaw, and tartar sauce...two pieces of marbled rye, and a handful of fries. The guy who ordered the crab cakes - me - should have known better, i.e. you really don't go into a Polish emporium and order crab cakes. But be that as it may ... out came three crab cakes deep fried...and the chef put a dollop of butter on top of each cake after they were fried...this proceeded to melt down and accomplish two things: 1...the cake was very greasy and you got slippery lips and 2...the extra butter ran down to the bottom of the plate and sat there for the French fries to swim in. Not good - but half my fault for ordering it in the first place. Service was mixed up...all the people are very nice with a heart of gold but Waitress A didn't know which tables Waitress B was serving and vice versa. We waited for a long time in this narrow little room before anyone thought to ask us if we had been served. Oh well...topped off the night. Everyone gets a small bowl of pickled beets even before you order dinner. They offer no desserts. They only serve dinner on Wednesdays and Fridays. The bar area is open every day. May give it another try.", "rating": "2", "date": [2015, 3, 7]}, "1": {"description": "This is a neighborhood place that caters to the same clientele who have been eating their fried food for 40-50 years. It's a family business who counts on \"regulars\" who don't like to venture out of the neighborhood for good food. Not always clean. Doesn't usually smell good. The mens room is a disaster. I eat there once or twice a year when I'm stuck in the area. Not much thought goes into the menu, or service, or customer satisfaction. Usually open for dinner on Wed. & Friday,  unless it corresponds with a holiday, or vacation, or a party, or..? I've had the chicken, which is decent, comes with a couple of fries. If you get chicken to go, your fries will be soggy. I've had the basa (fried fish) special, which is advertised as \"all you can eat\", although that depends on whether the manager/cook wants to close up early and go home, then it's \"all you can eat till I say when\".  The first plate had 3 basa filets on top of a couple of fries on a very small plate, so the filets were hanging off the side. Since the fries were UNDER the fish, the condensation made the fries wet and soggy, and made the breading fall off the fish and made THAT soggy. Subsequent filets without fries were crisp. They serve cocktail sauce with their white fish (????). But you can ask for tartar sauce. If you complain, you MAY get an argument from the manager.So, if you live in Hegewisch, don't feel like going far, realize what you're getting, this place might be for you. SOME parking. NOT minority friendly.", "rating": "1", "date": [2016, 3, 3]}, "2": {"description": "This place has excellent food. But seems to only be open when they want to be open not when there is high customer demand? Kitchen hours need to be readjusted to serve customers when demand is highest during the week. Over the years, I have called to place an order only to be told the kitchen is closed?", "rating": "3", "date": [2016, 2, 19]}, "9": {"description": "They just remodeled and it looks super nice! For all of you that said that the bar was dark, it is no more. Nice paint on the walls and bright can lights line the ceiling.. Looks great :)", "rating": "5", "date": [2012, 12, 29]}, "10": {"description": "When you walk in here you feel like you entered a tavern with a couple of tables in the back, love it. There is no ambience, the staff is warm, and you feel like you are at home on a Saturday. Spectacular breaded perch sandwich and an even better steak sandwich. Was really impressed and will try to get back there. It appears to be a real neighborhood place and is family ran from what I gathered. Awesome.", "rating": "5", "date": [2012, 7, 18]}, "4": {"description": "They have the BEST chicken and burgers EVER! we order for work a lot and we are never disappointed!", "rating": "5", "date": [2014, 9, 26]}, "6": {"description": "Great food, strange hours.  My family is new to Club 81 Too but we are definitely fans.  They are masters of fried foods.  The chicken dinners are huge, honestly enough for 2 people.  I'm not sure if it is the best fried chicken in the city like they claim, but it has to be up there!  The fried catfish was delicious, tons of yummy meat on the big fish.  Don't miss out on the fried green beans as well, these are definitely the best in the city.  I wish I could give the place 5 stars but I also wish they were open for dinner more than 2 days out of the week.", "rating": "4", "date": [2013, 11, 12]}, "11": {"description": "Heard on WGN that this place is supposedly known for their fried chicken... either this place is over hyped or I went on an off night because I wasn't too impressed.  It wasn't bad mind you, but the chicken just didn't seem any different from your average place.  It had a tasty crispy skin but, the meat wasn't all that moist and juicy.  I'll save you some gas money, don't make the long trek if you're coming here just for the chicken, there I said it!", "rating": "3", "date": [2010, 8, 23]}, "5": {"description": "This place is one of those typical dive bars that only the surrounding area goes to. Let's drown our sorrows. Has a musty smell, they sell food from a bathroom type kitchen. The only good thing about this place are the drinks are really cheap. Other then that, stay clear. Also it seemed to me many of the people that go here are still living in the past!!! Alright people grow up already and stop thinking your professional ball players.", "rating": "1", "date": [2014, 4, 7]}, "7": {"description": "Just found a new favorite place for lunch near my workplace on the south side.  Heard about it accidentally through a co-worker, who was trying to keep it a secret.  It is a true local bar dive. The front area is dark and seems to have the regulars sitting at the bar, but the back area is well lit and full of policemen on the day i went.  There was a regular flow of workers coming in to pick up orders.  I had a turkey sandwich..huge, fresh, and tasty.  I believe they are known for their fried fish, particularly the lake perch, but i was trying to be good.  i will def try it next time though.", "rating": "4", "date": [2012, 6, 21]}, "8": {"description": "I love dive bars and this one qualifies.  When you walk in you see the usual gang of old guys doing shot and a beer at the dimly lit bar.  The back room is BRIGHT!  There are about a dozen oil cloth covered tables that seat 4 to 8 people.  If you hate fried food, stay away.  There are about 20 items on the menu, mostly fish.  Mom had the perch and said it was great.  I had the fried chicken and it was incredible!  The cole slaw is served in a tiny plastic container and was nothing special.  The frys are thin and crisp.Drinks are cheap.  Dinner and 3-4 drinks came to $36.  This is obviously a neighborhood place and most everyone seemed to know each other.  They served lunch Monday-Friday and dinner on Wednesday and Friday.  I loved the atmosphere and the chicken and will be back soon.", "rating": "5", "date": [2011, 4, 15]}, "0": {"description": "It can be hard to describe the joys of a place like Club 81 Too. It's about the spirit of a place like Hegewisch and the honesty of working your whole damn life because that's what you do: you work. Like many places I love, you either get it or you don't. It's unpretentious and at its best will resonate deep in your bones. You'll adopt the Dombrowski family as your own just as soon as they adopt you, because the whole clan acts like the outgoing, joking relatives you grew up with.Lunch is M-F 11a to 2p. They serve dinner on Wednesday and Friday night until 8p. You can go in any night for a beer and a shot of \"Wolf Lake Elixir\" at $2... $1.50 on a Sunday. Cash only, but there is an ATM.You walk in to a worn-in bar, taken from the original location at 81st and Exchange. A dining room is to the right with several tables. Families are welcome and always present. Nothing fancy, the home cooking is the star here. Out back there are picnic tables, bocci ball courts, and a sliver of Wolf Lake to enjoy.The dinner menu is heavy on fish and seafood: whitefish, perch, shrimp, frog legs, snapper, walleye, lobster, orange roughy, catfish, mahi mahi, crabcakes, fried clams, and basa. They filet all of it themselves. They also serve chicken, steaks, ribs, pork chops, sandwiches, and apps. I had the walleye and fried chicken. The walleye was lightly battered, the flavor of the fish coming through, and brushed with butter for some of the tastiest fried fish around. I haven't had fried chicken in years, but went back for seconds and thirds, it was great. Everything has a from-scratch feel to it. Rye bread from a local bakery is always available. The food is done simple and with care. Filled with regulars, don't be worried... they'll know if you're not from the neighborhood and take extra care to make you feel welcome.Club 81 has been in the family for over 60 years. We went with a huge group and was treated generously. Refer 4 people and get a free steak dinner... you bet I'll be going back!", "rating": "5", "date": [2011, 4, 25]}}, "latitude": 41.65563, "neighborhoods": ["Hegewisch"], "categories": [["American (Traditional)", "tradamerican"]], "address": ["13157 S Ave M"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "Yes", "Alcohol": "Full Bar", "Delivery": "No", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Ambience": "Divey", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Dinner"}, "longitude": -87.53711, "category": "Restaurants", "rating": "3.5", "price": "$$", "number_of_reviews": "12"}, "petes-fresh-market-chicago-3": {"comments": {"12": {"description": "If you love a great variety of fresh fruit and vegetables, many grown in the USA, but also a large variety from around the world, this is the place for you.  There is also a large deli which includes salads, a fix your own salad bar, and many cooked selections, a fish/seafood stand, and bakery,all manned  by great people.  Add a multitude of organic selections, and specialty ingredients from around the world and you have my favorite grocery store.", "rating": "4", "date": [2013, 6, 23]}, "7": {"description": "This is my favorite grocery store ever.1) Their prices on meat and veggies are easily 1/3 to 1/2 cheaper than any comparable grocery store with no sacrifice on quality or longevity (I'm looking at you Stanley's!)2) The people who work there are super friendly!3) They make awesome homemade salsa, chickens and marinated beef among other options that are great for cheap and easy dinners or lunches.I don't really shop here for most packaged goods, since they aren't that cheap overall but I can usually get the fixins' for 5 nights of dinner plus snacks for less than $50 eating something home cooked and swanky each night!", "rating": "5", "date": [2013, 1, 10]}, "20": {"description": "This place is far, far better than any Dominick's or Jewel...  They have a huge produce section with a lot of inexpensive, good produce.  Their meat department is huge, with a lot of variety that you don't find elsewhere.  Their deli is great--the same brands of meat are 1/2 the price of what they might be at Jewel/Dominick's.Their prices are generally better than other grocery stores, too.  The store is bright and clean (nearly brand new, opened in 2006 or so).The only complaint I have is their sales are purposely tricky... Like they might have 2% milk on sale for $1.99 but skim and whole are $3.99... Or Diet Coke is on sale but regular coke (or one of those weird Coke flavors) are not on sale...", "rating": "5", "date": [2007, 9, 30]}, "19": {"description": "This place is far, far better than any Dominick's or Jewel...  They have a huge produce section with a lot of inexpensive, good produce.  Their meat department is huge, with a lot of variety that you don't find elsewhere.  Their deli is great--the same brands of meat are 1/2 the price of what they might be at Jewel/Dominick's.Their prices are generally better than other grocery stores, too.  The store is bright and clean (nearly brand new, opened in 2006 or so).The only complaint I have is their sales are purposely tricky... Like they might have 2% milk on sale for $1.99 but skim and whole are $3.99... Or Diet Coke is on sale but regular coke (or one of those weird Coke flavors) are not on sale...", "rating": "5", "date": [2007, 9, 30]}, "1": {"description": "Their bakery is amazing!  The salad bar and hot foods are a time saver when you're in a rush. And a chicharrones bar!  Be careful with the meat though,  use or freeze it fast! The produce is gorgeous.  Store is always clean and organized.  Staff is always friendly.", "rating": "4", "date": [2015, 11, 7]}, "2": {"description": "Petes started on a high note and has gone down hill within the past two years. A majority of the produce is frozen. So by the time you bring it home it thaws out and spoils. That's on top of the fact that it was way over priced to begin with. Along with everything else being overpriced meats and so on. Now with the bag ban the service is absurd. The policy says bring your own bag get .05 cents off. But they failed to mention if you bring your own bag your bagging your own food! The cashier just pushed my food aside. Then continue to charge the next customer before I finished bagging my food. If I wanted that kind of service I would of gone to aldis. The price they charge I'd expect a better quality store.", "rating": "1", "date": [2015, 8, 27]}, "9": {"description": "This place has changed for the worse in the last few months. When Pete's first opened, it was a godsend. Fresh produce, lots of choices in the Deli and with prepared foods, not usually found on the East Side of Chicago.Then I started to notice that their selection in the Deli became very limited. The wide variety of items, including some from Boars Head, became just a few brands. The salads and other Deli items showed their lack of turning, often looking like they had been there more than a few days. In the bakery, they would leave the muffins and strudels on the shelves for over a week, not restocking them with new items till the old ones sold, or became so stale as to be unsalable. Most bakeries replace their goods on a daily basis, and sell their older goods as day old. Not here. They need to start changing out their baked goods.I do not know why this change for the worse has occurred at this Pete's. I just wish they would get back to what may them so good. Until then, I shop carefully at this place, and have started buying my deli and baked goods elsewhere. If they don't wise up, they will loose a lot of their loyal customers.", "rating": "3", "date": [2013, 8, 21]}, "6": {"description": "Seriously LOVE this place to death!!!  I refuse to go anywhere else for meat/fish/produce. Their prices are a little higher for other stuff BUT their prices in the fresh meat/fish and produce prices are great. Their prepared food is also FANTASTIC along with their salad and soup bar......AWESOME!!!Their liquor department carries EVERYTHING.....and it's so awesome they finally got a liquor department, that was all that was missing before. I live in Whiting and have Strack and Wal-Mart as my options to shop - they are much closer than Pete's is yet Pete's is where I go because they blow the other places away.YAY PETE'S!!", "rating": "5", "date": [2013, 9, 2]}, "18": {"description": "Tucked away in the boondocks, you kinda have to know it's here to get here. I love this place so much. The hot food is cheap and delicious and the bakery selection is plentiful and never disappoints. They have the cheapest produce in the area and they keep everything well-stocked. It's right next to Marshall's so you can go shopping after you go shopping too!", "rating": "5", "date": [2011, 8, 16]}, "10": {"description": "As someone who likes to get a good value for their money, Pete's definitely fits the bill.  With a Jewel-Osco, Strack and  Van Til (local chain), and Super Walmart nearby, one does have choices on where to shop, but Pete's can definitely save you money.They do have an extensive produce, meat, and bakery section as others have referenced and their prices are decent.  You do have to watch their sale prices, especially when the produce is super cheap as sometimes its at or over the peak of ripeness and may go bad on you faster then you expect.  Their prepared food area is also very good (and a wide variety) as I like to buy their tamales or their rotisserie chicken every once in awhile.All in all, its not bad. In addition, they also have a number of imported/ethnic items...if one is in the mood for imported beets or pickles from Poland, Kinder from Germany, or even Burek from Croatia/Serbia, chances are you will find it at this location.  Also you can watch the sales on their packaged items as sometimes they have great deals on those items too.", "rating": "5", "date": [2013, 1, 24]}, "13": {"description": "I looooooooove Petes. I was first introduced to Petes while tagging along to AJWright and Dollar Tree which are in the shopping center as Petes. Since my first trip I've been hooked. I take two buses to go here.It is defitnely worth it.    When you first walk in you will be amazed by the produce. I know I am. Everything is fresh and organized. They often have a mixture of fruit cups- canaloupe, watermelon, kiwi, strawberry,etc.They have a lot of hispanic products. The prices are great. My must haves from there are the fruit, they have beef/chicken fajitas already seasoned, chicken breasts and buffalo wings seasoned, guacamole( love guac), almond milk, and their cupcakes.         The lines are never long when I go there. I'm usually in and out. The staff are friendly and willing to help out. They also have hot meals you can get as well. And they are close at ten pm every day.!", "rating": "5", "date": [2010, 10, 28]}, "16": {"description": "OK, this is a good place. Just like many of the other \"Petes\", it seems to have everything you need.  Actually this one in Hegwisch took a CLOSED Dominick's and transformed it into a very Upscale Food Store, but with a Mexican Tilt.  Meat Section is Great, Deli section is OK, Takeout section (Don't go there Hungry) is fantastic.  Everything seems to be well stocked and neat.  A big Highlight has to be their Bakery Section.  You got to check out their \"Atomic\" and Tres Leche Cakes.  Mexican Sweet Bread alongside American Favorites are plentiful and taste's great.  One other thing, Pete's is one of the few places you can find \"Hienies\" Hot Sauce, by the Gallon.  (Checkout my review about Hienies Shrimp House.)  This place doesn't really put any of the Mom  and Pop Stores out of Business, but really just raises the Standard of how a Food Store Should be.Big Day tomorrow, Grand Opening for another Pete's Store on Sibley Blvd in Calumet City.  Expecting big Crowds tomorrow.  See ya there.", "rating": "5", "date": [2009, 8, 4]}, "17": {"description": "Watch your receipt, this place false advertises sales.", "rating": "1", "date": [2012, 10, 23]}, "15": {"description": "Forget the trendy Whole Foods thing..this place ROCKS! I've lived in the neighborhood most of my life and I felt poorly when Dominicks abandoned this location but Pete's makes you for get it ever existed. Extremely organized, incredibly well stocked  and an almost overwhelming variety. I used to be a 'foodie'  until the local selections ruined it. Pete's has all the things I used to cook with and truly upscale products. I agree with a previous posting..don't go in hungry! The prepared food is unbelievable and if you're on a diet avoid the bakery....you'll drop your diet in a heartbeat. If you haven't tried this place, FIND IT! Its worth the trip.", "rating": "5", "date": [2012, 8, 14]}, "0": {"description": "One of my favorite grocery stores. I can always find what I'm looking for and then some, but what I always come for (even when I'm not grocery shopping) is the hot food! I have to get 3 chicken tacos sometimes a burrito and the Mexican corn which is absolutely the best food ever!!", "rating": "4", "date": [2016, 2, 28]}, "5": {"description": "Good produce and meat but that's all we buy there since the rest of the groceries are way over priced. It also takes forever to get checked out of there since they only have a skeleton staff of cashiers most of the time. Now add to it that after waiting 15 minutes to get checked out , they are now charging 10 cents per bag. That's CRAZY! If I'm spending 60 plus dollars in a store they should be able to absorb the cost of a bag. It's probably a good thing that it was my wife that was there today because I would've left everything on the conveyor and walked out to another store ! Looks like we'll be crossing the border more often to SVT where they are cheaper and have no sales tax on groceries", "rating": "2", "date": [2015, 8, 23]}, "11": {"description": "Great place to do all your grocery shopping. Constant deals on produce and deli. Employees are friendly but management could be a little unfriendly as times. The coffee shop is a great addition to the store in my opinion. It's not high quality coffee but its good enough for me to return to once in a while.", "rating": "4", "date": [2014, 4, 20]}, "8": {"description": "Beware that Pete's Fresh market has a 24 hr  return policy on fruit and produce! So does that mean, if fruit that is purchased at Pete's goes bad after 24 hrs, you can't return the spoiled product?", "rating": "1", "date": [2014, 4, 28]}, "3": {"description": "Great place to shop at.They have fresh produce. The perfect place to go grocery shopping because they also serve hot food so no need to cook when you get home!!!!  The bakery is amazing!!! And you can't go wrong stopping by the bucker for some meat.  The deli is tasty as well.  Theres a lot of imported food not only from Mexico but Europe as well.  They also now have a coffee shop and soft serve yogurt too.  Its worth the trip to this one.", "rating": "5", "date": [2014, 10, 17]}, "14": {"description": "I've never been in a cleaner more organized grocery store. Wow.", "rating": "5", "date": [2012, 5, 12]}, "4": {"description": "I always loved this store, always has what Im looking for when Im looking for it. If your looking for fresh meats and vegetables then this is the place to go.", "rating": "4", "date": [2014, 6, 5]}}, "neighborhoods": ["Hegewisch"], "latitude": 41.6809809207916, "longitude": -87.5390531122684, "rating": "4.0", "times": {"Mon": ["7:00 am", "9:00 pm"], "Thu": ["7:00 am", "9:00 pm"], "Sat": ["7:00 am", "9:00 pm"], "Wed": ["7:00 am", "9:00 pm"], "Tue": ["7:00 am", "9:00 pm"], "Sun": ["7:00 am", "9:00 pm"], "Fri": ["7:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Grocery", "grocery"]], "address": ["3448  E 118th St"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "21"}, "china-garden-chicago-2": {"comments": {"3": {"description": "Their Won-Ton soup is a religious experience.  Rich chicken broth, generous amount of perfect won-tons, super tender pork strips. Best EVER.  They also make the most incredible pot stickers and BBQ pork fried rice. I've ordered many different items and none have disappointed.Fast, efficient delivery and they have never screwed up an order.", "rating": "5", "date": [2015, 6, 9]}, "1": {"description": "I keep updating my review because this place bothers me one time it's good the next it's disappointing. We order the same thing damn near every time. Which is beef and broccoli, combo lo mein, and combo fried rice and sometimes sweet and sour chicken & crab Rangoon, it's always a damn problem with the combo Lo mein and beef and broccoli. Beef and broccoli: they always want to give you 5 pounds of vegetables and about 7 big pieces of beef. Really? it's not equal it's basically a broccoli dish with a few pieces of beef thrown in there, this is my third time ordering thinking they would get it right but no! It gets worse yesterday I order it again and I didn't get any damn broccoli they gave me broccoli LEAVES!! And greens beans!!! Wtf I damn near choked trying to eat these slimy tough leaves. No damn broccoli in sight I won't be ordering that again at least from this place. It's a fail every timeNow the combo Lo mein: they do the same give you 5 pounds of noodles with two shrimp and two pieces of chicken and about 4 little pieces of weird pork and veggies. Seriously they do this every time!!! Again another thing I will not be ordering ever again from here. I do like the rice and chicken that's about it. You guys at China star can't just give people whatever you want if I'm paying all this money for this food give me what I ask for stop trying to skimp on stuff and substitute items! You need to let people know if you are out of something or an item has changed because broccoli and broccoli leaves are waaaaay two totally different things! I wouldn't be complaining if this was once but it has happened 3 times!!!!", "rating": "2", "date": [2016, 2, 11]}, "2": {"description": "Good (average) neighborhood Chinese food. Order for pickup, tho.Egg rolls, good.Chicken wings,  good. Pot stickers, good.I could list everything I've tried, and it's all good. Not great, not bad.Not expensive. No frills inside.Don't eat inside.", "rating": "3", "date": [2015, 7, 9]}, "5": {"description": "Cheap, bland chinese food.  I tried it twice and I was disappointed twice.  I usually try for a very spicy kung pao dish... I got chicken here.  The chicken had a lot issues/inedible parts and the sauce had very little flavor, and it wasn't spicy at all even though I asked for extra spicy.  They also advertise bubble tea, I asked if they had taro flavor and they said yes (you KNOW what this is if you know chinese...) so I went back weeks later to order a taro bubble tea and no one there knew what taro was.  I felt like I was being punked.  So I skipped the bubble tea and decided to get Kung Pao again but with shrimp and asked them to make it very EXTRA EXTRA spicy.  Again, no spice, and the shrimp had a weird smell and flavor that reminded me of dry fish food.", "rating": "1", "date": [2013, 9, 17]}, "6": {"description": "Good neighborhood Chinese place.  It's a good value, not expensive with nice sized portions.  My family has tried lots of different food from all over their menu and we've pretty much always come away satisfied.  They're also on grubhub so that's a plus for me.", "rating": "4", "date": [2014, 6, 30]}, "7": {"description": "Although, the location and the interior is plain, the food is definitely the opposite. I love their General Tao's Chicken, one of the best I have ever eaten. I can't say anymore, you'll just have to go and try it out. Good luck and enjoy!", "rating": "4", "date": [2010, 10, 3]}, "8": {"description": "Definitely one of the best restaurant I have ever try, this restaurant provides great customer service and best quality of the food. The price is very cheap and you definitely need to try it out.", "rating": "5", "date": [2012, 2, 7]}, "9": {"description": "Actually a darned good neighborhood chinese restaurant. Good portions and quality.  My family loves the orange beef, pancit guisado, and egg foo among others.  Worth a try!", "rating": "5", "date": [2010, 12, 7]}, "0": {"description": "Hunan chkn.. organe chkn.. potstickers and crabrangoon was delish.. def recommend!! The price was right too..finally a great place close to home :)", "rating": "5", "date": [2015, 9, 2]}, "4": {"description": "Really good Chinese place in hegwisch, I got the wide noodle with seafood, I got so much food and such a big portion, also the smoothies are some of the best I've had, I've gotten mango and avocado so far, can't wait to go again!", "rating": "5", "date": [2014, 11, 8]}}, "neighborhoods": ["Hegewisch"], "latitude": 41.65279, "longitude": -87.547523, "rating": "4.0", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["11:00 am", "10:30 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["12:00 pm", "10:00 pm"], "Fri": ["11:00 am", "10:30 pm"]}, "price": "$", "categories": [["Chinese", "chinese"]], "address": ["13328 S Baltimore Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Has TV": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Delivery": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch, Dinner"}, "category": "Restaurants", "number_of_reviews": "10"}, "steves-lounge-chicago": {"comments": {"3": {"description": "This place is nothing short of amazing. The fish is fresh and fried perfectly. The pulled pork is tender and the sauce is delicious. I didn't have the chicken that others were raving about, but my husband did and greatly enjoyed it. We will be going back soon!", "rating": "5", "date": [2014, 6, 22]}, "1": {"description": "I enjoy going here to eat on Fridays. I'm still not even clear as to when the food is available, I do know it's not everyday. You eat in the banquet area of the bar. I got the fried perch which was very good but I thought was very expensive. Also, CASH ONLY! They will take your credit or debit card if that's all you have but signs posted everywhere inside states Cash Only. They were very nice about it since I forgot and had no cash with me.", "rating": "3", "date": [2016, 1, 30]}, "2": {"description": "I ordered 2 chicken dinners to go with potato pancakes and got some great potato pancakes.  Without sour cream. I mean you get sour cream when you eat in, why not some to go?The chicken was an overcooked, dark brown mess with too many balls of fat attached. You're supposed to pull that off people!On a good note, it was ready when they said it would be. If that's a priority. I dined \"in\" a couple of months ago, and had the chicken, and that time the breading was wet and falling off. They were out of potato pancakes then.The salad tray was great.If that's a priority.  A salad tray. I remember years ago it was alot better.", "rating": "2", "date": [2015, 4, 4]}, "5": {"description": "Steve's is a hidden jem in the frozen in time neighborhood of Hegwish on Chicago's far southside.  If you need a banquet hall, cateing for a film crew, a place to take a date on Saturday night, or a cozy bar to down a few cool ones with a buddy while watching the Sox game.  Steve's has it all and, it's all class.", "rating": "4", "date": [2011, 8, 16]}, "6": {"description": "I grew up in the area and remember their Friday nigt fish dinners we would frequently enjoy. I recently went to a birthday party at Steve's and was blown away by the chicken. Ive had White Fence Farm, Dell Rheas,and all of the other highly acclaimed chicken establisments around Chicago.This is by far superior. Worth the trip regardless of the distance.", "rating": "5", "date": [2013, 3, 4]}, "0": {"description": "Hey you guys, If you're lookin' for fried chicken to die for, Steve's Lounge is the place to find it.......and die they do!!!  Not from the chicken of course but from natural causes..... as Steve's is the place to meet up after you bury Uncle Stoshu at the Holy Cross Cemetery in Calumet City. You guessed right, Steve's is a Polish joint!I'm not kidding ya, Steve's is a well kept secret to most of Chicago!  They have the BEST chicken in town and let nobody tell you different. I drive out there if I'm having a party......and everyone is mystified by what kind of breading is on that chicken!  It's outstandingly delicious!  We can't possibly survive on just Asian, Low carb, Veggie and down it with a Slim Fast forever!  Where's the kapusta? Well, Steve's has that too! ...and yards of Polish sausage but, it's the chicken folks that keeps 'em coming back. Get it, it's the chicken!So drive on out to this vintage place, a throw back to the days when Mamie Eisenhower's bangs were still making headlines and when a real live band played at a doings (that's south side lingo for a Big Event).Call ahead, order it, \"the chicken,\" by the tray....It's cheap too!  Hey you guys!....A reminder, Lent is just around the corner!  Fabulous fish fry every Friday night too! Steve's also serves Italian sausage and mostaccoli but I never had either, I'm telling ya, it's the chicken!....Yes Gladys, there is life on Hegeweish!P.S.  The Chicken is available anytime. This is not a KFC,  you have to order it in advance... It's not a restaurant so to speak, it's a banquet hall. Order the chicken anytime.. Just call it in.", "rating": "5", "date": [2007, 2, 6]}, "4": {"description": "IMPORTANT INFORMATION BEFORE HEADING TO STEVE'S...The wonderful fried chicken that John Y. talks about in his review is ONLY available on Fridays. Listen, I'm sure it's wonderful. But I went an hour out of my way to check out the fried chicken at this place based on the previous review only to be told that it wasn't available on a Sunday. So, check it out ... but please keep that in mind before making a special trip.", "rating": "3", "date": [2008, 10, 12]}}, "neighborhoods": ["Hegewisch"], "latitude": 41.655346, "longitude": -87.547516, "rating": "4.0", "times": {"Mon": ["8:00 am", "8:00 pm"], "Thu": ["8:00 am", "8:00 pm"], "Sat": ["8:00 am", "8:00 pm"], "Wed": ["8:00 am", "8:00 pm"], "Tue": ["8:00 am", "8:00 pm"], "Sun": ["8:00 am", "8:00 pm"], "Fri": ["8:00 am", "8:00 pm"]}, "price": "$", "categories": [["Polish", "polish"], ["Lounges", "lounges"]], "address": ["13200 S Baltimore Ave"], "attributes": {"Noise Level": "Average", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Happy Hour": "Yes", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Delivery": "No", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Good For Dancing": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Bars", "number_of_reviews": "7"}, "puccis-pizzeria-chicago": {"comments": {"1": {"description": "Another great south side style pizza place. Grew up around the corner and had this a lot. This location doesnt have a dining area like the one on the East Side, but either way Pucci's offers some of the best thin crust on the south side. If you are ever in the Hegewisch/East Side area go Pudgie's or Pucci's. Both are solid choices.", "rating": "4", "date": [2011, 11, 16]}, "2": {"description": "Last couple of times I have driven by this place is closed.", "rating": "4", "date": [2012, 4, 24]}, "0": {"description": "Pucci's has excellent pizza!! Some of the finest in the area!!! Go there, and try it!! Chow Down!!", "rating": "5", "date": [2005, 8, 30]}}, "latitude": 41.653785, "neighborhoods": ["Hegewisch"], "categories": [["Pizza", "pizza"]], "address": ["13258 S Avenue O"], "attributes": {"Delivery": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.540237, "category": "Restaurants", "rating": "4.5", "price": "$", "number_of_reviews": "3"}, "monnie-ds-pizza-chicago": {"comments": {"3": {"description": "This is some of the worst pizza I have ever had.  I also ordered the chicken wings and they were on the same level of the pizza.  How do you mess up chicken wings?  Wood burning oven? The first impression is the most lasting.  It was awful.  If you want the best in Chicago head on over to Pizzeria Da Nela on Fullerton.", "rating": "1", "date": [2015, 12, 18]}, "1": {"description": "This place has only been open a couple of weeks. Early on, had trouble ordering because no one answered the phone, but I ordered yesterday. Large calzone with sausage and onion. This was mostly dough baked to a soft crust. Too soft. Almost to a soft pretzel consistency.  Hard to cut. Could have used more ingredients.  What I did taste had decent flavor, the sauce tasted like it was right out of the can.I also ordered a chicken dinner. Slight burnt taste, breading was nothing special.  Fries were hot but limp. Cole slaw was good.", "rating": "3", "date": [2015, 6, 29]}, "2": {"description": "Had their brick oven pizza today, it was ok. The sauce had a funny after taste, a bit metallic. Will go back and try their chicken or alligator. I'll pass on pizza.", "rating": "3", "date": [2015, 10, 9]}, "5": {"description": "Best pizza in Hegewisch. Brick over pizza was awesome. Route 66 or Monnie D's if you're on the south east side of Chicago", "rating": "5", "date": [2015, 6, 26]}, "6": {"description": "Pizza is not very tasty... Have ordered 2x and am not very thrilled about this place. Oh, and it's kind of pricey..", "rating": "2", "date": [2015, 8, 19]}, "7": {"description": "I have my set , reliable pizza joints, so I was a lil Leary . my neighbor had some fresh  leftovers . if was great . Since then we tried it on our own. Well worth a try", "rating": "5", "date": [2015, 10, 20]}, "8": {"description": "I placed an order for a pepperoni pizza and wings.  The pizza was chewy, the cheese tasted moldy and the sauce didn't have any taste at all.  My family compared it to Little Caesars, with Little Caesars winning.  The wings were good, large and meaty, the hot sauce was out of a jug and ordinary.  Doubt we will try again, I've experienced AMAZING brick oven pizza and this was so bad we ended up throwing it out.", "rating": "2", "date": [2015, 10, 29]}, "9": {"description": "Monnie D's Pizza was recommended from several friends in the \"old neighborhood\". Last weekend we were surprised with a visit from out-of-town guests (New York). We ordered the pizza, chicken wings and jalapeno poppers.  Our guests raved about the food and asked if they would ship this pizza to Islip, New York.   I think Monnie D's Pizza will put Hegewisch on the \"map\".  Our house guests said that they were going to contact Guy Fieri!", "rating": "5", "date": [2015, 6, 9]}, "0": {"description": "The thin crust pizza is awesome the customer service is very friendly. great addition to the hegwisch neighborhood.", "rating": "5", "date": [2016, 2, 11]}, "4": {"description": "Best Pizza in Hegewisch!!!  Just opened a month or so ago, great customer service, great food- A+ Great job love...", "rating": "5", "date": [2015, 7, 7]}}, "latitude": 41.653003692627, "neighborhoods": ["Hegewisch"], "categories": [["Pizza", "pizza"]], "address": ["13320 S Baltimore Ave"], "attributes": {"Attire": "Casual", "Waiter Service": "No", "Take-out": "Yes", "Accepts Credit Cards": "Yes", "Good for Groups": "Yes", "Alcohol": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.5475234985352, "category": "Restaurants", "rating": "3.5", "price": "$", "number_of_reviews": "10"}, "green-olive-chicago": {"comments": {"3": {"description": "This out of the way neighborhood bar is a nice setting.", "rating": "4", "date": [2013, 5, 16]}, "1": {"description": "Simply saying, either you charge 4.50 for a Modelo or you have holes in the bathroom walls. You can't have both.", "rating": "2", "date": [2015, 7, 23]}, "2": {"description": "High school and grammar school reunion ever time I've gone lol. Bartenders at the main bar are all over the place and don't have set sections. Drinks are cheap but not that tasty since they use well liquor when you ask for top shelf and then play dumb when you call em out on it. Waitresses are fairly useless once the bar gets semi full. I think they decide its ok to just kick it with their friends while on the clock and then complain about lousy tips. Here's a tip, DO YOUR DAM JOB! They have a \"No Hat\" policy which is outdated at best but fine don't allow ball caps but if someone is wearing a kangol or fedora style hat, use some common sense and leave him be. The door men are good but the lady checking Ids and complaining about everything once you walk in needs to go. You don't want that greeting you when you walk in. Truth be told I haven't been to this bar in over a year partly because I live out of state, so for all I know the bar has improved. I doubt I'll ever go back to this place unless I'm in a car full of people that all want to go there. Even then I'd likely suggest we go someplace else.", "rating": "2", "date": [2013, 11, 23]}, "5": {"description": "I only gave this place one star because it was my only option. In reality this place is a negative one million stars. I usually went here because a couple of my freinds were under age and needless to say they allow anyone in there. After talking to the owner a few times while there he asked me if I would be willing to bartend there because he knew I had bartending experience. Because of the fact that I had extra time on my hands I agreed. First off, this place should be shut down for multiple health code violations that I discovered while working there. The bathrooms are distgusting and are never cleaned, there is urine on the floor and walls and you can smell it from 10 feet away. I guess I shouldnt be surprised considering it is in Hegwisch, im sure there regular customers feel right at home. They offer a food menu. I discovered, after talking to \"the cook\" that the frying oil they use has not been changed in over a year. There are mouse dropping everywhere including on the cooking surfaces and I spotted mice on multiple occasions. As for the bar, upon being \"trained\" I was asked to save all bottles that would be considered top shelf or premium such as grey goose, patron, bacardi etc. Why would you save bottles you ask, so they can re-fill them with well vodka, rum, gin, and tequila. The well that they use is Bellows which costs about 6 dollars a bottle. I do not understand how a shady buisness like this manages to keep their liqour license. I would say about 50% of the crowd is under the age of 19. While working, I attempted to kick someone out who failed to show proper identification, the owner LUIS DEPOZO explained this person was okay to stay there. I refused to contribute to illegal activity and did not return to work there.  Overall this place is an embarrasment and should be shut down due to all the dubious activities.", "rating": "1", "date": [2012, 2, 16]}, "0": {"description": "Okay, if anyone is from the Southeast Side, be informed that this is the ONLY halfway decent place in our area that's good for those nights when you want to stay local instead of heading DT or the Northside to party...Anyhoot, with that being said, this place is essentially like \"Cheers\" and EVERYONE KNOWS EVERYONE here. Partying here usually turns into a mini-high school and grammar school reunion. But overall, great spot...DEPENDING on the night. This place usually gets crackin' when the owner (Joe Pope, brother of Alderman of 10th Ward John Pope) decides to host special live musical acts and DJ's. However, those nights are far and few in between. Which is why I only frequent this place every few months. If you can't make it to one of these \"special\" nights, the best nights to frequent are Friday and Tuesday nights. Friday is dance party night and Tuesday they have $2 Modelos on draft (Modelo is my favorite beer, btw). Overall, the place is super cozy (plenty of tables and couches and cute decor), has a shuffle board, three large screen TV's for game viewings, and hosts indoor bean bag sessions on Mondays (when martinis are $4...they basically make ANY martini you can think of as well..try the Banana Split martini...lethal AND scrumptious).I've also hosted two birthday parties here. Joe (the owner) and his wife Marie were VERY helpful in helping me orchestrate everything. And were very cool about letting buy out the bar and letting my friends and family take over the place! lol. Their food and catering are also very delicious. I recommend everything on the menu. Except for mozzarella sticks (the marinara sauce is generic) and \"crispy tacos\" (essentially, they're those taquito things!).", "rating": "4", "date": [2010, 7, 20]}, "4": {"description": "The Green Olive is a pretty cool place that I wouldn't necessarily expect to find in Hegewisch.  I don't know what was there before this place opened but I presume the Olive is an improvement.  It has a nice decor inside, not overwhelming or ridiculous in any way, very nice and understated; it maintains the feel of a neighborhood watering hole without being dive-y while easily being a place you wouldn't feel ridiculous looking halfway decent walking into.  It gets pretty packed on the weekend, but that's ok because theres plenty of room.  It's definitely much bigger than one would think from the outside. The drinks are affordable, and there is usually some kind of special going on.  I haven't tried much of the food, and of what I have had was standard bar fare, but it was decent.  Regardless, I feel it's good to have the option for munchies, even if they are deep fried....it's a bar whaddya expect?!For where this place is located it's a nice alternative to the local dives or driving northwards in search of a good time.I have only two complaints:  the Olive is in a residential neighborhood, so when it's crowded or a weekend the parking sucks.  Second, there always seems to be a squad car hangin around in front (the bar is on a corner) on Friday and/or Saturday.  I don't know if it's because of complaints from neighbors, a previous incident, or merely a preventative measure on the part of the CPD, it sucks to have to be slightly paranoid leaving a bar after having fun.  I know thats not the bars fault so I guess thats a personal complaint. Overall, its a good place in an unlikely location that not only succeeds but deserves to as well.", "rating": "3", "date": [2010, 2, 24]}}, "neighborhoods": ["Hegewisch"], "latitude": 41.6498756408691, "longitude": -87.5383071899414, "rating": "2.5", "times": {"Mon": ["3:00 pm", "1:00 am"], "Thu": ["3:00 pm", "1:00 am"], "Sat": ["5:00 pm", "3:00 am"], "Wed": ["3:00 pm", "1:00 am"], "Tue": ["3:00 pm", "1:00 am"], "Sun": ["4:00 pm", "1:00 am"], "Fri": ["5:00 pm", "3:00 am"]}, "price": "$", "categories": [["Bars", "bars"]], "address": ["13501 S Avenue N"], "attributes": {"Good for Groups": "Yes"}, "category": "Nightlife", "number_of_reviews": "6"}, "love-nails-chicago-2": {"comments": {"1": {"description": "This is my go to nail spot!!! I have tried so many nail salons and this is by far the best one! Brian is the best! He literally knows all his clients by name and its always a great time when your there. They have a great color assortment and change colors for the seasons. They carry mostley OPI, Essie and Orly which is great, anything you would like done to your nails he def can make it happen! Great place!", "rating": "5", "date": [2013, 3, 7]}, "2": {"description": "I had never been to Love Nails before until recently. I am never going back to any other nail place again! They are great here. Give you exactly what you want, very respectful, and very friendly with clients. Nail techs even know the names of clients that walk in. Love this place!", "rating": "5", "date": [2014, 5, 30]}, "0": {"description": "Best place to go! I'm always satisfied & very inexpensive:) all the workers know what they're doing & even if you're a walk in, they find the time for you & still do it great unlike some places :)", "rating": "5", "date": [2015, 12, 30]}}, "latitude": 41.6809735447168, "neighborhoods": ["Hegewisch"], "categories": [["Nail Salons", "othersalons"]], "address": ["3536 E 118th St"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.537307664752, "category": "Beauty", "rating": "5.0", "price": "$$", "number_of_reviews": "3"}, "doreens-pizzeria-chicago-2": {"comments": {"12": {"description": "I remember my father ordering here a.lot in the early 1990\"s. The pizza  was really hot/fresh and made from scratch. I remember ordering the 4 piece chicken dinners and the pieces were big. However,  as the years went on the food became lower quality and smaller. The last time I ordered there was 2002 and got a gyro pizza thinking it would be good wasn't. The pizza wasn't made from scratch anymore and the chicken dinners were smaller and not good. I understand business is buisness and sometimes owners have to do to stay in business.", "rating": "4", "date": [2014, 10, 12]}, "7": {"description": "Not happy.Doreens advertises daily price specials....They don't honor it unless you say that you want the savings. What happened to honoring the savings you advertise? Rip Off", "rating": "1", "date": [2015, 1, 18]}, "19": {"description": "Even though the pizza is frozen when you get it in the oven and on to your plate it's very good. It's seasoned, and very cute! Great for a date with a french theme. Come on use your imagination.", "rating": "5", "date": [2005, 11, 7]}, "1": {"description": "Ordered in the Italian beef and garlic bread with a small fry what I got was re-cook fries and a beef with more bread than beef and beef was cold took them 20 to 25 minutes just to make one beef sandwich", "rating": "1", "date": [2016, 3, 2]}, "2": {"description": "I've only had their pizza, French Fries, Curly Fries, Jalapeño Poppers and Cheese sticks. It's all pretty delicious! I also receive their text messages o see what coupons/deals they have going on each week. Everyone likes deals! Customer service is great!", "rating": "5", "date": [2015, 12, 27]}, "9": {"description": "since i moved to area i do like doreens the pizza is thin but we just get when they text specials but for the price y ou cant go wrong- we order salads italian beef the foodi", "rating": "4", "date": [2015, 8, 21]}, "6": {"description": "This is an update.... Ok so here's the thing I have had Doreen's pizza a few times now the slices in the afternoon are ok but what gets me is when I order a whole pizza. It has happened twice now I have ordered a pizza for my family actually it was a meal with chicken and fries and what not; the first time my whole family was sick the next day with diarrhea and stomach aches.... Then two weeks later I was starving but wanted some pizza which was last night and I said let me give them a try again... And guess what the same thing has happened we always order sausage pizza. I threw up last night after eating the pizza and I'm still nauseous and so is the rest of family. We got sick twice from this pizza place when we order sausage I'm not sure what is going on the sausage must not be good or they are cross contaminating. Wow my family will NEVER be going to this pizza place again! And it's sad because it's literally a five min drive if that. I would say beware and don't order late.", "rating": "1", "date": [2015, 10, 19]}, "18": {"description": "Jackie L., you're absolutely right about Doreen's Pizza !  I love it.  Lee Han J., I hope your name isn't a clue to your inexperience.  If you can't tell a frozen pizza from a Fresh One, you must be from New York or California.  Doreen's is the REAL THING.  And there sandwiches are also fabulous.  Try the Godfather, Italian Beef with sweet or Hot Peppers and a topping of melted mozzarella cheese on it.   A cold MGD (not from here) and a good College or Pro-Football team on the tube.  It don't get no better than this.  Doreens's must have started about 15 years ago, and its been going strong ever since.  Doreen's joins the other Staples of the South and East Side, Calumet Fisheries and Heinez's Chicken.  Oh yeah, I've found another Chicken House, right on 106th St. Gina's Chicken, but that's another review.  Doreen's is, I guess, a real Pizza Dive, but its well worth a visit.  Price Ranges from about $5.00 per sandwich to well over $20.00 for a Pizza, depending what you want on it.  And I know they make at least a 16 inch manhole cover.", "rating": "5", "date": [2009, 11, 21]}, "10": {"description": "Heard a lot of great things of this place several people have recommended it so went ahead and ordered a pizza. First time I was not content, it was really greasy and the taste was not great at all.   I like to try places a second time because there might be a different cook who does it differently but it came the same, I'll definitely never order from this place again and would not recommend it to anyone.", "rating": "1", "date": [2013, 12, 14]}, "13": {"description": "Hello, FOOD SNOB here.While driving thru Hegewisch Town today I remembered Jackie L. review on Doreens.  They  sell Pizza by the slice which was good since I did not have a lot of time.   Hegewisch always brings back old High School memories for me, since I went to High School with a lot of people from here.    The store front is kind of reminded me of one of those old corner neighborhood Bars that are Quickly becoming extinct.  Most of you know what i mean.The Pizza is the Old Fashion type, thin crust with Corn Meal baked into the bottom, YUM.  Kind of like the old Johns Pizza from the Cal City Strip but much firmer.    This was Pizza before the Big Franchises ruined the Quality of Pizza.The Cheese and the Sauce tasted very fresh, especially the Cheese  with the little bit of grease on the top was very tastey.  This makes for a good lunch or late night snack.The dining area is nothing fancy,  but the outdoor seating in the back is nice.", "rating": "4", "date": [2010, 4, 16]}, "16": {"description": "Incredible I own two homes one in calumet city 2 miles away from this establishment and one in Hammond about 3 miles from it and  they won't deliver to calumet city obviously it's closer yet they can't give me an explanation as to why they would deliver to Hammond but not Calumet.  I could sense this place still discriminates based of demographics.  Spoke with Lena and some other unhelpful person the more I questioned why they couldn't deliver the more excuses they came up with.  First question i asked was about their mileage distance they stated 7 miles again calumet city only 2.5 miles away.  Then they tell me they just don't deliver there because they don't want to the second person Lena rude would't even apologize for the inconvenience both I presume were White descendant just pathetic that in 2013 we still have establishment discriminate based of skin race and color.  By the way I proudly served my country and I am disappointed you've been able to stay in business with this long.", "rating": "1", "date": [2013, 6, 12]}, "17": {"description": "Best pizza in Hegewisch", "rating": "5", "date": [2011, 5, 17]}, "15": {"description": "So, I'm not sure why this entry is called \"Doreen's Gourmet Frozen Pizza,\" because that can be misleading! This address is for their take-out pizza place in Hegewisch...The frozen pizza is actually made in Cal City. This is the real, fresh, deal here!So, I grew up on the East Side (the southernmost neighborhood that borders the lake, not the\"new\" East Side which is just an extension of downtown), and there were pizza places aplenty: Bob & Jacks, Giappo's, Pucci's, Waldo Cooney, etc. At age 21, moved to Hegewisch (THE southeastern most neighborhood in Chicago) and was at a loss because I was so used to having Bob & Jack's on pizza night and suspected Hegewisch had nothing that lived up to B&J's. I was wrong.I think Doreen's is the best pizza on the Southeast Side. Yes, even better than the now-closed but much beloved Giappo's (which, yes, was pretty darn good but the service was awful!).So, at first glance, Doreen's appears to be another dime-a-dozen pizza/sandwich/Italian take-out place. I mean, they do serve pizza, sandwiches, pastas, salads, chicken, etc--but it's truly quality stuff! The thin-crust pizza is perfect: not cracker-thin, but not too bready, dusted with a little cornmeal, sauce has a nice tang to it, cheesy, sausage perfectly savory, and a nice little amount of grease on top. Call me crazy, but I like my takeout pizza a lil'greasy. I'm ordering takeout because I want to be bad!I've had their wings at parties and they're pretty tasty...Dig the Italian meatball sandwich...Mmm...So meaty! Lots of great choices for the hungry!I'm reviewing from a takeout standpoint since I lived about 2 blocks away so always picked up my order...They do offer delivery too, though! And, there are a few tables for eat-in if you choose...Although, it is pretty toasty in there from the pizza ovens and all. Not a lot of separation between the dining area and kitchen-quite small! And, yes, this is the same Doreen's you may see the frozen version of in your local grocery store. Except, they make those in Cal City. And I've never tried the frozen stuff--why when I have access to the real deal?Admittedly, I do not live in Hegewisch anymore so I don't get to enjoy Doreen's as often as I used to. But, my parents still live in the neighborhood, so it's a treat when they order pizza when I'm hanging around.", "rating": "5", "date": [2009, 10, 22]}, "0": {"description": "They have the super thin crust. The one I dream of when away from Chicago. Mushrooms tasted like they were from a can. The crust was nearly perfect and the sauce was okay. They were fast. It was cold outside. I would order again.", "rating": "4", "date": [2016, 1, 21]}, "5": {"description": "Good place for a quick bite for low prices if you're in hegewisch, got 2 pizza slices and a drink for $7, good deal for sure, lots of other items looked good too, would def return if im in the area again", "rating": "4", "date": [2015, 1, 26]}, "11": {"description": "I previously left a critical review of this establishment, but after giving them several more chances, I must modify my review. They have corrected the previous issues I complained of. Thank God they did, because this one of the best pizzas I've had in Chicago. Very good, and addictive.", "rating": "5", "date": [2015, 1, 16]}, "8": {"description": "The pizza is pretty good. Ive also catered from here for parties and their prices are reasonable as well.", "rating": "4", "date": [2014, 10, 31]}, "3": {"description": "Not sure why it took them 30 minutes to dish out 2 bbq beefs, but it did. Worth the wait? NOPE. The sandwiches looked like they had been done & sitting on top of the oven for the past 30 minutes. Soggy, bread falling apart & sticking to their wrapping. The can of Pepsi was ok. The sandwiches tasted ok, we just had to 'fork it'. Not cool after waiting 30 minutes for a 'sandwich'.", "rating": "2", "date": [2015, 12, 2]}, "14": {"description": "Good Stuff! My sister works near by and sometimes brings home a treat of Doreen's Sausage and Cheese. One day I was visiting when she brought pizza, and boy o boy, it was pretty good!! I had no idea.", "rating": "3", "date": [2010, 12, 17]}, "4": {"description": "This is hands down my favorite pizza. It has the perfect cheese and sauce to dough ratio which for me is a lot of cheese and sauce on a relatively thin crust. The dough is perfectly chewy inside and crisp on the outside. The cheese is just good cheese not overly salty or anything, the sauce has a distinctive tang to it that cuts the richness of the rest of this pizza and I've never tasted this anywhere else, it makes it extremely unique. Their menu talks about how they are very particular about their ingredients and I totally believe it, you can taste the difference. A little pricey, but worth it, tastes just as good cold or reheated. Come try this place, it's far probably for most people that aren't from Indiana or the Southside but it's honestly like no other pizza I've had.", "rating": "5", "date": [2015, 11, 18]}}, "neighborhoods": ["Hegewisch"], "latitude": 41.6553802490234, "longitude": -87.5467681884766, "rating": "3.5", "times": {"Mon": ["10:00 am", "10:00 pm"], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "11:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": ["12:00 pm", "10:00 pm"], "Fri": ["10:00 am", "11:00 pm"]}, "price": "$", "categories": [["Pizza", "pizza"]], "address": ["13201 S Baltimore Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "Yes", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch, Dinner"}, "category": "Restaurants", "number_of_reviews": "20"}, "papi-chulos-bar-and-grill-chicago": {"comments": {"3": {"description": "Husky blonde wouldn't serve us because she did not understand the concept that sometimes states updates the design of their driver licences. She assumed they were fake. Place was greasy and so was she.", "rating": "1", "date": [2015, 3, 29]}, "1": {"description": "If you're storing your boat its a nice precursor to windjammers.  Great staff and facilities.   The wings were hot the beers were cold!What more do ya want?", "rating": "4", "date": [2014, 10, 30]}, "2": {"description": "Good Wings and always a beer deal. It's fun to dock the boat and grab a bite to eat. But then again there aren't any other options. Waitresses are always friendly", "rating": "4", "date": [2015, 5, 3]}, "5": {"description": "This hidden gem serves burgers, sandwiches, wings, and a full array of spirits. A large beer garden overlooks the river and live music acts are often playing on the outside stage. It's popular among locals but also boaters. The bar tenders are pleasant and pleasant to look act. Give this place a visit. You won't be let down.", "rating": "5", "date": [2011, 5, 22]}, "6": {"description": "I love this place!  Especially in the summer time.", "rating": "4", "date": [2012, 11, 19]}, "0": {"description": "Nothing special but good food. Environment was boring but would defiantly recommend this resturant to anybody.", "rating": "4", "date": [2015, 8, 4]}, "4": {"description": "Good for a Burger & Beer & Shot & Shot & Shot & Shot & Shot! Hahaha. Fun in the Summer with the outdoor stage and beach volleyball.", "rating": "2", "date": [2014, 1, 26]}}, "neighborhoods": ["Hegewisch"], "latitude": 41.647575378418, "longitude": -87.5613784790039, "rating": "3.5", "times": {"Mon": ["11:00 am", "2:00 am"], "Thu": ["11:00 am", "2:00 am"], "Sat": ["11:00 am", "2:00 am"], "Wed": ["11:00 am", "2:00 am"], "Tue": ["11:00 am", "2:00 am"], "Sun": ["11:00 am", "2:00 am"], "Fri": ["11:00 am", "2:00 am"]}, "price": "$$", "categories": [["Bars", "bars"], ["American (Traditional)", "tradamerican"]], "address": ["13601 S Calhoun Ave"], "attributes": {"Noise Level": "Very Loud", "Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Happy Hour": "Yes", "Caters": "No", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "Yes", "Coat Check": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Good For Dancing": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good for Kids": "No"}, "category": "Restaurants", "number_of_reviews": "7"}, "subway-chicago-155": {"comments": {"0": {"description": "I went to eastside plaza subway was great experience.  They got fresh bread and my sandwich was so delicious.", "rating": "5", "date": [2015, 3, 21]}}, "latitude": 41.6809735447168, "neighborhoods": ["Hegewisch"], "categories": [["Fast Food", "hotdogs"], ["Sandwiches", "sandwiches"]], "address": ["3538 E 118th St"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Delivery": "No", "Outdoor Seating": "Yes", "Alcohol": "No", "Caters": "Yes", "Takes Reservations": "No", "Waiter Service": "Yes", "Bike Parking": "Yes", "Good for Groups": "Yes", "Drive-Thru": "No", "Good for Kids": "Yes"}, "longitude": -87.537268102169, "category": "Restaurants", "rating": "5.0", "price": "$", "number_of_reviews": "1"}, "alejandros-mexican-restaurant-chicago": {"comments": {"3": {"description": "Phone disconnected as of May 23 2012", "rating": "1", "date": [2012, 5, 25]}, "1": {"description": "Came here for the first time several months ago by accident.  There was a train blocking the street and instead of waiting for it to clear, decided to park in the nearby parking lot and try the restaurant there.  Looked kinda gross from the outside, but it was clean inside. The owners were very friendly.  They were very welcoming and gave us free tastings of the prepared food.  They had carnitas that day that we tried that and also were given free ice cream.  The selection is not that great...they seemed to be out of alot of menu items.   We ate there about twice a month but I believe they may be closed now.  Phone first!  The three star rating is for not having the menu items available.", "rating": "3", "date": [2011, 12, 1]}, "2": {"description": "I love this place.  I met my GF here and we go at least once a month.  The margaritas are the best.  The food is great and the menu has a lot of options", "rating": "5", "date": [2012, 12, 19]}, "0": {"description": "I've passed by this place many times over the past few years. My coworkers and I ended up deciding to try this place after being stuck waiting for the train. The outside looks deceiving, but when you go inside, it's pretty clean and their menu is large. One thing though, they have items on their menu that they sometimes don't have or run out of. I know that I've been wanting to get Elotes. Every time that we've been there or ordered to go, they have not had it. There has also been a time when we tried to order guacamole and they said they ran out. So, if you want to come here, try to order what they have already prepared. You can see it at the cash register. They have a counter with a glass cover where you can see the food that they have available for that day. The service is awesome though! They are very friendly and the food is pretty decent and cheap. They make their roasted pork on Friday mornings so usually when we go, we sometimes get to try it. Other than not having certain items on the menu, their food is good, cheap, and a quick lunch spot.", "rating": "3", "date": [2011, 8, 31]}, "4": {"description": "Would give this place more stars because the food is good, but it's been closed a lot lately, now the phone is disconnected...soo... who knows.", "rating": "3", "date": [2011, 11, 25]}}, "latitude": 41.6593132, "neighborhoods": ["Hegewisch"], "categories": [["Mexican", "mexican"]], "address": ["2642 E 130th St"], "attributes": {"Attire": "Casual", "Alcohol": "No", "Has TV": "No"}, "longitude": -87.5586853, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "5"}, "los-cantaritos-chicago": {"comments": {"3": {"description": "I enjoy ordering the pozole on the weekends for delivery quick and fresh! Friendly staff too! Couldn't ask for a better Lil place if you are in the mood for Mexican food!", "rating": "5", "date": [2015, 9, 6]}, "1": {"description": "Hmmm a bit conflicted when it comes to this place. I'm very particular about my Carne Asada, this place has good steak overall not full of gristle and fat or anything like that but for some reason they season it with cumin which I've never tasted in any other Mexican place and I see why, because it honestly ruins the natural flavor of the meat and makes it taste like armpit. It's a bad choice I wish they would stop, however I will say their Chiles rellenos are very good and are what I stick to when I come here and happily so also this place is pretty cheap. Give it a try, unlike me you might enjoy their cumin seasoned meat.", "rating": "4", "date": [2015, 11, 18]}, "2": {"description": "Fantastico!  Completely went there on a whim , looking for something quick to eat nearby the old stomping grounds and was VERY pleased. Guacamole was fresh and excellent as well as the salsa. They happily made a custom order for me - Fajitas camarones con chorizo and they nailed it! Huge shrimp perfectly cooked and seasoned. Yum. Yum. Yum. Definitely going back when I'm in town again.", "rating": "5", "date": [2015, 6, 5]}, "5": {"description": "Love this place for the steak tacos with cilantro, onions and cheese. Probably the best taco spot in the area. Not much to look at but their food is great. Just found out it's a byob spot now , so I will be going there more often.", "rating": "5", "date": [2015, 3, 21]}, "6": {"description": "Come and enjoy pretty spot on Mexican food. Taste and portions were good, byob for those looking for a nice quite little spot with good food and enjoy your own beer.", "rating": "5", "date": [2014, 10, 12]}, "7": {"description": "Found ourselves cycling through Hegewisch, and terribly hungry. Found this place and decided to try it. I'm so glad we did! Surprisingly good Mexican food (not sure why it's listed as American) with the friendliest service you can imagine. Price is great too.", "rating": "5", "date": [2015, 7, 4]}, "8": {"description": "Casual Mex in Hegewisch.I greatly enjoyed their Carne Asada tacos.Service was prompt and friendly.Looking forward to my next visit.", "rating": "5", "date": [2011, 1, 17]}, "0": {"description": "The fried potato tacos were delicious.", "rating": "5", "date": [2016, 1, 20]}, "4": {"description": "Little family place with good food. Friendly wait staff. The posole, menudo, and tamales on the weekend are great.", "rating": "4", "date": [2015, 8, 4]}}, "latitude": 41.652378, "neighborhoods": ["Hegewisch"], "categories": [["Mexican", "mexican"]], "address": ["13343 S Baltimore Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "longitude": -87.546776, "category": "Restaurants", "rating": "5.0", "price": "$", "number_of_reviews": "9"}, "chicago-pita-kitchen-chicago": {"comments": {"12": {"description": "Great food , great prices, on the southeast side!", "rating": "4", "date": [2013, 1, 6]}, "7": {"description": "Must say I'm a very picky person when it comes to food.... But I gave it a shot and I really liked it! Had a the original drago bobs and they were delish!!! I will def b back!", "rating": "5", "date": [2014, 8, 6]}, "19": {"description": "I had the lamb dinner over rice, with Greek salad.  Very fresh, very good.  The staff was pleasant and the restaurant has a nice outdoor eating area.  I should've known better than to go to a Greek-inspired fast food place and not get baklava or greek lasagna (what was I thinking?!?).  Oh well, I guess I'll have to go back--", "rating": "4", "date": [2010, 5, 24]}, "1": {"description": "My favorite souvlaki around. Won't deny that I didn't expect much after seeing the outside and inside, but it was amazing. The soup wasn't anything to rave about, but still good. Again, the real champs are the souvlaki and gyro. They also have a lamb sandwich and lamb on the weekends, so I'm excited to try it. Also, the workers were very friendly. Can't wait to go back.", "rating": "5", "date": [2015, 8, 13]}, "2": {"description": "Ok so one time I ordered a hot dog and it even came with an actual dog hair, but other than that Im very glad that Chicago Pita exists near my house because theres not much to choose from and  that isnt always a bad thing. I always get their chicken/chicken kebob pita and the Olympic Pita pita bread they use is THE best, its always so soft and buttery. The fries are delish and their salmon is very good as well. Their salads are always generous and fresh. This place is one of the best things around and if you like cops they cant enough of this place with good reason.", "rating": "5", "date": [2015, 3, 31]}, "9": {"description": "Awesome. Especially in an area were there is basically nothing else to eat. Been here a few times and will keep coming bAck.", "rating": "4", "date": [2014, 3, 10]}, "6": {"description": "Came here for the first time with a friend who gave them the upmost props, and I was back the very next day, I must say I've only tried the #1 Chicken Kabob Draggo style and it's delicious very flavorful, you just get the impression all there food is good, gonna go back on a weekend for the Lamb & Rice dinner or Lamb Sandwich", "rating": "5", "date": [2015, 1, 9]}, "18": {"description": "This place is awesome! Used to live blocks away...now I'm about 20 mins away in homewood, but still make the drive out for their food.  The place is alway really clean, employees are friendly. I recommend the ultimate steak sandwhich and souvlaki beef pita.   I am sure the place is hard to keep cold in the summer because of all the windows, and doors on both sides of waiting area that are always opening because they are busy... don't know that's something they can fix.  (Referring to earlier reviews)..  I wish they delivered to homewood!...", "rating": "5", "date": [2012, 2, 26]}, "10": {"description": "Standard Greek fast food, but with a really nice catering menu. This is kind of out in the middle of nowhere (went here going to get gas in Indiana), but it was a pleasant surprise to come in and get good food.Only qualm would be it's freezing in there when I went. It's like they can't afford to heat the place!", "rating": "3", "date": [2010, 1, 1]}, "13": {"description": "The Dra-Go'sssss are the bomb!  The original pork are the best. Don't forget you can buy them by the pound and cook them at your next cook out.", "rating": "4", "date": [2012, 7, 27]}, "16": {"description": "This spot is the BEST!!!! I eat here at least once a week.... The Chicken Drago pita and skewers are excellent!!! The staff there are AWESOME!", "rating": "5", "date": [2013, 8, 29]}, "17": {"description": "Good food, slow services, small seating area, reasonable prices", "rating": "4", "date": [2013, 6, 3]}, "15": {"description": "The best grilled chicken both as a souvlaki and as a sandwich I ever had!", "rating": "5", "date": [2009, 11, 20]}, "0": {"description": "They have legit gyros, spinning in the back. Had so much meat on my pita I had to get a to-go box (or get another pita and have another gyro)! My buddy thoroughly enjoyed their loaded hotdogs. Everything looked good and haven't heard a complaint from anybody I've gone with. One coworker actually said CPK had the best gyro ever! The staff was friendly and prompt. Plenty of business moving through so you got fresh goods as well. Ice cream for the kids!", "rating": "5", "date": [2011, 1, 4]}, "5": {"description": "I have been going here for years they have the best food I've had the people are very friendly and the prices are just right", "rating": "5", "date": [2015, 3, 7]}, "11": {"description": "Have been eating here for awhile now. I always like to order my food by phone and pick it up to avoid waiting inside since space is limited. The food is always consistent. I really like their fries and salmon pita lunch special. Their lunch specials are decently priced and I end up eating here about 2-3 times a month because it's close to work and good. There is a limited amount of places that make good food in the area that isn't a fast food chain.", "rating": "4", "date": [2011, 8, 31]}, "8": {"description": "This place is pretty nice and cozy. It's mainly a roadside deli with a parking lot. Seating consists of a row of bar stools across from the counter. The menu has around 30-40 items or more, mainly fastfood greek, like pitas, gyros hotdogs and roasted meats. They also have salmon. The set meals include a soft drink and fries. They also seem to have ice cream too.I had a pita with chicken kebobs in it, there was meat aplenty. The chicken was well grilled. I didn't really like the cream chicken and rice soup that I got though...", "rating": "4", "date": [2012, 11, 20]}, "3": {"description": "Where do I begin..... I have eaten here over a dozen times, yes the food is somewhat good, but mostly out of necessity due to the close proximity to my work.  But, honestly, lately the food quality is in the toilet, the food is cold, and soggy.  The delivery time is ridiculous.  Hire more drivers.  The woman who answers the phone is BEYOND RUDE, she is very aggressive and actually somewhat insulting when you call to place an order.  NEWSFLASH.... CUSTOMER SERVICE...... I decided yesterday after I ordered a meal never to return because this woman was so beyond rude to me when I called. We usually place big orders two to three times a week, I will go elsewhere and gladly give my money to a business that treats their customers with at least a surface level of respect.  I have ordered from this place over a dozen times, each and every time I speak with this woman she is SO RUDE.", "rating": "1", "date": [2015, 9, 3]}, "14": {"description": "This place has great food.  The owner/workers are always nice.  The prices did go up a bit in the last year tho.  I didn't like that since our lunch crew eats from here about twice a week.  The chicken souvlaki pita is good, and so is the salmon dinner.  The ice cream is REALLY good.  I wish it were cheaper tho because then I would have it every time I go.  The prices for that are pretty ridiculous...sometimes more than the meal.  I know it's homemade, but c'mon!  Another thing...sometimes, usually in the summer, they can take FOREVER to get the food ready.  We will phone in an order ahead of time but it doesn't matter.  We still end up waiting IN LINE a long time to pick up the food.  They really need to have a \"pick-up\" line along with an \"order\" line.  One more thing...PLEASE make sure the air conditioner is in top working order in the summer.  Those guys are sweating bullets sometimes and it is really gross.  We stopped eating there for awhile because of that.", "rating": "4", "date": [2011, 12, 1]}, "4": {"description": "Had a concern and management took the time to address the problem, way to go Andrew!", "rating": "4", "date": [2015, 3, 12]}}, "neighborhoods": ["Hegewisch"], "latitude": 41.654968, "longitude": -87.553894, "rating": "4.5", "times": {"Mon": ["10:00 am", "10:00 pm"], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "10:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": ["10:00 am", "10:00 pm"], "Fri": ["10:00 am", "10:00 pm"]}, "price": "$", "categories": [["Greek", "greek"]], "address": ["13227 S Brainard Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "No", "Ambience": "Casual", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "20"}, "pudgys-pizza-and-sandwiches-chicago": {"comments": {"12": {"description": "Reputed to be one of the best deep-dish places in town, but honestly I wasn't that impressed. However, they make a mean old-school Chicago-style thin crust that can hold its own against the likes of Vito & Nick's or Aurelio's. If they weren't located in Hegewisch -- the Chicago neighborhood equivalent of a utility closet in the basement -- or if they would open an outpost further north, they'd probably be as well-known as those other places.", "rating": "4", "date": [2013, 5, 4]}, "3": {"description": "Best thin crust pizza and constant great service and food! Also the prices are very reasonable.", "rating": "5", "date": [2015, 4, 24]}, "1": {"description": "No better pizza in the south suburbs of Chicago. The place is certainly a hidden gem in an area that isn't the most sought after for those seeking good pizzas. Nonetheless, this little place with pretty much no seating serves up a crispy crust pizza with a nice robust, savory sauce and good portions of cheese and ingredients. I always get thin crust well done pizza, and I recommend you do the same. Honestly worth the trip if you're looking for a great pizza. This place is an absolute must. No less than five stars could ever be given.", "rating": "5", "date": [2015, 8, 18]}, "2": {"description": "Just discovered this place again after so many pizza places were closing down around Burnham and Calumet City. I love his thin crust pizza. Also if you sign up for their VIP texts, you get some good deal. My mother and sister whom live with me love their polish sausage and kraut pizza (they serve it the last full weekend of the month). The service is also friendly if you pick up. Bob will have a good joke for you now and then. I also like the fact that Bob the owner enjoys helping out his community. He has helped my church (located in Hegwisch) a couple times.", "rating": "5", "date": [2014, 11, 10]}, "9": {"description": "I GREW UP ON THIS PIZZA!I lived in Hegewisch until I was 8 years old when my mom moved my brother, sister and I to Naperville.  My whole family stayed in Hegewisch, and thank god they did.  I would get so excited every time that we would get to drive back to the old neighborhood just because I knew that we were going to get Pudgy's Pizza when we were there, my family is all addicted to it...it is flat out the best thin crust pizza you'll find in this entire city.Now that I'm older, some of my best friends are still living in Hegewisch and I visit pretty much once a week (I live in the South Loop now which makes the drive much more manageable).  At least once a month I'll get my Pudgy's craving, call up a friend and head on down for some Pizza and beer.Pudgy's I grew up on your pizza, I hope you stay around until i'm long gone and my grandkids can enjoy you as much as I always have!", "rating": "5", "date": [2011, 7, 13]}, "10": {"description": "I've lived on the southeast side of Chicago pretty much my whole life and until yesterday, 23 years and 8 months in, I hadn't had Pudgy's pizza. After eating that first bite of that nigh transparent crust with homemade sauce and good sausage piled on top, I felt like I had been missing something for all these years.Compared to all the other pizzas around the neighborhood, this one felt the most homemade and that was because of the sauce. Too many places around here use the same canned sauce and you can definitely taste the difference between Pudgy's and the rest. And that's the reason Pudgy's is beating every one else - in my estimation, good sauce equals good pizza. The whole experience of Pudgy's pizza was as close as I've come to my very favorite pizza in the world - Vito and Nick's - the best in Chicago. In fact, I'd say it compares quite favorably.So, in conclusion my Dad and I won't be ordering from any of the other places around the neighborhood anymore - at least one's that aren't named Pudgy's.", "rating": "5", "date": [2011, 6, 5]}, "13": {"description": "Mmmmmmm....pudgy's.Just the name of this place made me think it was going to be good right off the bat...like I can just picture a bunch of slightly overweight chubby-cheeked Italian grandpas churning out some sweet homemade Chicago-style pies. I've heard they have awesome old-school Chicago-style stromboli and some mighty fine sandwiches, but I haven't tried 'em. But sister--they have some darn good pizza! I ain't lyin'!Seriously though, every weird craving that could possibly go along with pizza that I have, they make. Like one time I was in the mood for pizza, but I wanted something a little spicy, too. Oh, hey! Pudgy's has a spicy hot specialty pizza made with hot sauce in their sweet homemade sauce recipe. SUPER!And then there was that time I couldn't decide between making a BLT or ordering a pizza. Well, Pudgy's has a BLT pizza made with real bacon (not the papa john's stuff) so, ya know, why susbstitute the real thing when you can have a super mega BLT-pizza combo!My personal favorite is \"Bob's Mistake\". I don't really know what mistake Bob made, but honey, thank goodness for his transgressions!\"Bob's Mistake\" is piled high with sausage, garlic, fresh tomatoes, and fresh red and green peppers and LOADED with lovely, lovely cheese. Top it off with some ranch dressing (they NEVER ask questions or give you weird looks when you ask for ranch---a major plus!!), and you've got yourself one delicious heart attack on a plate.They get one start taken away because it's delivery and carry-out only. You can't dine in, but it's worth the trip for carry-out!", "rating": "4", "date": [2008, 1, 14]}, "16": {"description": "Really excellent thin crust pizza. If you like your pizza crispy or well done like I do there is no need to order it that way here. Very , very thin crust , what some refer to as ' cracker ' crust.", "rating": "5", "date": [2009, 3, 17]}, "6": {"description": "Chicago style thin crust pizza done 100% authentic.  I used to regular the original Vito & Nick's on Pulaski but then I found this place.  The worst thing about Pudgy's is that it is in Hegewisch (Chicago) - tucked away in the deepest part of the southeast side of Chicago just before it becomes Indiana.  But in all honestly it's the best food that Hegewisch has to offer - that's not saying much, but I will also add that it's the best thin crust pizza I have ever eaten.  They could easily chain-out to other areas of Chicago and hook people as long as the recipe is the same.Blast from the past:  It reminds me of The Charcoal Pit pizza from 6300 S. Knox over by Midway airport in the 1980's.  Haven't had a pizza like it since.", "rating": "4", "date": [2013, 5, 3]}, "15": {"description": "I love Pudgy's pizza. I have lived in Hegewisch almost ten years now and their pizza is my favorite of any Chicago pizza place! The sauce is the BEST. Delicious.", "rating": "5", "date": [2012, 5, 18]}, "0": {"description": "I am convinced that I will never taste a pizza so good!I grew up eating from here, and I will drive however long I need to in order to get my fix!The homemade dough.  The homemade sauce. The fresh ingredients.  Fast and friendly service.  Amazingly low prices.  It's all perfection.Oh, and even the sandwiches are amazing.  And trust me, I've tried them all.", "rating": "5", "date": [2014, 8, 25]}, "5": {"description": "don't order the deep dish ... I ordered vegetarian  .what got was a cheese pizza  ...Its a rip off  .....!!!!\"It has miniscule veggies ..just enough to cover a thin crust!!!!It was supposed to be deep dish!!!!    I'll  never go back again!I@m disappointed, after paying $20 bucks for cheese....", "rating": "1", "date": [2014, 3, 9]}, "11": {"description": "This is seriously some of the finest south side Chicago style pizza. The sauce is sweet and the crust is amazing. I usually get my pizza well done, a little orange/brown on the top.If I didnt grow up in the neighborhood I would never have know about this place. I always get a pie when I go back to my parents house. If you ever find yourself in this area, hit this place up. You wont be disappointed.", "rating": "5", "date": [2011, 11, 16]}, "8": {"description": "Sorry to bring the overall rating down, but I didn't care for this pizza very much. I grew up in the area, and no longer live nearby, but ordered the pizza for a party. Perhaps it was my fault for requesting the pizza to be well done, but I've done that in the past at other places and the pizza still tasted fine, so I'm not sure. In any case I'd stick to something like Palermo's in Oak Lawn. Their thin crust still has enough heft to it that it doesn't get all dried out when the cheese starts to brown.Picked up on: February 19, 2012", "rating": "2", "date": [2012, 2, 20]}, "4": {"description": "it really is that good! i've moved from that area years ago and i still miss three eateries: 1. pudgy's 2. schoops 3. pepinosthe northside just doesn't have any good food joints.", "rating": "5", "date": [2014, 8, 22]}, "14": {"description": "Gotten this pizza a few times and always a big winner.  It's everything you'd want in a nice thin crust...greasy, loaded and delicious.", "rating": "5", "date": [2012, 3, 30]}, "7": {"description": "This is my go-to pizza place. Yummy thin crust. Sausage is great! There is a \"butter\" pizza (no red sauce) that is reeeaally good with spinach, tomatoes and garlic. My only caution is that the mushrooms are  canned, not fresh and they can be a little stingy (IMHO) with the veggie toppings. :P", "rating": "4", "date": [2010, 11, 14]}}, "latitude": 41.65009, "neighborhoods": ["Hegewisch"], "categories": [["Pizza", "pizza"]], "address": ["13460 S Baltimore Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Delivery": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Dinner"}, "longitude": -87.54753, "category": "Restaurants", "rating": "4.5", "price": "$", "number_of_reviews": "17"}, "walgreens-chicago-172": {"comments": {"1": {"description": "This walgreens location sucks.. If u ever wanna wait in line for 30 mins come here. Happens every time", "rating": "1", "date": [2015, 11, 4]}, "0": {"description": "BEST WALGREENS EVER!!!Always polite and helpful employees,Always clean and well stocked,Always a pleasure!PharmacyFriendly service but highly understaffed for the amount of customers they service. The wait is always ridiculous.", "rating": "5", "date": [2015, 7, 1]}}, "neighborhoods": ["Hegewisch"], "latitude": 41.6805801, "longitude": -87.539299, "rating": "3.0", "times": {"Mon": ["8:00 am", "10:00 pm"], "Thu": ["7:00 am", "10:00 pm"], "Sat": ["7:00 am", "10:00 pm"], "Wed": ["7:00 am", "10:00 pm"], "Tue": ["7:00 am", "10:00 pm"], "Sun": ["8:00 am", "10:00 pm"], "Fri": ["7:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Cosmetics & Beauty Supply", "cosmetics"], ["Drugstores", "drugstores"], ["Convenience Stores", "convenience"]], "address": ["11801 S Avenue O"], "attributes": {"By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "2"}}