{"m-avenue-restaurant-chicago": {"comments": {"1": {"description": "Located inside the Warwick Allerton, the M Avenue Restaurant is the hotel's restaurant. Really, in the middle of Chicago with it's wondrous food options, I can't imagine many people would go out of their way to come here. The prices were what you would expect for a hotel food establishment, that is to say, on the expensive side for what you're getting. Still, on my last day leaving the hotel, might as well give it a try right? I ordered the salmon and bagel breakfast and it wasn't bad. Heaping pile of salmon, onions, capers, tomatoes, cream cheese. Pretty basic, near impossible to mess up. It hit the spot. There was only one other group there for breakfast that day so service was attentive of course, but make no mistake, they were very polite.  I was pretty happy and considered myself well fed as I said goodbye to Chicago!", "rating": "3", "date": [2016, 2, 11]}, "9": {"description": "Went here last night with a travel zoo voucher...as did every other person in the restaurant since it was expiring today. we were told it would be a 30-45min wait, which we were fine with. After an hour of waiting and noticing that people were having to get up from their tables to get a drink and wait for an hour for a drink, food and in some cases even order, I realized we may never get to eat dinner. I spoke with a manager and told him I understood they were in over their heads, people who were sitting weren't even being served and maybe they should honor the travelzoo voucher past tomorrow to clear some people waiting out (there was a line wrapped around and there wasn't even a hostess or anyone to take names). His response was \"no. After tomorrow your voucher is worth the value you paid\". No apologies or cares in the world, even with other people overhearing me and chiming in to agree. This was just the beginning of my 3 hour drink and appetizer experience at M but you get the idea. Terrible management and I won't be back ever again.", "rating": "1", "date": [2012, 8, 11]}, "12": {"description": "The Atherton is a secret little romantic boutique hotel. Its where (literally) flght attendants stay and this sultry little lounge is where they hang. Its charming but cramped and the furniture, many backless chasise lounges for instance , makes little sense.But the service was good, and there is a fair amonut of old world charm. The location, just off the Magnificent Mile, is lux and fun.", "rating": "3", "date": [2011, 5, 18]}, "21": {"description": "we came here for a restaurant week lunch because we were thinking about the allerton for our wedding reception. i love the decor of the newly decorated lobby/bar/restaurant. really great feel. the food and service were also good, which i found surprising since it was so empty when we were there. they did try to serve me a completely flat glass of proseco, which was a little disappointing, and i was not a fan of the bread pudding dessert. but if you're looking for a new place to try for lunch on michigan ave, i would say go!", "rating": "3", "date": [2009, 3, 2]}, "16": {"description": "Loungey and Art Deco. I didn't find it very inviting, though. Maybe because I was staying at the hotel. It is a very open area. The Oyster Creek Sauv Blanc was spectacular. Service was also very attentive.The restaurant I thought was trying too hard to be European with its food.  Again, service was attentive.", "rating": "3", "date": [2010, 3, 3]}, "17": {"description": "Got the Travelzoo deal so overall, it was a great deal.  My friend and I both had the onion soup (ok), steak salad (good) and shared a bread pudding for dessert (awesome)!!!  Service was good and waitstaff catered to our 2 little girls (they also have kids menu).  They even gave chocolate milk to them instead of us using our deal for 2 non-alcoholic beverages as the mommies preferred to pay extra for wine!!  :-)", "rating": "4", "date": [2013, 2, 7]}, "10": {"description": "Cool little lounge area in the Allerton Hotel.  Didnt try the food, but drinks were good.Didnt have too many beers on tap, but did have a wide selection of high end alcohol.", "rating": "4", "date": [2012, 7, 2]}, "5": {"description": "The perfect venue for Ladies Who Lunch (Urban Dictionary meanings #1 and #2 applies).  Quiet relax venue.  Pleasant and knowledgeable service.  Selections are ordinary with a lunch menu of soup, salad and sandwich that is served the best way it can be enjoyed.Onion Soup -- good serving size with too much bread that slurps all the available liquid.Cobb Salad -- generous portion with mega chunks of perfectly grilled chicken.Hot Tea -- nothing special about the brands.  It looks fancy served from a wooden box and presented to you.Steak Sandwich -- The sandwich relied heavily on the mayonnaise.  Without the bread and mayo, steak was dry and tough.  Well seasoned fries needs to conform to the size and shape worthy of a \"$$\" restaurant.Mango Mousse Cake -- a true delight.  Light flavorful mango mouse with a firm moist cake.", "rating": "3", "date": [2013, 1, 12]}, "11": {"description": "Trendy and chic atmosphere.  If only the drinks, food and service were of the same qualities as the hotel it's located inside of.  I realize this bar / restaurant  if you could call it that, was merely created to capture what \"little\" or few business they might come across in a day.  The space has potential but management needs to cross train the bartender and some of the wait staff.  I'm specifically speaking about experiences here during the TravelZoo offer which expires today 8/11/2012.  It's been pretty busy for the last week or so.  More so than I imagine it regularly is.  One day I stopped in solo to see what the environment was like and possibly have a drink.  Per their photos, there is a lush bar which is always open with a small seating area nearby.  Behind curtains is their dining areas which is larger and better accommodations when having a light meal with drinks.  However regardless of the day of the week or how busy, they close down the dining area by around 6:30 pm nightly.  The night I stopped in almost every seat was filled.  I met a sexy single at the bar and we decided to grab a table which we could not find.  A few people were already sitting in the back dining area, so we too headed over.  I waited about twenty minutes before getting a chance to speak with anyone for a first drink! When the waitress or hostess stopped by it was to ask us to remove ourselves from dining and move over to the bar.  The other tables were told the same but they like us were stranded because there weren't other seats or tables available.  So we decided to leave and found better accommodations down the street.My next visit was a few days later.  A weekday afternoon joined by another Yelper, just in time for happy hour.  Drinks are poured with a heavy hand which is usually a good thing but when the taste is so harsh you breathe fire, that's a whole other part to drinking.  It's called alcoholism.  LoL.  We started with the specialty drinks menu \"Silky margaritas.  Wow they were strong and poured into large wine glasses.  Followed by the Garden gin martini which was all gin.  For decoration a long sliver of cucumber is added.  With each sip we took, a grimace, ghastly lip curl was made.  That face one makes when they experience harsh flavor.  My buddy drank a quarter of it and told me he would not drink any more.  Specialty drinks are $12 each and the average drinker would have a decent buzz starting with the first.  I would recommend a basic cocktail and avoid specialty drinks of any nature.  We put in an order for a few appetizers which somehow got jacked up in the ordering process.  Although we pointed out the error to different parts of the wait staff the problem was never corrected until the very end when paying.  Service was negligent and people often waited over twenty plus minutes before someone was available for refills or etc's.  I feel that with the gross amount of business recently with the current offer they weren't prepared.  Instead of trying to capture new business via deal sites, management should approach nearby companies or websites which host for networking or happy hour gatherings.  Per their online menu with daily booze specials listed, I know that some of the happy hour groups I participate in would be interested.The food wasn't awesome, it was average stuff.  My buddy has worked a kitchen and felt the meat in their sliders were probably microwaved just before serving.  Of the appetizers ordered, none memorable.  The couple seated next to us enjoyed the buffalo wings and the Cajun shrimp. Would I come back.  Maybe if I happened to be on the Northwestern hospital campus and wanting a stiff drink.  If your aim is to get a date drunk, there ya go and its in a hotel so that's a plus.  Another reviewer commented that flight attendants stay here.  I can confirm that.  If management can score a decent bartender with specialty drink skills, that would be a draw.  Skip the deal site business.  A hotel bar with the look but the feel of a motel bar.", "rating": "3", "date": [2012, 8, 11]}, "3": {"description": "$25 for the M Avenue breakfast buffet.  $25.  For breakfast meats, eggs, and fruit.  If you ask, they will bring you toast. $25!  For that amount of money, in this city of infinite possibilities, you can do much better.", "rating": "2", "date": [2014, 8, 18]}, "0": {"description": "I wish I could give them an extra star.This review is about over a year late but better late than never.I worked with the manager to have some friends there for my 29th birthday. I liked the decor and I thought it would be a nice place to celebrate. Boy was it.I requested a cake and I had no idea it was going to be that fresh and delicious. I still think about that cake. The staff was great and paid a lot of attention to my guests. The kitchen was closed and they opened it just for us (we weren't even a large party, 10 people tops). It was a great time. I absolutely loved it.I'm going to have to do a stay-cation at actually hotel soon.", "rating": "5", "date": [2010, 6, 11]}, "20": {"description": "Went there after a stop at the Apple store right across the street to find this cool contemporary lounge with a cool gas burning fireplace in the middle of the lobby.  After waiting awhile to pickup my damaged iphone, this vibe is what I needed to relax.  I scanned their cocktail list and was suddenly offered a complimentary glass of wine.  The server mentioned that they were pouring free wine from 4:30pm-5:30pm for all guests -hotel and non-hotel.  I accepted a glass a of Cabernet and started to take in my surroundings.  On the cocktail list, they offer daily specials- Monday's beers, Tuesday's off tequila based drinks, including Jose Cuervo margaritas for $4, Wednesday's off wines, Thursday 1/2 off Cocktails, and on my fortunate night on Friday- I treated my self to $5 Baker Manhattan and my girlfriend a $5 mojito with Bacardi during their $5 Fridays.  With these specials and gorgeous space and cool music along with a magnificent location-especially after shopping or a night in the city, M Avenue Lounge is definitely a must for all the Streeterville/Goldcoast hipsters and shoppers.", "rating": "4", "date": [2009, 5, 14]}, "19": {"description": "we came here for a restaurant week lunch because we were thinking about the allerton for our wedding reception. i love the decor of the newly decorated lobby/bar/restaurant. really great feel. the food and service were also good, which i found surprising since it was so empty when we were there. they did try to serve me a completely flat glass of proseco, which was a little disappointing, and i was not a fan of the bread pudding dessert. but if you're looking for a new place to try for lunch on michigan ave, i would say go!", "rating": "3", "date": [2009, 3, 2]}, "2": {"description": "Inside the Allerton: I completely agree with Debbie E's review:  a decidedly loungey, Art Deco look, a spacious lounge but because of odd furniture and virtually no walls to break things up for a bit of semi-privacy, it doesn't feel totally comfortable, can't get your sea legs due to the mishmash. However, the bar itself is a nice throwback, as it feels like you walked back into the 1940's, with lots of top shelf liquors and a few excellent draft choices. I ate breakfast here once or twice and its fine: 18 bucks for cold buffet, 22 bucks for both hot and cold, it is more than passable. My service from the waitstaff last Wednesday was exceptional.", "rating": "3", "date": [2015, 6, 8]}, "18": {"description": "had a travelzoo voucher and came in for lunch,service was a little slow, i asked for coffee after 2 minutes the waiter brought a soda...ordered the m signature onion soup.tasted it and felt it lacked flavor,and watered down.entree was just ok i had the penne with chicken.", "rating": "2", "date": [2012, 11, 18]}, "13": {"description": "After getting the Travelzoo deal for 3 appetizers and two cocktails each, my bf and I went one day after work. It was pretty decent. Kind of your typical hotel lobby bar but decked out pretty swank. I can't say I'd come here often but if in the hood I'd come back for the very potent martinis.", "rating": "3", "date": [2012, 5, 23]}, "4": {"description": "Gf got the travelzoo deal. Food wasn't bad. It wasn't great though. Service was the same. Pretty forgettable experience. I don't think I'd go back with other places to eat around the area. Without the travelzoo deal, I'd be more on the 2 star side.", "rating": "3", "date": [2013, 4, 18]}, "6": {"description": "This is one of those places where you're glad to know it exists to have in your back pocket in case you're on Michigan shopping and want a drink.  I wouldn't plan on coming back.I came in with a travelzoo voucher.  The main guy was friendly.  The guy who brought the food and took away the plates was abrupt.  The food was ok.  I probably wouldn't have food here again.  The drinks were good!  We tried a fruity mojjito, the gin martini and a sazerac.  All well executed and refreshing.", "rating": "3", "date": [2012, 8, 1]}, "15": {"description": "Sexy! The decor of this place is really open and loungey and dark-- somewhere you could catch up with your girls over a few cocktails or have a secret rendezvous with a lover. I came here to meet up with one of my girls for dinner, and the service was very attentive. Then I looked around and realized there was almost no one there. Strange, considering the food was really good. The braised lamb fell off the bone, but was complemented by some tangy fruit flavor that didn't really appeal to me. The portion was BIG though-- like twice the size of my fist. The bread pudding dessert was nothing to sneeze at either. Probably one of the only times I wasn't able to finish the meal. I didn't have any foodgasms that night, but with the large portions and fair prices, I'd probably come back here for a lunch affair.", "rating": "4", "date": [2010, 3, 9]}, "7": {"description": "We were staying at the Allerton hotel which houses M Avenue bar.  Since our dinner reservations were not until 9 pm that evening, we decided to check out our hotel bar.  It was very comfortable with couches and pillows to lounge on as you enjoy your drink.  I tried the Pama Kiss Martini, which was awesome.  It was super sweet, yet strong at the same time.  This bar is nice if you are staying at the Allerton or meeting up with someon who us, but I would not seek it out otherwise.", "rating": "4", "date": [2013, 1, 21]}, "8": {"description": "This cozy bar is on the second floor of the Allerton Hotel.  The lounge area is cute, but very small.  We went early on a Saturday night and there were just a few people there.  The bartender with the long hair makes THE BEST MARTINI ever with St. Germain Liqueur.We asked for food recommendations for a snack and he suggested the quesadillas.  Now, to be fair, I'm from TX and we did tell him that.  They were pretty run of the mill flour tortilla, cheese, chicken and pico, but that's OK.", "rating": "4", "date": [2012, 12, 10]}, "14": {"description": "Great location, historic building and attentive service make it a 4 star review.  Came for lunch and food was okay.   Fries were not crispy, onion soup a little bland, steak sandwich came med. rare as ordered, but needed seasoning.  Side of fruit was a nice option and was tasty.  Reuben sandwich was good.  If you're in the area, I would check it out.", "rating": "4", "date": [2013, 1, 7]}}, "neighborhoods": ["Magnificent Mile", "Near North Side", "River East"], "latitude": 41.895077, "longitude": -87.624243, "rating": "3.0", "times": {"Mon": ["9:00 am", "5:00 pm"], "Thu": ["9:00 am", "5:00 pm"], "Sat": ["9:00 am", "5:00 pm"], "Wed": ["9:00 am", "5:00 pm"], "Tue": ["9:00 am", "5:00 pm"], "Sun": ["9:00 am", "5:00 pm"], "Fri": ["9:00 am", "5:00 pm"]}, "price": "$$", "categories": [["American (New)", "newamerican"]], "address": ["701 N Michigan Ave"], "attributes": {"Parking": "Valet", "Take-out": "No", "Wheelchair Accessible": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Caters": "No", "Good for Kids": "No", "Attire": "Casual", "Waiter Service": "Yes", "Dogs Allowed": "No", "Takes Reservations": "Yes", "Good for Groups": "Yes", "Good For": "Late Night"}, "category": "Restaurants", "number_of_reviews": "22"}, "mezza-mediterranean-grill-chicago-5": {"comments": {"58": {"description": "A great lunch spot tucked away in the food court at Nordstrom's mall, Mezza has a nice selection of sandwiches and salads.  You pick the sandwich you want, but get to customize the bread (pita) and fillings. My fav is the spicy chicken.  The curly fries here are outstanding - very crispy and well seasoned.  Yum!", "rating": "4", "date": [2009, 7, 30]}, "56": {"description": "My favorite is the grilled veggie wrap. They stick two fat, freshly roasted, charred-on-the-edges skewers of green and red peppers, red onion, yellow squash, zucchini and eggplant in between a chewy whole wheat wrap, and then you get to top it off with your choice of toppings - any toppings you want.  I recommend tabouleh, the tahini sauce or hummus and the hot pepper sauce and some lettuce, tomato and kalamata olives. Super tasty. Probably healthy. Five bucks.Only downside - the wrap is a bit smaller and thus overstuffs very easily. Eating it can be a very messy task - try, if possible, to unravel the foil as you eat, Chipotle burrito style, and keep plenty of napkins on hand just in case the sauce starts to leak out the bottom.", "rating": "4", "date": [2009, 8, 17]}, "29": {"description": "The Chicken Kabobs were ok. Nothing to get that excited about.", "rating": "3", "date": [2011, 10, 26]}, "42": {"description": "I am gonna go ahead and give four starts here just so people like me who were in disbelief of a quality medi location in a mall food court will give it a shot.  The falafel is okay, if you don't know really great falafel (ie sultans market or oasis cafe), you'll be perfectly happy with it. Chicken shwarma pita is where Mezza shines.  You will be pleasantly surprised with the quality (maybe not when you see the line on some days compared to other places in the food court) and they have awesome unlimited toppings for a good price for lunch.  Definitely worth a spot in the lunch rotation especially if your options are all in the mostly limited North Michigan Ave area.", "rating": "4", "date": [2010, 11, 23]}, "23": {"description": "I visited Mezza for a quick lunch and ordered the Chicken Shawarma wrap.  It seemed more like a pita taco than a wrap.   The flavors were good, but I was not blown away.One nice thing...they take LevelUp.  It's a great mobile app for making point of sale purchases.", "rating": "3", "date": [2012, 5, 12]}, "47": {"description": "Love me some Mezzaterranian Salad!  The falafel is good, and the spicy chicken is deelish.  Lunch at Mezza's always brightens my day.If I'm feeling indulgent, I \"make it a meal\" for just $2 and get curly fries and a drink.  (Hey, salad is the business, fries are the party!)  Also like the fresh baked cookies.Don't worry about the line, it moves quickly.  And don't forget the punch card, can't go wrong with a free meal!", "rating": "5", "date": [2010, 1, 23]}, "8": {"description": "I stopped by during lunch time last week for a salad.  The ingredients seemed fresh, but the chicken and hummus were both kind of bland.  Given the price, it was a decent option, but no where that I would rush back to try again.  I had no problems with the service and was able to order & pay in a quick and painless few minutes.", "rating": "3", "date": [2015, 5, 29]}, "31": {"description": "A great lunch option. Big, healthy, reasonably priced salads. There is a real lack of quality salad spots around this area for office folks, and this one hits a homerun! The Shepard's salad is super yummy.", "rating": "5", "date": [2011, 10, 5]}, "34": {"description": "Shepherd's salad was very interesting - I'll go back again.", "rating": "5", "date": [2011, 8, 27]}, "16": {"description": "Pleasantly surprised.  I mean it's in a food court, expectations weren't super high.  I had a Shepard's salad with chicken.  The dates and goat cheese made the salad for me, YUM.  The salad comes with a pita, which may have been one of the best pita's I have ever had.  It was warm, and really light.  Tasty, would def go back.", "rating": "4", "date": [2013, 9, 30]}, "13": {"description": "I went to Mezza not expecting it to be in a mall food court.  So strike one for me, but thankfully it was just for a quick lunch.  They had very good wraps, and the meat and vegetables in the wrap were very tasty.  I have to say it was quick, good, and Gluten Free.  So I will definitely return if I'm in the area shopping.", "rating": "3", "date": [2014, 5, 16]}, "11": {"description": "I thought shawarma is supposed to come off of a spit. Mine didn't, it came out of a warming box so who knows how it was actually cooked. And I'm pretty sure it was dark meat. God help you if you get behind someone who spends 5 minutes discussing the toppings on their wrap like I did. I think something is lost with Middle Eastern food when it goes corporate and multi location. I'm going to stick with the small indy joints.", "rating": "2", "date": [2015, 1, 28]}, "39": {"description": "Four stars for convenience, fresh food and price in the loop.  Pros: All the pitas can be made-to-order and the staff are totally on top of what you're asking for (i.e. you don't have to repeat yourself, can ask for extra whatever, etc).  Good lentil soup.Cons: The flow of the line is a little awkward especially for such a crowded place.  This isn't enough to dissuade me from coming.", "rating": "4", "date": [2011, 3, 20]}, "37": {"description": "Mezza's manager has invited me back to get a complete Shepherd's Salad or something else from the menu on him.  I'll definitely take him up on it!", "rating": "5", "date": [2011, 5, 5]}, "0": {"description": "Split a wheat pita wrap and the Shepherd salad with my mom.  The salad was amazing. It had cheese, dates, lots of greens, avocado, nuts, cabbage, corn and tomato (dressing on the side).  Everything was very tasty!The falafel wrap was good, too, and the tahini/tahina sauce was good and very chunky.  FYI it has yogurt in it so if you are lactose intolerant or vegan, don't get that.  Overall, it was a lot of great food for a reasonable price.  The location is great and there are other great fast food places in that same food court as well.", "rating": "4", "date": [2013, 10, 27]}, "38": {"description": "I've been to this place several times now and have experimented with many of the dishes that they offer.The falafel wrap is pretty decent, but is not the best falafel I have had.  The salads are great too.  The ingredients seem fresh and they have an interesting variety of dressings.  Their curly fries are my side dish of choice.For the first time today, I tried the spicy shrimp wrap with all of the toppings and some hot sauce.  The light orange sauce they throw on here is so GOOD!  I think it might be the tahini sauce, but I'm not positive.  I think this wrap might be my favorite thing there.", "rating": "4", "date": [2011, 4, 21]}, "51": {"description": "We had far too long of a wait on a slow day at Mezza to get a dried out chicken Caesar wrap.  And, their large soda cups are small than the small cups at most other places.", "rating": "2", "date": [2009, 9, 16]}, "27": {"description": "I had a craving for some middle eastern food and decided to check Mezza out. I went there with pretty high expectations since I have heard nothing but good things about it. I got the chicken kabaob plate and was immediately disappointed when I opened my container. The chicken tasted was extremely dry and bland like it had cooked hours ago or last night. The rice was undercooked and the falafels were ok at best, but you could tell they had been sitting under a hot lamp the whole time. I will admit that the portion sizes are great for the price but the food sucks.", "rating": "2", "date": [2011, 12, 30]}, "32": {"description": "For a fast food place in a mall, it was surprisingly good.  Its in a more upscale food court-  no burger king or golden arches here.  We went for the chicken shawarma-  the sauce was great, the pita was just crispy enough, and the meat was well seasoned.  The fires were pretty good too.  It was a little on the pricey side, but not bad for a quick fast food lunch that's much better than the usual fast food options.", "rating": "3", "date": [2011, 9, 25]}, "54": {"description": "YUM!  Huge fan of the falafel and signature salad.  The feta pasta salad is delicious too.  I also liked the chicken schwarma wrap, though it was a bit messy to eat.The space is a bit crowded during lunch, but totally worth it since the line goes pretty quickly.This is my new favorite lunch spot.", "rating": "4", "date": [2009, 8, 26]}, "48": {"description": "Mezza might be the healthiest food court find in the mall.  Their selection of wraps and salads is pretty stellar, and their portion size is generous.  Nothing too fancy, but compared to some of the greasier options it's a pretty safe bet.", "rating": "3", "date": [2009, 12, 9]}, "44": {"description": "I have recently gave up wheat and gluten products so lunch on the go is tough. I met a friend here for lunch today and I had the Mezzaterranian Salad with spicy chicken. It was amazing and it was a decent sized salad! Lots of chicken, olives, tomatoes, cucumbers red onion, feta with Italian dressing. I will remember that Mezza knows how to make a mean salad that fills you up!", "rating": "5", "date": [2010, 5, 18]}, "24": {"description": "I usually love this place, but I was really put off the other day by the fact that their hummus could've been pita bread batter. It tasted like pancake mix...and not like the hummus I've had there before. I'll give it 3 stars based on my experiences before. Just don't order the hummus I guess.", "rating": "3", "date": [2012, 4, 18]}, "7": {"description": "I really, really, really enjoy the steak wraps here but it completely depends on who makes your food.  I've had it made perfectly.. ample amount of steak, contents spread out evenly.. and I've had it poorly.  There's a particular girl that works there that if i see her, I will go elsewhere.  She doesn't care if the wraps are ripped and always gives off a \"I don't care\" attitude that clearly shows in the food.  When I get her, my wraps are ripped, there's barely any meat, condiments are on one side if she remembers to put what I ask on at all.Like i said.. when it's good, it's good... and that steak wrap is one of my favorite river north lunches.. but when it's bad.. it's crap.", "rating": "3", "date": [2015, 4, 29]}, "49": {"description": "A great lunch spot located in the Nordstrom food court.  They offer great wraps as well as salads.  I recommend the Fatush salad with spicy chicken and a side of curly fries.  A salad with a side of fries is kinda bizarre I know, but how can you pass up curly fries?", "rating": "4", "date": [2009, 11, 13]}, "40": {"description": "Stopped at this foodcourt for a very quick lunch one day.  After quickly surveying the options, I settled on mezza.  I had the spicy chicken pita which was quite flavorful and came with a nice assortment of toppings.  The only downside was that it was hard to eat as a pita and I ended up using a knife/fork.While this place wont win any awards, it does a good job for food court cuisine (again this is food court cuisine and hence the 3 star rating...know your expectations)", "rating": "3", "date": [2011, 2, 26]}, "53": {"description": "If you seek a nostalgic food court experience from the hazy mall days of your not-so-distant youth, wedged between memories of Claire's Boutique and the Buckle, you will not find it in the food court in the Nordstrom Building. There is neither Sbarro nor Panda Express nor the tempting waft of Cinnabon. But you will find Mezza. And it is wraptacular.Mezza offers a wide range of salads and wraps that are delicious, humongous, and cheap. The salads are fresh, green, and made to order right before your eyes. Like the rest of the menu, they are Mediterranean inspired. The wraps - oh my lord, the wraps! They are stuffed with two skewers of veggies, which makes for some interesting - and delicious - eating challenges. Top 'em with hummus, olives, lettuce, and peppers to complete your Mezza experience.And don't forget your side of curly fries! Why is it that when fries are curly they taste so much better? I never want to walk the straight and narrow french fry path again.The staff is quick and friendly, and will fill your order so you have plenty of time to get back to the office/real world, even though your heart wants you to hang out, nursing your soda and watching music videos (yes, they play videos - just like MTV used to do!) because you have no place else to go. And no place you would rather be.", "rating": "4", "date": [2009, 9, 4]}, "30": {"description": "Reasonably healthy, fast and tasty selections in a food court on the Mag Mile? Believe it.After shopping myself hungry on a bustling Saturday on the Magnificent Mile, I consulted my trusty Yelp app for some direction. Mezza came up and it took me a second to figure out it's located in The Shops at North Bridge mall's food court, but once I found it, I was smitten.Why?Deep selection of Mediterranean favorites such as falafel/hummus/wraps.Inexpensive yet substantial portions.No wait!My chicken shawarma wrap was made-to-order while I watched and it really hit the spot. It's great to know that a place like Mezza exists among the typical fast food options when shopping in a tourist area!", "rating": "4", "date": [2011, 10, 22]}, "46": {"description": "hmm...sometimes you should stick to what you know. Next time I will stick to the chicken pita because the falafel is close to being the worst one I have ever had. And to think I waited almost 10 minutes for them to make more of these suckers...waste of time. Stick to the pitas!too salty,inside was too mushy and the flavor seemed to hint that this batch was screwed up so they added too much of something else to make up for it.", "rating": "3", "date": [2010, 1, 26]}, "1": {"description": "How can the location in the Illinois Center be SO much better ?  The service is so inconsistent and you have to watch them make your salad or they will make a mistake.  At least half the time they have to remake my order here (never happens at Illinois center!). My salad today was bland and not fresh - I was too hungry to care. I need to stop coming here.  Just wish it wasn't the only half healthy option near my office.", "rating": "2", "date": [2015, 11, 5]}, "55": {"description": "Around $8 for a salad with chicken - I got the chopped salad with the spicy chicken. It's a huge salad so you can definitely share it with someone, so really it's about $4!!Went on my last day of my summer job, so I've only been there once - would come back again.", "rating": "4", "date": [2009, 8, 22]}, "9": {"description": "Something's always off here.  The falafel is over cooked, too dry or salty.  The rice is crunchy and dry. The meat or chicken is dry or grisly.  Every time I'm here, something is off, and I can't figure out why. Perhaps the employees should strive to be more consistent: Mondays are bad meat day.  Tuesdays are bad falafel day. Wednesdays are nasty rice day, and so on.", "rating": "2", "date": [2014, 12, 22]}, "26": {"description": "Before you go to Mezza (and before you form an opinion from the reviews) you have to recognize that it's fast food, not fine dining.That being said, I got the Chicken Shawarma Pita (added chili sauce) and it was really good!  Not better than the little hole in the wall with someone's grandmother in the back, but very good for fast food.  The chicken was well spiced, warm and hadn't been sitting on warmer for three days.  The pita was soft and well grilled and the veggies were fresh.The service was also good.  Being in Streeterville during lunch in a weekday, the line was pretty long but it moved quickly and everyone behind the counter moved efficiently.All in all I'd definitely go back to try their other offerings.", "rating": "4", "date": [2012, 1, 12]}, "25": {"description": "i go here about once a week for lunch - convenient in the pedway and a great option compared to the cosi's and potbelly's around.i swear by the shepherd's salad with spicy chicken. pitas aren't too bad, hummus, everything is good stuff. a little pricey for lunch if you get carried away, but it's fresh and delicious and worth it. the staff is great; quick, efficient, and friendly.always a line at lunchtime, so beware. and make sure to hop in the salad line if you're wanting that..saves you some time.", "rating": "4", "date": [2012, 3, 19]}, "12": {"description": "Very good, healthy food. Bizarrely bad service.The food is good and very high in fiber as long as you don't deliberately pick fat things. Great option for somebody who wants to lose or maintain weight.The service is mind-bogglingly bad. The people working there are extremely difficult to understand, as though they're going out of their way to speak gibberish. When you ask them what they said, they do what most people do and say the exact same thing with no modification, which doesn't help much. They're also really bad at following instructions and adding the things that you ask for them to add, as though they just don't know how to handle requests for the standard toppings and add-ons. This applies to more than one of the people who regularly work there.It's fortunate that the food is so good and that it's one of the few really healthy options around here for people who count calories and fiber.", "rating": "3", "date": [2014, 4, 25]}, "59": {"description": "My husband and I go to the one at 225 N Michigan A LOT. The food is delicious and it tastes like real food you could have made yourself at home, only better. I usually get one of the salads (I've liked all that I've tried), chicken pita, or kabobs with brown rice. Lots of great side options as well.  A nice lighter option. Just wish they had nutrition facts available.", "rating": "5", "date": [2009, 6, 9]}, "21": {"description": "Ate lunch here today and was very pleased with what we got.  Since we eat this type of food and I cook it at home, we weren't sure what it would taste like.  The hummus was really good as were the hot pitas served with it.  I absolutely looooove their lentil soup - it's delicious and just like the soup we get at our favorite Middle Eastern restaurant.  The fattoush was a different story.  No lettuce, only tomato, cucumber and parsley with little lemon taste but the pita croutons were very good.  this was more like Jerusalem salad.  All in all, for $16 for two people, we thought this was a pretty good lunch.  It filled us up and we didn't have to settle for some of the other worn out places in the food court - Chinese, sandwiches, burgers, Mexican.  This was different and pretty darn good for  a fast food place.", "rating": "4", "date": [2012, 9, 16]}, "17": {"description": "Reasonably healthy, fast and tasty selections in a food court on the Mag Mile? Believe it.After shopping myself hungry on a bustling Saturday on the Magnificent Mile, I consulted my trusty Yelp app for some direction. Mezza came up and it took me a second to figure out it's located in The Shops at North Bridge mall's food court, but once I found it, I was smitten.Why?Deep selection of Mediterranean favorites such as falafel/hummus/wraps.Inexpensive yet substantial portions.No wait!My chicken shawarma wrap was made-to-order while I watched and it really hit the spot. It's great to know that a place like Mezza exists among the typical fast food options when shopping in a tourist area!", "rating": "4", "date": [2011, 10, 22]}, "10": {"description": "The lentil soup was good but my friend ordered the chicken schwarma and it came with no sauce and was dry. And only half a piece of pita bread.", "rating": "3", "date": [2015, 8, 11]}, "5": {"description": "This location was inside of the Nordstrom food court. Knowing this, I was not expecting incredible customer service; rather a fast, dining experience. That it was I received. I ordered the Mediterranean salad sans cucumbers with extra feta and grilled chicken. The salad was assembled quickly and was such a large portion. I ordered iced tap water and it came with a side of pita bread. For $9 I got a lot of salad. I finished it all and was stuffed.  The flavors were spectacular! Fresh ingredients and the chicken was spiced perfectly and still juicy. I really enjoyed being able to have such quality food offered in a fast food environment.", "rating": "3", "date": [2015, 7, 17]}, "3": {"description": "it had been a long time. i boycotted after my last experience. anyway, the food has really gone down in quality. my chicken shwarma was about 50% fat that could not be consumed. also, they used to let me get fries for my side with a plate but not anymore. i have to order it separate, which is only $2.25 so not a huge deal. but today i was waiting for the fries to be finish cooking and two times, one of the workers walks over to the fry  area, pick up a fry (there were a few stragglers in the \"done\" basket) with her fingers and pop it in her mouth. she was  kinda tall, and wearing glasses. she was wearing the plastic gloves, which is a plus, but she kept the same ones on the entire time she was picking at the fries, as well as restocking the lettuce and all the other stuff over in that area. i was totally turned off by that because that shows me that those gloves could have touched anything else, including her mouth and she doesnt seem to even pay attention. bye, Mezza!", "rating": "2", "date": [2016, 2, 23]}, "35": {"description": "It is a good lunch spot. Their wraps are good. But their falafal is beyond bad. I love their lentil soup, and their salads are good too. But it is quite expensive for fast food.", "rating": "3", "date": [2011, 8, 24]}, "19": {"description": "They never have fries even though it's on the menu, and even when they do have fries they're never made (so have to be made fresh, which is half nice and half time consuming and too hot to eat right away). I went today trying again for fries and a falafel, they had neither. My coworkers have complained to me about how the girls there have been rude to her, and I haven't shared that part of the experience, and when they do have what I want it is good. But this mezza is still such a disappointment. Disappointing enough to feel the need to sit down and write a yelp review on my lunch break.", "rating": "1", "date": [2014, 7, 20]}, "28": {"description": "I was jonesing for mediterranean food and noticed that Mezza was nearby, so I decided to go there for lunch.  I ordered their chicken kebab platter for about $10 and was very disappointed.  The chicken was dry and tasteless, and the  grilled vegetables had a funky taste.  I suspect the kebab had been left out in a heating pan for a very, very long time.  Furthermore, the falafel was dry and gritty, and when I asked for tahini sauce to go along with my meal, I got a tiny solo cup's worth that was barely sufficient for one of the two falafel chunks that came with my meal.  The portions were also  small.  I finished my meal still hungry and with a bad taste in my mouth.To be fair, I probably would have had a much better experience if I had followed the crowd and ordered the chicken shawarma pita like everyone else did.  Regardless, my experience that day was very poor.", "rating": "1", "date": [2011, 12, 5]}, "45": {"description": "Blech!  You call that a Shiskebob?  And what is that yellow mush with the florescent heavy looking liquid on top?  You call that Hummus with olive oil?  And the Pitas?  Oy Vey the Pita's.  Use them as pizza dough, but please don't call them a pita.  And why oh why would you put sprinkled cheese on any Mediterranean sandwich?  Why god why?!!!If the middle east had any idea what was going on in this restaurant, they would stop the wars and Intifadas, Jews and Arabs alike, and they would unite to erase this tasteless chain of crappy food.I want my money back.Oh, and you get a second star for cleanliness and friendliness.", "rating": "2", "date": [2010, 2, 2]}, "33": {"description": "I was so happy to find a affordable place to have lunch on Michigan ave Magnificent Mile. For $6.99 I got a very tasty chicken schrawma with a side of red pepper hummus. I don't recommend this hummus it was very bland like it could have used some garlic and lemon?Definitely check this place out if you want something different from the typical Chicago eats.", "rating": "4", "date": [2011, 9, 2]}, "43": {"description": "Yum!  I really like this place!  I work across the street from the Northbridge mall, so I come here relatively frequently for lunch when I need to get away from my desk.  I find myself almost always going to Mezza when I come here, even though there are definitely some other good options at the food court (which is a million times better than your average McDonald's-Subway-Sbarro food court.)  I love all the toppings you can choose from, and their pita bread and shwarma chicken are really good.  I'm all about the feta, veggies and hummus, so when I need a reasonably priced and reasonably healthy meal, I come here!  They're also usually pretty quick and efficient, even when the line gets long at the noon rush.", "rating": "4", "date": [2010, 7, 12]}, "2": {"description": "Got a salad that I thought looked good but it was SO expensive and after I had it in front of me I realized I paid $10 for old lettuce, green peppers, tomatoes, and a few pieces of chicken. A salad at Naf Naf is cheaper and SO much better! Nothing really tasted fresh and the flavors were pretty bland. Would have much rather gone somewhere else for lunch but it was the only place without a line (wonder why). Won't be back.", "rating": "1", "date": [2015, 10, 20]}, "18": {"description": "I'm a big fan of the spicy chicken pita sandwiches, they're huge, tasty and full of veggies. The shepard's salad is also tasty, goat cheese, dates, avocado, YUM.   For some dumb reason today, I decided to get a falafal wrap. It was disgusting. The falafals were kind of raw tasting and the wheat wrap tasted like wood flavored cardboard.  Well at least I now know what I can and cannot get here.", "rating": "3", "date": [2013, 8, 1]}, "41": {"description": "Um, no. This is not the place to go for a good or really even decent felafel. I have visited Mezza before and have never been over joyed with the food. But, you know, after a while you can give a place a try again. Nope. Total fail.That plus I had to give my order at least three times and still it was messed up. But it was sort of sweet watching the girl at the register flirt with the guy behind me. Anyways. Hold out for Sultan's Market.", "rating": "2", "date": [2011, 1, 25]}, "52": {"description": "Forced to eat here by default: there's no other falafel in walking distance in Streeterville. They open at 11am, but had no falafel nor fries made by 11:30am. WHAT are they waiting for, a fuming angry, starving crowd of disgruntled consumers!?!?!? Oh...just wait....they're coming after they eat this repugnant \"falafel.\"You only get 2, squished into a SHITTY store-bought, generic pita. No surprise, the employees are all Mexican, not Middle Easter! What do they know about authenticity? Hummus, Jerusalem salad are flavorless & probably 3 days old. Add to it the most nauseating \"tahini\" sauce!!! It is sweet, like vanilla yogurt!?!?! Absolutely repulsive.Take a bus, if you have to, out of the 'hood for mediocre Middle Eastern. You won't find edible food at Mezza.Except one star for the fries...if they are ever fresh or ready made!", "rating": "1", "date": [2009, 9, 9]}, "50": {"description": "Trying to break my addiction to Potbelly's and looking for a good falafel sandwich close to my office, sooo I decided to give Mezza a try. Oops, wrong decision. Too salty. Too mushy. Too gross. Now I know not to stray from my beloved Potbelly's.", "rating": "1", "date": [2009, 11, 5]}, "4": {"description": "I love Mediterranean food, but if you're looking for a quick bite, head south down Michigan Avenue to Naf Naf Grill.  The options are more plentiful, the food much tastier, and the portions more generous.  Mezza is expensive  - $11 for a fairly small plate of food with limited side options.  I always leave feeling underwhelmed with my lunch and a bit ripped off.", "rating": "2", "date": [2015, 8, 8]}, "6": {"description": "Decent place. Falafel is pretty good. Freshly make and fry it. I love Mediterranean.. So this is one of easy location wise during your shopping at Nordstrom.", "rating": "3", "date": [2015, 9, 6]}, "22": {"description": "I come here a lot for a quick, tasty, healthful lunch. There is a lot of selection, but since I'm mostly vegetarian, I stick with the always delicious lentil soup and sometimes get the salad/soup combo with the mezzeterranean salad (or whatever they call it!). They make their salads and sandwiches to order and I appreciate having an alternative to all of the gross burgers and fast Mexican places. Tip: Ask for extra pita. They only give you one slice otherwise.", "rating": "4", "date": [2012, 5, 18]}, "15": {"description": "Didn't even get to eat there. They were cleaning up and closing before 3pm. Very disappointing when looking for gluten free options... No offer to make anything either!", "rating": "1", "date": [2015, 4, 17]}, "57": {"description": "Pretty good. I had the mezzaterrian chicken pita (~$7). I felt it had a decent amount of food inside the pita. This is kind of a mall fast-food type of place but the ingredients tasted pretty fresh. The guy serving the food behind the counter was pretty friendly and it was nice to see him slip on a pair of gloves before making my food. I would eat here again.Food Quality/Taste = 4 StarsPortion Size Given Price = 4 StarsPrice = 3 StarsService = N/AExperience with Staff = 4 StarsDecor = N/A", "rating": "4", "date": [2009, 8, 9]}, "20": {"description": "I'm a big fan of the spicy chicken pita sandwiches, they're huge, tasty and full of veggies. The shepard's salad is also tasty, goat cheese, dates, avocado, YUM.   For some dumb reason today, I decided to get a falafal wrap. It was disgusting. The falafals were kind of raw tasting and the wheat wrap tasted like wood flavored cardboard.  Well at least I now know what I can and cannot get here.", "rating": "3", "date": [2013, 8, 1]}, "36": {"description": "Mezza is fabulous! I go there everytime I'm home and always order different things off the menu. My fav? The steak wrap with all the veggies I can possibly get on it. Everything is always delish, fresh and fast. The service is great. Everyone is really friendly and if you are not satisfied, they will help to make sure your food is perfection.", "rating": "5", "date": [2011, 5, 24]}, "14": {"description": "The girl that helped me was not in a good mood and bitchy, sorry if your job sucks. I got a steak bowl, the rice was hard and steak was like rubber. I threw half of it out. No thanks.", "rating": "1", "date": [2014, 7, 17]}}, "neighborhoods": ["Magnificent Mile", "Near North Side"], "latitude": 41.8917667, "longitude": -87.624208, "rating": "3.5", "times": {"Mon": ["11:00 am", "6:00 pm"], "Thu": ["11:00 am", "6:00 pm"], "Sat": ["11:00 am", "6:00 pm"], "Wed": ["11:00 am", "6:00 pm"], "Tue": ["11:00 am", "6:00 pm"], "Sun": ["11:00 am", "5:00 pm"], "Fri": ["11:00 am", "6:00 pm"]}, "price": "$", "categories": [["Mediterranean", "mediterranean"]], "address": ["520 N Michigan Ave"], "attributes": {"Has TV": "No", "Parking": "Garage", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Wheelchair Accessible": "Yes", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Accepts Bitcoin": "No", "Ambience": "Casual", "Dogs Allowed": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "83"}, "chick-cago-grille-chicago": {"comments": {"1": {"description": "The chicken/rice soup is utterly hideous!  The rice had exploded into mush and the sodium level was toxic.  The first spoonful was so salty it merely tasted metallic.  I tried to pick bits of carrot or other (still recognizable) pieces of food to eat but it was like eating brine. I threw it away.  This stuff could be used to de-ice roadways or aircraft!  Ugh!", "rating": "1", "date": [2016, 1, 28]}, "9": {"description": "First time here! Great place to grab a bite to eat. I had the Lakeview Spinach salad which was really tasty without the bleu cheese of course. Nice place to eat at after a day of shopping at Nordstrom!", "rating": "4", "date": [2014, 6, 12]}, "23": {"description": "I find their chicken dishes very very tasty.  I haven't had the soup, but I've had a couple chicken sandwiches and the Lemon chicken and they were both quite good.  Their food is very flavorful and the chicken is tasty and moist.  This is not generic food court fare.The only thing I will say is that service could use a little hustle.  Everyone is nice, just sortof, taking their time.  Though they are usually not busy when I go in, so maybe that is why they aren't hurried.", "rating": "4", "date": [2011, 1, 14]}, "25": {"description": "Really disappointing.  $7.50 for a puny sandwich??  I got the bruschetta chicken sandwich (or some similar name).  Came on small bland bread.  I'd rate the bruschetta as like... pretty ordinary, but at least there was actual mozzarella.  There wasn't much of it, however -- certainly not enough to justify the price of the sandwich, which also came with chicken breast.Oh, and they give you flavorless tortilla chips with your sandwich -- straight out of a Kirkland (CostCo) bag!  (I saw them pour it right before I was served my meal.)Definitely NOT going back.", "rating": "2", "date": [2011, 1, 8]}, "12": {"description": "I just went there for lunch. I don't know what the last reviewer was talking about, it was no good. My salad was far from huge, it was in a big-ass container with very little lettuce and veg on it. I got the bruschetta chicken one. There was lots of chicken, but it was tiny otherwise. The soup I got on the side was thing and watered down, really icky. I am eating my lunch right now at my desk wishing I hadn't given this place a try. Also, the check-out person rang me up, had me sign, and I was like, where are the bags? \"They are right there,\" she said, pointing next to her, \"and silverware is right there.\" Really, you don't have time in your empty place to throw my stuff in a bag for me?If they want to last they need to kick it up a notch.", "rating": "1", "date": [2011, 3, 16]}, "21": {"description": "I've had a sandwich from here 3 times now, and I've finally made up my mind on how I feel about it. Nothing at this food court excites me very much, so when Chick-cago Grille opened I was happy to have a new option. First, let's be honest... the name is dumb.Second, the layout of the joint is so weird to me. When you walk in, you just kind of wander around until someone asks if they can help you. I'm weird about space-planning and this annoys me.Third, the sandwich I get is actually pretty good... turkey on focaccia. Yes, the chips are weird store-brand tortilla chips, but over-all, I like it. On Tuesdays, you get a sandwich, chips, pickle & drink for $7.50... not too shabby. My only complaint is that sometimes I'm not so thrilled about the dude making my sandwich... like, get that hair up in a net already. But, I haven't found any stray hairs yet, so here's hoping.", "rating": "3", "date": [2011, 2, 15]}, "16": {"description": "I'll start with my biggest problem with this place: When you walk in the door, you are immediately attacked by 2, 3, or even 4 different servers.  \"CAN I HELP YOU MISS?\" \"CAN I TAKE YOUR ORDER?\" \"WHAT WOULD YOU LIKE?\" While some people may think that seems like good, prompt business, it's nothing but annoying and rude when you literally JUST stepped into the place and haven't even had the chance to look at the menu (or are OBVIOUSLY still reading it, like come on, give me 60 seconds to LOOK!).  I've had to tell them \"I'm still looking\" so many times before that I've gotten too annoyed and just left without buying anything.  It's also the reason I avoid stepping into the place whenever possible, because I DREAD the in-your-face, pushy service.On to the times when I DID grin and bear their annoying behavior:Bruschetta salad: decent, but kind of wet tasting.  I think the chicken was wet or something. But it was good. 3 cheese pasta without chicken: Good. That's it.  Watching them pull the wet noodles out of a big container sitting on the COUNTER and throwing some sauce and cheese into it is NOT appetizing, but it was a decent amount and okay taste-wise.  Though the container they put it in spilled all over the bag I carried it in. Pizza: DO NOT ORDER THIS TO-GO.  It was literally a PILE OF MUSHY CHEESE by the time I walked the 2 buildings down back to my office.  Gross.  The crust was stuck to whatever plate they put it on and it wasn't even cooked all the way! Yuck. All in all, MEH. You can find much better food for the same prices elsewhere, including the other places in this food court :)", "rating": "2", "date": [2012, 3, 21]}, "17": {"description": "I'm very pleased with this place. Where else can you find a good bowl of homestyle soup for $3.50 in Streeterville?!I discovered this cafeteria-style eatery one day when I took a trip into the Nordstrom building. I've only had their soup and sandwich items, but all were very good. I especially liked the Lemon Chicken Basil soup! Service is fast and food is always served hot. And the menu items and specials can conveniently be found on a dry erase board outside the establishment.", "rating": "4", "date": [2011, 8, 25]}, "10": {"description": "This is a solid 3.5 stars for me. I wasn't expecting very much when I walked in, but I ordered the lemon chicken for lunch to go.  First of all, they give GIANT portion sizes.  The $8 lemon chicken is basically enough food for 3 lunches.  I got about half a dozen pieces of chicken, very moist and really flavorful.   They add some cilantro and bruschetta on top, along with an awesome sauce. I actually got extra sauce on the side cuz I like my food to be flavor-overloaded.I'm definitely coming back here and trying some of the other entrees-probably not the hot dogs or italian beef since I can just go to portillo's, but the entrees seem solid.", "rating": "3", "date": [2013, 5, 21]}, "5": {"description": "In searching Yelp for a sandwich place near my hotel in Chicago, this place sounded better than most other options. I ordered the Thai salad and have 3 positives about that choice - huge portion, fair price and lots of pieces of chicken.  The latter is nice because so often a salad comes with a few pieces of chicken on the top and almost none elsewhere in the salad.  The negative - the salad was essentially tasteless.", "rating": "3", "date": [2015, 4, 27]}, "11": {"description": "Stopped in to grab a quick lunch to take back to work...Easily the worst 'italian beef' I've ever had. Bun was dry, beef had very little flavor. Asked for hot giardinera, and maybe got a teaspoon of it on the entire sandwich.Asked for it dipped, and the sandwich was dry as a bone. They should be ashamed to call this Chicago Italian beef.", "rating": "1", "date": [2014, 6, 14]}, "22": {"description": "I work next door to this food court so I often come over here for lunch during the week.  I hadn't seen this place before so I popped in to see what their offerings were like.  I ended up ordering a Frontier Chicken Wrap and I wish I'd chosen something else.  It's made by putting some boiled chicken from a watery vat in with some spicy tomato sauce (think a mix of salsa and pasta sauce), warming it up, then dumping the whole thing into a burrito tortilla.  It was so very watery - the chicken wasn't well-drained before putting it in the tomato sauce and there was a lot of sauce!  Add some stale tortilla chips and a pickle... plus a drink, and that'll be $10 please.By the time I got the sandwich back to my office (next door, mind you) it was so soggy I could barely lift it to eat it.  The sauce is good, but the fact that I have a half inch of greasy water/juice in the bottom of my tray just kills it.  It's a HUGE wrap and I'm trying to think of a way to salvage the other half, but I don't think it's gonna happen.  The best part of the lunch?  It's a toss-up between the pickle and the Diet Coke.I wanted to like this place because they use antibiotic-free chicken, but until they learn how to cook it I won't be back for a sandwich.  Maybe I'll try a salad next time.  I will say that the staff were friendly.", "rating": "2", "date": [2011, 1, 19]}, "0": {"description": "We visited Chick-cage grill over the weekend. There were no customers so we ordered and received our food very quickly. My husband and I loved this place! First off, it was halal! We order the Cajun chicken and chipotle chicken sandwiches with a side of coleslaw. Both sandwiches were flavorful and most of all, grilled fresh. The bread was so soft and perfectly portioned. The chipotle sauce is amazinggggg! Order extra! It made up for some lack of flavor in the chicken. However, the Cajun chicken sandwich was incredible! It is spicy and extremely flavorful, my husband didn't want to share. Coleslaw was light and tasty as well. The service was great too. The price is reasonable given the location, $7.50 for a sandwich and side.", "rating": "4", "date": [2016, 2, 15]}, "20": {"description": "I recently went to the food court in Northbridge Mall on Michigan Ave and was pleasantly surprised by the offering of this new restaurant  specializing in \"natural\", hormone free meats and fresh produce, I was surprised by the variety of food offerings.  I originally had the Chipotle Chicken sandwich and really enjoyed the meal.  I later tried their Reuben sandwich, and for a fast food location it was extremely good.  I highly recommend that you try this new gem on the Magnificent Mile.", "rating": "4", "date": [2011, 2, 18]}, "19": {"description": "Over time, although I still like this place, it just doesn't jump out to me as much as it did at first. I'm taking my vote down by 1 star since the last reuben I had there was just so-so. I think they should focus on a couple of killer specialties to become a little more memorable.", "rating": "4", "date": [2013, 6, 10]}, "2": {"description": "The best fast-food in the area ! It's fast food but it's 100 times better than any other place in the area. Food is fresh, and yummy. I have tried so many things never tasted something average. All the menu is amazing! I love this place.", "rating": "5", "date": [2014, 11, 6]}, "18": {"description": "The three-cheese chicken penne sounded awesome and I ordered up.  I should've stopped the train when I saw the cook dip her tongs into a vat of hot water to pluck out chunks of chicken for my meal. Alas, I did not.Because the chicken had been soaking in water, it took on the texture (and taste, oddly) of canned tuna. The entree tasted exactly like tuna casserole.  Hey, I love tuna casserole.  But not like this.", "rating": "2", "date": [2012, 1, 25]}, "13": {"description": "Love their food. From the salads to the sandwiches and entrees this place is great. If you look at the name of the place you may wonder what kind of place this is, but the owner is an Afghani guy who used to own the best Afghani restaurant on Devon Ave (it's been like 10 years and there still isn't a place as good). Anyway he uses his recipe on several items including Lemon Chicken, Devon Yogurt Chicken and more. My go to item is the Southwest Chicken Salad with Lemon Chicken. You cannot go wrong with anything that has Lemon Chicken in it. He does charge $1 more for it but it is definitely worth it.", "rating": "5", "date": [2013, 6, 27]}, "4": {"description": "Excellent flavorful food, fast service, great location and light on the wallet. I had their Adobo chicken which was the most flavorful chicken dish I have had in the last year. Highly recommended. This is going to be a regular stop from now on on my Chicago visits. Another added bonus, all meat is HALAL!", "rating": "5", "date": [2014, 11, 1]}, "24": {"description": "Just went in to get a quick bite to go. Can't vouch for other menu items but the spinach salad and tortilla soup were delicious! Spinach salad: spinach, grilled chicken, croutons, blue cheese, pecans, port wine vinagrette. Tortilla chicken (soup of the day): cheese, crispy tortilla strips, lots of chicken, red peppers. Outstanding for the price and for a mall food court. Staff was very courteous and attentive and even offered to replace any of the salad ingredients with something else (if I didn't like blue cheese, which I do). Will definitely go back.", "rating": "4", "date": [2011, 1, 12]}, "6": {"description": "All I need to say is that anything with lemon chicken is fantabulous! I always get the lemon-chicken with chipotle sandwich. It hits the spot every time and always cooked juicy and right. I order this same dish every time I go. Once I tried venturing away and trying something new... It just wasn't the same. Anyways check it out, you will not be disappointed. Located in the food court in nordstrom mall and yes, it's Halal !!", "rating": "4", "date": [2014, 9, 4]}, "15": {"description": "This place destroyed and insulted the Italian Beef sandwich. I thought I would give it a try in maybe giving the Italian Beef sandwich a little bit of a twist but it tasted more like a revved up version of an Arby's roast beef sandwich with some cucumber style sauce and the green sauce in the cup? Cmon what's with that? And no this isn't Jerry Seinfeld reviewing this lol. I should of stuck with my Coast Burger which is still my favorite place to go at this food court.", "rating": "1", "date": [2012, 8, 7]}, "7": {"description": "HALAL!! Ideal location! Right on the magnificent mile in the Nordstrom mall. How could you go wrong with all of those pros? We have visited this place a couple times now and they have changed their hours. We used to always go and see that it was closed. I would always end up angry and promise never to return. But thanks to my wife's persistence, we walk in one fine summer day, she grabs their chicken chipotle sandwich and we were both shocked and happy at the same time. Good food, good service, and a lot of Halal variety. We have had the chicken chipotle as well as the chicken penne. Let me tell you, they do not hold back on the meat. The portions are great and the food is tasty!! If you're ever shopping and need good food...this is a great place downtown in the heart of the shopping mile. Will definitely be going back!!", "rating": "4", "date": [2013, 6, 26]}, "8": {"description": "Their hot dog is quite bad. The bun is stale. The hot dog is way shorter than the bun. They give you no fries. instead they give you nacho chips with no sauce. Once I ordered the wait was about 8 minutes for them to give you a wrinkled dog. The $5 price sounds decent for a lunch, because this is downtown Chicago. But for a poor hot dog, without a drink, it's overpriced.", "rating": "1", "date": [2012, 8, 28]}, "3": {"description": "I was drawn in by the claims of antibiotic- and hormone-free chicken but underwhelmed at the execution - I can only speak of the salad I ordered - mixed wild greens with roast chicken. Plenty of mixed greens which is a plus, but the overall combination of flavors didn't go together well (sounded better on the blackboard) - sun-dried tomatoes, pecans, gorgonzola (?) cheese - and the worst part...the chicken was most definitely not roasted, very small portion, dry, with a weird soy flavor (supposed to be a balsamic dressing). I think they just threw some ingredients together and called it a day...I may chance this place again as others seems to have had better experiences with sandwiches and other items.", "rating": "2", "date": [2015, 6, 22]}, "14": {"description": "I've had a sandwich from here 3 times now, and I've finally made up my mind on how I feel about it. Nothing at this food court excites me very much, so when Chick-cago Grille opened I was happy to have a new option. First, let's be honest... the name is dumb.Second, the layout of the joint is so weird to me. When you walk in, you just kind of wander around until someone asks if they can help you. I'm weird about space-planning and this annoys me.Third, the sandwich I get is actually pretty good... turkey on focaccia. Yes, the chips are weird store-brand tortilla chips, but over-all, I like it. On Tuesdays, you get a sandwich, chips, pickle & drink for $7.50... not too shabby. My only complaint is that sometimes I'm not so thrilled about the dude making my sandwich... like, get that hair up in a net already. But, I haven't found any stray hairs yet, so here's hoping.", "rating": "3", "date": [2011, 2, 15]}}, "latitude": 41.8914914131165, "neighborhoods": ["Magnificent Mile", "Near North Side"], "categories": [["Fast Food", "hotdogs"], ["American (New)", "newamerican"], ["Sandwiches", "sandwiches"]], "address": ["520 N Michigan Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Drive-Thru": "No", "Good For": "Lunch"}, "longitude": -87.6242038607597, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "26"}, "potbelly-sandwich-shop-chicago-8": {"comments": {"1": {"description": "If you are like me, you love Potbelly. In fact I literally find myself there once a week and I am nuts about the chocolate brownie cookie. However, this locations staff had a terrible attitude and the food was somehow not good - almost like the meat was old. The bad attitude and slow service was the worst thing I have a experienced from potbelly in a long time. Trust me, not worth going to this location. Spare yourself a visit to a deserving location.", "rating": "1", "date": [2015, 6, 13]}, "9": {"description": "My bf and I wanted a really quick breakfast (fast food) and passed by the big Nordstrom Mall. Not many fast food places were open except Potbelly's, and we were SO GLAD THAT IT WAS! I really liked how they have a variety of options on the same sandwich you want to get: either the small version which comes with less everything, or a regular version with less bread. They even have the calorie and fat count right on the board so you can make wise choices...Since breaky is my most important meal of the day, I opted for the regular sized Turkey sandwich with spices and HOT peppers. That pepper really added a nice zing and zip to my sandwich. It was so very good! I don't really know what the difference between this sandwich and the ones from Quiznos and/or Sub, but I would come to Potbelly's over the other two anytime!Prices are very reasonable. The only problem I had was that they don't serve coffee (probably not a breakfast joint anyways), but it would have been nice. You can get a variety of drinks and shakes if you're feeling like it though.I would highly recommend this place for a quick bite. You won't be disappointed and be sure to ask for the spicy peppers!", "rating": "4", "date": [2012, 4, 5]}, "23": {"description": "I'm giving Potbelly's some love. I don't know how some Potbelly's get 4 stars and others get 2. To me, they are basically all the same. I don't care what anyone says, I love Potbelly's. The Italian always satisfies me. I'm a sucker for the toasted subs, and their malts are pretty damn good too. I'm reviewing this location because it's where I go to most for lunch. It's still good even if it is in a mall. I'll take Potbelly's any day over Jimmy Johns, Quiznos, Subway and Cosi. You get what you pay for, I say. And I'd like to know who has a better sandwich for under $4. And when they are busy during the rush, see how Potbelly's runs like a well oiled machine.", "rating": "4", "date": [2008, 5, 25]}, "5": {"description": "I'd love to give this Potbelly 5 stars because of the vegetarian (not on the menu but it's mushroom and cheese - and you MUST add hot peppers). It's my favorite sandwich from any shop ever. It's what I order when I'm craving an indulgent lunch - with a malt and some chips. However, when I want something healthier I'd opt for a salad. But not here. Salads are supposed to be green, and Potbelly's Mediterranean salad, which is supposed to have a mix of romaine and spinach - was not. It had generous servings of all of the toppings that are mentioned in its menu description except spinach... and green romaine. All of the \"leafy greens\" I was hoping for were crunchy whites. It is because of this salad I am subtracting two stars from my rating. Potbelly, I still love you, but I'm not IN love with you. I will always come back for the vegetarian sandwich, but I definitely won't stay for the salad.PS I also one time saw R. Kelly dining at this location and it made my weekend, so thanks for that, too.", "rating": "3", "date": [2014, 9, 10]}, "25": {"description": "The lines get a bit long during the weekly lunch rush, but it goes super fast as you yell out your order a mile away from the counter. The sandwiches are fresh and tasty... I love the pizza sub with extra mushrooms. The frozen yogurt shakes are great, too. And the cookies and dream bars are heavenly. My only complaint: sell chocolate chip cookies!", "rating": "3", "date": [2006, 7, 26]}, "12": {"description": "Perfectly terrific toasted Sammie's in my humble opinion. For those with a protein heavy big appetite you can't beat their Italian meat combo, just ask for double the meat ($2 more! Bargain of the century) and top with everything (hold the mayo and oil - the toasting generates enough oils from the cold cuts). They were clean, friendly, fast and if I was in the mood their ice cream shakes and malts at under $3 per item are a real bargain as well and damn tasty. Not sure why this location scores so low - but it does lack a soda fountain (for free refills) and the usual quirky atmosphere here.....", "rating": "4", "date": [2013, 10, 26]}, "21": {"description": "Great sandwiches and good service.  One of the employees even gave me a suggestion to drain the hot peppers to take out some of the heat, which i will always do now!  Thanks for the tip.", "rating": "5", "date": [2009, 12, 18]}, "16": {"description": "We stopped at Potbelly right before we headed home from Chicago. We had heard it was pretty good food and fairly cheap, so we thought it'd be great for a quick lunch. Not a whole lot to say about this restaurant, other than it's an okay place to grab lunch. This one is in a food court, so we walked through the line and got our sandwiches.I got an Italian and the other got A-Wreck. Both were good, with fresh bread and fresh ingredients, and the toasting of the sandwich made it better. However, neither sandwich was anything special. Okay for a quick lunch, but nothing to go crazy over. Each regular sub (which seems to be about 8\") is $5, which is reasonable, with limited toppings available.This restaurant seems okay for those who live in Chicago, but if you're visiting, don't put this at the top of your list.", "rating": "2", "date": [2011, 3, 30]}, "17": {"description": "I've been frequenting this Potbelly's for 3 years, since I work in a nearby building. This review is solely based on the SERVICE. **I think the food at Potbelly's is good for a chain and it's pretty valuable based on the good quality of the menu items and the low prices. It's conveniently located, as well.**  On to the not-so-good parts...It's pretty obvious that within the last year or so management has switched over.  I go to this place multiple times a week, and it went from never making any mistakes to literally making a mistake every single time I go there.  If I get my order right, my coworker's is wrong, and vice versa 99% of the time. The obvious lack of training is inexcusable. I don't blame the workers, I blame the management. Once in a while is totally okay and forgivable.  But for example, the last 4 times I went go like this:1. Wrong salad dressing2. \"Pizza\" sandwich with FOUR pieces of pepperoni...might as well call it a sauce and cheese sandwich3. No croutons (which is always funny, seeing as how they ASK you if you want them, but obviously don't listen to the answer.)4. Wrong soupThis is just a sample of the last 4 times since they are fresh in my memory. But man, this gets frustrating and annoying! I want the Potbelly's service I know and love from other locations! Disclaimer: I have worked in similar environments for years (Panera for 3 years) so I UNDERSTAND what it takes to run and work in one of these places. Get it together.", "rating": "2", "date": [2012, 3, 30]}, "10": {"description": "Sandwiches, soups, salad, etc is always good here. I've never had a bad experience with that. My rating has to do with the poor customer service I just experienced. First, there was no one in line and no one around when I initially got to the counter. Finally a guy with glasses comes out but proceeds to do other things after saying hello. When he gets around to take my order he assumes the type of sandwich I want. I tell him is like the multi grain. He proceeds to push the flatbread multi grain after I tell him that is not what I want. Then he literally will not make my sandwich until I tell him why I do not want the flatbread. That is completely rude and unnecessary. I tell him I'd just like my sandwich the way I ordered it - so he finally starts making it. I get it the flatbread is a new thing they're trying to promote, and they have to try selling it. I know it tastes good too, but I don't always want it. It is rude to fight with someone on their order and lose a frequent customer because of this.", "rating": "2", "date": [2014, 6, 16]}, "11": {"description": "my first time at a potbelly. The manager Joe was incredibly ride and rushed me, then he put the order in wrong after all that. Cornell and Arielle were awesome though and tried to make up for it. But joe needs to learn how to treat customers.", "rating": "2", "date": [2014, 9, 19]}, "26": {"description": "Sandwiches are ok- fine, but nothing special. The sugar cookies on  the other hand are out of this world! Yummy!", "rating": "3", "date": [2006, 3, 28]}, "27": {"description": "You know the drill. Yell your sandwich, let it toast, pick your poisons, eat quick and cheap.This location is relatively indistinguishable from the others.", "rating": "3", "date": [2006, 2, 26]}, "0": {"description": "The location is what bumped this review from a 2 to a 3. The food is pretty standard for potbelly. I had my usual order of roast beef with cheddar- some of the lettuce on my sandwich was frozen (?) and I'm not sure why. The customer service was lacking. The lady who took my order was borderline rude. Maybe she was having a bad day, but she hardly acknowledged me or any of the other customers! The location of this potbelly is great- right above the shops of northbridge. Perfect for a quick meal after a long day of shopping or walking up and down mag mile. There's plenty of seating (as the 4th floor of the shops is food court styled). Don't know if I'll be coming back to this spot.", "rating": "3", "date": [2016, 1, 8]}, "20": {"description": "Best Potbelly in the city!  I love these guys!  I always order ahead on the internet, because the line here at lunch time is God awful (as expected for the location).  But they always have my order ready, and they remember me...and that I'm the skinny fat girl that orders the oreo shakes every day...I stopped that, btw.  But those shakes rock my world...the earth could be crumbling around me and it wouldn't matter if I were sipping on that shake.The Wreck, cliche, I know, but oh God is it good.Do it, often.", "rating": "4", "date": [2010, 5, 27]}, "19": {"description": "always add hot peppers and the italian seasoning to any sandwich!  i think the regular size is good enough to fill me up.  my two favorites are \"a wreck\" and the mediterranean one (add the chicken!).  their pickles are yummy too!", "rating": "4", "date": [2013, 4, 15]}, "2": {"description": "The sandwiches are alright. However, the other day I got an Uptown salad from here that totally changed my opinion. First of all, the description of the salad said a mix of lettuce AND spinach. It would be generous to say I got two tiny leafs on spinach in my salad. For the amount I paid for it, there could have been a great deal more spinach. Also basically all of the lettuce in my salad was the less appealing white, stalk part of the lettuce. This sent me over the edge. Probably the last time I'll come here.", "rating": "1", "date": [2015, 6, 2]}, "18": {"description": "Best Potbelly in the city!  I love these guys!  I always order ahead on the internet, because the line here at lunch time is God awful (as expected for the location).  But they always have my order ready, and they remember me...and that I'm the skinny fat girl that orders the oreo shakes every day...I stopped that, btw.  But those shakes rock my world...the earth could be crumbling around me and it wouldn't matter if I were sipping on that shake.The Wreck, cliche, I know, but oh God is it good.Do it, often.", "rating": "4", "date": [2010, 5, 27]}, "13": {"description": "my review is for their customer service...i've been going to this place since they have opened many years ago and have had no issues...today, i go there and i'm the only customer and no one else in line but it took them 5 minutes until they took my order...the staff were too busy chit-chatting with one another...one person was extremely rude and was talking down at me...he had zero customer service skill...he did this several times while he was making my sandwiches...when i finally reached the register, i asked to speak to the manager...it turns out that the person i intend to complain about was the manager", "rating": "1", "date": [2013, 6, 27]}, "4": {"description": "The food is fine... Pretty much on par with every other Potbelly in existence. But this place takes the cake with their awful customer service. I work in the area and this location is convenient for a quick lunch. The employees always seem less than pleased to fill your order and annoyed that you've chosen to dine at their establishment... But lately they have really upped the ante when it comes to terrible customer experience. One night a few weeks ago around 5:30pm, my coworker and I were craving a sweet treat. I volunteered to run to Potbelly for smoothies. I waited in line for nearly 10 minutes to be told \"we aren't making smoothies anymore\". I said \"Oh so they were removed from the menu?\" To which she replied \"Nah we are done making them today.\" But, you are open... And it's on the menu...Ten minutes ago, I was craving soup so I ran to Potbelly again. As I checked out at the register, the employee told me (literally, verbatim) that the soup I had ordered \"had a nasty after taste\" and she was shocked I had ordered it. What?!This place would probably benefit from some customer service training.", "rating": "1", "date": [2015, 6, 2]}, "24": {"description": "My first trip to a Potbelly's.  It definitely ranked higher than Subway or Quiznos in my book, but is along those same lines.  Only odd thing - one half of my sandwich was yummy with a nice spicy kick, the other was way spicier and made my nose run.  Same sandwich.  I don't get it.  If I had listened to my belly rather than my ever expanding waistline, I would've gotten the pizza one.  Mmmmmm.", "rating": "3", "date": [2007, 9, 30]}, "6": {"description": "No trip to Chicago is complete without stopping into one of my favorite lunch spots.  This is a location I'd not been to yet and I found it to be very similar in all aspects of the other locations only this one didn't have live music.  It's a bit smaller than the other ones I've been to but the layout is similar and of course the food and ordering are the same.  I love the turkey sub.  It always comes out hot and fresh and just the right amount of cheese melt for deliciousness to occur!", "rating": "3", "date": [2013, 3, 29]}, "22": {"description": "This location overcharged me. The mini sandwich was okay but I just don't like getting ripped off.", "rating": "3", "date": [2009, 8, 14]}, "15": {"description": "After hearing people rave about this place for sandwiches I knew I had to try it out. I decided to get The Wreck which was delicious. Packed with flavor and definitely a comforting meal for a snowy day. There weren't any lines when we went and since it was located in the Nordstroms mall it's definitely a convenient location for those who also want to get some shopping done. And the view is gorgeous from the second floor on a snowy day!", "rating": "4", "date": [2012, 3, 16]}, "7": {"description": "Good roast beef and provolone sandwich.  Had them make it thin. Staff was friendly and fast.", "rating": "4", "date": [2014, 9, 26]}, "8": {"description": "Makes me sooo happy when the two employees are having a grand conversation, ignoring the customers. Nice work.", "rating": "1", "date": [2013, 12, 16]}, "3": {"description": ".... what can I say - Potbelly is awesome.Located in the food court at the Shops at Norhbridge - this location rocks and rolls and gets you in and out quick - with a smile.  Close to many offices, which makes it a convenient choice.Tip:  They have the best cookies ever!!", "rating": "4", "date": [2014, 3, 3]}, "14": {"description": "If you're looking for a quick sandwich shop for lunch (locations all throughout Chicago) that'll blow subway and Jimmy Johns outta the water? Look no further, come to Potbellys. It's nothing fancy, but the ingredients are all fresh, I always prefer wheat but the white bread is my favorite here. The turkey and roast beef are all solid standbys!", "rating": "4", "date": [2013, 7, 14]}}, "neighborhoods": ["Magnificent Mile", "Near North Side"], "latitude": 41.8917667, "longitude": -87.624208, "rating": "3.0", "times": {"Mon": ["10:00 am", "7:00 pm"], "Thu": ["10:00 am", "7:00 pm"], "Sat": ["10:00 am", "7:00 pm"], "Wed": ["10:00 am", "7:00 pm"], "Tue": ["10:00 am", "7:00 pm"], "Sun": ["11:00 am", "6:00 pm"], "Fri": ["10:00 am", "7:00 pm"]}, "price": "$", "categories": [["Sandwiches", "sandwiches"]], "address": ["520 N Michigan Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "28"}, "pandora-store-chicago": {"comments": {"3": {"description": "Just left the store as I was trying on a bead my bracelet Broke  the sales girls said that it's a different franchise and she would not do anything about it even though the bracelet was less than a year old  I would not let my mom buy anything at the store and stoped. 400 sale. When I complained she said she would send it out to be fixed but it would take att lest  4 weeks  but she only said that because I said I was going to call and talk to the manager tomorrow. She still said it was still better to bring it to old orchard.   She did not want to honor a sale from another store. This is not accetable customer service So I would recomened  be careful  were  you buy if it's a present because the sales girl at the water tower did not want to honore a sale from another pandora store. I would not recomend to buy pandora if  the stores do not back the product.", "rating": "1", "date": [2013, 11, 30]}, "1": {"description": "I've been here twice!! Every time I wasn't greeted. My husband and I got married last Friday, so we want to buy a new charm to celebrate this special moment. No sales come or say anything like \"somebody will be with you shortly'. We waited there for about 15 mins. My husband said let's buy it online since we know sales persons there didn't have good service attitude. But I insisted we wait. Finally a sales man came, we said we just married, he said okay...I'm a little unhappy since we waited for 20 mins and then just got this. But I still asked if  they had a special Chinese symbol charm, he just said \"no, we NEVER have that.\" I said I saw it in New York's pandora store. But he said impossible, maybe you just saw some other jewelry but not Pandora's!!! I'm so pissed off then I left bought nothing. It's the day I got married. I was happy before I entered this store. I really saw it in other Pandora's store with my own eye!! Okay? Seriously! How dare he can judge and say that! If I can give 0 stars, I will!! Never come to this store AGAIN!!", "rating": "1", "date": [2016, 2, 7]}, "2": {"description": "I called today and left a message for the manager...no response yet!!   Why does that not surprise me???   Sub par service...so I did not spend anymore than the special.  treated better at Woodfield.  ....I went to the Water Tower store for the Special a few weeks ago....I was told the Radiant Bloom charm was not for sale...only on a special bracelet.  What gives?  I am a very and I mean VERY good customer at the Woodfield store...happened to be downtown and stopped in Water Tower.  If you are going to only sell certain charms on Special Bracelets...let me know.  That is so unfair.  So disappointing..  You may think because you are in Water Tower you have built in business and that may be so...but I will never stop back..you also need good customer service...Managers tend to hire employees like them...not returning my call and your sub par service from employee...shows your true colors...", "rating": "2", "date": [2016, 1, 10]}, "5": {"description": "The people are nice. I wish there were more of them on busy days. They have the cutest charms.", "rating": "4", "date": [2012, 2, 24]}, "0": {"description": "I went in yesterday  where i was \"suppose\" to see Vicki and continue my purchase. Well she wasn't  there smh... Anyway thats fine because Kate helped me and she was awesome. not sure if it was because she knew about my past experience or if it was legit. Either way i was very pleased with the staff there today. No one from my last horrid experience was there. I came in for 1 specific charm and walked out with 5 for my moms bday. That girl can sell lol... so kudos to Kate!!!!!..oh the 4 stars was only because i thought  i was meeting with Vicki and thought  she was aware i was coming  but she left early", "rating": "4", "date": [2015, 2, 13]}, "4": {"description": "I have 2 sisters and a mom, and all of us have Pandora bracelets. We're always excited for every Christmas and birthday because that means we get to go shopping together for new charms. That tradition came to a screeching halt this afternoon when I visited the Pandora store at Water Tower in downtown Chicago to buy a snowman charm for my mom. Some girl with a clipboard walked up to me and basically barked at me that I needed to put my name on a wait list. I was on my lunch break from work, so I politely asked if she knew how long it would be. She replied \"No.\" Ok, awesome. Very helpful. I explained to her that I was on my hour lunch break and if I could possibly add my name to a waitlist now to come and pick up a charm around 5:30. She replied \"No.\" Herein lies my problem. I understand that you're busy. Welcome to the world of retail during the holiday season. But as a loyal customer who is paying a lot of money for overpriced charms that I could buy somewhere else, I expect to be treated with a lot more respect than that. Maybe you could have asked the 3 sales associates standing around the register talking to help out some of the waiting customers? Maybe when asking a customer to sit around with their name on a waiting list, you could do it with a slightly more pleasant tone? My career is in sales and I would never dream of treating a paying customer with such disrespect. All of the bad customer services reviews I've read on the internet are now starting to make sense, and I'm not surprised that about 5 customers walked out behind me after they saw how the woman treated me. A bit of advice - hire sales people who suck less. Oh, and happy holidays.", "rating": "1", "date": [2013, 12, 23]}}, "neighborhoods": ["Streeterville", "Magnificent Mile", "Near North Side"], "latitude": 41.8979112803936, "longitude": -87.62401945889, "rating": "2.0", "times": {"Mon": ["10:00 am", "9:00 pm"], "Thu": ["10:00 am", "9:00 pm"], "Sat": ["10:00 am", "9:00 pm"], "Wed": ["10:00 am", "9:00 pm"], "Tue": ["10:00 am", "9:00 pm"], "Sun": ["11:00 am", "6:00 pm"], "Fri": ["10:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Jewelry", "jewelry"]], "address": ["Water Tower Place", "835 N Michigan Ave Ste 8100"], "attributes": {"Parking": "Garage", "By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "6"}, "red-mango-chicago-7": {"comments": {"12": {"description": "This is the first time I've been to a Red Mango that is self-serve. That in itself is a plus. I'm not a fan about weird flavors. I love their raspberry frozen yogurt. Since it is self-serve you pay by weight. I like to get fruit toppings on mine. Friends of mine love to put fruit and even fruity pebbles on their frozen yogurt. The place is on 7th floor of Water Tower. It shares a space with Auntie Anne's.", "rating": "4", "date": [2012, 6, 20]}, "3": {"description": "Fall from glory...they have been SO inconsistent lately.One time I went in and all the taps were loaded with different flavors and the texture was solid.  They even had two flavors of the new sorbetto.  The dark chocolate sorbetto was so rich for being so light.  I was checked out promptly and even got to use bonus rewards from my mango card.  It was glorious.Another time I went in and more than half the taps were not on and the flavors available were plain and a slight variation of plainer.  Not to mention the texture on some of the flavors came out way to runny.  Then I had to wait to weigh and pay because one clerk was busy cleaning something and couldn't or wouldn't stop to help a customer and the other was in the back.  *Face-palm*", "rating": "3", "date": [2013, 5, 3]}, "1": {"description": "Ehhhhhhh.  The people were nice and gave us lots of sample cups, but everything tasted watered down or artificial or both. I prefer Forever Yogurt.", "rating": "2", "date": [2015, 8, 21]}, "2": {"description": "Store Review:FROYO! Somehow the tart of the probiotic filled froyo is something that can't be replicated even if you pay .56 cents per oz. I recently signed up for club mango and had 5 dollar credit to try and I was not let down. It might even be better than forever yogurt. There is a rotating line of flavors but the best was the original and peach flavor that added the right tart. Toppings include mochi, pineapple, strawberries, and mango which is a unique blend of texture. All this in the 16 oz cup topped off for only 6 dollar ish. I believe the froyo must be lighter than the other competitors. Pros- multiple selection of flavors, friendly staff, low caloriesCons- expensive dessertHidden deals-Sign up for club mango, 5 dollar credit when you sign up and 5 dollars for your birthday. Earn credits for more free FROYO", "rating": "4", "date": [2013, 3, 29]}, "9": {"description": "The froyo was good, but the service...not quite as much.  Found the cashier lady slightly rude, much like many of the other workers in the Water Tower building.  The rare moment I found a nice person, I was pretty shockedI suppose it's convenient for those who want to have self serve frozen yogurt with other food from Auntie Anne's Could use a wider variety of flavours, perhaps I'm too used to Menchies in Canada", "rating": "3", "date": [2014, 3, 27]}, "10": {"description": "I LOVE RED MANGO. BUT WHY IS THIS PLACE NOT AS GOOD?well, i've decided to ask around, and according to the manager at the lincoln park location, he believes that the melty texture of the froyo here is due to the fact that auntie annes that is connected. therefore, it is alot warmer and causes the froyo to melt, which kinda makes sense i suppose.  But, Red mango's froyo is normally super good! gahh!just disappointed.Guess i'll be going to the lincoln park location moreee.", "rating": "3", "date": [2013, 3, 13]}, "4": {"description": "I'm glad that I ventured to the upper precincts of Water Tower Place. I usually stop about floor 3-4, for Lucy/SA Elite/Banana Republic. After a particularly intensive experience at the T. Mobile Store to suss out the latest gadgetry to which my plan entitles me, I knew I needed something to take the edge off. I peeked into this location of Red Mango, which happens to be squirreled away next to an Auntie Annies, and was happy to note that the machines are self-serve. When it comes to fro yo, I prefer to customize my own selections and determine how much/little I want versus having someone behind a counter dictate my preferences. I found the price/ounce on the steeper side, though I did enjoy my combination of original tart and Pina Colada. For a once in a while treat, and a worthy reward for braving the throngs at Water Tower, one could do worse than Red Mango.", "rating": "3", "date": [2014, 7, 2]}, "6": {"description": "Where can you find refuge when your blistered feet are tired of shopping and your bank account has been depleted? Look no further and make your way to the 7th floor and enter the oasis that is Red Mango!After a long day of retail therapy, nothing hits the spot like some froyo. Red Mango shares the the space with Auntie Anne's so you can not only grab a refreshing cup of frozen yogurt, but also load up on some carbs (the pepperoni pretzel is bomb...jus sayin). OK - back to the froyo, RM offers a wide selection of froyo flavors from coconut tart to mango to white peach to my favorite - red velvet. That along with your choice of toppings, nothing can bring you down!So here's how it works - the concept is self-serve so you grab a cup and fill up to your heart's desire of froyo then top it off with their selection of toppings including mochi, fresh fruit, cereal, nuts and sauces. When you're finished, head to the register and you pay by the number of ounces that you're froyo weighs. Simple and quick!Additionally, there's seating along the wall if you choose to chill or you could walk around the mall if you're on the go. Defs recommend coming to this hidden gem when you're having shopping woes or anytime for that matter!", "rating": "4", "date": [2013, 4, 19]}, "0": {"description": "I went twice during my weekend stay in Chicago. They had white peach flavored froyo. WHITE PEACH. Never have I ever had such a delicious tasting froyo dessert, and believe you me, I've had my fair share of froyo on the East coast. The consistency is a little chunky, but I didn't mind. The strawberry and vanilla were good too! Yes, it cost me more than a comparable-sized froyo cup elsewhere, but for me, it was worth the walk(s) in single-digit temps!", "rating": "5", "date": [2016, 1, 24]}, "5": {"description": "My friends and I came here with big expectation, but I have to say: it just okay... We tried chocolate flavor, it's a little bit sour.. We don't know why... And the non-patient service let us down again...Anyway, I don't recommend here...", "rating": "3", "date": [2013, 12, 19]}, "13": {"description": "It's OK,,, but not as good as the other red mango s.", "rating": "3", "date": [2013, 3, 21]}, "11": {"description": "I'm not sure how new of a development this is, but there is a SELF-SERVE Red Mango in Water Tower...INSIDE of the mall's Auntie Anne's Pretzels. Literally the same shop. We discovered this about a week ago and I thought I'd died and went to salty/sweet heaven! Now that BerriChill is no more, Red Mango is my new fav tart yogurt chain in the city. It's a big chain that I tried for the first time years ago in SoCal. But this is the first I've seen that is self-serve! Like a mini version of Yogurtland! Lots more flavors than in the normal Red Mango shops, and of course since it's self-serve you commitment-phobes can mix and match little bits of each flavor. The toppings are self-serve as well and there are TONS. My fav toppings are mochi, fruity pebbles, and these fabulous flavored boba balls they have (mango and strawberry). They're like regular boba, except when you chew them the fruity liquidy gel pops into your mouth. Just trust me...Needless to say we splurged and got Red Mango aaaand shared Auntie Anne's original pretzel sticks. Perfect saltysweetsaltysweet combo!", "rating": "5", "date": [2012, 5, 3]}, "8": {"description": "They have a lot of flavors and toppings. Mango was too sweet and very liquidy. I guess their yogurt machines weren't working properly when I went there. I have been to better yogurt cafés before. This is okay but not the best one out there. You have to pay by the weight which is good.", "rating": "3", "date": [2014, 3, 28]}, "14": {"description": "I don't know why I keep going here, as I always leave slightly disappointed.  I don't find the flavor selection to be all that great, and half the time it seems that they don't have the yogurt dispensers' temperature low enough as often times it comes out drippy and half melted.  Perhaps the other locations in the city are better, but I definitely prefer Forever Yogurt  down the street or Forty Carrots inside Bloomingdale's over this location.", "rating": "3", "date": [2013, 2, 25]}, "7": {"description": "I'm glad Red Mango is located on the top floor of Water Tower Place as the first time I visited Water Tower, I took the escalators up and circled each floor before taking the escalator up to the next floor.  By the time I reached the top, I was parched and needed something to drink and a snack.  A Red Mango smoothie was the perfect thing to quench my thirst and fill me up just enough before my dinner later in the evening.  Service was quick and friendly too.", "rating": "4", "date": [2014, 5, 11]}}, "neighborhoods": ["Streeterville", "Magnificent Mile", "Near North Side"], "latitude": 41.8982525914907, "longitude": -87.62401945889, "rating": "3.5", "times": {"Mon": ["10:00 am", "9:00 pm"], "Thu": ["10:00 am", "9:00 pm"], "Sat": ["10:00 am", "9:00 pm"], "Wed": ["10:00 am", "9:00 pm"], "Tue": ["10:00 am", "9:00 pm"], "Sun": ["11:00 am", "6:00 pm"], "Fri": ["10:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Ice Cream & Frozen Yogurt", "icecream"], ["Juice Bars & Smoothies", "juicebars"]], "address": ["845 N Michigan Ave"], "attributes": {"Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "15"}, "the-limited-chicago": {"comments": {"12": {"description": "The Limited has to be my favorite store for subtly gorgeous grown-up clothes that are very well-cut, made from great materials, and much cheaper than Banana Republic. The store atmosphere isn't what I would call warm and inspiring, but every time I (even hesitantly) buy something here, it turns into a long-time favorite clothing item.This particular store, however, goes over the top a bit with their sales strategies. An employee started a fitting room for me, and as I came to try on my clothes, the room was stuffed with clothing items I hadn't picked out. I thought it was just a mistake, but they told me they had picked these out for me. Uh, thanks! A gray suit? IN A RANDOM SIZE? Maybe others would appreciate the well-intended effort, but I prefer to pick out my own stuff.", "rating": "3", "date": [2008, 3, 25]}, "7": {"description": "It took a lot for me to go here. First off, I hate malls...especially Water Tower Place, especially with the American Girls store. Second, I went to Express before I went here. Long story short, they're overpriced and lie to you about what's on sale.In my quest for new dress pants, I decided to give The Limited a go. I did my deep cleansing breaths, then plodded on to Water Tower. I must say that from the very beginning, I was greeted warmly. No one at this store was \"selly.\" They simply reminded me of the specials, and steered me towards what I was looking for. As most normal people have actual plans on Friday night, the store was pretty empty. I liked this. A long line at a waiting room will completely steer me free of a store, even if I intended to buy.So, kudos to the staff for being friendly and approachable. The store was well-organized and everything was easy to find.Dare I say, I may be back!", "rating": "4", "date": [2009, 11, 12]}, "3": {"description": "I've always been a fan of the Limited, but yesterday the customer service was extra awesome. I don't know if it had anything to do with Adam F. coming with me, but I got $100 off a suit, and an additional $50 off with a coupon, and I also got 50% off on a pair of pants.The sales associate, Grant, was very friendly and helpful. My shopping experience was fast and painless, and my male shopping companion didn't have to wait too long for me...Hahaha.", "rating": "5", "date": [2011, 3, 2]}, "1": {"description": "The Limited has been pretty good to me lately.  With a handful of coupons I was able to save $100....we'll overlook how much I may have spent.  I typically scan the clearance section first.  Yes, I'm a clearance whore.  Their clearance selection was okay, I did score a cute $10 tank so I can't complain.The staff were super friendly, but as far as helpful advice...I'm not too sure if I believe they were looking out for my best interest or their sales level interest.  It seemed like they were trying to tell me what they thought I wanted to hear.  But faulty advice aside, it was a shopping success!", "rating": "4", "date": [2011, 7, 3]}, "2": {"description": "OMFG!  I won?!!  *Takes deep breath*                                 *Clears throat* First, I'd like to thank MTV for all of the votes it took you people to get off your lazy @ss and vote me as the Best Dressed.  Thanks to my fans for recognizing that I don't have to be dressed like a hoochie to still be sexy and attractive.  Most of all, thanks to my stylists for providing me with form fitting suits, fashionable long length jeans, silky shirts that fit just right and allows me to go from the office straight to Yelp events, and cute accessories to dress up my outfits once I leave my place of employment.In case you're wondering where my stylists get my clothes; let's just say they like to use the unlimited amount of coupons in the mail and charge me twice as much.  But, after today's award, I'm dropping them like change spewing out of a winning slot machine.  So, if you want to see a glimpse of me off this stage, drop into The Limited.  Since it's the only one in Chicago, I'm sure I'll run into you eventually.", "rating": "5", "date": [2009, 10, 2]}, "9": {"description": "This Limited is smaller than most, but has a super friendly staff.  I bought my first pair of grown up pants here a year ago and they are still in good shape.  They usually have a buy one get one half off sale every year and a decent selection of sale merchandise as the seasons change.  If  you don't mind wandering through Water Tower it's a great place to go after you've realized you can't afford to shop at Banana Republic.", "rating": "4", "date": [2008, 9, 14]}, "18": {"description": "The Limited is my favorite store for work clothes because everything is well-made and fashionable without being overly trendy.  It reminds me of the clothing that Express USED to have before they decided to be the sweatpants and tank top capital of the world.  This location at Water Tower Place was remodeled about 2 years ago to have more of a boutique atmosphere.  The store seems to be divided into smaller rooms by color.  The front of the store holds a plethora of dress pants, skirts, capris, and great tops for the working woman.  I have recently fallen in love with their washable wool suiting which comes in a variety of colors.  If you travel for work or just don't like to dry clean everything, try this out!  Almost all of the pants come in petite, regular and tall lengths (great for us giants) and they offer FREE alterations on regular-priced pants.  There is a smaller area of casual clothing in the back of the store and a great accessories area.  If you are looking for casualwear that isn't designed for a pre-pubescent-14-year-old, there are great options here for you!  I have found many casual items here that are perfect for the office when paired with a nice pair of slacks.  The Limited's regular prices are not cheap.  Expect to pay $60-80 for a pair of slacks and $30-50 for tops.  However, keep in mind that I still wear basic slacks that I purchased here  4 years ago.  Keep a look out for the great sales and you can often find a 50% off rack in the back of the store.  The often send out coupons too, so sign up for the mailing list.", "rating": "4", "date": [2007, 7, 30]}, "10": {"description": "I love this store!!I got the cutest dress here today and the best part: every time I came out of the dressing room a person was there to comment about how the pieces looked on me. I had a great time and love that there are always sales!", "rating": "4", "date": [2009, 8, 8]}, "13": {"description": "Love, love the clothing and styles here.  Not so much the price though.  But when I think about it, it's worth the investment.  The quality of the clothes are good, the styles are always in fashion.  I also love their events when they close out the entire store for a fashion show with free wine, food, and desserts and 40% off the entire store for that evening.  I can always find some business clothes that's still sexy and appealing.  Kudos to the fashion buyers for choosing amazing pieces of clothing.", "rating": "4", "date": [2010, 9, 8]}, "16": {"description": "I just got my first grown-up job, and this is one of the first places I headed for work clothes. They're trendy, but not too trendy, and a lot of the pieces were very similar to what I had seen 5 minutes earlier at Banana Republic, but significantly cheaper. I got three very classy, sophisticated knit tops for $19.50 each on sale, which you really can't beat. The quality of the pieces is rather good, especially for the sale prices, and the salespeople at this store aren't pushy or rude.", "rating": "4", "date": [2008, 7, 11]}, "17": {"description": "All I can say is \"CHEAP QUALITY.\"  The jeans I bought that were slightly snug on me stretched out so badly they were hanging on me the first day I wore them!  Cheap, \"made in China\" label.", "rating": "1", "date": [2008, 5, 2]}, "15": {"description": "I love this store. I come here often and they are always helpful and friendly. They do need more employees that can be more helpful with fashion and helpful tips; however, there are a couple employees that are amazing. The woman manager is always really nice. I was there the other weekend and a young man helped me with a few super cute outfits. He needs to work more often:)", "rating": "5", "date": [2011, 3, 13]}, "0": {"description": "I have to disagree with Lauren K.  I hope you voice your concerns to the store manager because I don't think your experience is what they intended. I have been a loyal Limited shopper for years but have recently gone more frequently and have spent substantially more money. The Water Tower Limited have incredibly friendly staff. I have twice encountered a not so knowledgeable sales person, but overall they will bend backwards to satisfy you. I love this Limited location and the ladies who work there! Not to mention... I think the pants and suit jackets are great quality for the price.", "rating": "5", "date": [2013, 10, 10]}, "5": {"description": "Dear The Limited,I am BEGGING you to open up another location in downtown Chicago.  Seriously, begging.I hate going to Water Tower.  HATE.  And now that the American Girl store is there?  HATE CUBED.And because you are the only location downtown, you are ALWAYS PACKED.  The lines for the fitting rooms and the lines to check out are enough to make me walk out empty handed.  And I do, nearly every time I go there.  Which is a shame, because I love your clothes.I know the economy sucks, but I'm willing to bet if you opened another location on...  say...  North Avenue...  you would get more than enough traffic to keep your doors open.All my Limited-less Love,Jo Mama", "rating": "3", "date": [2009, 1, 2]}, "11": {"description": "The Limited has really great, classic, styles - perfect for work or for some wardrobe basics like black or khaki pants, capris, suits, etc. They aren't super cheap, but they are a bit less expensive than Jcrew or Banana Republic. I think their clothes are on par, price-wise, with Express but the quality is better. They also have a much better selction of non-almost crotch-baring pants, pants that I can actually wear without sporting a sweet muffin-top. They usually have at least a few more trendy options for night and weekend wear as well. The accessories are great, and they are almost always having some kind of buy one/get one special. The salespeople can be a bit over the top sometimes. You just have to tell them to back off a bit. This is the only store to which I have held on to my credit card. I come in every 6 months or so, stock my wardrobe for the season, and then spend the next 6 months paying off the damage.", "rating": "4", "date": [2008, 1, 10]}, "8": {"description": "While my preferred method of shopping is thrifting, I can't buy pants at a thrift store because I am tall. Its so hard being me.I like their pants here very much. The work pants fit me, are flattering, and can usually be found on sale. Ditto for their jeans. I have one gripe : not all of the pants can be found in the tall sizes. This means that you can buy brown, black and khaki till you go broke, but its a no go for the fun gray ones or the trendy tweeds. This makes me sad. The pants last though - I've been wearing my brown, black and khaki ones for about two years now and they don't show any wear and/or tear.", "rating": "4", "date": [2008, 11, 21]}, "4": {"description": "It has been a while since I've been to the Limited, but I think I'm back... The reason?  Machine washable suits.  I was in need of a suit for an interview and after scouring every store in Michigan Ave, this was the place.  In addition to their machine washable suits, they've just got an overall suit collection.  There was another suit I wanted but couldn't get at the time.  They seem to have lots of promotions which is also a plus.", "rating": "4", "date": [2011, 10, 14]}, "14": {"description": "My hometwon lost The Limited well over a decade, but I recalled it not being all that great when we had it. But this Limited surprised me. I liked the clothes. Not too colorful, not overly trendy. Very nice!", "rating": "4", "date": [2007, 9, 16]}, "6": {"description": "I've been a fan of The Limited for almost 20 years. It sounds like a long time, I know.  Nowadays, it has become a go-to place for my work wardrobe and sometimes every day items like camis, tees,  or cardigans. Unfortunately, it's located in Water Tower, but the store gives me reason to come in here once in awhile.What do I like about this place? With a few exceptions, most pants and jeans styles come in three different lengths: short, regular, and tall. Now, any place that offers short (or tall) length sizes is worth checking out, in my opinion. They also offer free hemming with a purchase of regular priced pants. It's been awhile since I last had a pair of pants fixed here, but I think that's still the standard and thought my pair were fine. Tops and sweaters are pretty basic and, at times, cute. I've also found the suits here to be comfy and have a good fit to them, which is nice because I hate wearing suits for long periods of time. Yes, they are a little pricy, but check out the semi-annual sales and you'll often  find something worthy. Dresses are cute here too. I just found a dress I thought would be unflattering but turned to work out just fine. You know what else - it ended up to be about $20+!  Employees can be hit or miss, but during the week or late Sunday afternoons, they can be very helpful...I think, when the crowd dies down a bit.", "rating": "4", "date": [2009, 8, 13]}}, "latitude": 41.8981895, "neighborhoods": ["Streeterville", "Magnificent Mile", "Near North Side"], "categories": [["Women's Clothing", "womenscloth"]], "address": ["845 N Michigan Ave"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.6239471, "category": "Fashion", "rating": "4.0", "price": "$$", "number_of_reviews": "19"}, "littlemissmatched-chicago": {"comments": {"0": {"description": "A cute little shop in Water Tower that is FULL of socks.  Don't let their colorful, kid friendly displays fool you, they have socks and such for adults too.  They have a friendly sales staff that will perkily greet you with their little slogan.\"Welcome to Little Miss Matched, have you been here before?  No.  Well all our socks don't match!  They're sold in sets of three, so if you lose one you still have two more.\"And that is correct, all their socks don't match, they're a mix of complimentary colors and patterns and are oh so cute.  They also carry stuffed animals made out of socks, bags, and other little trinkets.  A great place for a cheeky gift.  Or for the dancer in your life...they sell some great half socks, or \"spinner socks,\" toe-less socks, etc.", "rating": "4", "date": [2011, 6, 2]}}, "neighborhoods": ["Streeterville", "Magnificent Mile", "Near North Side"], "latitude": 41.8979112803936, "longitude": -87.62401945889, "rating": "4.0", "times": {"Mon": ["10:00 am", "9:00 pm"], "Thu": ["10:00 am", "9:00 pm"], "Sat": ["10:00 am", "9:00 pm"], "Wed": ["10:00 am", "9:00 pm"], "Tue": ["10:00 am", "9:00 pm"], "Sun": ["11:00 am", "6:00 pm"], "Fri": ["10:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Children's Clothing", "childcloth"], ["Accessories", "accessories"]], "address": ["Water Tower Place", "835 N Michigan Ave, 2nd Fl"], "attributes": {"Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Fashion", "number_of_reviews": "1"}, "blended-bean-cafe-chicago": {"comments": {"1": {"description": "My brother and I walked to the Shops At North Bridge to enjoy the Whisper's gelato I remembered so well. It was so delicious. And it was out of business. The man at guest services recommended the Blended Bean Cafe. Why not? We'd try it.  If you haven't been to the Shops of North Bridge it is a vertical mall. Blended Bean Cafe is on the top level in the food court.  Blended Bean Cafe is more than gelato. It serves coffee based beverages and cafe favorites. I went here for the gelato.The gelato window is a work of art. The display was inspired me to up the scoop from one to two. I exchanged close to $6 for two scoops of gelato served in a plastic cup. They were two giant scoops. I ordered the peanut butter cup and strawberry gelato. Color me impressed. The peanut butter cup gelato included diminutive peanut butter cups. Both the peanut butter cup and strawberry gelato were just like the famous avenue below: Magnificent.", "rating": "4", "date": [2014, 7, 28]}, "9": {"description": "Impeccable service! No matter what mood you come in with you'll always leave feeling 100 times better, any drink I ask for is always on point and even if you do not know what you're in the mood for they make sure you get something absolutely delicious. Mango gelato is always a great pick me up :-)", "rating": "5", "date": [2014, 8, 14]}, "12": {"description": "This place has hands down the best coffee in the city. Their blended drinks (especially the white mocha) taste amazing and always put me in a good mood. I live in Lincoln park and make the trek to the nordstroms at least 3 times a week forThe coffee! the coffee art by Musa is also unlike anything else! I will continue to go there and hope that one day they get a location in Lincoln park!", "rating": "5", "date": [2014, 9, 17]}, "21": {"description": "Delicious little place with great customer service too! The coffee and espresso drinks are divine! (Irish nut is my new favorite) All of the juiced items are amazing and they let you mix and match what you want together. The salad bar is always FRESH and has a lot of options and the gelato is also amazing. (I work in the mall so I have the pleasure of frequenting this new joint!) They have offered me a great healthy alternative to the regular food court options. Don't care about counting calories? Then you have to try their crepes! From savory to sweet they've got it all.", "rating": "5", "date": [2014, 5, 17]}, "16": {"description": "I LOVE the blended bean! The staff is friendly, the service is amazing, the food quality is top notch! The green juice is my favorite, but I've tried a couple of their others and they are good too, but I keep going back to that one. (Ask for ginger and lemon in it!) I've also had their salads and I am a huge fan, you can tell they use organic ingredients and I really appreciate having that option in a shopping mall. I've also had their gelato and it is really good too, high quality gelato, it's the real stuff. You can not go wrong with the blended bean. 5 stars all the way. :)", "rating": "5", "date": [2014, 12, 23]}, "17": {"description": "Pistachio is the standard and very delicious gelato in Italy. This place offers pistachio as in Italy. However, the taste of ice-cream is different than its original. I do not like the sharp almond flavor in gelato. Totally disappointed.", "rating": "2", "date": [2014, 8, 6]}, "10": {"description": "Super fresh salads and excellent gelato.  Service is very friendly, yet professional.  I would rate this establishment highly regardless of whether I was comparing it other restaurants, but I am especially appreciative of the fresh food and good customer service when compared to some of the other lackluster options in this food court.", "rating": "5", "date": [2015, 4, 8]}, "5": {"description": "Talk about creativity! Musa, the owner, has a talent for art, which can be seen throughout this cafe. His hospitality is impressive. He is willing to go above and beyond for his customers.", "rating": "5", "date": [2015, 4, 22]}, "11": {"description": "The Blended Bean is a true gem - the owner (Musa) and team consistently produce exceptional coffee- and espresso-based beverages, gelatos, and food. The quality of the ingredients is a differentiator along with the wonderful service. My go-to drink is the iced mocha with 70% Madagascar chocolate and 30% white chocolate. Their gelatos are almost all delicious but my favorite include the spumoni, banana caramel crunch, and pistachio. Further, if you are ever confused or unsure as to what would satiate you - Musa will provide guidance and context on each drink, the unique properties (it's how I learned about the Madagascar chocolate and how he sources and roasts his espresso beans), and makes it a near \"risk free\" transaction.", "rating": "5", "date": [2015, 4, 23]}, "3": {"description": "This is not your typical food court coffee shop that might be there for the sake of having some stand in coffee and juice shop. Everything is so fresh and colorful. Since the namesake I went with the Mocha Coconut coffee, and it was delicious. It totally hit the spot after the heavy lunch. I figured I needed to offset that with caffeine. I would love to come back for the gelato. It's great to know that this place exists because I will surely stop in here now when I'm shopping in the vicinity.", "rating": "5", "date": [2015, 6, 13]}, "0": {"description": "I work down the street and this place has quality food at a good price. 6.75 for a salad with unlimited toppings with plenty of nut choices, cheeses, avocado, chickpea, and meat options. Smoothies are good. It's the only healthy option at Nordstrom mall, and it's got really good frozen yogurt as well. The employees are nice and helpful, and this is the only food place I would recommend at Nordstrom.", "rating": "5", "date": [2015, 10, 29]}, "20": {"description": "Try the Irish Cream, very creamy and doesn't give you a sugar rush. Will come back for the Cappucino and gelato. Best coffee ever!", "rating": "5", "date": [2014, 5, 22]}, "19": {"description": "Try the Irish Cream, very creamy and doesn't give you a sugar rush. Will come back for the Cappucino and gelato. Best coffee ever!", "rating": "5", "date": [2014, 5, 22]}, "2": {"description": "Happen to come here since they made salads and they were one of the few places open. I was pleasantly surprised. The salad was huge. No limits on the toppings. They also offer fresh squeezed juices. I had a cough and kept coughing and the man gave me a shot of some ginger and orange and instantly my cough went away. Really. He befriended my daughter and gave her a free hot cocoa and made a beautiful design. Great place.", "rating": "5", "date": [2015, 4, 8]}, "18": {"description": "One of the best gelato I've ever had! I got a double, and I was shocked! The guy gave me two super big balls! Only for more than $5. And later when I visited the window again with my friend, he gave me a third one for free! I was shocked. Really great guy, great gelato", "rating": "5", "date": [2014, 6, 16]}, "13": {"description": "I can't believe this place is in a food court!! I wish it was on every corner too, at least I can wake up to one of the many healthy drinks they have to start my day! The staff is so delightful and the price is unbelievably affordable... Once a month I cheat and get some gelato.... I actually found the pistachio to be very good. Try it for yourself and be the judge :)", "rating": "5", "date": [2015, 1, 26]}, "4": {"description": "I just came back from Rome, where I ate gelato pretty much everyday.  When I got back, I was a little sad about my vacation being over and thought I would cheer myself up with some gelato here in the States.  The stuff they serve at Blended Bean is not gelato.  It's plain old ice cream and it's not even that good.  I should have known better than to think I could get the goods at a food court!", "rating": "2", "date": [2015, 7, 17]}, "6": {"description": "On the 4th floor of the shops at north bridge. I had an incredible green juice. The man working there was very friendly and helpful! I will definitely be back!", "rating": "5", "date": [2015, 5, 7]}, "15": {"description": "Delicious little place with great customer service too! The coffee and espresso drinks are divine! (Irish nut is my new favorite) All of the juiced items are amazing and they let you mix and match what you want together. The salad bar is always FRESH and has a lot of options and the gelato is also amazing. (I work in the mall so I have the pleasure of frequenting this new joint!) They have offered me a great healthy alternative to the regular food court options. Don't care about counting calories? Then you have to try their crepes! From savory to sweet they've got it all.", "rating": "5", "date": [2014, 5, 17]}, "7": {"description": "love this place. I get a loaded salad for an unbeatable $6.50 and awesome customer service. Musa even draws a puppy in my lattes which brightens up your day more than you think...If you're looking for a healthy meal or snack and are in the Northbridge vicinity, this is the place. From the gelato to the juices, all the ingredients are fresh and do your body good ;)", "rating": "5", "date": [2015, 1, 20]}, "8": {"description": "What a scam! Their \"sweet treats\" feature \"ice cream base\" which is actually just whole milk and ice. The man working the stand seemed very shady. On top of that they use store-bought fruit purée in their $6 fruit smoothies. Total ripoff. Avoid this spot!", "rating": "1", "date": [2015, 7, 5]}, "14": {"description": "I love a good crepe-anytime I can get a fresh crepe like the ones at Blended Bean I take both sweet and salty! So good and priced fairly.", "rating": "5", "date": [2014, 10, 15]}}, "neighborhoods": ["Magnificent Mile", "Near North Side"], "latitude": 41.8914914131165, "longitude": -87.6242038607597, "rating": "4.5", "times": {"Mon": ["8:00 am", "7:00 pm"], "Thu": ["8:00 am", "7:00 pm"], "Sat": ["8:00 am", "7:00 pm"], "Wed": ["8:00 am", "7:00 pm"], "Tue": ["8:00 am", "7:00 pm"], "Sun": ["9:00 am", "7:00 pm"], "Fri": ["8:00 am", "7:00 pm"]}, "price": "$", "categories": [["Gelato", "gelato"], ["Juice Bars & Smoothies", "juicebars"], ["Cafes", "cafes"]], "address": ["520 N Michigan Ave", "Ste 422"], "attributes": {"Parking": "Garage", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "22"}, "starbucks-chicago-103": {"comments": {"29": {"description": "So far, i have visited this place 4 times prior to writing this review and the first 3 times i was very pleased with their service until the 4th time came around i ordered Cheesecake brownie, and Tall Chai Tea Latte. I had to repeat my order multiple times til they finally got it down. I wasnt very happy being that i didnt have a special order, i only order two simple things", "rating": "3", "date": [2013, 4, 2]}, "42": {"description": "I was impressed that I was asked what my drink order was before I got to the cashier only to be unimpressed with someone two people after me getting their drink first.What do you do - there's a starbucks on every corner and when you need your coffee fix you sometimes have to settle.", "rating": "2", "date": [2010, 11, 21]}, "23": {"description": "I'm a daily Starbucks drinker, and this has to be the worst location I've ever been to.  I went on 11/24 around 3:00/3:30, which was a chilly Sunday afternoon, so obviously I expected it'd be pretty busy. I got in and there was one cashier working with 3 employees just standing around behind the counter talking. It took all 3 of them to pour milk in a plastic cup. There was a line out the door and none of the idling baristas seemed to care. When I finally got my order and walked out, I realized that the drink was lukewarm at best. There was no way that I was going to go back and suffer through that nightmare again. When you charge 5.50 for a drink that costs 12 cents to make, you really need to step up the service and end product to make it worth it.", "rating": "1", "date": [2013, 11, 24]}, "47": {"description": "I know it seems kind of weird to review a chain like this, but oh well. This location is nice, right on Michigan Avenue, attached to the Intercontinental Hotel. It is definitely an interesting place to come and people watch. I have been an Argo convert recently, although the new Starbucks tea drinks drew me back in. The London Fog tea latte is very very good. I will be back for that one. Hopefully they don't decide to get rid of it after the promo period. Another thing I like about Starbucks is that if you use your registered Starbucks card, you can get free customization, such as soy milk and flavoring.", "rating": "4", "date": [2009, 2, 23]}, "8": {"description": "Nothing noteworthy. It's one of your typical Starbucks stores on a busy street. There's not a whole ton of seating area if you're looking for a place to rest or work. Staff isn't particularly friendly either.", "rating": "3", "date": [2014, 6, 16]}, "31": {"description": "This is a great Starbucks.  They have all the usual coffee drinks and snacks.  They also have plenty of seating and outlets.", "rating": "4", "date": [2012, 9, 4]}, "34": {"description": "The Barista Sam is the worst customer service indiviual I have ever seen in my life. Not only does he not listen, he doesn't even know what the mission statement of the company is. Even worse, the hotel that houses this location doesn;t care about the mission of Starbucks. The Starbucks mission states clearly:Our mission: to inspire and nurture the human spirit - one person, one cup and one neighborhood at a time.Neither this \"leased\" location nor the hotel that host it cares about the customer. I am writing this review for a second time to make sure that no real authentic Starbucks patron is ripped off from the best experience in the world. If you notice there is actually a Corporate owned Starbucks directly across the street. I was always wondering why there were two locations so close to each other. And now I understand why! Besides me expressing to Sam how bad his customer service was, I yelped it a first time and was fired from a position that I had in the hotel because I choose to express my social responsibility. Now almost two years later I haven't had a job at all. I give you fair warning, go across the street to the Authentic Starbucks. Even if you are staying in the hotel it is worth your peace of mind to cross the street!", "rating": "1", "date": [2012, 4, 26]}, "16": {"description": "Giving this place 4 stars simply for the wonderful decor. It must be because this branch is within the Intercontinental. Beverages are as good as any other Starbucks. Great for people to rest after shopping on Michigan Ave. Would come here to read/study/do work by myself too.", "rating": "4", "date": [2015, 1, 3]}, "13": {"description": "Staff is super friendly - always a big smile on their faces - and the location is the best in Chicago!", "rating": "5", "date": [2015, 4, 3]}, "11": {"description": "Low review due to the surly cashier and barista who just repeated my order under his breath and set it on the counter!Perhaps they should consider making it a female employees only.  Since I visit this location as much as my calendar allows...I usually meet clients here, if I get this attitude again, I will ask for the manager.", "rating": "2", "date": [2015, 2, 4]}, "39": {"description": "It's conveniently located next to the intercontinental hotel so if you're staying there you have easy access. I like the big space, you can sit there and people watch. The staff is friendly and fast.", "rating": "3", "date": [2011, 3, 6]}, "37": {"description": "Really folks - I'm a little surprised by all the bad reviews. What gives? This Starbucks has GREAT seating, an efficient layout given the hotel and Michigan Avenue entrances, and while the service was never super speedy, it was always perfectly fine. No reason not to grab a quick drink at this location if you're strolling along the Mag Mile and need a little caffeine boost.", "rating": "4", "date": [2011, 10, 21]}, "0": {"description": "So convenient if you are staying in the Intercontinental. They have worked with the hotel and they offer up a free coffee or tea for hotel guests. I would walk past the shop often as I was in and out during the day. I would see it busy a few times, but for the most part it seemed very manageble if you were a customer. It would even be a good spot to sit and work. I picked up a  black coffee as I was checking out. Service was quite and my aunt and uncle liked the coffee. So nothing to complain about.", "rating": "4", "date": [2015, 11, 23]}, "38": {"description": "You know every time that I have gone to this location and placed an order with \"Sam\", he has never provided complete extraordinary service. So I choose to share with my social networks about the non-extraordinary customer service. The worse thing about this experience is that I actually pulled \"Sam\" to the side, on my second to last visit and told him how my experience was. He promised that he will pay more attention to my request and needs. Well obviously that didn't happen and this is why I am now \"yelping\" the experience. In addition, the barista called the onsite security and had me removed from my place of work. I actually produce shows in the Intercontinental hotel, which is attached to this location. So now what should I do about this?This was VERY absent in my most recent experience with @starbucks Our CustomersWhen we are fully engaged, we connect with, laugh with, and uplift the lives of our customers - even if just for a few moments. Sure, it starts with the promise of a perfectly made beverage, but our work goes far beyond that. It's really about human connection.Mission Statementstarbucks.com", "rating": "1", "date": [2011, 3, 14]}, "51": {"description": "I love Intelligensia much better than Starbucks, but it was cold and I was having dinner next door (at Bandera).  This SB is adjacent to the Lobby or the Intercontinental Hotel, so there are many many tourists getting their coffee fix.  I was able to get a seat at the far south end of the cafe in a cozy sofa chair.  The jazz CD was kind of loud, but I was able to sit down with a book and tune everything out.Lines are very long, but moves quickly.  Oh good tea too.", "rating": "4", "date": [2007, 9, 16]}, "27": {"description": "What haa the world come to. I'm writing a bad review for Starbucks . This is my second weekly stay at the Intercontinental so I've visited the location a few times. While some Baristas seem really friendly and nice I can't unfortunately say that for all of them. The cashier got my order incorrect and gave me two sandwiches. When I returned it at the drink counter the guy just took it back and said nothing. So I proceeded to the cashier to let her know of the error. I got no apology or a refund.. All I got was \"oh I thought you said two\" Are you serious? This morning there were a bunch of tourists from Spain who didn't speak English  in the store. I noticed one cashier help them very nicely with smiles and hand gestures and slow talking so they could understand. Can't say the same for the other cashier who spoke with no expressions mumbled under his breath making it difficult for the tourists to understand. Starbucks needs to push down their mission statement a bit stronger on their employees", "rating": "1", "date": [2013, 5, 10]}, "32": {"description": "On the MAG MILE you would think this location would be infested by TOURIST, screaming kids, and loud YUPPIES.... its not that bad. Its 4:00 pm on a Thursday a lot of seatings, people are diligently on there lap tops.... music volume is on easy listening tone. ME LIKE!", "rating": "4", "date": [2012, 8, 9]}, "48": {"description": "No real point in reviewing a place like this, but I will say that the baristas here seem to always be laughing and joking with each other, and I like that. This store also has a good seating selection, if you don't need your snacks to go.", "rating": "3", "date": [2008, 4, 29]}, "44": {"description": "It was late on a cold, snowy night and I was in search of a cup of tea to bring with me back to my hotel. This Starbucks was the closest one open at 5 blocks away. While it was late, there were a lot of people (mainly teens and 20s) hanging out inside. Not sure if there is wifi but everyone was just hanging and chatting. There are a lot of tables in here. The service was great and I could tell they were cleaning up for the evening. They even went into the back room to bring out more tea for me when they could have easily said that they were out of it. Most of the pastries were gone from the glass service area which makes me think there is a steady business for that and that the muffins won't be a few days old.", "rating": "4", "date": [2010, 1, 26]}, "24": {"description": "Not an official Starbucks location! Does not accept the Starbucks gold card for rewards or payment!", "rating": "1", "date": [2013, 9, 6]}, "7": {"description": "I usually wouldn't write a review for Starbucks because typically they are all the same. However, the service here was exceptional. I made it in just before the doors were locking at 9pm. There was a decent line in front of me and they were all ordering the most complicated drinks - double caramel latte light foam half decaf room temp tall in grande cup type of drinks. It was a rainy, busy day in Chicago and I'm sure the night crew was tired and ready for the day to be over. However, they were all SO kind and friendly. Drinks came out quick and served with a smile.", "rating": "5", "date": [2015, 7, 11]}, "49": {"description": "It's nice to have a Starbucks in the lobby of the hotel you are staying in. But, I just have to ask: What is up with the healthy option obsession?There are all these signs for 90 calorie skinny lattes. Whatever, I'm still mourning the loss of the eggnog latte. I also found it puzzling that they had a sign promoting whole grains that read, \"Looking for whole grains? Try the apple strudel!\" Seriously? Ok, I guess if it's healthy!", "rating": "3", "date": [2008, 1, 15]}, "40": {"description": "This is the slowest Starbucks I've ever been to.  I've gone here a couple times and thought the slowness was just due to it being later in the evening, but I don't think that's the case.  I got in line (5 people ahead of me) at 8:35 this morning and only ordered a coffee with room.  I left at 8:55.  They don't even seem to know that they are oh-my-god-are-you-serious slow.  Now I know why everyone goes to the location across the street.  I will never go here before work again.", "rating": "1", "date": [2011, 1, 24]}, "30": {"description": "AWFUL. Cross the street and hit the 'Bucks at 444 N Michigan. Service consistently sucks. Drinks are consistently forgotten. Corporate should be ashamed of themselves for how poorly this location is run. The servery is consistently disgusting (see my photo of the ice scoop sitting in a puddle of spilled drink). Nasty nasty nasty.", "rating": "1", "date": [2012, 11, 10]}, "46": {"description": "This is my favorite Starbucks in Chicago.  I love to study at Starbucks, and this one's perfect: it's got outlets (not too many though--if coming with friends, bring your own power strip), it's easy to get to (Grand Red Line's just a few blocks away), and has a nice bathroom in the hotel (really important for marathon study sessions!).  It's also a cool place to people-watch, since there are lots of tourists.  Sadly, no internet (not even AT&T--only the really expensive, $12.95 per day Intercontinental Hotel internet)--but that's prob not a bad thing if you're studying.", "rating": "5", "date": [2009, 3, 10]}, "1": {"description": "I have a nostalgia for this place. It's spacious and nicely designed inside. The view is amazing on the most elegant street in Chicago (and probably in the US). Nothing is better than a cup of coffee at this place while it's snowing outside.. #Chicago #Romance #Love #Coffee", "rating": "4", "date": [2015, 1, 28]}, "9": {"description": "When I asked the employee something they just shrugged their shoulders and said oh I don't know like I asked them something so hard, not the kind of service I normally get from my normal Starbucks from where I live which is much better. Also I agree with another reviewer that the just repeated the order under their breath and I guess the customer just has to hope the cashier gets it right. Not sure if I will go to this location again and spend my money at another one away from the hotel", "rating": "1", "date": [2015, 6, 28]}, "26": {"description": "What can I say that hasn't been already said.  It's a Starbucks.  This location is pretty busy and the baristas can seem like jerks, but they are extremely busy.  I have a bit of a diva drink and they got it right the first time, 3 days in a row.  This is a minimum standard, however, so this place gets 3 stars from me.  BTW, my order:  Grande, London Fog, whole milk, no water, one pump of vanilla.", "rating": "3", "date": [2013, 7, 8]}, "25": {"description": "8 out of 10 times there's going to be a long line so come prepared to wait. The employees are nice so that's a plus.", "rating": "3", "date": [2013, 7, 31]}, "12": {"description": "Restaurant reviewAre all starbucks the same? The answer is no.... I did not realize there is a difference between franchise and corporate starbucks and I found out during this past holiday. Starbucks was offering a BOGO free offer on holiday drinks. Luckily I asked before I paid and they said no they are affiliated with the hotel (Intercontinental) and did not have that promo. The barista told me to walk further south to the corporate Starbucks. Now I know why there is one just a footstep away. Otherwise this starbucks is always bustling and there is a line. Coffee is on par with other starbucks as well.Pro: the store is larger than the corporate one which is perfect if you want to sit and window watchCons: not a corporate store so they will not honor starbucks promo including my starbucks rewardsHidden gem: none as this is a franchise branch of starbucks, i would go down the street to the other corporate starbucks!", "rating": "3", "date": [2014, 1, 20]}, "21": {"description": "I have been coming here for years and noticed a significant decline in the past several months. This Starbucks is filled with people who loiter without buying drinks and also take naps here. This makes for a somewhat uncomfortable environment. Also the bathrooms have been disgusting for the past two or so months... Two out of the three toilets in the women's bathroom are constantly not flushed and it turns out something is wrong with flushing mechanism in these two toilets. I figured this out when I tried to flush them in order to use them - this is beyond unpleasant! Please try to resolve these issues.", "rating": "1", "date": [2014, 3, 19]}, "17": {"description": "Unfriendly starbucks staff. They just ignored us for a good few minutes to talk to each other while there was a massive line behind us. Move so slow.", "rating": "1", "date": [2015, 1, 2]}, "10": {"description": "Great coffee as usual. Staff was very friendly and helpful. I stopped to meet a client and was able to find a table right away.", "rating": "5", "date": [2015, 3, 5]}, "5": {"description": "Not a corporate store so don't take any free card perks (earned drinks w/ card membership). Staff wasn't as high quality either (less polite, and they treated me like a TSA agent going through an airport security line) - frankly a step down from the typical Starbucks experience. If you need a Starbucks or you'll bomb your upcoming sales pitch by all means, but if you're looking for an excellent experience this isn't your place.", "rating": "2", "date": [2015, 12, 19]}, "3": {"description": "While I prefer small, independent coffee shops, one could do much worse than this Starbucks if you are on Boul Mich and need a respite or to get a little work done. This shop is part of the Intercontinental Hotel, and one end of it is almost as comfy as a living room. It has comfortable, easy chairs, a couch and a fireplace. This can be a drawback also; as people tend to linger for long periods here. I confess, I am no better than the rest of them.The shop is very busy, and it can be tough to get not only a seat by the fireplace but also at one of the tables or the counters facing the windows out to the boulevard. Restrooms are outside of the shop, upstairs in the hotel. They are very clean and well-maintained. There is free wi-fi that appears to be part of the hotel network and displays a disturbing message that says there is no privacy on the network. Other than that, this is a standard-issue Starbucks.", "rating": "4", "date": [2015, 1, 20]}, "35": {"description": "Walked right up to the counter and stood for over 2 minutes with the barista right at the register pretending to not notice me and chatting with her coworkers before she finally acknowledged me and got my order.  Then proceeded to screw up my order when I asked for cream and sugar in my coffee and just gave me black coffee.  I know I can add it myself but usually when I do I'm not able to find that perfect mix that tastes the way they do it. I was the only one in line so it wasn't busy   Definitely not pleased with my experience.", "rating": "1", "date": [2012, 3, 2]}, "19": {"description": "I think these employees used to work at the DMV or they are in training for DMV work!  I have never seen such slow Starbucks employees!  It's like they are just biding their time until their shift is over.I got in line with 2 people ahead of me.  There were 5 people behind the counter and it took 15 minutes to get a coffee with vanilla and cold soy milk.  I was ready to jump the counter and get it myself!  I also had some skanky guy trying to chat me up as I waited so it seemed like an eternity.You have people going in and out of here with their wheeled suitcases and the music could be quieter.  The only thing great about this place is the people watching.  That I would rate 5 stars!", "rating": "2", "date": [2013, 4, 21]}, "28": {"description": "I think these employees used to work at the DMV or they are in training for DMV work!  I have never seen such slow Starbucks employees!  It's like they are just biding their time until their shift is over.I got in line with 2 people ahead of me.  There were 5 people behind the counter and it took 15 minutes to get a coffee with vanilla and cold soy milk.  I was ready to jump the counter and get it myself!  I also had some skanky guy trying to chat me up as I waited so it seemed like an eternity.You have people going in and out of here with their wheeled suitcases and the music could be quieter.  The only thing great about this place is the people watching.  That I would rate 5 stars!", "rating": "2", "date": [2013, 4, 21]}, "45": {"description": "Starbucks, is Starbucks everywhere you go right?  I guess generally speaking when it comes to the menu.You would figure that because this particular location has an entrance/connection directly with the Intercontinental Hotel (not your usual average priced hotel), service would be better than average.  Sadly, service was even less than that.With rude cashiers, baristas carrying out conversations with friends (non-Starbucks staff) instead of making your order, and a line system that lacks in both definitions of \"line\" and \"system\", it's safe enough to assume that I have definitely experienced better.The only good thing about this location is it's location.  Maybe I just caught them on an off day, but really.....I could have at least had a somewhat friendly cashier.", "rating": "2", "date": [2009, 12, 20]}, "33": {"description": "OK... Drinks are good but take forever to make.  Seating is scarce since there are so many people there working off of the free wi-fi all day long.  It was wild.  Meetings scheduled there and everything!  And only one student in the mix.  Times have changed! (but I want to be able to sit and enjoy my drink.  That is all I ask.)", "rating": "3", "date": [2012, 6, 28]}, "43": {"description": "I love Starbucks in general.  This location is slow,  and lost my drink.  When I did get my beverage it wasn't very good.  Howard needs to check on this location.Hence the reason, I'm writing this review from Argo Tea.", "rating": "1", "date": [2010, 10, 23]}, "2": {"description": "Avoid this location.  There is a much better Starbucks across Michigan Avenue, less than a block South.I've been here many times and am always disappointed in the slow service.  There were four employees standing behind the counter yesterday and only one was actually working.  The others were standing around talking.  Also, they were out of my breakfast sandwich as well as my back-up choice.  They were very nonchalant about it - just stating, \"we're out\" despite the fact it was morning.  My drink, when I finally got it, was sickening sweet and tasted nothing like Pumpkin Spice Lattes I've had at other locations; I threw it out half-way through. With all the Starbucks in this vicinity, there is zero reason to visit this one.", "rating": "1", "date": [2014, 12, 3]}, "18": {"description": "Went there at night. A really good place to stay for a while and get warm by the fireplace.", "rating": "5", "date": [2014, 11, 26]}, "41": {"description": "Good service, situated next to the Intercontinental Chicago lobby. Not sure about the wifi as it seems though you have to connect through Intercontinental.", "rating": "4", "date": [2010, 12, 15]}, "50": {"description": "Love that there is a Starbucks right across the street from Nordsroms. It was such a hassle walking a block south to get to Starbucks if I need an Iced Venti Latte in the middle of my shopping excursion at Sephora or even *shudder* a block west to the Starbucks on Rush. The only down side of this particular Starbucks is dealing with all the tourists staying at the Intercontinental. It can be a real cluster *beep*.note: I dedicate this review to Max Power B. *kisses*", "rating": "4", "date": [2007, 12, 18]}, "4": {"description": "I think this location was the inspiration for the SNL satirical starbucks commercial. SOOOooo slow. Bad attitude. Lazy work ethic. It's absolutely the worst Starbucks I've ever even heard of. Always a large group of people waiting for their drinks, even when there isn't a line. Meanwhile the one across the street at 444 n mich cranks through a 20 person line in 5 min. There absolutely has to be a story behind the hiring", "rating": "1", "date": [2015, 5, 1]}, "6": {"description": "Starbucks- how I love thee.... you always know what you are getting, and you know it's going to be good... plus you can do a little people watching in here.  For the most part, everyone looks the same, but then once in a while, if you are lucky... a very unusual person walks in- and makes you question everything you've ever thought was fact in your life.", "rating": "3", "date": [2014, 9, 29]}, "22": {"description": "Restaurant reviewAre all starbucks the same? The answer is no.... I did not realize there is a difference between franchise and corporate starbucks and I found out during this past holiday. Starbucks was offering a BOGO free offer on holiday drinks. Luckily I asked before I paid and they said no they are affiliated with the hotel (Intercontinental) and did not have that promo. The barista told me to walk further south to the corporate Starbucks. Now I know why there is one just a footstep away. Otherwise this starbucks is always bustling and there is a line. Coffee is on par with other starbucks as well.Pro: the store is larger than the corporate one which is perfect if you want to sit and window watchCons: not a corporate store so they will not honor starbucks promo including my starbucks rewardsHidden gem: none as this is a franchise branch of starbucks, i would go down the street to the other corporate starbucks!", "rating": "3", "date": [2014, 1, 20]}, "15": {"description": "Ugh, they don't honor starbucks promotions and sent us across the street. UGH!", "rating": "1", "date": [2014, 12, 12]}, "20": {"description": "Nothing noteworthy. It's one of your typical Starbucks stores on a busy street. There's not a whole ton of seating area if you're looking for a place to rest or work. Staff isn't particularly friendly either.", "rating": "3", "date": [2014, 6, 16]}, "36": {"description": "The wifi here isn't free; the hotel blocks it. The guests from the hotel come into this Starbucks and hold up the line with stupid questions. They have no place to be and can't fathom that the 20 people standing behind them just want to get their coffee and hop on the 151. Don't go here if you're in a hurry; go across the street to the one next to the Walgreens, half a block north of Illinois.The seating is nice, if you can find a seat. If you manage a seat, it's a great place for people watching. They sometimes have outdoor seating in the summer along Grand avenue. Giving only three stars because the line really is always slow as hell, and the wifi thing really pisses me off. If you're not much of a coffee snob and just want to sit around with some free wifi, go downstairs to the Cosi on Rush & Grand. They aren't as coffee-savvy but the wifi's free, people-watching is great, and the seating is always ample.", "rating": "3", "date": [2012, 1, 27]}, "14": {"description": "One of the absolutely worst Starbucks of all time. The employees at this location always have a bad attitude. When you ask them to warm a pastry for you an hour (yes,an entire hour) before closing they tell you no because they've already turned off the warmer. Wow! I only go to this location because it's near by but I won't be going back anymore. I thought in the past that maybe some of the employees were having a bad day, so I let it slide. I know it's still unprofessional, but I know sometimes people get tired and have bad days at work. That's one of the main reasons why I never tip the people here either. I also hate how they never hand the drinks to the customers. They always put it down on the counter and say the name of the drink once and then say it under their breath. Starbucks corporate really needs to do something about the employees, if they really care about customer service and satisfaction.", "rating": "1", "date": [2015, 5, 30]}}, "neighborhoods": ["Magnificent Mile", "Near North Side"], "latitude": 41.8913113, "longitude": -87.6240589, "rating": "2.5", "times": {"Mon": ["6:00 am", "8:00 pm"], "Thu": ["6:00 am", "8:00 pm"], "Sat": ["6:00 am", "9:00 pm"], "Wed": ["6:00 am", "8:00 pm"], "Tue": ["6:00 am", "8:00 pm"], "Sun": ["6:00 am", "8:00 pm"], "Fri": ["6:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Coffee & Tea", "coffee"]], "address": ["Intercontinental Hotel Lobby", "505 N Michigan Ave"], "attributes": {"Good for Working": "Yes", "Parking": "Garage, Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Outdoor Seating": "Yes", "Wheelchair Accessible": "Yes"}, "category": "Food", "number_of_reviews": "52"}, "le-dress-chicago-2": {"comments": {"1": {"description": "Wedding season is upon us....and I'm in the market for a new dress! This proved to be the perfect excuse to check out Le Dress's* newest location, in the Nordstroms building.While they had lots of adorable colorful dresses I didn't find anything that was dressy enough for a wedding.  I was also hoping to find a short black dress that I could wear as a bridesmaid later this summer and the few options I tried on made me look like a tacky prom queen. No thank you!I had better luck dress shopping at Neimans this time, but I'll give Le Dress another shot when I'm looking for a dress that's a bit more casual.----------*yelp.com/biz/le-dress-ch…", "rating": "3", "date": [2011, 4, 24]}, "0": {"description": "I stumbled upon Le Dress in the Nordstrom Mall area.  I had just been in Nordstroms searching for a dress and found everything either to boring or to expensive.Le Dress is a super, little, cute boutique that carries dresses, and a few small accessories.  The dresses range from $69 on up, so I could even go there for a special occasion dress! I ended up buying 2 dresses that I could wear for both day or night! The dresses are adorable and they are unique- which I love! The boutique has a very french, feminine, fun, \"tres chic\" feel!!!!The staff was super helpful, and friendly, and provided great service.  The best thing about my experience with Le Dress is that one of the dresses i had to special order because they were sold out in my size.  I wanted to make sure I had the dress before I left on vacation.  The manager, Victoria, personally delivered the dress to my doorman at my place of residence- NOW THATS CUSTOMER SERVICE!I know I can count on Le Dress whenever I just want something fun and different or if I have an event or special occasion to attend!", "rating": "5", "date": [2011, 7, 29]}}, "latitude": 41.8914914131165, "neighborhoods": ["Magnificent Mile", "Near North Side"], "categories": [["Women's Clothing", "womenscloth"]], "address": ["520 N Michigan Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.6242038607597, "category": "Fashion", "rating": "4.0", "price": "$$", "number_of_reviews": "2"}, "the-body-shop-chicago-5": {"comments": {"3": {"description": "The last time I was at one of The Body Shops was circa...high school? There used to be a huge mall 15 minutes from home and I would rarely go there because I thought it was expensive and you can get the same thing at Bath & Body Work.Thanks for the amazing deal on Groupon, I entered the store with a new outlook after a decade later. The sales guy was actually super friendly, not pushy at all, and I appreciated he just said hello and let me wandered around the store. It was my birthday month so I got a free love my body card. So I will be getting 10% off all year long plus freebies throughout the year. Bad news for me because I will be coming here frequently...But all in all, I picked up some great products for more than half off. For fabulous skin, get the aloe mask and vitamin c capsules. And for a restful night of sleep, I picked up some pillow mist and japanese sea salt. After tonight's trip I definitely won't be waiting for another 10 years to visit this store again. I think this will become my regular store like Sephora.", "rating": "5", "date": [2011, 3, 29]}, "1": {"description": "Walked in here to buy some coconut body butter since I had seen that they were having a sale. Despite knowing exactly what I wanted, the salespeople kept trying to get me to try other things. Some people might enjoy this, but I personally like to browse in peace and utilize the salespeople's expertise when I have questions.Another thing about the Body Shop: they rarely post prices to their products which irritates me. It's helpful to check online beforehand so you know how much things cost before ending up with product that costs far more than you wanted to spend.", "rating": "3", "date": [2015, 10, 28]}, "0": {"description": "I started shopping here around 20 years ago when (I think) it was brand new and it used to have scented oils that you could buy separately or add into their products, so I am a long-time customer But foolishly, I had fallen off in recent times. So lately, people have been noticing that my hands are very dry. About the third time I had to explain to someone that my skin is dry to begin with and the dry winter air makes it worse and this winter won't end so I can't heal and besides my job requires me to wash my hands a lot and I can't apply lotion until after I clock out, and on top of that the only thing that helps me is the hemp hand cream from The Body Shop, I started feeling self-conscious, and why don't I just go back to the Body Shop and get said hand cream?So I did. The two ladies who worked there were very pleasant, and knew a lot about the products. Even though I said was I was looking for, the one lady sold it to me anyway, explaining the benefits of the cream, and agreeing that it was the best product for my preternaturally dry hands (and she told me some things about it that I didn't know, as well). Both ladies also described and suggested other products that I might like as well, and were unintrusive after I picked out what I needed but still looked around for a bit.Oh yes, and my hands feel 100% better already. Body Shop, we will not take such a long break from each other again.", "rating": "4", "date": [2014, 3, 6]}, "2": {"description": "It's been awhile since I shopped at this location but was pleasantly surprised with how much the store didn't change when it comes to it's quality and store layout.The service was phenomenal, thanks to the lovely Liz, who helped me pick out a small gift for my sister while I was in town.  They had a great selection, everything was labeled and customer friendly and of course when I asked if there were any promotions that day, I was happy to find out that there were and I was more inclined to buy more!if you're in the area and are looking for some great scented toiletries, visit the Body Shop on Michigan Avenue and you'll be sure to walk out  with something useful, that smells delicious!", "rating": "5", "date": [2010, 5, 3]}, "5": {"description": "PUSHY SALES STAFF!! I work in Sales, and if a client says no to something I suggest, I leave it at that. My salesperson at The body Shop was nice but pushed me to sign up for some BS rewards program. Look, I'm all for rewards programs....IF I SHOP THERE FREQUENTLY....but I very rarely shop at this store so I declined. He kept telling me about all the benefits after I told him no TWICE. Ugh. I bought a travel sized hand santizer, which I legit needed, and high tailed it out of there.", "rating": "1", "date": [2012, 11, 8]}, "6": {"description": "Listen up ladies, because I'm about to share my winter moisturizing secret: The Body Shop Shea Butter body butter. I have tubs of this stuff in every room in the apartment. It's non-greasy, absorbs right into your skin and keeps your hands moisturized through a few hand washings. It's worth every penny.This is my favorite Body Shop location because I just like the salespeople there. Also for some reason every time I shop there it's not crowded. I give it minus one star simply because getting there means having to walk through Water Tower Place, bleh.", "rating": "4", "date": [2010, 12, 29]}, "7": {"description": "I had never been to the body shop but I was super excited to check them out because I had several people rave about how wonderful their products are. The products I have to say are awesome however the service was lacking. I walked in and was not even acknowledge the lady behind the counter actually acted as if I was bothering her just to ask a question. That was such a big turn off for me so I left very sad that I didn't get to make a purchase.", "rating": "2", "date": [2010, 7, 8]}, "8": {"description": "Love me some body shop. I only shop during the semi-annual sale and stock up on the items. My favorite is the blueberry body butter. Also worth mentioning are the Jasmine body wash, Manuka shampoo, and Oceanus body wash. A definite visit during the sale period.", "rating": "4", "date": [2007, 6, 20]}, "9": {"description": "I had a Groupon that unbeknownst to me expired on 12/24; I was there on 12/27 & they wouldn't honor it. The so called Manager was in the back room & the associates had to go back there to discuss with them. He or She never came out to talk to me directly which I thought was highly unprofessional. Well, I always have Bath & Body Works who always have coupons.", "rating": "2", "date": [2012, 1, 8]}, "10": {"description": "What the hell is going on with the staff here?  It was like I was the first customer they've seen in years.  The minute I walked in the door I was being bombarded with suggestions and multiple offers for help and business cards for the home business they're running.Weird.    I'm not a big fan of fruity smelling crap, but I like their exfoliating cloths and stop in every few months to buy them in bulk.Oh, and for those fools who've fallen for the cellulite zapping claims at Bliss Spa, the \"slimulator\" which is $22 at Bliss is $12 at The Body Shop.", "rating": "4", "date": [2008, 1, 4]}, "4": {"description": "Knowledgeable sales staff would be nice. I'm not that familiar with The Body Shop products, but I'm extremely intrigued because of the all-natural appeal and the Fair Trade uses, plus I'm a sucker for great cosmetics. I came here on a Saturday with a friend who was looking for a product she had read about. We walked in and there were no other customers - shocking because the mall was packed. We were greeted immediately, which was nice... but when the sales girl \"tried to help\"... oy.We asked about a specific mask, and asked if she had used it. She replied no, but she had used another. She continued to tell us about the other, because it was all she was familiar with. She didn't even say anything more than \"it's nice because it's warming\", which hello - it says on the bottle. I asked her what other ingredients were used in the mask we were inquiring and she had no idea. She said \"well, it has Tea Tree\" which, I should hope so because it's a Tea Tree Mask!Essentially, I found the girl useless. She did nothing. Unlike some other cosmetic stores located in Water Tower (hint hint Lush) that actually try to help you and know everything about their products (sometimes a little too much), my Body Shop experience was terrible.", "rating": "2", "date": [2013, 2, 19]}}, "latitude": 41.8981895, "neighborhoods": ["Streeterville", "Magnificent Mile", "Near North Side"], "categories": [["Cosmetics & Beauty Supply", "cosmetics"]], "address": ["845 N Michigan Avenue"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.6239471, "category": "Shopping", "rating": "3.5", "price": "$$", "number_of_reviews": "11"}, "benefit-brow-bar-chicago-3": {"comments": {"3": {"description": "This place is great - only place I've found that will tweeze rather than wax. Only problem: the smell from Lush - bleh!", "rating": "5", "date": [2012, 11, 2]}, "1": {"description": "They ruined my brows after a long year of having finally a perfect shape so upset I wouldn't return I was rushed and the lady didn't even ask me if I like them she justCharged me and took the next person wish I could had them at least filled", "rating": "1", "date": [2015, 9, 23]}, "2": {"description": "I came here out of convenience, and the price is slightly higher than it's possible to pay if you know where else to go.  (I know a place nearby where it's $13).But nevertheless, if you're ok with the price ($21) the brow wax I had here from B. was perfect.", "rating": "5", "date": [2015, 5, 10]}, "5": {"description": "The only reasons I didn't give the Brow Bar in Macy's a 5 is 1) the unbearable stench from LUSH and 2) whether or not I make an appointment, I ALWAYS have to wait. Will try BB at 900 N. Michigan.", "rating": "4", "date": [2013, 9, 25]}, "6": {"description": "On a whim, while visiting Chicago for the weekend, I decided to get my brows shaped at Benefit Brow Bar.  Initially I thought I may not like having my brows done in the middle of a bustling cosmetic area in the Macy's in Water Tower Place, but once in the chair, I didn't notice anything else going on around me.  First, I watched the brow expert work her magic on another client.  Once I realized she knew what she was doing and I also took notice that her own brows were beautifully shaped and FULL, I went for it.  My Benefit Brow expert was Maggie Egan.  She was very cheerful, friendly, knowledgeable, professional, and talented.  Just look for Zooey Deschanel's twin (my husband disagrees and says she looks like Emma Stone?)! She told me exactly what she would be doing and my brows looked amazing.  I was very pleased with her work and would recommend her to anyone who is going for a full, classic arch.  I will definitely be making a trip back to see her again!  A great brow expert can be hard to find!I went back to see Maggie again in July 2012 and she's just as fabulous as I remember!  So pleased with her work and she's so sweet, too.  I'll return again next time I'm in Chicago!EDIT: I understand Maggie is no longer here. If anyone knows where she went, please let me know!EDIT: Maggie Egan is now at Zazu Salon in Chicago.", "rating": "5", "date": [2012, 1, 22]}, "7": {"description": "a comfortable bow wax!?!? YES!", "rating": "5", "date": [2012, 1, 4]}, "0": {"description": "*This is the Benefit Brow Bar in the Macy's at Water Tower Place* So I'm at the Taste Bar (cafe on the ground floor at the back of the Water Tower Place) buying a lemon cookie the size of my head when I hear this chick say, \"Hey Girl, check out those brows!\" I'm mortified (mostly b/c of the size of the cookie I just bought) - but then I turn to see Maggie, my new eyebrow lady from the Benefit Brow Bar. You can tell from the word go that she could care less if I were purple and eating pine cones. She's too chill to care. She asked me about my friend's birthday dinner party and if I like my brows. I've met this chick ONCE, for five minutes over 2 days before. After I picked my (hairless) chin off the floor I nearly high-fived her for her memory, and realized I owe her a review: Two days earlier I'd marched up to the brow bar to get practically my whole face waxed. I told her to thin out my brows and give me an arch. She said no - she'd never thin me out. Maggie 1: Emily 0. I took it on the chin, literally. Everything looked great after (no strays!) and I wasn't red or itchy after (I'm usually red and itchy). Will go back. Thanks, Maggie! (She's the one that looks like Zooey D., except ZD is creepy and Maggie isn't at all).", "rating": "5", "date": [2011, 12, 19]}, "4": {"description": "Such amazing service from Jerri! I walked into Macy's just to look around and spotted the Benefit Brow Bar. I knew I needed a fix up, and I saw that they offered waxing for $20 or tweeting for $25. Now I typically do threading but I figured hey, why not go for the wax? I saw Jerri finishing up a customer and she looked amazing, so I was pleased when I was told that I would be getting her. Jerri was very nice and informative, showed me my arch and the beginnings and ends of my brows, and explained that she was going to trim and shape my brows. She did an awesome job! They have an excellent staff here at Benefit, very kind and attentive. Also, the wax was really gentle, which I liked. I'm very fair and my skin is pretty sensitive (i.e. red hot after waxing for hours on end) but this wax session only left me red for 30 minutes! My brows look fabulous and I think she changed me from threading to waxing. If you get a chance to go here, definitely ask for Jerri.", "rating": "5", "date": [2013, 8, 4]}}, "latitude": 41.8982525914907, "neighborhoods": ["Streeterville", "Magnificent Mile", "Near North Side"], "categories": [["Eyelash Service", "eyelashservice"]], "address": ["Sephora Watertower Place", "845 N Michigan Ave, Ste 219"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.62401945889, "category": "Beauty", "rating": "4.5", "price": "$$", "number_of_reviews": "8"}}