{"cal-harbor-restaurant-and-lounge-chicago": {"comments": {"12": {"description": "This little place on the south side of Chicago's Pullman historic district is a find -- an unpretentious neighborhood spot with waitresses who know the menu by heart and call you \"Hon.\"  If you like comfort food they've got open face meat sandwiches with gravy, meatloaf, breaded cutlets, sandwiches, pasta, and enormous omelets served all day -- and grits!  It's reasonably priced too - my omelet, hash browns and iced tea were $7.50.I noticed liquor is served after 7 a.m. on weekdays so if you're looking for an early start after a late night out, this will do.Cal-Harbor serves an interesting mix of white, brown and black customers.  Take a walk to work off that enormous meal you just consumed and enjoy the terrific 19th century Pullman row-house architecture, tree-lined streets and pretty front gardens to the north.", "rating": "4", "date": [2008, 7, 26]}, "7": {"description": "Pancakes are really good and the hash brown is my favorite. The lady stated that the prices went up which didn't reflect the menu I was looking at. That definitely bothered me at first, that was until I ate my pancakes and hash brown.", "rating": "4", "date": [2014, 10, 31]}, "19": {"description": "when i used to live 2 blocks north of this place, i would wake up at 2 in the afternoon if i didn't have to work that day and place my call for a greek skillet or an omelet with corned beef hash.in 10 minutes i'd be walking back with a bag full of warm breakfast food goodness.this place is one of the best breakfast spots i've ever eaten at and it looks like a hole in the wall. the prices are reasonable and it's just like your typical diner (old men talking over coffee. waitresses screaming, the woman at the end of the counter, smoking over a cup of coffee, the little tv showing the news or whatever talk show was on at the time)it's a wonderful little spot.i remember the day i sat and watched my friend eat like 13 pancakes in a row.whenever i go to visit my family in that area, i stop by there and pick up a petes omelet. you can live off of that thing for a week i swear.", "rating": "5", "date": [2007, 4, 20]}, "1": {"description": "This is your perfect, \"hole in the wall\" diner. Excellent menu of traditional fare, breakfast skillets, biscuits and gravy!! Yummy! This is a great find!!", "rating": "4", "date": [2016, 3, 6]}, "2": {"description": "In and out. Friendly and quick service as always. And never had a bad dish here. Short and simple, delicious breakfast/lunch spot.", "rating": "4", "date": [2015, 8, 30]}, "9": {"description": "This place is a gem!  You have the full diner experience: a waitress who knows her customers, some folks who are obviously regulars, and great coffee which keeps on coming.  I had a Greek omelet which was stuffed with spinach, sauteed onions and creamy feta.  It was delicious, but  I couldn't stop eating the hash browns.  They are finely shredded and have that buttery crispness which melts in your mouth.  Delicious!  My husband had a loaded skillet. which he finished (and then he helped eat my hash browns).  Prices are low and attention from the wait staff is high.  We will definitely go back!", "rating": "5", "date": [2014, 7, 5]}, "6": {"description": "breakfastrules.blogspot.…All in all, this is a very recommended breakfast spot. Frank thought his omelette was one of the best omelettes he ever had. He gave it a resounding 5 Brent faces and even went to take his leftovers--and mine--home with him for lunch the next day.I thought this was a great place and it made me a little nostalgic for the now closed Ramova Grill. The coffee was perfect, the service was as it should be, my omelette (despite Sasquatch's molestations) was damn tasty and any place that offers grits gets half a Brent face for that alone. I also like that I could have my breakfast and then proceed to the bar ten paces away. I gave it a 4.Brent was a little less sanguine on the experience and awarded an average 2.5. \"It was a good omelette but I didn't like the hash brows,\" he says.Another dissenter was Sasquatch (also 2.5), who thought his omelette was a little too runny and possibly undercooked. He explained this in the car on the way home because he didn't want to go on a Sasquatch-like rant in the restaurant. Although he did admit the bacon was good.Howard, who scouted this place, gave it a 4, and why not. To counter Brent's take on the hash browns Howard said that he preferred Cal Harbor's bronzed, shredded browns as opposed to the cubed variety. He found his Hodgepodge omelette most agreeable.That gives Cal Harbor Restaurant & Lounge a very good rating of 3.5 Brent faces.", "rating": "4", "date": [2014, 2, 24]}, "18": {"description": "This place is a complete dive--but that's why I like it.  And it's the only place to eat at (besides McDonald's) located in Historic Pullman.They have strange hours (breakfast and lunch only, no longer serving dinner, but the bar is open until 10pm or something).  The food is OK.  Some things are really good, others just OK.  Its greasy diner food.  The people are entertaining to watch.  Any given morning you can go here and find the same waitresses screaming orders at each other..Now that the Pullman Pub has closed, they're the only drinking game in town... they apparently serve \"bar food\" type things at night too.", "rating": "4", "date": [2006, 10, 3]}, "10": {"description": "Awesome service and I would have to say the best hashbrowns!!", "rating": "5", "date": [2013, 8, 3]}, "13": {"description": "Welcome to America.  We're experiencing a quality diner shortage, and places like Cal-Harbor are the remedy.  Cal Harbor's attached to a cocktail lounge, which closes before midnight.  This may not seem like much until you stop to consider the clientele such a combination is likely to attract: older regulars.  Sort of refreshing at a time when the average hot spot's shelf life is about 17 days.You can't do much wrong with a BLT or a grilled cheese sandwich ($3-$4), though I wasn't necessarily interested in giving the cream of broccoli soup a whirl.  If, however, you'd like soup, french fries and a sandwich, you'll be out no more than $8.  Standards of decorum are pretty loosely enforced.  One man came in and ordered two roast beef sandwiches in separate bags to go.  When asked if he wanted mayonnaise, he responded, \"you ain't gotta do anything but load' em up.  Load 'em up!\"  He seemed pretty pleased with this formulation, and repeated the command no fewer than four times.  In the booth next to ours, a man had fallen asleep at a 45 degree angle, though the staff appeared unconcerned.Thank goodness for Cal-Harbor.  I once visited a diner and paid $8 for a bowl of yogurt and granola.  Cal-Harbor isn't that kind of diner.", "rating": "4", "date": [2009, 3, 27]}, "16": {"description": "1st visit down to Pullman (Metra Electric to 115th) in years. The landmark of the yellow awnings have blown away for now. Waitress said they'll be back. 115th between Metra station (just west) & the McDonalds (just east). $9 total for coffee, phillie melt plate w/fries, soup. Good diner food in a funky neighborhood.", "rating": "4", "date": [2011, 2, 19]}, "17": {"description": "As a dive diner, it rates 5 stars.  Clean,  old, nostalgic, friendly, cooked hot and fresh just for you.  Very diverse clientele, and staff.  Near Pullman Village, where I hear the owners live.  May have been the largest serving of gyros I've ever had.", "rating": "5", "date": [2011, 7, 8]}, "15": {"description": "Cal Harbor's isn't actually on the Calumet Harbor, but it's still got some praiseworthy industrial views.  The four stars are principally for the omelet that I had, which was greasy, but/and really delicious.  The service is attentive, friendly, and coarse, which made for plenty of entertainment during my solo meal.  And the 5:30AM opening time is great, since it means I can get my hot chocolate and griddle-fare right before bedtime.  The prices are low, but actually a step above what I expected for this far south--the omelet & bowl of grits was $6.50.Lastly, Yelp is calling it in Riverdale, but it's really in Pullman--easy walking distance from the historic attractions, if you're visiting.", "rating": "4", "date": [2008, 6, 26]}, "0": {"description": "Within the category of \"dive diner\" this place rates the full five stars.The skillets are my favorite, except maybe for the great friendly staff who always recognize a repeat visitor.  Service is efficient and they seem to never make a mistake.  You can sit on a rickety barstool and read the paper with your meal, or you can find a booth in the corner. It's cash-only, but you won't need much.  As another reviewer said, it's in Pullman, on 115th - look for the yellow awning. Only one more word: Grits.", "rating": "5", "date": [2009, 10, 23]}, "5": {"description": "Love this place. It's one of those joints where everyone knows everyone. Staff is very friendly, food doesn't take long even when they are busy. They have the best hash browns ever. Had a cheese omelette and grits last time (and of course the hash browns). Delicious! My coffee kept getting refilled sometimes before I was even done with it. For the omelette, hash browns, grits, coffee, and an English muffin, my total bill was $8. Not bad at all. I'll come back here every chance I get and would recommend it to anyone looking for some good breakfast.", "rating": "5", "date": [2014, 12, 22]}, "11": {"description": "Thank you Yelp for leading me to this gem of a diner! It's in Pullman, not Riverdale as labeled here, but when I searched for a restaurant in the area it was the only thing close, so thought we'd check it out. My son had a court date on 111th, and this diner is less than a mile away. He said he wanted to go for breakfast food at a \"real restaurant with some atmosphere\", not fast food or a chain. Well this place fit the bill, he said \"I love this place!\" 3 times before we even got our food, lol. It is definitely a greasy spoon with the decor and ambience you would expect. Service was great, kept my coffee cup filled, asked if we needed anything else even after giving us our check. Food was fabulous, cooked as requested. The hash browns were fantastic, grated finely, crispy on the outside, tender on the inside. Pancakes were so light and fluffy! If I'm ever in the area I will definitely go back. Highly recommended!", "rating": "5", "date": [2014, 1, 10]}, "8": {"description": "This place is great for what it is. I come here for a good, hot, cheap breakfast. Pablo works his magic on the griddle, and Marge always remembers us. The turkey sausage links are delish, the thinly shredded hashbrown potatoes are unique and tasty, and Marge is the stereotypical diner waitress type (with an extra 30 years). She doesn't crack her gum, though...", "rating": "4", "date": [2014, 3, 5]}, "3": {"description": "Was in the area and stopped by.  There aren't many diners on the south side of Chicago, so I was eager to try this place.  I had buttermilk pancakes, sausage links and hash browns.  The side of hash brows was so big, I couldn't finish it.  It was literally a whole plate.  My pancakes were good as well.  I want to come back and try additional items on the menu.  Also, for it being Sunday around 11am, it was not so crowded where I have to wait, which was fine with me since I was as hungry.  You just gotta make sure you bring cash, since that's all they accept.", "rating": "4", "date": [2015, 5, 20]}, "14": {"description": "\"What would you like, hon?\" the pleasant waitress greeted me.  I ordered the Cal-Harbor skillet.  Some time to kill, I marveled at all the fake wood- tables, diner bar, side wall paneling.\"Pablo, que pasa?\"\"Pablo- what's the steak come with, as a side?\" (everybody seems to know Pablo, the cook, by name).I noticed tremendous diversity, people of all shapes and sizes and ethnicities and ages.  A senior couple leisurely sipped coffee and spoke softly at the table next to me, drowned out by a rowdy double-date across the room.\"This is not a democracy,\" a man sitting alone lectures his daughter over a  cell phone.  \"You do what you're told.\"I got my skillet after some time.  It was exceptional- scrambled eggs, blackened potatoes and sausage, peppers and onions, everything well done and tasty.\"More coffee, hon?\"", "rating": "4", "date": [2008, 9, 7]}, "4": {"description": "I live near the area and take the Metra train nearby but never really thought about trying this place until my Mom's refrigerator stopped working and she needed breakfast.  I was pleasantly surprised when I looked at the Yelp reviews of this establishment and they were good ones.  It's what made me decide to try them for take out.  Staff was friendly, and I was surprised how many people filled the restaurant on an early morning weekday.  Our French Toast and bacon/turkey link sausage was deliciousl!  The only thing we didn't care for which was a disappointment was the hash browns.  Yelpers said how good theirs was and that's why I got them.  I asked them to add minced onions in them.  I think they kept them on the griddle too long because they were dark brown & didn't look like the ones in the display picture, ha!  Other than that, GREAT!  I will definitely be back and hopefully I can sit inside and take advantage of be waited on.", "rating": "4", "date": [2015, 7, 1]}}, "neighborhoods": ["Riverdale"], "latitude": 41.6856994628906, "longitude": -87.6096725463867, "rating": "4.5", "times": {"Mon": ["5:00 am", "3:00 pm"], "Thu": ["5:00 am", "3:00 pm"], "Sat": ["5:00 am", "3:00 pm"], "Wed": ["5:00 am", "3:00 pm"], "Tue": ["5:00 am", "3:00 pm"], "Sun": ["5:00 am", "3:00 pm"], "Fri": ["5:00 am", "3:00 pm"]}, "price": "$", "categories": [["Coffee & Tea", "coffee"], ["Lounges", "lounges"], ["Breakfast & Brunch", "breakfast_brunch"]], "address": ["546 E 115th St"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Delivery": "No", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Breakfast"}, "category": "Restaurants", "number_of_reviews": "20"}, "rosebud-farmstand-chicago": {"comments": {"1": {"description": "Not a bad lil place", "rating": "3", "date": [2011, 2, 24]}, "0": {"description": "Nice place just to pick up stuff you forgot. Don't spend your whole link card there. Just pay your friend Day day or big mike or even pookie to take you in his beat up car to Ultra foods or Aldi  in lansing.", "rating": "3", "date": [2012, 1, 25]}}, "latitude": 41.6582450866699, "neighborhoods": ["Riverdale"], "categories": [["Grocery", "grocery"]], "address": ["525 E 130th Street"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.6084136962891, "category": "Food", "rating": "3.0", "price": "$$", "number_of_reviews": "2"}, "mcdonalds-chicago-188": {"comments": {"3": {"description": "This is my only 3 star review I think I may ever leave. The experience I had here was quite phenomenal, and I would assume most people would have left 1 star, but since I left this Mcdonald's with such amazement, I will not leave it 1 star, but three. This place is A-OK...Here we go....So, I pulled up to the drive thru of this Mcdonalds one summer afternoon, and sat at the Drive thru for a couple of seconds. Then about a minute....Nothing. Well, thats fine I thought, the employees are probably being lazy on a hot summer afternoon. I'll cut them some slack, its Mcdonalds. Then I heard some fast-food type beeps and frying sounds. They were coming from the little speaker. The other end....WAS LISTENING. I hesitated, then began to place an order, testing to see if my hypothesis was correct. What I had ordered appeared on the little LED screen. INCREDIBLE. I placed the order, a total came up. Not a word had come out of the box, only sounds. I slowly....carefully pulled up to the first window. The total appeared again on another LED screen. The employee's hand was outstretched. I gave her money. She gave me change and hurriedly shoved my order at me. NOT A WORD WAS SAID. The order was correct, and everything was fine. I straightened my head, stared blankly, and proceeded to pull out of the drive thru, unable to comprehend the madness that had just happened. After the numbness in my brain went away, I realized this was for the better. It is extremely hard to communicate with people at Mcdonalds. I'm just saying, there's something lost from box to headset. This Mcdonalds, though, has achieved some sort of fast food drive thru nirvana.... And I am enlightened.", "rating": "3", "date": [2010, 5, 4]}, "1": {"description": "Don't expect much from this place. The workers are rude and your food is wrong and cold half of the time. I'd hardly call this place fast food.", "rating": "1", "date": [2015, 10, 5]}, "2": {"description": "So I'm not gong to be biased i have. Been there on multiple occasions This mcdonalds sucks ass they consistently mess up orders get orders switched around I mean there are only 15 things on a menu I mean if you order a number 2 don't be surprised if you end up with a  number 9 and when you go inside prepare for the longest fucking wait possible to receive your order", "rating": "1", "date": [2014, 11, 8]}, "0": {"description": "Lol at the only other review..the only reason I'm reviewing this place is because I've lived 2 blocks away from it for 20 years..The way it used to be: Go in early, hi, how are you? Can I take your order? with a big smile on their face..Now: ______________________________________________ya? Lol..ok not all the time but people here are so dry..they don't smile, say hi, how are you..and if they say, have a nice day it sounds like someone's holding a gun to their head...Like I always say, if you don't want to do your job..someone else will..people who can't provide a good level of customer service don't deserve a job..even if it's at McDonalds! It's 8 hours of work, and it's just not that hard...get over it!I really don't eat much McDonalds...maybe once every few months..but when I do, ya I bypass this place and head over to NW Indiana..or the East Side...even though I live right here..Sunday mornings forget it..damn House of Hope people line up the drive through out to 115th st...I can never get my coffee on my way to work...hopelessUgh but a little customer service training would be nice..I know I shouldn't expect much...but damn.", "rating": "2", "date": [2011, 1, 23]}}, "latitude": 41.68572, "neighborhoods": ["Riverdale"], "categories": [["Fast Food", "hotdogs"], ["Burgers", "burgers"]], "address": ["600 E 115th St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.60766, "category": "Restaurants", "rating": "2.0", "price": "$", "number_of_reviews": "4"}, "the-factory-gentlemens-club-chicago": {"comments": {"14": {"description": "This place sucks.  I took some friends on a strip club crawl for my wife's bday and this was supposed to be the last stop.  I printed the 50% off coupon from their website and called to see if I needed to make copies for each of my guest in an attempt to preserve some trees.  The owner tells me that I would be cool but when I get their they start tripping.  The raspy-voiced old lady at the front, Gina, gets smart with me.  She say's \"you seem intelligent\" and tries to read from the coupon as to imply that I should be able to read.  Before she can finish, I tell her don't worry about it, me and my party will all leave and you can get NONE of our money.  They must have needed it desperately seeing as how the club seemed VERY empty for a Saturday night...in comparison to SKYBOX which was packed with plenty of dancers.  Today I found out their was an attempted robbery and the club was shot up moments after we left.  Thank God they were ignorant and didn't know how to treat customers and we all got out safely.suntimes.com/news/24-7/1…Amazing...", "rating": "1", "date": [2009, 12, 14]}, "3": {"description": "Disclaimer: I came here for my sister's birthday on November 5, 2011 - but I wrote this review directly after:This star comes from sheer entertainment of the crowd and the look of the place.I drive past this place all the time ~ always thought \"I going to check them out.\" Well the day finally came ~ my little sis planned to have her 26th Birthday bash there.I was told to get here fairly early cause prices go up tremendously. Note that 10pm must have been too late. There was a $20-$30 charge for parking in their gravel, uneven, mud pit. How they determine the difference between $20 and $30? ~ only the crackhead looking guy that directs you knows that bit of info. All parking is paid ~ so we pay the $30 thinking this puts us close to the entrance...no...my feet in those 4inch heels walking on uneven ground dodging mud pits begged to differ.We finally get to the line and I tell my feet it is okay they are safe now. But only if I knew my pockets were now in danger.The cover for myself and my husband ~ $70!Little Sister ~ oh how I love you ~ this would have been my que to get out of this place... but I told my pockets they were safe.. I'm not going to put them through that torment again. I told them they were going to be okay ~ no money on drinks ~ cause the Factory is a BYOB. My pockets were wounded and not so easily to forgive.We we finally walked in $100 dollars lighter our breath was taken away... yes the place is cute ~ but the air quality is awful! Now I love me a good strip joint ~ and my husband is somewhat of a connoisseur... but this place is the bottom of the line when it comes to tittie bars. I feel a little sorry for the girls cause they are not making any money ~ besides the exorbitant fees to enter:~ the girls on stage are not doing anything spectacular~ no full nudity~ some of them were quite thin ~ and some of them were quite fat~ the girls walking around had on as much clothes as the chicks on stage...my hubby thought this was a plus ~ because usually a great tipper at the club ~ he vowed he would not pay a dollar more in this establishment.That last statement is easier said then done when BYOB is only and just that ~a bottle and nothing else ~ not even the bag it came in~ so... :- cups (little clear plastic ones) $1- ice buckets (like the little hotel size) $5- juice (1/2 liter) $5- water (just regular size) $3We needed only 3 things someplace to keep our tequila and beer cool ~ and cups ~ $7.The DJ was cool ~ there was no real dance floor ~ so folks kept walking in circles.There was a smoking area which they had roped off so it was quite small with a lot of people ~ I wonder if some weaves went up in flames out there?The thing about this type of BYOB ~ you don't drink it you must leave it. By the later hours, this fact made for some dark entertainment:~ people puking were they stand~ people passed out in corners ~ people being carried out by security.I wondered where they were taking the victims of alcohol poisoning...I found out:They dumped the males out behind the place - just laid them outside...still don't know what happened to the multiple chicksAll this to say what I can sum up in one word:Overrated", "rating": "1", "date": [2012, 2, 7]}, "1": {"description": "It was a lot of money made in this club, but the club was ghetto like cowboys use to be. You had ever class of dancers in this club, and you also had every class of customers in this club. Unfortunately, black dancers can't get into every Gentlemen's Club like white women can. So for the black men that like black women they had to come to a black club that had black dancers.Some of the dancers were school girls, some of the dancers had regular jobs & we're hard working women. Some of the dancers were classy, & some of the dancers we're trashy. Some of the dancers we're ghetto rough women,  & some of the dancers we're evil. Usually In black clubs weight doesn't matter.The dancers can be really skinny or really plus size. The dancers that make the most in the black club are usually chunky dancers, but sometimes thin dancers can make a lot too if they look like beyonce, but even though I was on the skinny side, and I wasn't lightskin I still did well at this club. To bad my cousin seen me dancing, and made me quit. He didn't want his friends thinking negative things about me", "rating": "4", "date": [2014, 12, 15]}, "2": {"description": "WTF was I thinking!I haven't been to a strip club since 2006 and this experience made me remember why.A friend's bday had passed and he mentioned that he liked strip clubs so I decided to return to one after a 6 year hiatus. First off there is a $20 parking fee which is mad ridiculous and then I walked into a $30 cover...30 minutes later my friend paid $40 to get in. After paying $50 and not seeing a naked ass yet, I was told there is a mandatory $3 coat check fee...WTF!!! I told the coat girl that they are running the biggest scam in town. We walked inside the joint only to see more women spectating (which I'm not a fan of) than guys...not to mention the strippers were unattractive...the waitresses were more scantily clad! This joint is byob so everyone was walking around with a bottle of something in their hand...Diddy's Ciroc Vodka and Patron seemed to be the drink of choice for most.I think its a travesty for what they charge in this joint! Again, $53 was outta my pockets before I saw any flesh and by the way, out of 45 mins of being there I only saw two nipples... At least the door guy told me and my buddy to have a nice evening as we walked out...Never again!!!", "rating": "1", "date": [2012, 2, 19]}, "9": {"description": "This was the worst gentlemen's club I have ever been to. And I have been to A LOT of them... The girls were disgusting. We paid $20 for Valet (mandatory), and $30 for entry. These other reviews must have been written by the club promoters. Horrible experience.", "rating": "1", "date": [2012, 1, 16]}, "10": {"description": "AVOID THIS PLACE AT ALL COST. I came here to celebrate a friends birthday.  When I get here I have two choices for parking. $30 to park in the back with gravel or $50 to park on the side and front. I was by myself so I paid the cheaper parking spot. So I ask the guy who assisted parking about my small leather blazer and having foldable shoes in my purse. He said it was fine.  I wait in line.  Once I get to the bouncer I was told to throw my shoes away or take them back to the car. (Mind you it was a lil walk in the first place and I'm not standing in line again) bye shoes. I'm in the doors (yay). I had to pay $30 for cover. Then once I'm at the double doors they were like coat check. I just had it.  It's not even a damn coat. I told them give me my money back and I'm leaving. I had it at this point I'm out of $60 and a pair of shoes before seeing the inside of this place. Plus not to mention money that I planned to spend in there. It was the principle. They gave me the cover money back, but not parking. I'm out $30 bucks. Never again will I be back.  It's better places that don't nickel and dime you out there.", "rating": "1", "date": [2014, 3, 29]}, "4": {"description": "Sometimes it's a few people who hold together an establishment. This is an amateur hour of strip clubs. First, you got to keep the hot girls there. I didn't see any. Second, the cover charges are just stupid. That's all.", "rating": "1", "date": [2013, 9, 9]}, "6": {"description": "Im still trying to figure out what the HELL you people are thinking. Are we talking about the same place?  First things first, what club is free but theres a mandatory $10 parking fee and mandatory 2 drink JUICE minimum and charges money for a petty ass bucket of ice?? Ok...I guess thats no biggie....anywho I went in on a monday night expecting beautiful bitches everywhere and a nice sexy enviroment. Instead I walk into a Block party at the Players club, I see a mother of 6, recovering alcohlics, and sticks on stilts. I felt like I was in a Lil Jon video. For a huge club like this which is very nice and sexually decorated I expected magic. And DEFINATELY a better selection of ladies. I cant lie though, I saw a few diamonds in the rough and some Big asses. But besides the BYOB rule and 5 out of 100 bad bitches....eh I think I'll pass", "rating": "2", "date": [2011, 12, 22]}, "11": {"description": "Okkkkk...Soooo, I decided to charter a party bus to The Factory from Michigan for my birthday. I had heard wonderful things about the club.  WRONG!  WRONG! WRONG! Although I stayed in contact with the club promoter weeks before my initial party, I MIGHT AS WELL HADNT TALKED TO NOBODY because we were treated as such!!  We get to the club and was greeted by BIG ASS DUDES who seemed to be PMSing and were cramping bad!! They said we couldnt wear hats..fine, took them back to the bus. We get back he says, NO OPEN BOTTLES...so again..back to the bus. Finally get back and was frisked by the BIGGEST BITCH EVER (that prolly had hair on her back may I add). I get in the club, these clowns talking bout $40, when the promoter told me $15 no more than $20. I had 16 ppl with me.. you do the math. They were charging the guys $60. So we get in and it smells like catfish and taco powder, it  was over crowded... my shoes stuck to the gummy ass carpet..dudes grabbing random girls asses (LIGHT WEIGHT RAPIST)....everybody running around in a circle...outta da 50 chicks there it was only 2 worth looking at. I felt like my safety was being compromised. IT WAS A COMPLETE CIRCUS!!! We didnt even stay in the club longer than an hour before we were back on the party bus. DO NOT GO TO THIS GHETTO ASS...SEAFOOD & TACO BELL SMELLING..STD GATHERING SPOT. ITS BAD FAH YA HEALTH!!!  #IwishIcouldPress0stars..cuz yall establishment SUX!!", "rating": "1", "date": [2013, 3, 4]}, "12": {"description": "I love the byob, the girls are smokin, and the club is spectacular. Suites are great prices and you get what you pay for better than any other club in Chicago-land.", "rating": "5", "date": [2011, 1, 4]}, "5": {"description": "I love THE FACTORY! Great club for girls and guys! Love the music, too! First of all, it's BYOB! I love that!  My girlfriends and I bought a bottle of vodka and was set for the night! So much cheaper then paying for drinks at the bar! They also have awesome food and a friendly staff, which is rare! Secondly the girls are HOT!!! There were all types but all beautiful. I got several private dances and trust me, they were great and reasonably priced ;-P Finally, It's aesthetically pleasing with beautiful modern decor. They have two rooms and lots of VIP space! It's a large, beautiful club with the perfect layout. Did I mention they have rooms with showers where you can watch girls dance? Where else can  you see that?! There is a jacuzzi outside too! I've never been to a gentlemen's club like this. I can't wait to go back!!!!!!!!", "rating": "5", "date": [2010, 7, 27]}, "13": {"description": "I wish I could give the place three and a half. It is BYOB (bring your on booze) and they serve no alcohol. I went on a Saturday and it was dead from 8pm til 12pm.Another downside you HAVE to buy buckets of ice to keep your liquor cold (5 bucks a bucket).The place is huge but only six girls were in there. Step it up factory!!!!", "rating": "3", "date": [2010, 1, 14]}, "7": {"description": "This club is huge, it should be a nightclub and I'm glad to hear it's finally going in that direction. I hope they do with this business what was done with Club 2000 years ago in Charlotte, N.C. A nightclub linked with two strip clubs for men and women. Factory's biggest set back is location and lack of transportation for those without. It can be seen off the expressway but isn't easily found once you exit. A few signs on the road would help. If you're an Internet sleuth you can score passes online, otherwise cover is typically $15-$20, I believe there was a mandatory valet cost which was minimal. Good to know there is some kind of security in the lot. This club blows many others off the beaten path with their stylish décor, helpful staff and clubby atmosphere; that is until you've been seated. I hope it's gained more popularity since our visit some time ago. Ladies are lovely and seems to have moved here with the publicity; from neighboring clubs. Some staff has travelled from as far as Milwaukee and Michigan just for the opportunity to dance at a mega club. The club is a dry bar, so you have to bring your own. It is hard to find any liquor sales nearby and you'll have to drive a great distance for that, so plan ahead otherwise you'll be stuck with a cost of $20 for a carafe of juice! Most ladies are welcoming with a decent stage presence and receptive in welcoming you to their club. Many of their entertainers are reflective of the types of nationalities found in Chicago. Please, please, don't be cheap ass. If you want company at your table let yourself be heard via decent tips. Tip the stages, your waitresses, etc. The night I stopped in only one of two dance areas were in use. A single long stage with a length close to a basketball court with around three poles with two entertainers dancing at a time, encircled with seats. Dances were approximately $35 per song or 3 for $100 if you went for the best of dances, $25 for the regular. There are other options like shower dances or watching your entertainer in a Jacuzzi. If you plan on staying awhile, want info on having a party or just want to see it all, ask for a tour. Management is willing to show off a bit. Right now it's a decent club and with some work, more popularity and a thriving night club scene added in, it could be an awesome time in the future. But with staunch competition like Scores, PoleKatz and Industrial strip it's going to have to do a lot more to distinguish itself from the rest. I know that our group was thoroughly annoyed with their pricing on everything from dances to beverages for mixing with our booze. Currently I've heard their club scene happens on Thursday nights with Latin music and topless dancers.", "rating": "3", "date": [2009, 11, 30]}, "8": {"description": "Should do well as a nightclub and If the do this, I hope the owners do it right.  Girls are so-so.  Mostly women from other clubs.  Some 10s, some downright hood chicks with the tudes', tatts and tramp stamps.  Some bi strippers also.  Customers are mostly local peoples, lots of bi and lesbian women too.  Seeing lesbians flock to a strip bar in groups is new to me, anywayz.Here are the charges: $6 valet. $20 cover (go online and Google them, you can get half price passes and free ones too)Dances:Table dance: Didn't know they offered these, not sure if I trust Jade J.Lap dance: $25 each song. (Gaurd stands nearby)Lap dance: $35 each song or 3 for $100. (This is a more private room, no monitoring. They have to be monitoring with cameras, but, you don't have to look at a security gaurds ugly mug)Shower:  $100, in 15 or 30 minute shows. (You just watch)Jacuzzi:   $100, in 15 or 30 minute shows. (You just watch)Whyz the hell would I pay money to watch a chick wash herself or sit in a jacuzzi.  For real?  Ph--k that.  Since its BYOB, I'm tellin ya you need to bring beer with you.  We did the dumbest shit, brought in whiskey.  They said they would give us mixers. Cool.  Then we got the bill and it said, $20 for a small pitcher of cranberry juice. Damn.  And then, thats $40 dollars total cuz we got 2.  Plus for ice you got to buy it for $5 dollars.I get it, they don't have their own booze so they gotta get theirs any way they can.  But damn, chill on them prices.  Girls are really nice and will come over and say hello. They got some gorgeous black women, one chick lookin like Beyonce.  Some of the latinas are stuck up, but that is usual around these parts.  They only dance for their latin homiez.", "rating": "3", "date": [2009, 8, 30]}, "0": {"description": "Yep. Good times.So, my GF and my 3 BBF's went and had a killer time. Good music, the girls were friendly (until the young ghetto boys with $$ got there), and it's BYOB.  So what the small carafe was $10 for fruit juice - shame on any man who complains about that. Or for a $5 pitcher of ice. Bring beer next time, Tramps.The bathroom was CLEAN. We got the tour and I was satisfied with what I saw (private room, hot tub, VIP, shower).There is Ladies Nite on Wed (oh yeah). So I will be back.", "rating": "4", "date": [2010, 9, 7]}}, "neighborhoods": ["Riverdale"], "latitude": 41.67519, "longitude": -87.6024475, "rating": "2.5", "times": {"Mon": ["9:00 pm", "2:00 am"], "Thu": [], "Sat": ["9:00 pm", "4:00 am"], "Wed": [], "Tue": [], "Sun": [], "Fri": ["9:00 pm", "4:00 am"]}, "price": "$$", "categories": [["Adult Entertainment", "adultentertainment"]], "address": ["12054 S Doty Rd"], "attributes": {"Best Nights": "Thu, Fri, Sat", "Parking": "Private Lot", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Very Loud", "Alcohol": "No", "Outdoor Seating": "Yes", "Happy Hour": "No", "Wheelchair Accessible": "Yes", "Has TV": "Yes", "Music": "DJ", "Smoking": "Outdoor Area/ Patio Only", "Good for Groups": "Yes", "Coat Check": "Yes", "Good For Dancing": "No"}, "category": "Nightlife", "number_of_reviews": "15"}}