{"new-tea-garden-chop-suey-chicago": {"comments": {"3": {"description": "One of my best friends family runs this little business. Mostly, it's known in the neighborhood for its chicken wings. Many interesting things I learned about this americanized Chinese restaurant. I learned that the food here was cooked as soon as you ordered it. So it's not made and then reheated. Interestingly, the chef chops everything up himself, he doesn't believe in using any machines. The crab rangoons are the best I've ever had; I crave for them. But it's too bad I have to drive a long way for them. Don't think this is a fast food restaurant because they make the food when you call to order it! This is mostly a carryout restaurant , so you really wouldn't be able to sit and eat there. Eggrolls, fried rice, chicken wings... yummy! The family who runs it is very friendly and prompt. Chicken wings are the most popular on the menu.  so if u are in the area, i do suggest u try their crab rangoons", "rating": "5", "date": [2008, 5, 17]}, "1": {"description": "A neighbor of mine tried to tell me about this place a few years ago but he couldn't remember the name of the establishment.  It was because of a fellow Yelper's review that I decided to try them and I'm so glad I did.  Food is delicious!  They have alot of dishes to choose from.  Most Chinese places don't have this dish but they did and it was good - Shrimp and Egg.  They will definitely get our family's business from now on.  Yummy.", "rating": "4", "date": [2015, 6, 1]}, "2": {"description": "Never again! Fast quick polite service clean not smelly However probably worst Chinese food ever! Hard egg rolls I ask for no MSG THAT DIDNT MEAN NO TYPE OF SEASONING !!! Yuck then for 7.50 very disappointed!", "rating": "1", "date": [2015, 9, 11]}, "0": {"description": "I love New Tea Garden!They give you a lot of food for your money and on top of that it is D'lish!  The shrimp egg foo young, the shrimp and lobster sauce, I agree the crab ragoon is on point, and the lunch special!This is another place that I wished I lived closer too because the food was some of the best that I had.I miss it!", "rating": "4", "date": [2012, 11, 20]}}, "neighborhoods": ["Roseland"], "latitude": 41.6876678466797, "longitude": -87.6213226318359, "rating": "3.5", "times": {"Mon": ["11:30 am", "10:00 pm"], "Thu": ["11:30 am", "10:00 pm"], "Sat": ["11:30 am", "10:30 pm"], "Wed": ["11:30 am", "10:00 pm"], "Tue": ["11:30 am", "10:00 pm"], "Sun": ["12:00 pm", "9:00 pm"], "Fri": ["11:30 am", "10:30 pm"]}, "price": "$", "categories": [["Chinese", "chinese"]], "address": ["11342 S Michigan Ave"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "No", "Attire": "Casual", "Waiter Service": "No", "Takes Reservations": "No"}, "category": "Restaurants", "number_of_reviews": "4"}, "subway-chicago-263": {"comments": {"1": {"description": "I avoided this Subway ever since the SECOND time I came here. I mean, the service was really shitty and the people did NOT give a rat's ass if they got your order wrong. There is a glass protector between the staff and customers. However, it does nothing but prevent them from hearing your orders. Bad attitudes and poor hygene.", "rating": "1", "date": [2013, 4, 6]}, "0": {"description": "Worst subway I've ever been to! Super duper slow service. Then they mumble everything they say, and it doesn't help that there is a bulletproof window covering everything.", "rating": "1", "date": [2014, 10, 7]}}, "latitude": 41.7073202133179, "neighborhoods": ["Roseland"], "categories": [["Sandwiches", "sandwiches"], ["Fast Food", "hotdogs"]], "address": ["240 E 103rd St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Kids": "Yes"}, "longitude": -87.6171603798866, "category": "Restaurants", "rating": "1.0", "price": "$", "number_of_reviews": "2"}, "ap-deli-chicago-3": {"comments": {"3": {"description": "If you craving a real corn beef sandwich , this is the place . Don't think they should be priced so high though .One sandwich like 10 bucks , no fries ,chips or drink.", "rating": "3", "date": [2014, 8, 9]}, "1": {"description": "I love this place!  Just grabbed 4 large corn beef on rye w/mustard, and a whole pickle! Talk about pleased. Their sandwiches are made fresh, while u wait. And talk about the meat hanging off the sides. Highly recommend this place.", "rating": "4", "date": [2015, 5, 8]}, "2": {"description": "I absolutely love their corn beef! It is delicious.  Every time I come here, I feel welcomed by the cashier.  Most times I see different workers but I never leave feeling uncomfortable. Sometimes their inventory is low and also the place can use a bit of a makeover, maybe to brighten it up but overall it's a cool place. It's been there for years! Keep serving the Roseland Community!", "rating": "4", "date": [2015, 4, 1]}, "5": {"description": "It's a deli. Low frills. Adequate service. Delicious corned beef. I always find myself waiting waaaaay longer for my reuben while my coworker has her corned beef sandwich out and ready to go. It's a neighborhood staple and great lunch option if you're in the area. I know there are a couple other locations around the city. It's not somewhere I'd drive out of my way to go, but when we have in-service days and professional development, AP Deli is our go-to place for a lunch that's better than franchise fast food and completely overindulgent,  The portions are great sizes, and my belly is always happy.", "rating": "3", "date": [2013, 3, 29]}, "6": {"description": "I was craving corned beef and cabbage. A co-worker recommended AP-DeliUnfamiliar with the area, I decided this would be a nice little adventure. So from school, I ventured south along Martin Luther King Dr until 107th and made a left onto Michigan Ave. The area seems like it use to be very popular, but I guess due to the economy, one of the only places surviving in the area is AP Deli. So the area isn't that scary; i did see the CPD cameras in the residential area. As i walked in, I realized this place is very old and has been around here for a pretty long time. The staff pleasantly greeted me behind the bulletproof glass. I ordered the main menu item; corned beef. Picked up my order and noticed how they have drinks i never seen before or drinks I haven't seen for a long time; Arizona drinks I never knew existed and Wildwood canned soda.I quickly got into my car and drove back to school, because it's a take-out only place. The corned beef sandwich is pretty good. It's finely cut and it's a decent portion. It has a nice tenderness and fattyness to it. I only wished I got fries with it and there are lots of little bits of corned beef everywhere. I just felt it was a little over-priced for just a sandwich ($7.45). Unless that is the norm, then I stand corrected.Until I can find a better place for corned beef in the southside, this will be my goto place.", "rating": "4", "date": [2011, 4, 6]}, "7": {"description": "A.P. Deli is the standard for which other places serving up corned beef sandwiches in Chicago are measured (at least on the southside...and if you haven't heard about this joint yet for you folks north and west--shame on you..listen up). A.P.'s been around for years, and they are quickly expanding.  In a city that holds hot dogs, pizza and steak near and dear to its heart, blowing up as a deli in Chicago is tough.  A.P. Deli aint never been scerd.  And they now have numerous locations to prove it.The secret (that's not so much a secret): a HUGE, thin sliced corned beef sandwich that's enough to feed two. The price is more than reasonable (roughly 7 dollars). It usually comes with a sliced pickle and hot peppers--that once stuck inside the sandwich set it off like Vivica (Foxx for you slow pokes...for you super slow folks, Vivica Foxx was a star in the movie Set it Off--thanks, you've now ruined the vibe)....back to it...A.P. Deli is such a gem, it was the inspiration for a deli my Dad opened up in the late 90's called 3 J's. He knew that A.P. was onto something and although he didn't fair as well with his business ventures, A.P. continues to thrive. It's actually a shocker nobody had reviewed the ORIGINAL A.P. Deli on 107th and Michigan until me, so I'm honored. (taking a bow)I first went to this spot in the mid 90's and back then the location on 107th & Michigan was a bit sketchy. Not sure how things are around there now. The good news is A.P.'s are popping up all over the place. So if you want to find out what (arguably) the best corned beef in Chicago tastes like, hit A.P., walk up to the counter and repeat after me:\"I'd like a corned beef on rye with mustard\" The hot peppers will come in a white wrapping. Stick those in your sandwich, sit back, relax, and enjoy the show. Good talk.", "rating": "5", "date": [2009, 8, 5]}, "0": {"description": "I have been going to the AP Deli in Roseland since I was a kid. The Cornbeef sandwiches are still awesome!!!", "rating": "5", "date": [2016, 1, 5]}, "4": {"description": "The worst customer service ever. I called in my order, only to have to wait thirty minutes for it. There were no apologies, a total disregard for the customer.", "rating": "1", "date": [2015, 4, 16]}}, "neighborhoods": ["Roseland"], "latitude": 41.6988471150398, "longitude": -87.6209456473589, "rating": "3.5", "times": {"Mon": ["10:00 am", "11:00 pm"], "Thu": ["10:00 am", "11:00 pm"], "Sat": ["10:00 am", "12:00 am"], "Wed": ["10:00 am", "11:00 pm"], "Tue": ["10:00 am", "11:00 pm"], "Sun": ["12:00 pm", "8:00 pm"], "Fri": ["10:00 am", "12:00 am"]}, "price": "$$", "categories": [["Delis", "delis"]], "address": ["10758 S Michigan Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "8"}, "firehouse-steak-and-lemonade-chicago": {"comments": {"3": {"description": "My food was good but omg! The people that works there! They are rude uneducated black women! Don't know how to speak to people just know how to give attitude. Had to tell a young woman about herself.", "rating": "2", "date": [2015, 1, 6]}, "1": {"description": "Had this delivered through grubhub and it was sooo good. Simply good food and good prices.", "rating": "5", "date": [2015, 9, 30]}, "2": {"description": "Customer Service at an all time low ! I placed a delivery order from here on Friday at 9:56pm through Grub Hub. I ordered a philly chicken & a gym shoe. Only 2 sandwiches !!! I got a text at 10:53 advising the order was on the way and should arrive between 10:55 and 11:05. 11:15 I pleasantly called the restaurant and was advised that the order was on the way. I dozed off, it's now a little before midnight & still no order. Advised again order was on it's way. So after 12, the 2 sandwiches and fries that took over 2 hours to arrive are freezing cold, Since fries are no good re-heated, that was an entire waste of time & money. Never Again will patronize this business. No apologies or anything about the delay !", "rating": "1", "date": [2015, 4, 25]}, "5": {"description": "Great????????????", "rating": "5", "date": [2014, 7, 10]}, "6": {"description": "One Friday afternoon, I had a taste for something different. So I ordered the boneless wings and a taco salad. When the food arrived, it was cold...period. The boneless wings were good even though they weren't even lukewarm. The French fries were limp and cold as well. The taco salad contained old hamburger meat that looked as though it had been cooked long before I ordered. The salad dressing in the package they sent was runny and old. I would not order food from here if I were you. If you insist though, I would order in person and see it before paying for it.", "rating": "2", "date": [2014, 6, 6]}, "7": {"description": "I was FEENIN' for some frozen lemonade, so we just stopped by on the way back to the house.  Nothing outstanding - ordered the lemonade (sugary as sin), steak tacos (barely seasoned meat, great authentic soft shells) and cheese fries (it's the cheese sauce they use on the cheesesteaks, so the au jus flavor gave it a weird flavor kick).  But I give them three stars today, simply because I needed that lemonade SO badly!", "rating": "3", "date": [2010, 5, 29]}, "8": {"description": "Yummy fast food, definitely a big step above Mickey D's! There's not much else in the area for a quick meal other than the typical fast food chains. The interior is really clean and kinda cute (for a fast food place) with a faux fireplace at the counter. There's not a lot of room to eat in though; there's a counter with around 10 stools around the perimeter of the restaurant. Probably better to order to go.Anyway, moving on to the most important part - the food! I had a spicy chicken sandwich combo, which comes with fries and a lemonade or any drink. The chicken sandwich was pretty good, but the FRIES!!! The fries were awesome - very crispy on the outside but soft and delicious inside! Perfectly cooked fries!The lemonade is really good too, but be warned that it's a frozen lemonade, like a slushy. They have several different flavors of lemonade, such as cherry, red raspberry, blue raspberry, some interesting ones too such as pineapple and watermelon. I really liked the red raspberry, but wish I had known it was a frozen drink before I ordered as it is absolutely ridiculously freezing in Chicago right now!!The rest of the menu is mostly philly cheesesteaks, chicken sandwiches and wings. I will probably return at some point to try a chicken philly or the hot wings sometime soon.", "rating": "4", "date": [2009, 1, 15]}, "9": {"description": "Just ok... Nothing to write home about", "rating": "1", "date": [2009, 10, 8]}, "0": {"description": "I always get Philly steak extra meat and a soda! Every time delicious. I prefer regular fries to what ever they have but it's consistently good. Since fire & ice decided to close its now my go to when I want a Philly.", "rating": "4", "date": [2015, 10, 30]}, "4": {"description": "Terrible customer service! We called the restaurant 2.5 hours after ordering our food to check in, figuring the delay was due to Chicago weather, and they told us our food hadn't even been prepared yet and it would be another hour! Then we were put on hold before they hung up on us. Extremely rude! We called back half an hour later and asked to have the order cancelled and we were told that we're now on their \"block list.\" The food I've had from there has been fine, but I can't handle such rude and terrible service.", "rating": "1", "date": [2015, 2, 2]}}, "latitude": 41.7363316565752, "neighborhoods": ["Roseland"], "categories": [["Sandwiches", "sandwiches"], ["Cheesesteaks", "cheesesteaks"], ["Burgers", "burgers"]], "address": ["100 W 87th St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Very Loud", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "No", "Drive-Thru": "No", "Good For": "Lunch"}, "longitude": -87.6268351078033, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "10"}, "tommys-chinese-restaurant-chicago": {"comments": {"1": {"description": "Best chinese food in Roseland. I simply love it yummy!", "rating": "4", "date": [2011, 10, 22]}, "2": {"description": "um um good! They fried rice speaks for itself", "rating": "3", "date": [2011, 6, 7]}, "0": {"description": "I love this food!!!It is always good and always consistent. I only eat at Tommy's when I'm in the mood for Chinese food. No other place in RoseLand can compare or even come close to the flavors of their Crab Rangoons. The fried rice and egg fu yung  is wonderful and they have a full vegetarian menu for the non-meat eaters. If your on the south side and want a great taste of Chinese food you must drop by and pick up some of these eats to go. This is a gem on 103rd.", "rating": "5", "date": [2015, 8, 11]}}, "neighborhoods": ["Roseland"], "latitude": 41.70696, "longitude": -87.61901, "rating": "4.0", "times": {"Mon": ["3:00 pm", "9:30 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["11:00 am", "10:00 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["3:00 pm", "10:00 pm"], "Fri": ["11:00 am", "10:00 pm"]}, "price": "$", "categories": [["Chinese", "chinese"]], "address": ["129 E 103rd Street"], "attributes": {"Attire": "Casual", "Waiter Service": "No", "Take-out": "Yes", "Has TV": "No", "Accepts Credit Cards": "No", "Good for Groups": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "category": "Restaurants", "number_of_reviews": "3"}, "3-jjjs-better-taste-jerk-restaurant-chicago-2": {"comments": {"3": {"description": "Ordered 1jerk taco off of there food truck it was lacking in flavor and tasted funny! The next day I was having sharp pains in my stomach that caused IBS and vomiting uncontrollably and it lasted for 24 hours I will never go there again", "rating": "1", "date": [2015, 11, 26]}, "1": {"description": "I tried a jerk chicken taco from the food truck by Forman Mills. It was 2.00 and didn't have much taste and there wasn't much meat. My fiancée didn't like it either. If you are shopping at Forman Mills and you are hungry go across the street to the new Maxwell!", "rating": "1", "date": [2015, 12, 22]}, "2": {"description": "Yuck!! I had the tip and link combo and jerk chicken .. Ribs were hard and tasted old. Hot links were ok. The chicken was old and hard as well. Will never be ordering from here again.", "rating": "1", "date": [2016, 3, 3]}, "5": {"description": "l had wanted to try this place for awhile.  There was a jerk restaurant in that space prior that I wasn't impressed with so I decided I would try them today.  It's a warm day, 84 degrees.  When I stepped into the place, it felt warmer in there than it did outside.  They had several ceiling fans but they weren't on. :(   I ordered the Oxtail dinner.  The dinner comes with 2 sides so I decided since I love cabbage greens, I would get a double side of them.  I asked the order taker how long it would take, he said 7 minutes.  I ran an errand and came back after 7 minutes and still had to wait.  It was more like 15-20 minutes I waited for my food, however, they told they me they gave me extra probably realizing how much longer it took.  As you can see, it's a ton of food so no worries there.  The Oxtails were flavorful and tender so I enjoyed those.  However, the cabbage greens I couldn't eat at all.  Too much seasoning on them especially black pepper which was a real disappointment because here I am with all these greens and can't even eat them.  The order taker told me he hoped I would come back.  I told him I would call the restaurant and let him know what I thought of the food.  You know what?  When I called the number to the restaurant, a recording came on saying that the voicemail was full.  Not a good way to handle your business.", "rating": "2", "date": [2015, 5, 17]}, "6": {"description": "I just left there got a whole and a half chicken and a large rib tip.The chicken was greasy but other wise ok.,,Now the tips the sauce was great but tips were so tough was like eating the bottom of my shoe with great sauce on it. Next time I will certainly ask to sample them. If it would had not been such a inconvenience to me I would have taken that shoe leather back and demanded my money back.   Uggg!", "rating": "1", "date": [2014, 12, 18]}, "7": {"description": "We drove out of our comfort zone to an amazing find. The Salmon Dinner fed two people, and we were full.  The resturant was different but cozy and welcoming.  The food was \"just what we needed, a flavorful dinner that reminds you of having meal prepared by Mom. We ordered Candied Yams and Rice for the sides.  The Resturant also has a Food Truck that comes next to my building at work, downtown.  I will look for it and patronize it going forward. There were other Menu items that I want to explore so I will be a eating there for a while and spreading the word to my co-workers. :)", "rating": "4", "date": [2015, 5, 13]}, "8": {"description": "Met this flake infront of merch mart one day while going to get chipotle. He gave us a card and said call me anytime for food. So today I decided to call. Called at 9 oh yea 5 people 40 $. He said he would be there shortly after noon. 140 hits we call him he goes OH YEA. I am 10 minutes away. NO call NO show. So I went and had me a delicious billy goat burger and will never try this chicken again. If he can not deliver it right how can he make it right.", "rating": "1", "date": [2015, 2, 27]}, "9": {"description": "I absolutely love this place the food is great jerk chicken is so good juicy and tasty best jerk in Chicago better than joes and jerk villa. The prices are very reasonable and the service is great...I will be a regular at the place", "rating": "5", "date": [2015, 2, 8]}, "0": {"description": "I used to work next to a Jamaican restaurant in another city and greatly missed authentic Jamaican.  This place is amazing.  I just finished up a plate of jerk chicken (dark meat) from the food truck that stops by the loop.  Perfect amount of heat and huge portions.  Loved it.", "rating": "5", "date": [2015, 7, 30]}, "4": {"description": "Anyone that says they like this place has never had real jerk from any island!   This food what merely grilled spicy food.  A waste of food.My wife found his food truck on the westside of Chicago too bad I couldn't take it back.", "rating": "1", "date": [2015, 9, 5]}}, "neighborhoods": ["Roseland"], "latitude": 41.707047, "longitude": -87.613297, "rating": "2.0", "times": {"Mon": ["9:00 am", "10:00 pm"], "Thu": ["9:00 am", "10:00 pm"], "Sat": ["10:00 am", "11:00 pm"], "Wed": ["9:00 am", "10:00 pm"], "Tue": ["9:00 am", "10:00 pm"], "Sun": ["10:00 am", "9:00 pm"], "Fri": ["10:00 am", "11:00 pm"]}, "price": "$$", "categories": [["Caribbean", "caribbean"], ["Soul Food", "soulfood"]], "address": ["409 E 103 St"], "attributes": {"Attire": "Casual", "Waiter Service": "No", "Take-out": "Yes", "Accepts Credit Cards": "Yes", "Good for Groups": "Yes", "Outdoor Seating": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "category": "Restaurants", "number_of_reviews": "10"}, "ranch-steak-house-chicago": {"comments": {"3": {"description": "Very Flavorful steaks!  Closes a little early (7pm now) but if you can get there in time....", "rating": "4", "date": [2015, 10, 27]}, "1": {"description": "Customer service was great at first I went at about 6:00pm the close at 7:00pm my steak was burned my salad looks as if it had sat out all day and turned and my garlic bread was greasy and burned back potato was good but the when I called back to tell the manager about it she was careless and not sympathetic she just didn't care it was as if she had already gotten our money so she didn't care what the food was like nothing for our inconvenience or the food we had to throw away just sorry and there is nothing else she could do..... I will NEVER eat at the RANCH again", "rating": "1", "date": [2016, 1, 23]}, "2": {"description": "I came here on 4-14-15.  I have seen this establishment for years as I grew up in the neighborhood but never tried them.  I am happy to say that because of the great reviews on Yelp, I decided to give them a try.  Was appreciative that they are open early - the area is not the best so it was nice to get there before alot of street traffic started happening.  I ordered a ribeye breakfast special for my Mom who was celebrating her birthday and the french toast for me.  I waited awhile for my food but I didn't mind.  The staff, including the female chef were very friendly.  The food was Delicious and had a great flavor.  Looking forward to going again and maybe this time, sitting inside the establishment and be waited on.", "rating": "5", "date": [2015, 5, 14]}, "5": {"description": "I'm surprised there aren't more reviews of this place.This is one of my favorite places to eat in Roseland and it has been a staple in the neighborhood for many yearsNow, it has been a few months since I was last here but I use to come here at least once a week and I can't imagine this place changing that much in a few months.I love the steak breakfast with eggs and even if you get it to go it is hot and fresh!If you aren't a big steak person that's okay they have other breakfast items like the Dino's Special which is 3 eggs with your choice of sausage, ham or bacon, they also have some great pork chops and pancakes.They are not just great for breakfast but lunch and dinner.I have had one of their hamburgers and I really enjoyed them but I have not had the ribs, seafood or chicken. The salads are pre-made but I think the must do them daily because I haven't had a salad that didn't taste fresh!!!So, I say if you are ever in Roseland and you have a hankering for a steak and you are on a budget this is a great place to try!!!", "rating": "4", "date": [2012, 9, 26]}, "6": {"description": "I just had breakfast. It was my first time there. The food was really good.  But the place could be updated.", "rating": "4", "date": [2014, 11, 24]}, "7": {"description": "Hey I fell in love the first time I ate here. The atmosphere is very warm and welcoming.  The waitresses are nice and and the other patrons are loyal and gracefully family like.  I had the ribeye and was amazed at how juicy and tasty it was and it was not tough at all.  The pancakes was so delicious and I had some fresh strawberries on top.  My man took me there. He has been coming there all his life and that proves to me that it is a good restaurant to be there so long because he is 100 years old. Lol just kidding but I love to see long lasting traditional places like this and I really enjoyed it.  I made him promise to bring me every Monday and the hashbrowns were good and the tea and the eggs love this place and will continue to come here forever more.", "rating": "5", "date": [2013, 11, 28]}, "8": {"description": "Probally the only restraunt left in roseland!    With all the fast food places around it is nice to sit down and eat a meal that was not previously frozen. The steak sandwich is decent and so is breakfast. The only drawback is the limited parking.", "rating": "4", "date": [2010, 7, 16]}, "0": {"description": "Great breakfast. Next time ill come for the steak. Great atmosphere. Right in my own neighborhood this whole time.  Must get there early rush hour parking is crazy. But love the place", "rating": "4", "date": [2015, 12, 4]}, "4": {"description": "I've had breakfast here twice and after a recent article in DNAinfo featuring The Ranch, I decided to try it on a Friday night with a friend. Initially, we were a little turned off when we arrived a little after 6 pm and was told they were closing at 7 p.m. But, ignored the comment and sat down and ordered two ribeye steak dinners. We're still talking about how flavorful those steaks were! I didn't care for the potato or salad, but that steak was something else. We enjoyed ourselves and vow to come back. Just a tip for the staff: If your website says you close at 9 p.m., then change it! And don't knock people over the head with what time you close when we walk in the place. Just be happy that you have some customers! And please read the feature on the restaurant. That helps to break the ice especially when we tell you that's why we're there...All in all, I'm a fan.", "rating": "4", "date": [2015, 10, 27]}}, "neighborhoods": ["Roseland"], "latitude": 41.6912, "longitude": -87.6206799, "rating": "4.0", "times": {"Mon": ["7:00 am", "9:00 pm"], "Thu": ["7:00 am", "9:00 pm"], "Sat": ["7:00 am", "9:00 pm"], "Wed": ["7:00 am", "9:00 pm"], "Tue": ["7:00 am", "9:00 pm"], "Sun": ["7:00 am", "9:00 pm"], "Fri": ["7:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Steakhouses", "steak"], ["Soul Food", "soulfood"]], "address": ["11147 S Michigan Ave"], "attributes": {"Good for Kids": "Yes", "Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Good For": "Dinner", "Attire": "Casual", "Waiter Service": "Yes", "Wheelchair Accessible": "Yes", "Good for Groups": "Yes", "Takes Reservations": "No"}, "category": "Restaurants", "number_of_reviews": "9"}, "south-chicago-food-mart-chicago": {"comments": {"1": {"description": "If I could, they wouldn't be getting any stars. This is the most horrible place I have ever  ordered from! I tried to give them  multiple chances, but they constantly mess up orders, forget to put everything in, or take way too long to deliver. I wouldn't recommend anyone supporting this restaurant. I have had to contact support online, from eat24 for the last 4 times that I have ordered from them. If by chance you do call the restaurant themselves, you get rude customer service. So, they don't deserve to be open if they are rude and can't do anything right. They also apparently don't care what you want, instead give you what they want you to have.", "rating": "1", "date": [2015, 2, 8]}, "0": {"description": "in the food desert that is the far south side, finding a place that delivers is like finding $100 lying on the sidewalk. but this place not only deivers, it delivers good food in a hurry. granted, it's burgers and sandwiches, but it's good and you don't have to do anything but pick up the phone to get food in about 20-30 minutes.", "rating": "4", "date": [2015, 1, 17]}}, "neighborhoods": ["Roseland"], "latitude": 41.6877568513155, "longitude": -87.6210180670023, "rating": "2.5", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["11:00 am", "10:00 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["11:00 am", "8:30 pm"], "Fri": ["11:00 am", "10:00 pm"]}, "price": "$", "categories": [["Grocery", "grocery"]], "address": ["11346 S Michigan Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "2"}, "lauren-readus-chicago": {"comments": {"3": {"description": "She did a excellent job on my hair! I was very happy with the style and service. See u soon!!!!! Thank u LAUREN!!!!!!", "rating": "5", "date": [2014, 11, 5]}, "1": {"description": "I went to Lauren based on these very positive reviews. However, I didn't even get my hair done and unfortunately had to walk out.Lauren and I scheduled a date and time to install Marley Twists on my hair. I also showed her photos for inspiration- as I didn't want them to be too big. She said it would be twenty dollars more. She then cancelled on my less than two hours away from the appointment but said she'd give me 10 dollars off. Today I went to the 5pm appointment we agreed on however when I got there she was in a middle of installing a weave. By the looks of it I knew it would take at least another hour. Lauren did not apologize for being behind schedule. In addition the salon is a zoo and not relaxing at all - extremely loud music to the point that you can't even hear the other person next to you speak and kids running around.At around 5:45pm when she was done with her client I got up to walk to her chair - she stopped me and said someone else is next. Again she did not apologize or offer any explanation. When I first walked in Lauren didn't say there was another person ahead of me. Never mind the fact that I texted her at 3:30 pm to confirm my appointment. Around 6:30pm she came over with her assistant to get started on my hair - finally! Then she stopped after about 8 twists and went back to the other client. When I inspected the twists that were done so far I was horrified - different sizes and lengths,the twists were not evenly twisted and it was clear that two different people were working on my hair. After waiting yet another half hour - around 7:30pm I told Lauren I wasn't happy with the size or look and I've been waiting for too long. Again no apology about having me wait for HOURS and nothing but excuses regarding the poor execution of the twists. Then she left me hanging and went back to another client. Finally I told her I couldn't wait anymore and will have to leave to which she did not respond. I'm not sure if she was overbooked or just started late that day but I would've preferred that she was realistic about when she could get to my hair instead of having me wait for THREE HOURS before I finally just left. Some stylists just want your money and don't care about customer service or satisfaction which ultimately brings in and keeps the clients. In addition I'm not sure if she was having a bad day but I wasn't impressed with the work. I would never recommend Lauren and will not be rescheduling.", "rating": "1", "date": [2015, 8, 5]}, "2": {"description": "Lauren does a great job on sew ins, marley twists, and many more styles. She is very talented, sweet person, and makes sure her clients leave satisfied. I always look forward to coming to her for my next hair style!!", "rating": "5", "date": [2014, 11, 5]}, "0": {"description": "I love getting my Marley twist done by her!!! She's one of the best!!!! She really takes care of my natural hair!!! Great prices!!! She'll even work with your schedule. Give her a shot, you won't be disappointed!!!!", "rating": "5", "date": [2014, 11, 7]}, "4": {"description": "Lauren is a great stylist she has been doing my very hard to manage hair for over 7 years! She specialize in natural health and sew ins.. I have had almost every style she does and loved it every time, I have more than 2 people that I referred as a new client and they love lauren!", "rating": "5", "date": [2014, 11, 5]}}, "neighborhoods": ["Roseland"], "latitude": 41.707871927001, "longitude": -87.6150177577971, "rating": "4.0", "times": {"Mon": ["8:00 am", "7:00 pm"], "Thu": ["8:00 am", "7:00 pm"], "Sat": ["8:00 am", "7:00 pm"], "Wed": ["8:00 am", "7:00 pm"], "Tue": ["8:00 am", "7:00 pm"], "Sun": [], "Fri": ["8:00 am", "7:00 pm"]}, "price": "$$", "categories": [["Hair Extensions", "hair_extensions"], ["Hair Stylists", "hairstylists"]], "address": ["Before & After Barber Shop", "10251 S Calumet"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "category": "Beauty", "number_of_reviews": "5"}, "u-b-fashions-chicago": {"comments": {"1": {"description": "This place sucks! Seriously. The clothes are poorly made and cheap. Unless you are a certified hoodbooger there is no reason to shop here unless you like looking like a stereotype.", "rating": "1", "date": [2008, 11, 8]}, "2": {"description": "Ha!!!!! I went here in high school and got myself a lovely pair of lime green jeans. WTF?! I saw someone reviewing it and had to jump on the band wagon.Wow...it's still around...", "rating": "1", "date": [2008, 11, 8]}, "0": {"description": "It's an okay place. Good for belt shopping and finding little things for going out. They have good gym clothing..not brand name though.", "rating": "5", "date": [2005, 11, 2]}}, "attributes": null, "neighborhoods": ["Roseland"], "categories": [["Women's Clothing", "womenscloth"]], "address": ["11142 S Michigan Ave"], "latitude": 41.6912593, "longitude": -87.6211449, "category": "Fashion", "rating": "2.5", "price": "$", "number_of_reviews": "3"}, "popeyes-famous-fried-chicken-chicago-13": {"comments": {"3": {"description": "Saturday December 8th at 4:40 PM we waited 20 minutes well the female staff did nothing but talk and play with their nails and talked. We asked at the drive through after waiting five minutes for someone to say something if, \"its going to take a while\" the female said there is no wait at all. My wife just had to have her chicken and everyone in the drive thru seemed to be getting frustrated. Finally we get up front and of course they tell us to pull to the side and they ended up forgetting about us. The only male in the store helped us out and gave my wife some extra portions to help us out well the girls played with their nails. Stop hiring lazy women and think about hiring people who are willing to be as helpful as the guy in the store. I see people walking around all day hanging around I bet they could use a job if given the chance.It seems there was a shift change going on at the time so most of the girls stopped working and ran out right on the dot screaming and being loud of course. One jumped in a big rig well screaming to another female employee getting in her car to run home.This place is horrible go to KFC nearby", "rating": "1", "date": [2012, 12, 11]}, "1": {"description": "Let me start by saying I LOVE the Popeye's chain but some of their staff is very unprofessional & especially at this location, IGNORANT. There is NEVER A TIME YOU CAN JUST VISIT & RECEIVE a complete order of chicken. Mark my word there will be an issue with chicken supply & you will receive major attitude when you question it. On Tue, Oct. 27, 2015 at 8:15pm my children & I went to this Popeyes East on 103rd. There was along backed up line as usual, so once I did eventually get to the intercom. I placed my order & I had 2 coupons. 1 for a 8 piece mix/spicy & 3 piece tender mild. As I was speaking to the unprofessional young lady you can tell she had attitude and had a egde on her voice. She told me there was no WHITE MEAT. I said how long is the wait? She said 15-20 min. I said that is fine I will wait, I do not eat dark meat. So I paid for my orders & waited like 10 min. until I noticed my receipt said mild chicken. I drove back to the intercom to let her know make sure my chicken is spicy. She stated we don't have any spicy chicken, I said what have I been waiting for then? You told me you were cooking white chicken & it would be a 15min wait. She said MILD. I said I DO NOT WANT any MILD chicken, I want SPICY & I want to make sure my order will be correct. She said with a edge in her tone, \"YOU WANNA WAIT AGAIN\" I said i want my order CORRECT...She stated, well you gon have to wait another 20min. Mind you I had already waited 15 min. for a box of 8 piece. I said I been waiting this long I will wait, I want my order correct. With a attitude she sighed & said \"YOU CAN MOVE ON UP OUT THE DRIVE THRU\" , intsead of saying ma am will you pull to the side again????? I said EXCUSE me? What is your name? She said Madonna. IDK, something on that order.. And may I add this young lady was a MANAGER at this location. UNACCEPTABLE & POOR REPRESENTATION!!!!! So I calmly pulled to the side a second time & my kids & I, waited an additional 20 + minutes in my car out in the rain. My kids was in the car getting very restless, because it was late in the evening. So a fast visit to Popeye's turned into a 40 minute wait. I would of left but my family had their mouth set for popeyes. I sat watching at least 10 cars receive their orders, so now she is being vindictive. It is now 8:56 p.m. mind you I arrived at 8:15. She comes dragging out of the door with the bag & I asked her what is the district manager name she answered with a smart edge in her tone Symphony Redmond.  As her arrogant self walked away  she clapped her hands as if she was saying I don't give a care who you call. As I said she was being very vindictive, when I got home my chicken was warm/cool.NOT HOT..I live less than 3minutes away from this location.  Managers are suppose to lead by example. Not in this case, this girl was as cocky, arrogant & ignorant as they come. An  the behavior is UNACCEPTABLE especially for management. I called corporate so I am waiting on a reply from them.  If I have to I will start writing & complaining. And continue to make some phone calls until I reach the right person to handle this issue correctly. Because something surely needs to be done with the work performance at this location. CLEAN HOUSE if so be...", "rating": "1", "date": [2015, 10, 28]}, "2": {"description": "This is one fucked up Popeyes the wait was 10 mins for mild chicken besides thighs no lemon aid or pink lemon aid no honey just horrible", "rating": "1", "date": [2013, 9, 1]}, "0": {"description": "No spicy wings,  no onion rings, driveup wait is ridiculous. Do they hire right from kindergarten for this location. I could have deep fried 3 wings in my portable deep fryer in the parking lot faster than this turtle ass Popeyes.", "rating": "2", "date": [2015, 12, 30]}}, "latitude": 41.70766, "neighborhoods": ["Roseland"], "categories": [["Fast Food", "hotdogs"]], "address": ["616 E 103rd St"], "attributes": {"Take-out": "No", "Has TV": "No", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Loud", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "longitude": -87.60814, "category": "Restaurants", "rating": "1.5", "price": "$$", "number_of_reviews": "4"}, "big-sams-mini-mart-chicago": {"comments": {"0": {"description": "This guy uses his Link card to purchase the candy, snacks, and treats he sells at this store. Despicable. He is the reason Americans distrust middle eastern people and social systems.", "rating": "1", "date": [2013, 1, 10]}}, "latitude": 41.7000008, "neighborhoods": ["Roseland"], "categories": [["Convenience Stores", "convenience"]], "address": ["10658 S State St"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.623642, "category": "Food", "rating": "1.0", "price": "$$", "number_of_reviews": "1"}, "super-nails-chicago": {"comments": {"29": {"description": "I have been here twice and had two different techs.  The first time I just had a pedi and they did a great job.  The next time I got a Mani/Pedi and eye brow wax.  The toes and nails turned out great!  The tech did leave a little wax by my eye brow but over all did a great job.This place does get very busy on weekends, so plan on waiting a little while.  Only cons: you have to pay for parking and if you want to leave a tip you have to use cash.  You can use a card to pay for services though.", "rating": "4", "date": [2012, 4, 7]}, "42": {"description": "Not only did the polish chip after a mere 8 hours after the pedicure but 24 hours later....drumroll please....Infection!!  Whoo!  At least the swollen red toe draws your eyes away from the chipped polish.I live right by this place and the price is reasonable, but service was so so...and I had only been in there when it was slow.Never never never go for anything other than a polish change when that place is busy.  The girl working on me had too much goin on to pay any attention and cut off a major portion of my toe.   Just a nightmare.", "rating": "1", "date": [2008, 7, 6]}, "23": {"description": "My favorite nail place in Lincoln square . I've been coming here for a few years now. Ask for Tracy! She's a perfectionist . I won't get no chip anywhere else", "rating": "5", "date": [2013, 8, 31]}, "47": {"description": "This was the first time I'd been here.  I happened to be right down the street and wanted a french manicure, and this was the first nail place I came across.  \rThere was no wait when I came in, which was nice.  And the girl who did my nails was friendly enough.  My nails look better than if I had done them myself, but not as good as the last time (and first time!) I had had a professional manicure. \r$15 for the manicure was comparable to what I've seen elsewhere, but the actual store was kind of dumpy.  The magazines were all wrinkley (had been wet?) and stuck together, and they had cleaning supplies scattered all over the place - maybe they were in the process of moving or something, but it looked messy and dirty.  \rGiven that this was only my second time getting a manicure, I'm not sure if this happens often or what, but the girl made me bleed and I thought that was a little less than cool.  \rWith so many other nail places around, I'd check out several others before heading back to this one.\rEdit: I took away a star because in the 24 hours after I had my nails done, several of them have chipped off and now they look like crap.  Last time I had my nails done (elsewhere) they didn't chip at all for a week.  I'm glad I had them done two days before a wedding and now need to retouch them before I go.", "rating": "1", "date": [2006, 6, 22]}, "8": {"description": "Affordable and they always give me what I ask for. They listen well and do a great job. The place is clean and hygienic. They are very accommodating. No complaints and my nails always last. Best no chip I ever got.", "rating": "4", "date": [2015, 4, 21]}, "31": {"description": "the guy that did my sisters nails didnt even turn on the masage chair i had to tell him to do it they were annoying they didnt make conversation the lady that did my nails was talking to that guy the whole time in their language and they didnt have good colors it was pricey i rather do my nails at home. they didnt do a good job on either.", "rating": "2", "date": [2010, 9, 30]}, "34": {"description": "They have nice new massage chairs when you get your pedicure.  I got a no-chip gel manicure that lasts two weeks.  It takes a little longer than a regular manicure, but looks great and natural.  They have a parking lot, which is nice as it is right by Lincoln Square so street parking is a pain.  However, the lot is metered, which is a little annoying.  That's the city's doing though not the salon obviously.", "rating": "3", "date": [2010, 3, 23]}, "16": {"description": "My favorite nail place in Lincoln square . I've been coming here for a few years now. Ask for Tracy! She's a perfectionist . I won't get no chip anywhere else", "rating": "5", "date": [2013, 8, 31]}, "13": {"description": "I had a great experience. I was welcomed at the door for a 2 o'clock appointment. It was saturday, so it was really busy. I had to wait a 10-15 minutes for my manicure to start, but I was warned and was apologized to. I waited in their comfortable manicure chairs. The woman that did my no-chip was very sweet. She did a great job and it took a lot less time than I'm used to for no-chips.I paid with a credit card. You can't tip on the credit card, so I had to go next door to 7-11, but they were not rude at all about it. I went to give the tip and was thanked by a couple people for coming in. They used my name when saying good bye. I'm definitely going back!", "rating": "4", "date": [2014, 3, 22]}, "11": {"description": "This is a lovely salon.  Very pleasant workers and always professional on the phone and in the salon.  If you are looking to get gell nails or fill ins don't look any further than the nail tech Wee.  He is so friendly, smart and does an amazing job.  Your nails don't look fake but real.  I get compliments all the time.", "rating": "5", "date": [2015, 5, 30]}, "39": {"description": "well I used to go here regularly, not because theyre an excellent institution of nail care, but because they were close to my house. I had acrylics and the ladies would always shape them oddly and they all looked different. They charge a ridiculous amount for airbrushing and they also cut me...come to think of it every time I go in there I bleed. NOT GOOD. They ruined a presentation I had to do the next day by cutting one of my toes when doing a pedicure. My toe was so sore that not only could I NOT wear the cute pink peep toe heels I had bought a few days before, but I was limping around  and couldnt stand for any length of time. My pedicure and manicures constantly chipped, my acrylics always broke between visits and my eyebrows looked the same as when I came in. Find another nail salon if you can.", "rating": "1", "date": [2009, 2, 19]}, "37": {"description": "Not awesome, not terrible.Despite a host of bad reviews (that I discovered AFTER coming here), my experience wasn't half  bad. The commute was great (across the street), the price was right for a simple mani/pedi (less than $40) and the employees were friendly (ie they didn't obviously talk about me to my face). My pedi lasted about a week and I surely didn't walk out with an infection...The only downside was that there wasn't much of a hand or foot massage, and I had to explain that I wanted \"square nails\" at least 3 times. I won't rush back to Super Nails, but won't avoid it like the plague either.", "rating": "3", "date": [2009, 5, 6]}, "0": {"description": "They did an amazing job! Got a pedicure and a full gel set and couldn't be happier! This is my goto place even if it is a little far from my house.", "rating": "5", "date": [2016, 2, 14]}, "38": {"description": "Have been here a handful of times ... each time, this place seems to get worse.  Went yestereday evening for a mani and pedi and my toes and fingers are RAW!!!  They cut me down to the quick on my toes and I am currently in antibacterial ointment to circumvent infection.  There was nothing remotely close to a foot massage or hand massage, as they were over so quickly and the manicure is already peeling.  I find the staff rude, and they barely acknowledge that you are there.  I have half a mind to call the health inspector, as I don't believe their practices for cleaning and sanitizing the cuticle cutter, nail clippers, etc. are up to speed.  And I thought that using those razors was illegal these days????  They certainly didn't use them on me, but they did ask my friend if she wanted them to use it on her.  My advice - find somewhere else.", "rating": "1", "date": [2009, 3, 18]}, "27": {"description": "Everyone here is so nice and they have such a great selection of colors. What I really like is their selection of gels colors. They almost a full wall of colors. They do a great job as my nails usually last pretty long when I get them done here.", "rating": "4", "date": [2012, 6, 14]}, "32": {"description": "i came in for a full gel set and they look better then ive ever seen! i called around 9 on a friday morning and was able to get an appt for 11. staff was super friendly and they all spoke good english which is nice. the guy who did my nails was super patient when removing my poorly done set (i'll admit, it can hurt!)....the salon itself is clean and modern with lots of mags to look at. affordable as well. want to try a pedi next time, the chairs looked comfy. great place!", "rating": "5", "date": [2010, 9, 19]}, "44": {"description": "Super Nails...ah not so Super. They did a crappy a** job and they also cut me. Plus, the woman who did my nails started talking about me right to my face. Okay...so I have no idea what she was actually saying but I didn't need to speak her language to know...you just know. She'd look right at me and motion at my nails and say something disdainfully. Okay..thanks for making me feel completely humiliated and unwelcome while I'm paying you to do a service. No thanks...I'll never come back.", "rating": "1", "date": [2008, 4, 17]}, "24": {"description": "Why this place has 2 stars is beyond me! I just got a pedicure and it was awesome! She massaged me feet wonderfully and really cleaned them up. They also have great, current colors!!", "rating": "5", "date": [2013, 7, 26]}, "7": {"description": "I went in with a complicated picture from Pinterest and left with the absolute coolest nails. Ever.", "rating": "5", "date": [2015, 2, 7]}, "40": {"description": "Since I wrote a review for a nail place I liked in the hood, I thought I'd write one for one I wasn't crazy about. Not that this place is bad, it's like 100 other cheap nail places. But that's the point, there's not really anything special about it. I've gotten pedicures there a few times (and a manicure once which I won't even comment on, there's nothing to even say about it!). I think it's like $27 for a pedi and you are in and out in about 1/2 hour. And that's for the spa pedicure too. But they don't really do much in the way of massage and they are fairly quick with the cleaning and buffing of your feet. Also, I noticed that the nail color tends to look drab after just a couple of days. It doesn't necessarily chip, but it doesn't look shiny or new like I think it should for at least a week (and at a really good place, 2-3 weeks). So all-in-all if you are lookin for a quick, relatively cheap pedi (say for a night out) then this is a good place. If you want something that looks really good and will last a couple weeks, I would not recommend it.", "rating": "2", "date": [2008, 8, 20]}, "30": {"description": "I am extremely picky about my gels/acrylics, and have tried dozens of places in the area and in the northern suburbs where i sometimes work. I also like to get nail art done on my big toes when i get a pedicure, and have had a hard time finding good artists at other locations too. i have had very good experiences here. my gels last longer than from other places with very little, if any, lifting even after weeks. no yellowing either. i've switched since i started coming here to pink and white acrylics with gel overlay and just love them. i have not had to have a new set for months. the fills are very nice and efficient. my pedicures are great - comfy chairs and i agree with other reviewers on the polish selection. i don't do no-chip manicures, but they seem to have a huge selection of colors there too. my nail art is also fantastic!for the price and location close to home, this can't be beat for me.", "rating": "5", "date": [2012, 1, 30]}, "46": {"description": "I've been to Super Nails a few times and 50% of the time it was ok. I went there often because it was close to the house and there were a few friendly girls there. I have to say that I am never going there again.I got a fungus and after thinking about it, some of the ladies made me bleed. Not cool.Not recommended at all. If you are looking for a cheap, quick mani or pedi, head a few miles up north on Western and check out Golden Nail.", "rating": "1", "date": [2007, 2, 18]}, "1": {"description": "Still here, after all these years. Hands down, the BEST full sets I've ever had (I always ask for the owners - they do incredible work). And Wei (sp?) is THE MAN for pedicures. A HUGE selection of polish colors including no chip. The entire staff is wonderful; the owners are hands on and do great work. Waxing services here are great. In the years I've been coming here, there has been little to no staff turnover - that IMHO says volumes. If I go somewhere else (which rarely happens), I almost feel as if I'm cheating lol!", "rating": "5", "date": [2015, 10, 7]}, "9": {"description": "They might do a good job but don't expect them to honor your appointment. I made an appointment for 10am Saturday morning 5 days prior for my 2 daughters and myself. They put my young daughters (it's a real treat for them- a kids mani/pedi) into pedicure seats and then I realize- every technician is already on a manicure/pedicure. All but one. When I make an appointment? I am starting to think they don't have an an appointment book- no one checked, they just kept talking to each other. REALLY disappointed! They have now left my daughter sitting in the pedicure water with no technician for 20 minutes. If my kids wouldn't cry I would walk out. Really unprofessional. Why don't they just say they are walk-in only if they don't honor appointments?", "rating": "1", "date": [2015, 7, 4]}, "26": {"description": "Love this place. Best selection of Essie and and OPI colors in this area.  Pedis are thorough and manis seem to last a couple days longer than other places.", "rating": "5", "date": [2012, 11, 17]}, "25": {"description": "Why has anybody post a recent comment? Any who, better for me lol this place is PHENOMENAL, I went there & was received by a great friendly staff.  They offered a seat, magazines & to pick out any color I wanted. I specifically asked for a picky demand lol POINTY NAILS! & right away they work on them!I left happy, happy HAPPY! definitely will be back, I promise Super Nails..", "rating": "5", "date": [2013, 3, 12]}, "12": {"description": "Not luxurious, but great spot, very clean, and friendly, trained staff. My mani/pedi lasted a long time. Will definitely go back.", "rating": "4", "date": [2015, 8, 4]}, "21": {"description": "What's better on a snowy winter day than getting a mani/pedi? After seeing some pics of the great nail art done at Super Nails, I decided to try it out. I only live a few blocks away, so the snowy hike was worth it. I had Sue do my nails and she was wonderful. She did exactly what I wanted and then some! It was a great experience. I will definitely be going back.", "rating": "5", "date": [2013, 12, 8]}, "17": {"description": "Wonderful!   Pink and white experts. So nice too. I have been looking for someone since I moved to Chicago. I think I have my place now. Reasonable prices very clean", "rating": "5", "date": [2014, 12, 27]}, "10": {"description": "Used to be good with previous owners. The new owners have made enough mistakes to make me look for a different nail salon. This place is right by my house, but I'll take a longer drive for quality work than convenience.", "rating": "1", "date": [2015, 4, 28]}, "5": {"description": "This was the best nail experience I've ever had and I've been getting my nails done for a really long time!!Victor did an amazing job doing my nails (I asked for an acrylic fill). He was gentle and very precise during the entire process. I loved his attention to detail and how careful he was to make sure that everything was perfect.This place is also priced on the cheaper side, in comparison to other places I've been to.  I did go on a Sunday and it was VERY busy so my suggestion would be to call ahead and make an appointment but they are very accommodating of walk-ins. Also, they only accept cash gratuities so make sure to have some cash on hand (for the tip at least) and they only accept Visa and Mastercard (I think the sign said) with a minimum of $12.Thank you Super Nails--I will be back in a few weeks!", "rating": "5", "date": [2015, 6, 7]}, "3": {"description": "I use to go to a nail salon in Wicker Park but after the damage it did to my nails, I had to stop going there. I then jumped from nail salon to nail salon to find a great fit for me. I found this place very randomly. So on a Saturday morning after sleeping in with my boyfriend, I've decided that we are going to get our nails done. Well he loves pedicures! So I started to look for nail salons in our area but IDK couldn't find one that I liked. He also wanted to get his hair cut so I had ample time to find a good nail salon. So we drive to his hair appointment and BOOM nail salon next door. We go in and they take us right away! My gel manicure turned out perfect! Everybody in that salon is really friendly. The nail tech that does my nails (forgot his name) is great. First impressions are everything and because of the phenomenal job they did the first time, I've been coming back religiously every two weeks.Great salon, check it out", "rating": "5", "date": [2014, 11, 15]}, "35": {"description": "I live across the street. The chairs are nice, the polishes aren't crusty, and the staff speaks English pretty well. I had my eyebrows waxed here just because they needed some cleaning up, but they didn't do a great job. I left looking better than when I came in, but nothing awesome.My nail tech did stop to talk on her cellphone a few times while doing my nails - which, come on guys, that's NO way to run a business.", "rating": "3", "date": [2010, 2, 22]}, "19": {"description": "Ummm I dont think this place is completely legit on there prices. My sister went here and they charged her $45 for mani/pedi AND eyebrows. I thought that was a great price and saw how much she loved it but I just called to set an appointment and the guy tried charging me $28 JUST for a pedicure!!!!", "rating": "1", "date": [2014, 7, 20]}, "28": {"description": "I've been going to Super Nails for a while now, but I really had to sit down and write a review.My mom has horrible feet. It's bad, I feel bad for her - she has had such horrible ingrown toenails, she had to have them removed on her big toes. She's embarrassed by them, but has been told in the past she can't get pedicures, there's nothing they can do.Super Nails just gave her her first pedicure ever. And she loved it.  They were able to fit us in as walk ins (my sister, my mom and myself)- they were thorough, polite, and did a kick ass job. My gels look great, and more important than anything- my mom is SO happy.  And that alone is 5star worthy. The staff at Super Nails made my mom feel special and pampered.Isn't that what we all want?", "rating": "5", "date": [2012, 5, 31]}, "45": {"description": "I've been to Super Nails at least a half-dozen times.  The manicures I've had have been hit or miss; often the edges were ragged and the polish chipped within a day.  The pedicures seem to last quite a bit longer than the manicures, but sometimes they get a little too aggressive with the scary foot razor.The eyebrow waxes, though, they have been good.  I'm rather picky about my eyebrows, and I've never been disappointed.   Once, after a month of neglect, I went in and the associate didn't believe me when I told her how much I wanted them cleaned up.  A safe move on her part, but not what I wanted.   Thankfully, she was more than happy to clean them up to perfection.", "rating": "3", "date": [2007, 8, 26]}, "33": {"description": "I simply don't believe in \"spa pedicures\" and spending an arm and a leg to get my nails done.  My aunt used to do nails and she told me you run the same risk for an infection on a $30 pedicure as you do a $50 pedicure.  I was at home and since my usual go-to pedicure place is kinda far, I google mapped nail salons in the area.  This one was just up the street from me so I decided to give it a whirl.  Even if you have to pay the meter, a parking lot is nice.  Another star was for the fact that I walked in and didn't have to wait.  I was in a foot bath within 30 seconds of selecting my polish.  The woman who did my pedicure did a perfectly nice job.  No cuts, no bleeding, no scary skin slicing blade.  She did a decent length lotion massage and the polish looks great.  Can't complain!  I'll definitely be back!", "rating": "3", "date": [2010, 4, 16]}, "43": {"description": "A guy getting a pedicure?  Well, if you are on your feet allot.....and are very active in sports.....then hell yeah!  Lots of Professional Athletes get them!  This place is close for me........so every now and then I'll take a walk over.  Especially with the amount of running and playing softball I do.   Heck, it's better than me trying to cut my own toe nails and having them \"ZING\" all over the room, then ya gotta pick them up!  ha!    So into the chair I went and stuck my feet in some warm pink dye water.  Turned on my massaging chair and sat back.  Watched some soccer on the flat screen TV.  Not sure who did my feet this time, but she was pretty good.  She clipped and filed and whatever else they do.  Then the part where they scrub the bottom of your feet, holy cripe.  Yeah, I am ticklish so its hard not to laugh at this part.  She then massaged my feet and calves.....put my feet in the funny little flip flops, painted some clear polish on and off I went to the \"drying section\".  $27 for a pedicure, not sure what the going rate is, sounds about right to me.  The only negative is the lady doing my nails had to \"call me out\".  As she was doing my feet she loudly said \"Ah......ingrown toe nail!!\".  The whole row of girls looked down at me.........oh boy!  Oh well, that's why I was there!   Anyway, I'll be back......this place works for me!", "rating": "3", "date": [2008, 6, 14]}, "2": {"description": "One of the better nail shops I've been to in Chicago. The nail tech Bryan was very patient, took his time  which I LOVE because I know he values his work and clients, he filed my nails and shaped them just the way I liked! He also coated my nails 3X without me asking which is a PLUS! No complaints and they took me right away even though they were packed. I also took a chance and got my eyebrows waxed, at first I was a little skeptical but when I got home I realized the lighting was a little dark at the nail shop and the lady actually did a good job by just cleaning them up!I will definitely be back in about 2 weeks! Please make sure to bring cash if you tip! They don't accept debit/credit tips.They close at 6pm Saturdays so arrive early before  they get packed.There is a minimum of $12 on cards so if you're just going for a eyebrow wax I recommend you bring cash! Did I mention lol it's next to a bunch of food places LOL!! Who doesn't want a meal after being pampered, so you can dig your freshly manicured nails into some grub :) LOL!!", "rating": "5", "date": [2015, 4, 25]}, "18": {"description": "My friend and I had an 11 o'clock appointment here and when we arrived the salon was full of people. they pretended there were no appointments. The manager pointed at the wrong day and said, \"see, no appointments.\" I could clearly see the appointment book with our names written for 11am on the correct date... And other appointments throughout the day. Liars run this shop.", "rating": "1", "date": [2014, 7, 4]}, "41": {"description": "Super-cheap and fast, but you get what you pay for.  The manis barely last a week, and some of the gals rush the process so much that you get nicked or bleeding cuticles.  My first mani here was so bad that my nailbeds and fingers hurt the next day, but I kept going back because there were no comparable (and affordable) places in the 'hood.  The women who work here try their best to make conversation but sometimes it's just awkward, especially when the male manager is there.Since then, I have found much better salons that are only marginally more expensive.", "rating": "2", "date": [2008, 7, 21]}, "4": {"description": "This place is really good, I don't mind making the trip from my Uptown neighborhood because my nails have held up so good here", "rating": "5", "date": [2015, 4, 4]}, "6": {"description": "This is your typical looking nail salon but with high quality services. This is the only place that I have settled on for excellent no chip manicures, as the color doesn't fade and the manicure lasts, like reallly lasts. I've been here maybe a dozen times so far and never has my manicure chipped or peeled off. It is usually done so well that they have to spend some good time taking it off when I come in for a new one. The pedicures are thorough and there are a lot of color options to choose from! The staff is really nice. They are very accommodating and do their best to make you feel comfortable. Major credit cards are accepted, leave tip in cash. If you want to avoid a rush, then come in during the early part of the week and you will have no wait!", "rating": "5", "date": [2015, 2, 1]}, "22": {"description": "I just recently moved to the neighborhood and this is the closest nail salon to my apartment. I have been more than pleased with the service! The first time I visited I didn't realize you had to pay to park in the parking lot (it's a strip mall and you have to pay to park?? Welcome to city life I guess). I didn't realize this until I had already sat down for my pedicure so the technician I was working with was gracious enough to make sure a parking sticker got placed on my car windshield so I wouldn't get a ticket. They are also always willing to take my business even if my mani/pedi runs the risk of forcing them to stay a little past closing time without making me feel bad (I try not to do this very often!). Will definitely continue to keep coming here!", "rating": "4", "date": [2013, 9, 23]}, "15": {"description": "What's better on a snowy winter day than getting a mani/pedi? After seeing some pics of the great nail art done at Super Nails, I decided to try it out. I only live a few blocks away, so the snowy hike was worth it. I had Sue do my nails and she was wonderful. She did exactly what I wanted and then some! It was a great experience. I will definitely be going back.", "rating": "5", "date": [2013, 12, 8]}, "20": {"description": "A friend and I came in here a couple weeks ago for an impromptu pedicure. The staff was great and took us as walk-ins with no complaints, no dirty looks -- even though they were pretty busy. I also appreciate them sitting us together and working on us at roughly the same time. The massage chairs were awesome and the technicians were great!! They were conversational and had a sense of humor. My toes still look fantastic, and the prices are totally reasonable. I'll have to go back to get one of those fancy manicures that I've been seeing on Pinterest.", "rating": "5", "date": [2014, 3, 4]}, "36": {"description": "So we'll start with the good...A good selection of polishesNice massaging chairsThat's about it, don't get me wrong they do a decent job, but it's nothing special. I feel much more rushed here than at other places and they don't take the time I would like for the pedicure. I have had much better, at the mall no less. If you're in a bind it's alright.Also, tips are cash only so make sure you have some and quarters for the meters if you're willing (need) to give this place a try.", "rating": "2", "date": [2009, 6, 7]}, "14": {"description": "A friend and I came in here a couple weeks ago for an impromptu pedicure. The staff was great and took us as walk-ins with no complaints, no dirty looks -- even though they were pretty busy. I also appreciate them sitting us together and working on us at roughly the same time. The massage chairs were awesome and the technicians were great!! They were conversational and had a sense of humor. My toes still look fantastic, and the prices are totally reasonable. I'll have to go back to get one of those fancy manicures that I've been seeing on Pinterest.", "rating": "5", "date": [2014, 3, 4]}}, "neighborhoods": ["Ravenswood", "Lincoln Square"], "latitude": 41.968587487936, "longitude": -87.6871586591005, "rating": "3.5", "times": {"Mon": ["10:00 am", "8:00 pm"], "Thu": ["10:00 am", "8:00 pm"], "Sat": ["10:00 am", "8:00 pm"], "Wed": ["10:00 am", "8:00 pm"], "Tue": ["10:00 am", "8:00 pm"], "Sun": ["10:00 am", "5:00 pm"], "Fri": ["10:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Nail Salons", "othersalons"]], "address": ["2319 W Lawrence Ave"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "48"}, "white-castle-chicago-28": {"comments": {"0": {"description": "This has to be the slowest white castle in Chicago in the morning.  we have to get to work and they have their hand up their asses.  just to get white castle.  gosh. The smallest burgers and they shouldn't take 26 minutes to cook. two cars in front of me and they are getting impatient.  ill drive to the one on 111th and halsted to see if they are any faster than this turtle snail castle.", "rating": "1", "date": [2014, 8, 29]}}, "latitude": 41.7070933, "neighborhoods": ["Roseland"], "categories": [["Burgers", "burgers"], ["Fast Food", "hotdogs"]], "address": ["10301 S Michigan Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.6200851, "category": "Restaurants", "rating": "1.0", "price": "$", "number_of_reviews": "1"}, "market-fish-2-chicago": {"comments": {"1": {"description": "I saw roaches crawling on their raw meat counter. I told the lady behind the glass and she just giggled and shrugged it off. Nastiest place ever. I walked out on my Oder and never been back since.", "rating": "1", "date": [2015, 7, 5]}, "2": {"description": "MF2 has the best chicken I've ever tasted. They stay open late & are very polite. The food is always fresh. I definitely recommend them.", "rating": "5", "date": [2012, 10, 30]}, "0": {"description": "All the food I've gotten from here has been good. The chicken tenders were exceptional on my last visit. But the balding guy who works @ the cash register the times I've been there is an ASSHOLE plain & simple. No customer service skills, comes off as a pretty shitty person. His pissy attitude grinds my gears & prevents me from going there more often. They are much politer @ Gerry's fish & chicken on 103rd & State", "rating": "3", "date": [2016, 2, 26]}}, "latitude": 41.7073208838701, "neighborhoods": ["Roseland"], "categories": [["Seafood Markets", "seafoodmarkets"]], "address": ["242 E 103rd Street"], "attributes": {}, "longitude": -87.617142945528, "rating": "3.0", "price": "$", "number_of_reviews": "3"}, "china-garden-chicago-3": {"comments": {"1": {"description": "I always feel welcomed here and always leave with a compliment lol. Besides thats, it's a nice clean place. I never sat and dined here but I did get a few meals. The food is good. Sometimes the egg rolls are a bit dry but for the most part it has always been good to me.", "rating": "4", "date": [2015, 4, 1]}, "2": {"description": "I visited this place twice within a wk and the first time the food very flavorful but, on my second visit the orange chicken just wasn't as orangy as my first. My order still hot and steamy when i received it but, just not as flavorful. I'm hoping the last visit was a fluke and when i visit again the flavor is back. I think I'll ask for extra orange zest in my order. The inside is clean and the staff seem friendly.", "rating": "3", "date": [2011, 1, 15]}, "0": {"description": "I like this place.  I think too much. I order from 2 or 3 times a month. Great staff, quick service , food served fresh. Remember to order a $10 min to get free egg roll.", "rating": "4", "date": [2016, 3, 4]}}, "neighborhoods": ["Roseland", "Morgan Park"], "latitude": 41.6954727, "longitude": -87.6427078, "rating": "3.5", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["11:00 am", "11:00 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["12:00 pm", "10:00 pm"], "Fri": ["11:00 am", "11:00 pm"]}, "price": "$$", "categories": [["Chinese", "chinese"]], "address": ["10912 S Halsted St"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Wheelchair Accessible": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "3"}, "barneys-pizzeria-chicago": {"comments": {"3": {"description": "Took a group of kids for some pizza to Barneys and was pleased with the service. Fresh ingredients, cool owner, and very clean. Don't eat pork and they had a lot of options.", "rating": "4", "date": [2014, 7, 1]}, "1": {"description": "I came to this location on a Thursday night. I ordered two slices of sausage pizza from the lady at the counter. I waited about 15 minutes before I approached the counter looking for for food. I saw a guy in the back and asked for him to come to the front. I asked him where was my pizza and he said the order hadn't been placed. I explained to him I'd placed my order with the girl that was just up here. He said she didn't put it in... I looked down and told him I wanted a brownie for my trouble because now I have to wait for it all over again. He smiled and told me he couldn't do that. I said that's a shame and decided to use the freedom of speech to let u guys know not to wait patiently for ur order just in case it wasn't put in... They do not care about ur time. At least the pizza was good so I gave them 1 star due to bad service and worse customer service. The guy smiled in my face for crying out loud. Those are the two people in the picture in uniform...", "rating": "1", "date": [2014, 12, 21]}, "2": {"description": "I ordered over the phone. The girl taking my sounded like she had an attitude. The delivery guy delivers my food & once I signed the receipt he says to me \"what? No tip?\" Unprofessional! I check my good & it wasn't made how I ordered it. I call back to speak with the manager & he was just as rude. Makes perfect sense now. Their food isn't all that good. Won't order from here again.", "rating": "2", "date": [2014, 6, 17]}, "5": {"description": "I was visiting Chicago and wanted a quick bite to eat close to my destination and found this spot. Definitely not Chicago's finest. The workers were friendly, and the establishment was clean but the pizza is terrible unfortunately. If you've tasted good quality pizza, you'll definitely be able to taste the difference. However, their brownies were delicious.", "rating": "1", "date": [2014, 3, 22]}, "6": {"description": "Reminds me of my college days...$6.00 pizzas.  Cheap prices great food..Good food on a small budget...Game day specials are good when you having a party..", "rating": "4", "date": [2013, 4, 27]}, "7": {"description": "Excellent vegetarian pizza! Very nice and professional people. Only have used the delivery service and they have done a great job. Fast delivery!", "rating": "5", "date": [2013, 11, 2]}, "8": {"description": "Two stars only because the customers service was better than the product. Tried the sausage and cheese and let me tell you;It was the best cafeteria pizza I tried.Lacks flavor,crust was chewy,cheese tasted fake.Want pizza in this area try Beggars...Im a Lou man myslef!", "rating": "2", "date": [2011, 7, 10]}, "0": {"description": "\"I've only eaten from here a few times and have been inside of the location and ordered for delivery. The location has decent veggie and cheese pizza, a professional staff and the place is clean. The prices are reasonable, their delivery is fast and the drivers are pleasant.\"", "rating": "3", "date": [2015, 1, 21]}, "4": {"description": "Pizza is ALWAYS good. Recently ordered full slab of ribs, tips & hot links. It was PERFECTION !", "rating": "4", "date": [2014, 7, 4]}}, "latitude": 41.692169, "neighborhoods": ["Roseland", "Morgan Park"], "categories": [["Restaurants", "restaurants"]], "address": ["11101 S Halsted St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Takes Reservations": "No", "Attire": "Casual", "Ambience": "Casual", "Has TV": "No", "Good for Groups": "Yes", "Good for Kids": "No"}, "longitude": -87.64196, "times": {"Mon": ["10:30 am", "12:00 pm"], "Thu": ["10:30 am", "12:00 pm"], "Sat": ["10:30 am", "1:00 pm"], "Wed": ["10:30 am", "12:00 pm"], "Tue": ["10:30 am", "12:00 pm"], "Sun": ["10:30 am", "12:00 pm"], "Fri": ["10:30 am", "1:00 pm"]}, "rating": "3.0", "price": "$", "number_of_reviews": "9"}, "gbn-nail-salon-chicago": {"comments": {"12": {"description": "I was recommended by one of my co workers to go to GBN. Her nails were always on point! And she always has designs I've never seen! So I had to try them! So I went for my birthday. The owner VU did my nails. He took his time and did an awesome job. While talking to him he let me know that they're crowded most of the time because they pride themselves on QUALITY work and that he prefers a customer comes back for the quality and not how many people they can get in and out. I appreciated this detail. The owner Mimi is the truth! I BARELY have eyebrows and took her time arched and filled them in! I must say it makes me look like a whole new woman? Now, I ONLY go to this nail shop. EVERYONE does a good job there!", "rating": "5", "date": [2014, 9, 17]}, "7": {"description": "Sooo I have had issues in the past with this shop both good and bad but today took the cake. Mind you I have definitely put up with nasty attitude of the brother of MiMi and personal opinions from MiMi's dear Hubby about Blacks in a Korean establishments. Water under the bridge though right???  As I try to come get my nails done, I ask if there's a wait. I'm told \"why so you can write a bad review??\" Me: what review? Him: \"on Yelp.\" Me: isn't that what Yelp is for? To discuss your experience in an establishment? If I gave a bad review lets turn it around!  Him: \"that was bogus and if you can say that about us maybe you shouldn't get your nails done here\" Me: So A) I can't be honest about my experience and B) I can't get my nails done??? Him: *snidely* No! Me: *Drops sign in pen and walks out* Ha! How dare you??? I have been here Atleast twice since my horror experience that caused me to write a bad Yelp over 4 months ago and nothing was ever said and furthermore this ain't Korea bitch! I can say what the F*CK I want based on my experience!!!!! I will never set foot in this shop again! Quite frankly I never really felt welcome Minus MiMi, Hanna and 2 others. Wow! I'm so blown! Clearly, He has me mistaken for someone who cares", "rating": "1", "date": [2016, 1, 6]}, "20": {"description": "I love getting my nails done and when I was going out on in Beverly after work one night, I asked my coworker who lived in the area where to go to get a quick mani.  She recommended GBN right away... I believed her... oops!The salon itself was dirty.  The floor had to be clean and there were two workers not doing anything.  One was talking (very loudly) on speaker phone so the whole salon heard his conversation.  Another was watching a movie on his computer.  Why couldn't they clean the place?The women who did my nails was very nice but the manicure itself was crap.  After filing my nails, they still felt rough and unshaped.  She used cuticle oil instead of lotion to massage my hands and fingers but did use enough so the massage was uncomfortable.  The paint job also looks like it did it myself.  I will give this salon 1 star just for cheap prices... Mon-Wed you can get a pedi for $17.  But I don't think I could force myself to go back.", "rating": "1", "date": [2009, 3, 13]}, "19": {"description": "I love getting my nails done and when I was going out on in Beverly after work one night, I asked my coworker who lived in the area where to go to get a quick mani.  She recommended GBN right away... I believed her... oops!The salon itself was dirty.  The floor had to be clean and there were two workers not doing anything.  One was talking (very loudly) on speaker phone so the whole salon heard his conversation.  Another was watching a movie on his computer.  Why couldn't they clean the place?The women who did my nails was very nice but the manicure itself was crap.  After filing my nails, they still felt rough and unshaped.  She used cuticle oil instead of lotion to massage my hands and fingers but did use enough so the massage was uncomfortable.  The paint job also looks like it did it myself.  I will give this salon 1 star just for cheap prices... Mon-Wed you can get a pedi for $17.  But I don't think I could force myself to go back.", "rating": "1", "date": [2009, 3, 13]}, "1": {"description": "Terrible, TERRible, TERRIBLE customer service!First, let me start by saying that I went to this nail salon regardless of the previous reviews.  So I am absolutely not on the bandwagon of the previous reviews, this is my very own experience. I came into the salon around 1:50 p.m. and signed for an overlay service. I was told the wait is ABOUT an hour. After coming up to my hour of wait time, a young lady came in, the gentleman at the door asked her what did she want done and she said a soak off and an overlay. She signed in and say next to me which was right next to the receptionist/ his station. He looked at her again and looked at the clipboard then days \"Oh Ashley, you don't want a pedicure, too?\"(so it was obvious that she was a regular for them). She said \"No, I'm just going to have these soaked off\". How about within 10 minutes of her waiting, he leans over and tell her to go sit a station and a man begun her service?!!?? WAIT A MINUTE, I'm not just seeing what I think I'm seeing just happen!!?? So I leaned and asked a young lady did she understand what happened. She said it looks like she's getting her nails done, I explained I've been waiting in the same service! She says \"oh girl, I thought you were waiting for eyebrows!?\". So I politely stand up to look at the clipboard and sure enough, a soak off and overlay for Ashley with Vu!!! NOT ONLY THAT, it's people marked off all around my name!!! I asked the man about it and he said \"oh, your still down, I'm right here then this person then you\". I ask why couldn't I go to who's available, I didn't write your name down?\". I reminded him \"you told me an hour, he says no I said over an hour! No you didn't sir BECAUSE I wouldn't have gave you a $1 for a parking pass to be a FREE security guard for an unsure amount of hours!!!", "rating": "1", "date": [2016, 3, 4]}, "2": {"description": "Seriously, you don't like black people or black money? Wow   I thought money was currency and it didn't have a color only the paper but I'm  guessing your stupid ass  don't know  any better!  I'll make sure none of my friends come to such a racist establishment ! you like white money?  that's a joke", "rating": "1", "date": [2016, 1, 6]}, "9": {"description": "Love love love my nails. The owner and Ryan were so nice. Ryan took his time and made sure my nails were polished and designed to perfection. So happy I tried them out. I'm positive I will be back.", "rating": "5", "date": [2015, 11, 5]}, "6": {"description": "They don't EVER schedule appts!! The excuse was people stopped coming in. Oh well. That's ridiculous! What business operates like that? There are some of us who have lives & don't want to wait 3 hrs in a dirty, loud ratchet nail salon. What the hell? You can't get satisfied & repeat customers that way. If it doesn't bother you, maybe your standards need to be raised. Also, I watched the lady double & triple dip the stick into the wax when she was doing eyebrows, which is a health code violation. She wasn't disinfecting her tools between people either. They can keep it! On to the next.", "rating": "1", "date": [2015, 11, 19]}, "18": {"description": "I go to this salon every 2 wks the salon has history in the Beverly area...I followed the nail tech that use to work for Tip Top Nail Shop over in east Chicago and I'm proud to say this shop is very relaxing from all the commotion from the previous shop....They have renovated the Salon so it is more up to date than before from the previous review...Ive tried allot of salons high end or cheap but the way they do nails to me is something special usually my nails break or polish chips when i go to other shop but GBN has never done my nails wrong lol my nails seemed strong enough to grow out naturally faster....I recommend this shop to anyone that wants ur nails done the way u want them done....Although sometimes the techs can be loud with their conversations.....", "rating": "4", "date": [2010, 11, 24]}, "10": {"description": "I've been going to GBN since December, & I am sold. My nails ALWAYS look great, my pedicure water is always the perfect temperature & their paint jobs have been consistently neat. I am officially a regular. I would give 5 stars if they expanded (to cut wait time). That's my ONLY gripe. :)", "rating": "4", "date": [2015, 5, 9]}, "13": {"description": "Vu and Mimi, the owners, are the BEST. The others that work there, not so much.  it's best to try and get them on slow days such as Tuesday and Wednesday . They're neat, clean, and very professional. They also build report with frequent customers which I really love.  One of the best and largest polish selections I've seen,  good polish brands like OPI, Essie, China Glaze. And all products are available for retail also. Great pedicure chairs. I would suggest getting here at the open of the shop during the week if you can. Otherwise they're always crowded, which a sign of good work in my opinion.", "rating": "5", "date": [2013, 4, 1]}, "16": {"description": "This shop is amazing, I was recommended by a good friend to go here and I've been very pleased. I love the exotic designs they do and how they stay on top of the popular trends. 5 stars/2 thumbs up!", "rating": "5", "date": [2013, 1, 10]}, "17": {"description": "I am here every two weeks like clock work I love Vu and Mimi they do incredible work on my nails! I drive all the way from Lake Shore to get my nails done by them. Its a bit pricy but you pay for quality!", "rating": "5", "date": [2013, 3, 29]}, "15": {"description": "this a truely honest review! i only go here to get my eyebrow done including a tint with mimi she does a great job but the wait is terrible!i literally just left there, its 1:20pm. i tried to get there when they open which is 10:30am and got there at 11:00. so yes i was sitting for 2 hours just to get eyebrows done and was never services....so frustrating...to top it off this is the 3rd time this has happen... i always wait for atleast 2 hours. great work just to long of a wait just for eyebrows", "rating": "2", "date": [2014, 8, 12]}, "0": {"description": "I searched for a nail salon (I'm very picky) for a very long time before I found GBN ..I LOVE this place !!! Everyone's super nice and patient(specially when I don't know what color I want) !!!! They always take their time & make sure I'm satisfied !  Thanks Vu.", "rating": "5", "date": [2016, 1, 12]}, "5": {"description": "When I tell you this is THEE BEST salon I've ever been to,  THEE BEST. I've been a client of Vu's for over 10 years now,  I moved to Virginia and can't find quality and service like they provide here. Every time I go to GBN I feel beautiful and well taken care of.  MiMi does the best eyebrows and lashes I've ever seen. Everytime I come in town I have to get pampered by the best.  VERY well mannered, easy to talk to and they put pride in their work.  I must address a post I saw while reading these reviews,  racist - NOT AT ALL most of the clients they serve are African American, and they return religiously; rude- ARE YOU KIDDING ME some of the nicest people I've met in my life; slow- not one bit was there at 4:45 Ish was gone before 5:30 ; busy- why wouldn't they be EVERYONE LOVES THEIR WORK. If they are busy they are definitely worth the wait, and or the return later. I tell EVERYONE  about this place because that's how great they make me feel.  What salon do you know that everyone in there does a great job at what they do?  This is the only one,  TRUST ME.  When you go tell them Aris sent you,  you won't regret it.", "rating": "5", "date": [2016, 1, 6]}, "11": {"description": "GBN Nails is the best nail salon that I have ever been to. Vu and his crew always give the best quality service from nails to eyebrows. They have an array of services for every customer. The time spent there is worth every second and I'm proud to be consistent customer. So happy my bestie told me about this place and showed me the light!!!", "rating": "5", "date": [2015, 12, 7]}, "8": {"description": "OK, I use yelp A LOT and although I'm an avid user I have never reviewed a business before. It's only right for this to be my first one.  I am 100% satisfied with this place for a couple reasons: 1) The level of skill and care that goes into making sure your nails are nothing short of on point 2) The level of professionalism and kindness. I don't care how good you are at what you do in ANY business, customer service is still what will make you stand out from the rest. I followed this place a long time on IG before trying them out and I'm so happy I did. Vu is simply the best. I've seen the work of some of the others and they are good as well, but, he specifically did mine and I've been hooked ever since. I have gone to him twice so far and have been completely satisfied both times. He forever has a loyal new client. Go check out GBN nails you won't be disappointed!!", "rating": "5", "date": [2016, 2, 1]}, "3": {"description": "There is nothing special about this shop.  They do the same nails as everyone else.  The wait is 4 hours or more, even on weekdays, mostly due to them only having a couple people doing nails.  There is nothing o.k. about waiting for hours for nails!  Yes, the people were nice, but, again, there is nothing special about this place, and nothing about their work thats worth waiting for.  Find a shop that respects your time by having enough good people to serve you.  What other ethnic group would sit for hours, week after week, for acrylic nails?  They would not get away with this with a different clientele because they would stop coming!", "rating": "1", "date": [2016, 2, 17]}, "14": {"description": "I love GBN. I been with mini since 79th. Mimi and Vu aim to please and every tech is capable. Great service. Fun people. Early arrival is highly suggested but great work takes time.", "rating": "5", "date": [2014, 2, 11]}, "4": {"description": "I went in today to have a eyebrow tint. The place was crowded standing room only. I put my name on the list due to them not taking appointments. I ask the young lady that would provide my services if it was ok for me to go grab a bit to eat she said yes \"I won't be ready for you for another 2 to 3 hours.\" Upon me returning after one hour I found my name taken off the list not because she was ready to serve me, but because when she decided to call out names on list (doing a head count) I wasn't there. REALLY!!! I was told I needed to put my name back on the list with wait time being 3hours. I explained to her that she told me it was ok to leave, she said \"I know but clients say that all the time so you need to sign-in again.\" WOW poor customer service.... I will never patronize them", "rating": "1", "date": [2016, 2, 19]}}, "neighborhoods": ["Beverly"], "latitude": 41.7213349, "longitude": -87.6680035, "rating": "3.5", "times": {"Mon": ["10:30 am", "7:30 pm"], "Thu": ["10:30 am", "7:30 pm"], "Sat": ["10:30 am", "7:30 pm"], "Wed": ["10:30 am", "7:30 pm"], "Tue": ["10:30 am", "7:30 pm"], "Sun": [], "Fri": ["10:30 am", "7:30 pm"]}, "price": "$$", "categories": [["Nail Salons", "othersalons"]], "address": ["1822 W 95th St"], "attributes": {"Parking": "Garage", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No"}, "category": "Beauty", "number_of_reviews": "21"}, "old-fashioned-donuts-chicago": {"comments": {"58": {"description": "AG from this OG (old guy). Just remember that apple fritters are made after 10 AM!", "rating": "5", "date": [2013, 11, 17]}, "56": {"description": "forget about all those fancy bakeries and donut places you know in chicago. donut vault, glazed and infused etc...comparing to this place they are NOTHING!..yes this place is far, and the area is not a good place either but this place has the best donuts in the whole illinois state. i try to drive there once in a month. i buy my donuts in bulk and freeze them, of course it is not the same once you defrost them but i still prefer it to others.", "rating": "5", "date": [2013, 12, 19]}, "29": {"description": "Delicious caramel cake donuts! Let's see what else? Oh, they also serve some breakfast sandwiches, coffee and a few lunch items. There's some seating and they don't have  a bathroom.", "rating": "4", "date": [2015, 4, 3]}, "42": {"description": "I love this place! Tons of doughnut chains have come and gone but this place is #,1! Often imitated but true old fashion doughnut s is the best!", "rating": "5", "date": [2014, 8, 7]}, "23": {"description": "Literally just left this place not too long ago, I love donuts, and I read from reviews that this place is a place that you must try! There wasn't a lot of selection but I guess they sold out of a lot of stuff and they had to make them again because there was a lot of people there. But I got 6 chocolate donuts and an apple fritter which was the size of my head! I tasted them the minute I got in the car and wow! These are delicious and they melt in your mouth I seriously can't even handle how good these are! So I would definitely recommend, I'm not sure if I would come back soon because it is a bit of a drive from Hyde Park, but I will definitely come back at some point!", "rating": "4", "date": [2015, 6, 6]}, "47": {"description": "absolutely worth the trip for lovers of donuts, fried things, frosting, or apples.  if you live in the city and the thought of driving to the south side scares you away, pick a morning before work to go at 6am or 6:30am while everyone is sleeping and traffic isn't bad.  as everyone says, it will be the best fritter you have ever had!  seating is limited to 20mins but trust me you won't even need that to house 1 of these bad boys, despite their size.  tons of parking right in front of the shop, and it's all SOOOO CHEAP--bring one or two of these w/a regular dozen back to the office and you'll be a hero for the rest of your career", "rating": "5", "date": [2014, 4, 27]}, "8": {"description": "Very excellent donuts, always fresh and yummy!", "rating": "4", "date": [2016, 1, 29]}, "31": {"description": "I walked out of Old Fashioned Donuts with two apples fritters and a dozen donuts for $15.50 which might buy me 5 or so donuts at the artisan donut shops that seem to be springing up daily across Chicagoland. Pound for pound and dollar for dollar, this is probably the best apple fritter in the city. And yes I did put it on my kitchen scale and yes it weighed in at just under 15 ounces. It hits all my checkboxes for a delicious fritter, huge chunks of apple, crisp glazed exterior, chewy interior. Awesome. I didn't touch any of the other glazed or old fashioned offerings as the fritter alone was the prize of my visit. I have to say, I'm not a Chicago native, so this is not my Chicago, but it's a part of Chicago that's worth getting to know a little more. Seems like everyone working at the store is there all the time, and they know all the friendly faces and customers as they come in. Chatting about what's new, joshing with the kids, it's an atmosphere that's lost a lot nowadays. A paper sign reminds you not to sit more than 20 minutes, but it doesn't feel like anyone would rush to get you out of there. I understand why people come here and I understand why others don't. Is it the best apple fritter in the city? I can say there's no apple fritter I would definitively say is better and if you're willing to trek to Old Fashioned Donuts that fritter will be waiting for you with service with a smile.", "rating": "4", "date": [2015, 4, 1]}, "34": {"description": "I love these donuts and have been coming here for years! I'm so happy they're not conveniently close by because if they were, I'd seriously be in trouble. I love how fresh the donuts are and I've never been unhappy with any of the flavor varieties. Of course you can never go wrong with the classic glazed donut. They also have a fantastic apple fritter donut that's to die for. The one complaint that I do have is that I'm not particularly fond of the customer service. Or should I say lack thereof. I'm huge on customer service and I don't want to get a feeling of intimidation while placing an order. I dislike patronizing businesses when they person taking my order has an attitude. I also feel that there can be multiple people filling orders especially if there is a crowd. It would also be nice if they accepted credit cards but they don't.", "rating": "4", "date": [2015, 1, 29]}, "16": {"description": "LEGENDARY! There's a lot of trendy Northside doughnut shops that get publicity but, they ALL lack the quality and perfection of a well crafted doughnut. Old Fashioned is the last of the greats. Simple and excellent. None of that flash in the pan stuff. The Apple Fritters are just a work of art. Quality ingredients and down right iconic doughnut greatness.", "rating": "5", "date": [2015, 10, 5]}, "13": {"description": "Apple fritters are huge, amazing, and fresh.  The other donuts are also excellent.", "rating": "5", "date": [2016, 2, 8]}, "11": {"description": "The only good thing about this place is the donuts, and they ain't all that great. the  women working the counter are extremely rude, nasty and confrontational. One employee yelled at a customer for giving her too much change...a \"setup\" she called it, while a bigger woman working the grill gave her friend free food. She did not pay the cashier.The donut shop building  is ugly dirty and decrepit, how they kept a license is beyond me. The counters are unsanitary. The shop is on Michigan avenue where you can't enter without being harassed, threatened or intimidated by beggars and peddlers. I frequented the place for over 20 years. Never again will I set foot in there.", "rating": "1", "date": [2015, 12, 30]}, "39": {"description": "Have you ever taken a bite into a pillow?  How about a cloud?  Those are the first things that came to mind when I closed my teeth around the freshly baked glazed doughnut from Old Fashioned.  My wife and I were fortunate enough to grab a dozen that had just been made.  They were warm and surprisingly, not too sweet.  We paid 15 bucks for a dozen doughnuts (half glazed, half chocolate), two bowties and a gigantic apple fritter (we don't too much care for fritters, but people raved about them so much we decided to check them out).  On the north side, at Chez Doughnut Gallery, the same order would have set us back $60-70........but of course the doughnuts would have been made with South African all-purpose rice flour and had a strip of organic bacon from free ranging Bulgarian pigs on top. Old Fashioned Donuts does accept credit cards (at the time of this review, the Yelp listing indicates that they do not).  The girls who worked the counter were super friendly and down to Earth, as they cackled back and forth with their regular customers about what was happening in their \"Stories\" (Soap Operas).  It was a pleasure to do business with them.", "rating": "5", "date": [2014, 10, 20]}, "37": {"description": "I cannot get over how good the apple fritters are here.   My head feels like it is going to explode when I bite into the fresh fritter.", "rating": "5", "date": [2014, 11, 24]}, "0": {"description": "Yeah, the neighborhood is BAD.  The fritters are AMAZING - you can taste the yeast risen dough, and the warm cinnamon, and ....drool....Do not come for the ambiance. Come for your fritters, get an extra or two, and fall in love.", "rating": "5", "date": [2015, 9, 24]}, "38": {"description": "Oh my goodness! My friend knows of my love for Apple Fritters. I always tell him that Chicago does not know what a real apple fritter is. Glazed & Infused = Crap, Dunkin Donuts = Don't get me started... So he and his wife surprised me with one from this place and my mind was blown! This place is legit. The number one question to ask yourself: Is it worth it to risk my life for quite possibly the most delicious apple fritter you will ever have?", "rating": "5", "date": [2014, 10, 21]}, "51": {"description": "Some of the best donuts I've come across, so far!Yes, it's a hole-in-the-wall little place. Yes, there are somewhat unhappy cashiers some days, and friendly, patient ones other days. And, yes it's in Roseland! They don't get any more fancy than Orange Cream icing, but they do what they do well. And, if you can catch the plain ol' glazed, yeast-raised donuts hot from the fryer...You. Will. Hurt. Yourself! The apple fritters are from Gawd, and should only be consumed in stages. Or shared with others...Let me stop now, or I will soon be making the trip back out to Roseland!", "rating": "4", "date": [2014, 3, 5]}, "27": {"description": "I love this place . I have been going here for years, and I always order the same thing. I always get three glazed donuts for myself. I have tried their other donuts, and they are good as well.", "rating": "5", "date": [2015, 4, 28]}, "32": {"description": "I NEVER believe anyone when they say, \"oh go there, it's the BEST.\" Rarely is that ever true, as taste buds are subjective as hell. But this is close. It likely was the best doughnut I've tried in Chicago, for good reason: it's traditional glazed doughnut is very dense (and as such, gooey) and cake-like. I could easily get diabetes here.", "rating": "5", "date": [2015, 2, 27]}, "54": {"description": "I've been coming here since I was a kid back in the early 80's with my grandmother, I haven't had a donut that compares yet. I still go there and its the same guy making donuts in the front window. Quality is the best no comparison and still cheaper than every other bakery with better quality products. I take a dozen to my job sometimes in the north suburbs by Skokie and everyone always ask where this place is and wants to go there. The expensive places need to take lessons, I've moved from Roseland back in 1990 and still go there a few times each month. THE GREATEST EVER oh yeah and yes they do accept credit cards", "rating": "5", "date": [2014, 1, 3]}, "48": {"description": "A bit into a donut and thought I was in heaven...yes the donuts are that good. They are melt in your mouth fresh. When I got there they were out of the strawberry, which is understandable since I went on Saturday at 2pm (people line up there at 6am in the morning for donuts on Saturday). So I ended up getting the glaze, chocolate and carmel donuts. I just thank God that I don't live anywhere near them.", "rating": "5", "date": [2014, 4, 26]}, "44": {"description": "Crazy huge and delicious apple fritters. If you're not from the area, it seems as though you just walked into the World Renowned \"Wiener Circle\" on the North Side and you BETTER know what YOU want before stepping up to that counter! Ha..Not exactly, they are nice friendly people, ready to make your day with their deliciousness. Wish they weren't out of the Texas Glazed Donut though. Next time, blood sugar level, next time.", "rating": "5", "date": [2014, 5, 30]}, "24": {"description": "Love these donuts and I'm not a fan of donuts! Very fresh and my favorite are the caramel and strawberry!!", "rating": "4", "date": [2015, 6, 3]}, "7": {"description": "Yes the donuts are good. The glaze donuts are the best but poor customer service. The women that work there have the worst attitudes. You will lose business with having a sucky attitude.", "rating": "2", "date": [2016, 2, 3]}, "49": {"description": "Oh my gosh, Oh my gosh, Oh my gosh. My friend and I picked up doughnuts from Old Fashioned yesterday and we just couldn't stop saying Oh my gosh, over & over. Old Fashioned's Donuts are mind blowing.When we drove away from Old Fashioned with our baked goodies in hand, we decided to try a bit just to see how they were. They were hot from the deep frier, insanely soft & fluffy texture and the flavor was absolutely mouth watering. What was supposed to be one bite turned into us devouring an entire Texas glazed donut and a smaller chocolate donut between us. We were on our way to dinner, so that definitely wasn't the original plan. But it was just so good! We could not stop eating. At nearly the exact same moment we both exclaimed the donuts were like crack! We were addicted and had to force our hands to stop grabbing more so we'd actually have something left for breakfast the next morning.Old Fashioned Donuts are the best I've ever had for the light, fluffy, covered in glaze type of donuts. On top of being friggin amazing, their prices are extremely reasonable. A huge Texas sized donut which takes an entire To Go container is just $2.22 and you can get it in either plain glazed or chocolate. We got 2 Texas sized donuts & 3 normal sized donuts for under $8. Wowza! We went to Old Fashioned at about 515pm on a Saturday. They are open from 6 to 6 each day and when we went, we waited in line about 15 minutes. The place was packed and sadly they had a 35 minute wait for Apple Fritters so we passed on those. Something to look forward to the next time we go! The lady who took care of us was very friendly and quick in her service.A very cool little added bonus of Old Fashioned is that the front of the shop is all glass windows and you can see the donuts being made. I've just had my other donuts this morning and I have to say they are definitely better fresh from the deep fryer. But my pro tip is to microwave it for 20 seconds to get it back to as close as you'll get to the warm from the fryer gooey goodness. Finger licking, mouthwatering delicious donuts!", "rating": "5", "date": [2014, 3, 16]}, "40": {"description": "Holy crap these are good. If you're south of Roosevelt you might as well keep driving and stop through here for some donuts.We were at the counter at 4:30 on a Saturday and hankering for sugar. Is it bad that we ate some of our donuts before we paid for them?! My bf just asked for it straight from the case into his hand and he couldn't stop. I'm lucky I got a bite. It was so good and then we had some more. Then I finished our order and paid. Haha!We've been a few times since and it is awesome. It's too bad it's so far away. I want one now Veruca Salt style... oh and they take credit cards!", "rating": "4", "date": [2014, 10, 1]}, "53": {"description": "This place is awesome. We went here on our way to the Pullman house walk. My guys dad has been getting donuts here for 50 years, if you can even imagine the neighborhood was a working class safe neighborhood then. I love this place, its literally a step back in time. The storefront is where the donuts are made. They are made by older men who have probably been doing the same routine for the majority of their lives. All of the fluffy goodies are made by hand 100%.I have trouble choosing when it comes to places like this so we got one of all of them, INCLUDING the apple fritters. Whoah, wayyy  too much delicious! The apple fritters were def the stand out of them all. The size of your head, warm, with chunks of cinnamon y apples how can you go wrong.If youre in the hood, stop by you wont be disappointed, YUM!", "rating": "4", "date": [2014, 2, 13]}, "30": {"description": "AHHHHMAZIING! The best donuts I have ever had hands down! The yeast donuts are SO fresh, pillowy soft and just outstanding. My favorite is the apple fritter, you CANNOT finish one in one sitting, no matter how hungry you are! They are that huge! The first time we came they were out of fritters but we waited the 20 mins for a fresh batch, it was well worth it! These donuts are not the cheapest but they are certainly the best!The neighborhood is definitely sketchy but there were people from all sides of town waiting for these amazing donuts! I will be back again next time I am anywhere near these warm pillows of yeasty goodness!", "rating": "5", "date": [2015, 4, 2]}, "46": {"description": "This place is the real deal, yo. If you had done a Yelp search a few years ago for donut establishments, you'd be left with Dunkin Donuts and Old Fashioned Donuts. Now there are a bevy of options but I'm here to tell you that there is a reason that Old Fashioned Donuts is still going strong on the far southside after 40 years: their donuts are the bomb. The donuts are not \"fancy\". You will find no bacon, no ribbons of candied fruit peel or chocolate shavings. But you will find some damn good donuts and one very orgasmic apple fritter...which I'll get to in a moment. The glazed dodos are a thing of beauty, the orange cream is the stuff dreams(icles) are made of and the crullers? My gawd, the crullers. Sadly they were out of the chocolate frosted cake donuts. I thought my friend wasn't going to recover from this heartbreak until....APPLE FRITTER! The apple fritter is as amazing as everyone says it is. It's as huge as everyone says it is. It is beyond words. It can only be described as follows:OH-MY-GAWD. Mmm... *chomp* MMMMohmygod. ohmygod. \"I'm so glad we got pecans on this.\"Mmmm. Oh my...mmmm. Old Fashioned Donuts is totally worth the almost hour drive from the Northside. It's a no frills place with some of the best donuts you'll have. The coffee ain't bad either. Don't be intimidated by the drive or the neighborhood. The counter gal was helpful and warmed up to us and was able to talk my friend down from the ledge upon learing that they were out of the choco donuts.You don't stay for the ambiance, you stay for the donuts...and that's how it should be, shouldn't it?", "rating": "5", "date": [2014, 4, 27]}, "1": {"description": "I just had THE BEST donut, EVER I had a coworker bring a box of mixed donuts to work.  I've never tasted anything like this before!  Super fresh, crispy... YUM !", "rating": "5", "date": [2016, 2, 24]}, "55": {"description": "The best apple fritters I have ever had!  Donuts are amazing also! The college kids told us about it and it is worth the drive out of the city! Will be heading there again when we go back!", "rating": "5", "date": [2013, 12, 27]}, "9": {"description": "Literally just left this place not too long ago, I love donuts, and I read from reviews that this place is a place that you must try! There wasn't a lot of selection but I guess they sold out of a lot of stuff and they had to make them again because there was a lot of people there. But I got 6 chocolate donuts and an apple fritter which was the size of my head! I tasted them the minute I got in the car and wow! These are delicious and they melt in your mouth I seriously can't even handle how good these are! So I would definitely recommend, I'm not sure if I would come back soon because it is a bit of a drive from Hyde Park, but I will definitely come back at some point!", "rating": "4", "date": [2015, 6, 6]}, "26": {"description": "The BEST donuts ever!  There I said it! Dunkin Donuts, Krispy Kreme, What???!!!  No comparison to these donuts.  I grew up eating these donuts as they were in the neighborhood.  Such a treat.  Family run business.  I miss seeing some of the women in the family who worked there for years.  The best luck you can have is getting their donuts when they are still warm.  Mmmmm....so good, pure heaven.  I am glad to be living back in my old neighborhood so I can have close access to these donuts.  And, for an added treat, get one of their hot sandwiches.  Their polishes are Delicious.  Thank you for all the years you have provided such great food.  You will always have my business!", "rating": "5", "date": [2015, 5, 14]}, "25": {"description": "The best donut I ever ate. If you are in the area you must stop by here and give it a try. Old fashioned as the name implies. They make them right there for all to see and enjoy. Friendly staff too. The glazed is my absolute favorite. Hands down the best donut ever. The apple fritter is not to be missed either. Huge and delicious.", "rating": "5", "date": [2015, 5, 15]}, "12": {"description": "AHHHHMAZIING! The best donuts I have ever had hands down! The yeast donuts are SO fresh, pillowy soft and just outstanding. My favorite is the apple fritter, you CANNOT finish one in one sitting, no matter how hungry you are! They are that huge! The first time we came they were out of fritters but we waited the 20 mins for a fresh batch, it was well worth it! These donuts are not the cheapest but they are certainly the best!The neighborhood is definitely sketchy but there were people from all sides of town waiting for these amazing donuts! I will be back again next time I am anywhere near these warm pillows of yeasty goodness!", "rating": "5", "date": [2015, 4, 2]}, "59": {"description": "Food addiction is a very real thing.  I woke up this morning fiending for Old Fashioned Donuts.  The donuts here are just as addictive as heroin and well worth the one-hour drive from the suburbs.We tried the apple fritter, chocolate frosted cake donut, orange frosted cake donut and the glazed donut.  I am a little embarrassed to admit that my \"mmm!\" exclamations while eating the fritter may have started to sound like moans.  The chocolate donut really tasted like a slice of cake.  I wanted to exclaim that the fritter and chocolate donut were better than sex.  Well, at least better than bad or mediocre sex, okay?I wasn't as impressed with the glazed donut.  The fritter and cake donuts are really the star of the show here.  I've never had a donut with such a crunch to it on the outside!  We also ordered a coffee & milk.  I was a little taken aback when I was given a small carton of whole milk.  I thought whole milk was for infants.  I gasped when I saw the fat content on the milk package.  Like it was going to make a difference after eating donuts for breakfast, right?One fritter, three donuts, a coffee and milk cost a little over $9.  There are a lot of stools and small tables for seating, or you can take it to go.  They do accept both credit cards and cash.That's not all folks.  On top of the best breakfast ever, you can get a little bit of a show here.  A man they called \"the reverend,\" was a comic presence while waiting in line.  The line was 5-6 people deep constantly.  The rev puffed out his chest and bellowed his thoughts on demanding men and subservient women.  I think he was joking...I think.  Most of the customers in line either chuckled or rolled their eyes.  A few times the employees behind the counter yelled at him to shut up.  The employees are friendly and patient while waiting for customers to pick out their donuts.  While eating, a female customer approached us and asked for money.  I won't ignore panhandlers, so I said \"I'm sorry.  I don't have any cash on me.\"  She lingered a few seconds more, but an employee working behind the counter noticed this and very loudly told the woman to get out and never do that again.  I may be overreaching, but I felt just as safe coming to OFD in Roseland as I would feel walking down the Magnificent Mile or in downtown Naperville.  Why?  Oh, it's because I'm not afraid of black people and I wasn't going to hang out at the park after dark.  I've been coming into contact with too many suburban folks who think the \"south side\" stops at Bridgeport and anything south of there is like walking through an open shooting range.  A word to white people:  don't be afraid of a place just because you will suddenly be the minority.  By overcoming fear, you will have the world's most perfect donuts.", "rating": "5", "date": [2013, 10, 27]}, "21": {"description": "The best donuts we have ever tasted.  The croissant donut and French crueler (not sure if I spelled that correctly) were the magnificent. Utterly delicious.  A diamond in the rough.", "rating": "5", "date": [2015, 7, 10]}, "17": {"description": "The BEST donuts ever!  There I said it! Dunkin Donuts, Krispy Kreme, What???!!!  No comparison to these donuts.  I grew up eating these donuts as they were in the neighborhood.  Such a treat.  Family run business.  I miss seeing some of the women in the family who worked there for years.  The best luck you can have is getting their donuts when they are still warm.  Mmmmm....so good, pure heaven.  I am glad to be living back in my old neighborhood so I can have close access to these donuts.  And, for an added treat, get one of their hot sandwiches.  Their polishes are Delicious.  Thank you for all the years you have provided such great food.  You will always have my business!", "rating": "5", "date": [2015, 5, 14]}, "10": {"description": "I'm 28 now and I've been going to this place since I was 4, with my mom and dad.  Donuts are fresh, fluffy and hella tasty. I've had everything, literally. My favorite of all time is their cinnamon rolls. I promise they won't disappoint.", "rating": "5", "date": [2016, 1, 6]}, "5": {"description": "The service is terrible. I went there on March 3 2016 at 6.15 am.therewas a man getting 10 boxes of donuts.there were 3 people  in line and that older women that has been there for year would not help the customer. That is bad business. We alway talk about supporting black business.if I had a business she definitely  wouldn't  be working  there.she does that all the time.", "rating": "1", "date": [2016, 3, 2]}, "3": {"description": "I made the special trip here from the north side to check out all of the fuss around the donuts and apple fritters, and would unequivocally say the fritters alone were well worth the trip. They are massive, satisfyingly chewy with apples galore, very sweet and crunchy too if you go with the pecans version.  The \"regular\" donuts are very good too but not worth the special trip, especially since the selection doesn't go much further than those traditionally found at old-school bakeries and donut places. It is a pretty threadbare, no frills place in a run down neighborhood with no frills prices and no frills service, but a very loyal local following (I arrived at 10:30 on a Tuesday, and the line was nearly out the front door), so I hope it's still around for some time to come.", "rating": "4", "date": [2016, 2, 14]}, "35": {"description": "Oh man. I can't say enough on how tasty the dinner plate sized fritters and donuts are. Quality and freshness are superb!  5* on taste alone.", "rating": "5", "date": [2015, 1, 26]}, "19": {"description": "I NEVER believe anyone when they say, \"oh go there, it's the BEST.\" Rarely is that ever true, as taste buds are subjective as hell. But this is close. It likely was the best doughnut I've tried in Chicago, for good reason: it's traditional glazed doughnut is very dense (and as such, gooey) and cake-like. I could easily get diabetes here.", "rating": "5", "date": [2015, 2, 27]}, "28": {"description": "4.5 stars! This place is amazing.  Must try again...and again...and again.  Some of the donuts are very sweet but overall you can't go wrong.  You'll never eat dunkin donuts ever again.", "rating": "4", "date": [2015, 4, 4]}, "45": {"description": "Hands down the best donut I've had in my life so far. I recommend the apple fritter!!", "rating": "5", "date": [2014, 5, 2]}, "33": {"description": "The donuts are extremely good. Better than Krispy creams but if your not here before the afternoon you will have to wait for a while. I really don't understand how they dnt have a lot already made or faster service due to the fact that their glazed donuts are the main reason ppl come here. *shrugs* I guess", "rating": "2", "date": [2015, 2, 6]}, "43": {"description": "There really are no words to describe the delicious, mouth-watering doughnuts at this established shop. After over 30 years of eating these sweet and savory treats, I still can't choose a favorite but I do love the chocolate or glazed ones best. The apple fritters are so good that I almost shed a tear while eating.", "rating": "5", "date": [2014, 6, 19]}, "2": {"description": "I'm sorry excuse my language. Best damn donuts I've ever tasted.  They will kill a diet.", "rating": "5", "date": [2016, 2, 7]}, "18": {"description": "This place is going to be the death of me,,,,simply delicious!!!!! My favorites are the glaze and buttermilk,,,there is nothing better than knowing that the donuts are freshly made every morning,,,,", "rating": "5", "date": [2015, 6, 9]}, "41": {"description": "This is my all-time, favorite childhood donut shop. In my many travels, have I yet to find another to come close to the deliciousness of their freshly baked glazed donuts and apple fritters. The eclairs are buttery and creamy greatness...I get emotional thinking about the love placed into the fried dough. All the warmth of gramndma's hugs.", "rating": "5", "date": [2014, 8, 11]}, "52": {"description": "Visited Old fashioned Donuts after reading the DNA Chicago article \"ROAD TRIP!\"and it was amazing!  The neighborhood is cool in it's own way with a vibrant Roseland community but those glazed donuts were just amazing!    Saw the real MR Donut at work in his storefont window to the world.  You have got to try these real donuts.", "rating": "5", "date": [2014, 2, 13]}, "50": {"description": "Perfect glazed donut that melts in your mouth. The chocolate donut has a very light crunch to the exterior that is hard to explain combined with the fluffy soft interior but it is the best I've ever had. As every one has said, the Apple fritter is absolutely amazing!!! Not sure what else can be said about this sinfully delicious concoction of heaven on earth with apples.", "rating": "5", "date": [2014, 3, 14]}, "4": {"description": "I walked out of Old Fashioned Donuts with two apples fritters and a dozen donuts for $15.50 which might buy me 5 or so donuts at the artisan donut shops that seem to be springing up daily across Chicagoland. Pound for pound and dollar for dollar, this is probably the best apple fritter in the city. And yes I did put it on my kitchen scale and yes it weighed in at just under 15 ounces. It hits all my checkboxes for a delicious fritter, huge chunks of apple, crisp glazed exterior, chewy interior. Awesome. I didn't touch any of the other glazed or old fashioned offerings as the fritter alone was the prize of my visit. I have to say, I'm not a Chicago native, so this is not my Chicago, but it's a part of Chicago that's worth getting to know a little more. Seems like everyone working at the store is there all the time, and they know all the friendly faces and customers as they come in. Chatting about what's new, joshing with the kids, it's an atmosphere that's lost a lot nowadays. A paper sign reminds you not to sit more than 20 minutes, but it doesn't feel like anyone would rush to get you out of there. I understand why people come here and I understand why others don't. Is it the best apple fritter in the city? I can say there's no apple fritter I would definitively say is better and if you're willing to trek to Old Fashioned Donuts that fritter will be waiting for you with service with a smile.", "rating": "4", "date": [2015, 4, 1]}, "6": {"description": "Delicious goodness that is hot and fresh all the time.", "rating": "5", "date": [2016, 2, 15]}, "22": {"description": "This place is going to be the death of me,,,,simply delicious!!!!! My favorites are the glaze and buttermilk,,,there is nothing better than knowing that the donuts are freshly made every morning,,,,", "rating": "5", "date": [2015, 6, 9]}, "15": {"description": "Omg these reviews were not kidding. I rarely ever eat donuts and I'm so glad I gave it a try! Amazing. Toasted Coconut donut for $1 even. Can't believe how good it was lol", "rating": "5", "date": [2015, 10, 14]}, "57": {"description": "Delicious. They may never change the grease that they fry the doughnuts in, but that's part of the charm. I had one glazed doughnut and it was phenomenal. If you don't eat junk food on a regular, you might get a headache (at least I did), so brace yourself.", "rating": "5", "date": [2013, 11, 23]}, "20": {"description": "Great donuts, been around for decades. The place isn't fancy but the donuts are delish.", "rating": "4", "date": [2015, 7, 10]}, "36": {"description": "The name explains it all. Old Fashioned Donuts delivers wonderful old fashioned donuts. I went here early in the morning to get a fresh dozen and left with a smile on my face and a wonderful aroma in my car.The only negative is that the drive back into the city is terrible on weekdays. While I am not sure I will ever go back, I will always be willing to pay for someone to drive there and bring them to me!", "rating": "3", "date": [2015, 1, 8]}, "14": {"description": "Been coming here for the last 25 years, starting with the location on 63rd and Halsted (thanks Grandma).  Always a treat.  I hope the older gentleman making the donuts/fritters knows he is a Chicago treasure :))", "rating": "4", "date": [2015, 12, 4]}}, "neighborhoods": ["Roseland"], "latitude": 41.6893310546875, "longitude": -87.6213455200195, "rating": "4.5", "times": {"Mon": ["6:00 am", "6:00 pm"], "Thu": ["6:00 am", "6:00 pm"], "Sat": ["6:00 am", "6:00 pm"], "Wed": ["6:00 am", "6:00 pm"], "Tue": ["6:00 am", "6:00 pm"], "Sun": [], "Fri": ["6:00 am", "6:00 pm"]}, "price": "$", "categories": [["Bakeries", "bakeries"], ["Donuts", "donuts"]], "address": ["11248 S Michigan Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Delivery": "No", "Wheelchair Accessible": "Yes"}, "category": "Food", "number_of_reviews": "164"}, "the-blossom-boys-chicago": {"comments": {"14": {"description": "Best of the best!  Great creativity and shop is extremely inviting.  Love everything about them!!", "rating": "5", "date": [2013, 8, 18]}, "20": {"description": "This place has the most beautiful flower arrangements. They are so unique, fresh and colorful! Also has tons of jewlery, tchochkes, candles and candy. Perfect for an easy gift.", "rating": "5", "date": [2010, 3, 24]}, "3": {"description": "Absolutely fabulous custom arrangement...I wanted to support a neighborhood business and needed a superb trustworthy florist to put a 70th Birthday arrangement together for my mother.  I'm her only daughter, oldest child and out of town.  I have had such rotten luck ordering quality flowers/arrangements from Teleflora and ProFlowers. so, I turned to Yelp for help figuring what did I have to loose.I called Blossom Boys on Friday and gave them a little background...I like Yellow Roses and my Mother likes White Lilies, White Roses and Fragrance.  My mother lives on the East side of Chicago and that is out of Blossom Boys delivery range.I'm like okay....I will have my husband pick them up.  Upon arrival the Florist (don't recall his name) was extremely informative and explained and gave background on the various items in the arrangement.My husband took pictures...But my husband the pictures do not convey the beauty and awe as seeing the arrangement in real life...He also said that with other arrangements he has thought, \"those are nice\" but with the Blossom Boys' arrange he was like \"Wow'ed\".The arrangement has lots of buds...once the blossom I'm sure the arrangement will be even more breathtaking.Thank you so much Blossom Boys.  I will be a repeat customer and will definitely refer anyone asking to you.  Once again great job...", "rating": "5", "date": [2015, 7, 11]}, "1": {"description": "Awesome experience with the Blossom Boys! This year I decided to order my Mother's Day flowers from a florist instead going to Jewel, and I am very glad I did. The super sweet lady that helped me went above and beyond to make sure I was happy with my arrangement.  Everyone in the shop was very nice, and made the effort to say hello. That's the kind of customer service that will keep me coming back.My mom absolutely loved the flowers. Thanks again!", "rating": "5", "date": [2015, 5, 10]}, "2": {"description": "This is really a superb florist. The flowers in the case are always fresh and long lasting.  The owners are super!  Usually, we just stop by and let the kids pick some flowers from the case for their mom.  For our wedding anniversary, though, I asked the Blossom Boys to recreate my wife's wedding bouquet from an old photo.  The result was stunning (it looked better than the original!) and my wife was blown away.  Highly recommended.", "rating": "5", "date": [2016, 1, 29]}, "9": {"description": "Great customer service.  Thank you Steve and Ryan for accommodating our needs on short notice. The floral arrangement for my mother in law's funeral was beautiful.", "rating": "5", "date": [2014, 7, 14]}, "18": {"description": "The Blossom Boys did such a lovely job with our wedding flowers! Their work was amazing, and they were so easy and friendly to work with from the very start. (Not to mention they stepped in at the last minute--about a month before the wedding--when our original florist fell through). I gave them some ideas of what we wanted, and from there they worked their magic! They created all of the centerpieces, decorative arrangements, personal bouquets and boutonnieres. Everything turned out exactly as we imagined, and we received compliments all night on how lovely the flowers were. Best of all, our guests were able to bring the centerpieces home at the end of the evening, and we kept two huge and beautiful curly willow arrangements for ourselves, which look fantastic in our home and will forever be a reminder of our wedding day.I would not hesitate a second to recommend them to anyone, for any job, large or small.", "rating": "5", "date": [2011, 3, 15]}, "10": {"description": "This place is the best in the city!! I always go here, service is great! Flowers are top notch and always put together with care. Flowers are always fresh and beautifully arranged, it's a plus when you pick up your flowers to smiling faces, pleasant conversation and speedy service!! Keep up the good work!!", "rating": "5", "date": [2014, 4, 26]}, "4": {"description": "I'm so very sorry  it has taken me several months to write this review. Steve & Ryan were absolutely the most professional, creative, delightful & accommodating designers I have ever worked with. To say that the Centerpiece's, carts and various other floral arrangements that were designed for my Nieces bridal shower were STUNNING is an understatement! Although we met several times and they provided samples prior to the event , seeing everything come together far exceeded my expectations. The customer service, attention to detail and quality of the product are just a few reasons why I would definitely recommend the Blossom Boys.", "rating": "5", "date": [2015, 9, 10]}, "16": {"description": "I am completely happy to have found this florist. They did a fantastic job of designing my sons boutonnière & his dates coordinating corsage.  They turned out beautifully!", "rating": "5", "date": [2011, 6, 1]}, "6": {"description": "I was totally overwhelmed with the good service and the quality of the flowers that I ordered. A very kind and helpful woman on the phone seemed to read my mind in making my selection (sympathy flowers). The flowers were beautiful and much bigger than I thought I was getting for the money.  The card was exquisitely written in calligraphy. I can't remember any place that I have gotten better service and such a high quality product. Thanks!", "rating": "5", "date": [2015, 6, 19]}, "11": {"description": "Steve and Ryan are wonderful.  They welcomed us to their colorful shop and seated us for consultation in their back room.  There they showed us the beautiful orchid centerpiece and harvest- colored bouquets presented in glass containers and vases that realized our vision.  They even added fair trade bells to reflect the silver bells we planned to place on each table.  Ryan called me at each step of the process to confirm our contract and payment schedule.  He and his assistant arrived as planned to our venue and began to distribute and assemble the floral designs.  We quickly created a solution when it turned out I hadn't told Ryan we added two tables.  Steve and Ryan presented our bouquets in dark wicker baskets which were prefect for my nieces to distribute at the event.  The many flowers for our suits, our parents and special guests were elegantly presented in clear boxes with bright tissue that made the donning go smoothly.  The eyes of our guests filled with tears when we brought white bouquets to our mothers and my sister as a part of our ceremony.  The flowers the Blossom Boys created shine in the memory of our wedding day.  We highly recommend them for their creative design and friendly manners.  Albert and Joe", "rating": "5", "date": [2014, 10, 25]}, "12": {"description": "Amazing! The Blossom Boys did my wedding this weekend and once again proved how amazing they are!  I really had no idea what I wanted. At our initial meeting I showed them pictures of the venue and told them to do whatever they wanted-they're the florist not me. They came with the most beautiful center pieces (people we're arguing about who got to take them home) and bouquets. I would recommend them to anyone. From weddings to just because flowers their is no one better!!", "rating": "5", "date": [2014, 2, 24]}, "17": {"description": "The Blossom Boys are a true gem in Beverly!  They always have fresh, vibrant and amazing floral arrangements.  From private to corporate events the Blossom boys can make any venue dazzle.  I've seen dozens of weddings with their work and they've never disappointed...even once!Also, stop in and discover the many fair trade items in store!!!  Check out there edibles too....yummy! They are in a class of their own!", "rating": "5", "date": [2011, 3, 10]}, "5": {"description": "the Blossom Boys did a fabulous job for my son and daughter in laws wedding! The flowers were absolutely beautiful, just what the bride had envisioned. They are very intuitive, seemed to get a sense of what we were thinking of and went from there. They had many creative ideas, and also listened to our ideas. the wedding was at the Morton Arboretum, which is so beautiful, that I was worried that flowers might not stand out. Not true, the BBs flower arrangements aand bouquets blended in, while actually enhancing the environment. It was a a great experience, no stress, worry, set up went very well, flowers fresh.  I have also gone into BBs for flowers on short notice, and they have always delivered a beautiful arrangement.", "rating": "5", "date": [2015, 7, 18]}, "13": {"description": "The Blossom Boys did our wedding flowers, and were a delight to work with.My idea for flowers was that every girl carry a different color flower, and that they be jewel-toned flowers.  Ideally, I wanted the bouquets to be carnation-based.  Ryan and Steve took my idea and ran with it, and the flowers were stunning.  In fact, my mother loved her corsage so much that she's asked that whenever we buy her flowers, that we get them from the Boys.We met with the Boys a few times before the wedding, and they really were able to take an abstract idea and bring it to life.  We also purchased all of the gifts for people who were doing readings, etc, at their store.  They are absolutely wonderful to work with, and I would recommend them to anyone looking for a fun, reasonably priced florist for their wedding.", "rating": "5", "date": [2010, 10, 11]}, "7": {"description": "Ryan and Stephen designed the most stunning flowers for my daughter's bridal shower.  We walked into the room and were stopped in our tracks when we saw them.  Everyone at the shower commented about the unusual and beautiful centerpieces.  What wonderful and creative gentlemen!  I love going to their shop because they take their time educating you about the flowers, and how to effectively display them.  They listened to our ideas and brought them to life.  We can't wait to see the wedding flowers.  I highly recommend you stop in and see a wonderful store with two highly professional and reliable owners, who go out of their way to make your day special.  You will not have the same run of the mill centerpieces, but designs of highly creative flowers.", "rating": "5", "date": [2015, 9, 8]}, "8": {"description": "We used the Blossom Boys for our Wedding this August.Summary: Beautiful work, but difficult shop to work withDetails: My bridemaids bouquets and groomsmen boutineers were BEAUTIFUL. Seriously picture perfect, exactly what I wanted, couldn't have been better. Maybe one of my favorite parts of my wedding.However, my bouquet was all wrong. When we had our first meeting with The Blossom Boys, I brought in 6 pictures of bouquets I liked. 5 of the 6 were of tight, mounded style bouquets, and 1 was a looser garden-style. I explained, I wanted the mounded style, but I included the other picture because I liked it's colors. I said specifically I don't like bouquets with alot of green leafy filler in them. When we went back for our second meeting to hear their proposal, they had me down for a loose garden-style bouquet. I corrected them, and watched him make the change on the paper. Months later, when we made our final payment, I checked AGAIN that they had me down for a mounded-style bouquet; and they did. However, when the flowers showed up on the wedding day; my bouquet was in a loose garden style with all sorts of extra green buds shooting out of it. My dad and one of my bridesmaids spent a few minutes snipping all the green things off, and it helped ALOT but I still didn't really care for the overall look of it.Additionally, the shop could be very difficult to get a hold of at times. They also made a mistake and tried to double charge us the delivery fee. Also, our wedding was two weeks ago, we made the final payment two weeks before that, but TODAY they replied to a month old email asking when we could come by to drop off our last check. So many levels of not organized....Bottom Line: These guys will do amazing work for you, but you need to be prepared to stay on top of them and be CRYSTAL CLEAR with what you want from DAY ONE. Definitely hold onto all your paperwork from them and expect to have to wait a long time for any emails to be returned.", "rating": "3", "date": [2015, 8, 21]}, "19": {"description": "Extremely nice and helpful people, amazing arrangements...this place is as good as it gets.", "rating": "5", "date": [2012, 5, 14]}, "0": {"description": "Sheer geniuses! We recently used the Blossom Boys for my bridal shower and wedding and their work was nothing short of perfection. Despite living out of state they met with my mom and wedding planner and facetimed me in for all of our consultations. Given my complete lack of knowledge regarding flower types, the Blossom Boys were able to provide great suggestions and truly brought my overall vision to life.  Their creativity and attention to detail is very impressive.I honestly could not have dreamed of what they were able to deliver.It was an absolute pleasure working with them and with that being said, I would recommend them hands down to anyone with out reservation!", "rating": "5", "date": [2015, 10, 12]}, "15": {"description": "Excellent customer service, good pricing and a sense of style that cannot be replicated. Who needs a florist or boutique on the north side when you've got the Blossom Boys right here? From soap, to flowers, to cards, to jewelry, this is the place.", "rating": "5", "date": [2012, 6, 22]}}, "latitude": 41.713599935174, "neighborhoods": ["Beverly"], "categories": [["Florists", "florists"]], "address": ["9911 S Walden Pkwy"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "Delivery": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.6676234602928, "times": {"Mon": [], "Thu": ["11:00 am", "6:00 pm"], "Sat": ["10:00 am", "3:00 pm"], "Wed": ["11:00 am", "6:00 pm"], "Tue": ["11:00 am", "6:00 pm"], "Sun": [], "Fri": ["11:00 am", "6:00 pm"]}, "rating": "5.0", "price": "$$", "number_of_reviews": "21"}, "dat-donut-chicago-3": {"comments": {"0": {"description": "This is a great location for business. Fresh doughnuts and coffee. I had a chocolate cake and a jelly. They were both good. Two doughnuts and a medium coffee is $3.49", "rating": "3", "date": [2015, 4, 3]}}, "attributes": null, "neighborhoods": ["Roseland"], "categories": [["Donuts", "donuts"]], "address": ["14 W 95th St"], "latitude": 41.7218666, "longitude": -87.6248169, "category": "Food", "rating": "3.0", "price": "$", "number_of_reviews": "1"}, "colour-nails-chicago": {"comments": {"12": {"description": "Newly built, so the furniture and decor is nice. They have a lot of stations. I believe 14 manicure stations and 14 chairs, one of the largest I've been to in a while. I went to ZiZi and he was very sweet, took his time with my service and made sure I was taken care of.  Only got my natural nails done, so not quite sure about full sets, but everyone else's nails looked nice too. Will return!", "rating": "5", "date": [2015, 1, 19]}, "3": {"description": "I pulled up Yelp and found this place on a whim because I needed a quick no-chip manicure after work. Colour Nails was close by and had pretty good reviews, so I walked in at about 3:15 on a Friday afternoon. I told them I needed a soak off and a no-chip and only waited about 10 minutes before I was serviced. My nail tech, Ryan, was very nice and quick! I was in and out in about 45 minutes (including my wait time). Even better, their no-chip polish change is only $20!! I had just had a manicure, so I didn't need all the works, so this is a great price for a new no-chip color. This place is close to work and reasonably priced, so I think I'll be back.", "rating": "4", "date": [2016, 1, 16]}, "1": {"description": "I've been here before with family and it was great, which is why I chose this place again. I came here with a friend as a girls day out. My nail tech was Tony and my friend had a young pregnant women who's name I don't recall. I couldn't have a conversation with my friend without it seeming like someone wanting to be in my conversation. Then, my tech was so rude and so was my friends tech.  I was seated all the way near the front door and it's cold outside. When told to wash my hands after having my cuticles removed, my tech thought it was okay to wash the bowl while I was washing my hands and  pushed my hands out of the way. both techs would push the hand away to signal that they wanted the other hand rather than say it. A customer came in and asked my tech if he could help her, he replied that he was busy. She replied I know your busy, but can you help me with my question. He told her to find the owner. Who was not around. My friend and I payed $55 for a manicure and pedicure. It was completely overpriced. I was embarrassed to have taken her to this nail salon in my very own neighborhood. I will not be coming here anymore as I don't support establishments that lack proffesionalism within their employees. There's a nail salon literally around my house that doesn't have customers because they are rude and lack professionalism. The same will happen if this establishment don't get it together.", "rating": "1", "date": [2016, 3, 3]}, "2": {"description": "I have been a faithful customer over the past 1 year. I will not get my nails done anywhere else in Chicago. Helen is my favorite overall in my opinion she does the best nail art. Phat her hubby is amazing with acrylic. Everyone is super friendly. The salon is always packed so go at opening or late if you go on a Saturday.", "rating": "4", "date": [2015, 10, 1]}, "9": {"description": "Tina is good", "rating": "4", "date": [2016, 2, 2]}, "10": {"description": "First, I will start with the positive and say that it's a nice space...open and bright with newer spa chairs and bowls. Second, my technician, Ivy (I think), was very pleasant! So, the first strike was the price-$25 pedi or $35 for mani-pedi. This, of course, is not terribly out of range. However, I will admit that my normal two places are only $20 and $30 for those services. Second strike was poor range of color choices. As a professional and due to personal choice, I don't want overly bright, ridiculously dark, or sparkly polish. If you like these choices, this is a good place for you. However, some people like more conservative pinks, corals, etc. Fast forward to paying, the thrid strike occurred when Ivy returns with my card with an extra fee ($1) on it! Umm, excuse me, what is this charge for? I spoke with the owner, David, I was informed that \"the DMV and other places charge fees for card use.\" Sir, the DMV also make licenses. Just because they do, doesn't mean that you can! At least post a sign and let me make an informed decision. Grant it, it was a nominal charge, however, it's the principle. Can you imagine how much extra income they generate off of that small charge because no one says anything?! Overall, although Ivy was pleasant, I will not be returning. Why pay $41 when I can get the same service for less?!", "rating": "1", "date": [2015, 4, 17]}, "13": {"description": "Inconsistent service.... don't pay until you are completely done....I've been into this shop about 10 times...  half the time I have good service the other half poor. ... green does a great job and takes his time.... but there are too many technichians who are just quickly trying to slap on some polish and get you out.    I normally pay before my nails are painted, but if I come back I won't be doing that again.   I get the same thing every time I get my nails done... 3 times now at this shop I've ben asked, and argued with to get what I want.. half glitter half plan polish. I don't care if you think the Polish won't show up. I don't care if you think it'll take to long to dry.. please do what I ask for, and what I pay for.. especially if it  isn't difficult...   I don't go on busy weekends, or when it's crowded so there no reason to rush.", "rating": "2", "date": [2015, 2, 19]}, "16": {"description": "1st and last time going. The manicure price in the wall says $12, but I was charged $16 ($1 fee for using c.c)Got a pedicure on Thursday,  the polish chipped on Friday off 3 toes. The manager made me feel like the bad guy by telling me I should have remembered who took care of me...how do he know if I didn't go somewhere else and just coming there to get a free polish change...and the only thing he can do is polish over my 3 chip polished toes with a random color because he couldn't \"find\" the one I had on (even though I told him the polish name and color number ).", "rating": "1", "date": [2015, 7, 19]}, "6": {"description": "I went here. The service was very nice and prompt and my nail tech was very helpful. What I didn't like was that she rushed through the UV curing of my no-chip manicure. I got the manicure Friday morning, by Monday I noticed tears in the color, by Tuesday the tears had gotten more pronounced and the gel had begun to left. Today, wednesday, pieces of the manicure gel have fallen off of two fingers. I'm very unhappy with the manicure, but she did pay great attention to my cuticles. Don't go here if you want a worthwhile manicure. By the way, I was the first customer of the day, so there was no need for her to rush.", "rating": "2", "date": [2015, 8, 5]}, "15": {"description": "I came in and told them that I wanted a pedicure and a no chip manicure. This was the best no chip manicure I have had in Chicago. I enjoyed the pedicure too.", "rating": "5", "date": [2015, 1, 30]}, "0": {"description": "As soon as I was walked in I was greeted and asked to sign in (I arrived around 10:40 AM so they had only been open for 40 minutes). I was immediately seated for a pedicure and got started. The chairs are big and comfy. The young lady doing my pedicure was great! She worked to make my feet nice and soft. My polish was smooth. I'll be back! *GOOD TIP* arrive early because this place gets packed fast!", "rating": "5", "date": [2016, 2, 6]}, "5": {"description": "WHAT I'VE BEEN LOOKING FOR This is a very nice new shop.I got a very warm feeling when I walked in the door. But you have to stop by the place to see how much this owner put into this new nail salon. It is beautiful from the Crystal Chandler when you come in the door and the feel so good service chairs. The color changing boarder ceiling. So now the service Again love the service chairs. But I  was able to just set back and enjoy the music while Alice just made me feel special. And yes I loved the quality of her work she does a really good job.(feet, manicure, brows, and brow tint, and my eye lashes )I'm very excited about this place keep me happy and I'll keep coming back This is this owner 2nd shop. And the nail technician Jennifer has been with him for a few years now.So check them out and tell them I  sent you from yelp.", "rating": "4", "date": [2014, 10, 6]}, "11": {"description": "I like them! My first time here. The service is great and the staff is friendly. Got regular pedi and a no chip manicure. Green was my technician and it was his first day and did a wonderful job! He will be my go to guy for here on out! The decor is wonderful and brand new. The massaging chairs are comfortable. Wish they made them a little longer for us tall folks. Over all it was a good pretty quick day! Total cost was $55 w/ a 20% discount.", "rating": "5", "date": [2014, 10, 8]}, "8": {"description": "Christine is EVERYTHING. I refuse to go to anyone else for my brows. Im sad im moving back to ny soon. Wth am i gonna do without her. She does it all. I've come in there many times and shes actually managing everyone and she isnt even the manager. Answering the phones and doing nails. Asking others to spread out work to avoid waiting clients and spills. She is awesome", "rating": "5", "date": [2015, 11, 28]}, "4": {"description": "So this was my second time visiting this shop and I must say I think I have found a nail technician. Christine is quick and good. The prices are like every other shop, you pay for base fill-in and everything else ala carte, cut down, fix nail, etc.. The shop isn't too far from home looking forward to my next visit. Nice selection of colors both no-chip and regular.", "rating": "4", "date": [2016, 2, 9]}, "14": {"description": "They are one of the best nail salons in the city at both locations that they own they are the truth I love them Ive been coming to them for over four years now and they are really a family oriented business I love them", "rating": "5", "date": [2015, 2, 20]}, "7": {"description": "The best place to go for consistently good quality. They're like most salons busy on weekends and even then I'm never disappointed and that speaks volumes from me because I'm very indecisive. I have frequented both of their locations and this one is super convenient and close. They have more parking here. As far as services go, I've had manicures, pedicures, brow waxing, Brazilian waxing of which I suggest making an appointment for with Tina because she does the best job in my opinion. Overall this is my home when I need my manicures and pedicures done right.", "rating": "5", "date": [2015, 6, 7]}}, "neighborhoods": ["Chatham"], "latitude": 41.7433701, "longitude": -87.6322556, "rating": "3.5", "times": {"Mon": ["10:00 am", "8:00 pm"], "Thu": ["10:00 am", "8:00 pm"], "Sat": ["10:00 am", "8:00 pm"], "Wed": ["10:00 am", "8:00 pm"], "Tue": ["10:00 am", "8:00 pm"], "Sun": ["11:00 am", "6:00 pm"], "Fri": ["10:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Nail Salons", "othersalons"], ["Hair Extensions", "hair_extensions"], ["Eyelash Service", "eyelashservice"]], "address": ["8300 S Holland Rd"], "attributes": {"Parking": "Garage", "By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "category": "Beauty", "number_of_reviews": "17"}, "shultz-wings-and-hoage-chicago": {"comments": {"3": {"description": "Pretty decent hogie... for a former a&p location", "rating": "3", "date": [2011, 2, 24]}, "1": {"description": "This is one of these reviews that I thought I did a long time ago.I truly hate I don't live in the area anymore so I don't get to go as often.  Shultz has been around for awhile and the young lady who owns it is a beautiful soul...Her son does most if not all the cooking. Its been awhile since I went and got me an order of wings but when I do make it her and her son always seems to know who I am and gives me a big smile every time.When you say Jumbo wings they have some Jumbo wings that are always fried to perfection. I usually order 3 wings when it's just me and I can't eat it all that's how big the wings are. They are cooked to order so be prepared to wait a little but it is well worth it for sure.They do allow you to call in your order as well so that is another option if you are on the go.I would also say that each wing is about a dollar a piece but again when you see them and taste them you won't think that is a bad deal especially if you think about some of the competitors that give you hen wings.I like their mild sauce but I never have them add it to my chicken because it is on the sweet side and I like to be able too dictate how much I add to my chicken. They have run out of chicken a time of two and not because they didn't prepare but because they are so popular. We have gotten a couple of pans for a party and I know we aren't the only ones.You also receive bread with your order but it isn't just some white sliced bread IDK what type of bread it is but it is so good.They also serve some excellent Hogie sandwiches that is very flavorful.There shakes OMG are great made with real ice cream and it maybe its a good thing I don't live over there now because I use to get one at least once a week and instead of losing weight I would be gaining...lol I have no control when it comes to their shakes.If you are in the neighborhood you should give them a try you won't be disappointed.Enjoy!", "rating": "4", "date": [2014, 5, 27]}, "2": {"description": "This place has some delicious jumbo wings, which they make to order. I would call in your order to cut down some on the wait time. And this is not an establishment that you can eat inside.  I have to say i am glad I don't live closer to this restaurant because I would probably be in here at least a couple times a week. I haven't gotten to try much else that is on their menu because I can't move past the wings, lol. If you are ever in the area, I say go you won't be disappointed.  And the lady that owns it is very friendly and will always let you know what to do to make sure your chicken stays crispy and doesn't get soggy.", "rating": "5", "date": [2014, 5, 27]}, "0": {"description": "The food at Shultz is wonderful!! Mother is definitely friendly and likes to get things right. I haven't had a bad item off them menu yet. The wings are fresh & cooked to perfection. The Hogey sandwiches are great and meaty as well. It's a place that is a must on your list for South Side of Chicago. I live close by and have to restrict myself on how many visits....lbvs", "rating": "5", "date": [2014, 10, 4]}}, "latitude": 41.6924858, "neighborhoods": ["Roseland"], "categories": [["Restaurants", "restaurants"]], "address": ["107 E 111th Street"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Takes Reservations": "No", "Attire": "Casual", "Ambience": "Casual", "Good for Groups": "No", "Good for Kids": "Yes"}, "longitude": -87.6207352, "rating": "4.5", "price": "$", "number_of_reviews": "4"}, "cvs-pharmacy-chicago-59": {"comments": {"0": {"description": "I went here yesterday about 7:45 p.m. after work and a intense workout.  I was tired.  I needed to get a graduation card & this CVS was nearby.  I will say that I had a bad altercation with the security guard that worked there even BEFORE I entered the store but my rating is due to how the store handled the incident.  I pulled into the parking lot and saw a space that was near the handicapped sign but I saw no handicapped icon on the pavement so wasn't sure if it was or not. I certainly didn't want to park there if it was handicapped.  I saw this gentleman who was outside just looking around so I got his attention.  I wasn't sure whether or not he worked for the store.  I said \"Excuse me\" several times and then he finally came over to my car.  I simply asked \"do you work for the store\" and he nastily answered \"what's your question!\"  I was SHOCKED!  I told him \"I just asked a simple yes or no question, no need for you to get nasty.  So nevermind\".  He then went back inside the store. To be safe, I parked in another space.  With that treatment, I could have left but I didn't.  I noticed that the person who spoke to me so harshly was wearing a jacket that said \"security\" on the back.  So, I entered the store, to which the security guard said very friendly \"Welcome to CVS!\" to which I said \"Oh, now that I'm inside the store, you are going to be nice to me??\" He lied and said he didn't hear me asking a question to which I replied \"you wouldn't of answered me nastily if you didn't hear my question\".  I walked away, got my items and headed towards checkout. There were 2 people ringing up merchandise.  They both were extremely friendly.  As I was checking out, the one cashier asked me \"Is everything alright, I noticed that you had some words with our security guard.\"  He actually was ringing up another customer so I was impressed that he was concerned.  I told him what happened and he apologized for the incident.  What I didn't know is that the woman who was ringing up my items was actually the site supervisor.  When she heard what happened, she told me that she would handle the situation and let the appropriate people know.  Because of this, I definitely will be back.  I didn't have to voice my own complaint, they were concerned enough about me as a customer to inquire.  Excellent customer service.  I will be back and hopefully the security guard will have been addressed.", "rating": "4", "date": [2015, 5, 19]}}, "latitude": 41.706654, "neighborhoods": ["Roseland"], "categories": [["Drugstores", "drugstores"]], "address": ["745 W 103rd St"], "attributes": {"Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.642372, "category": "Shopping", "rating": "4.0", "price": "$$", "number_of_reviews": "1"}, "mcdonalds-chicago-165": {"comments": {"1": {"description": "Came in here for a meeting with a client since it was halfway between our respective locales. They had apparently just cleaned the whole place, which was odd, because rather than a \"DANGER WET FLOOR,\" it sort of reminded me of a swamp, as the floors and all of the surfaces were all equally moist. Not \"just-wiped-down\" moist, but rather, \"cleaned and left very damp by someone who wasn't quite sure how to use a wiping-mechanism.\"I guess the coffee was okay, but a couple of people during my 35 minutes there I overheard complaining about how they had skimped on ketchup packets. \"That's 95th,\" one gent said. Serious.", "rating": "2", "date": [2014, 10, 28]}, "0": {"description": "The food was fresh but customer service was poor. They took ten minutes for my order of McNuggets.", "rating": "3", "date": [2015, 6, 18]}}, "latitude": 41.7218849, "neighborhoods": ["Roseland"], "categories": [["Fast Food", "hotdogs"]], "address": ["36 W 95th St"], "attributes": {"Waiter Service": "No", "Take-out": "Yes", "Accepts Credit Cards": "Yes", "Good for Groups": "Yes", "Delivery": "No", "Noise Level": "Average", "Drive-Thru": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.6254125, "category": "Restaurants", "rating": "2.5", "price": "$", "number_of_reviews": "2"}, "maad-cuts-chicago": {"comments": {"1": {"description": "Good barber shop. They have four barbers who all can cut. The price is very reasonable ($15 for everything). I've never seen anyone walk out with a bad haircut. The service is good and they take walk-ins. The wait is never more than an hour and if so, they'll tell you when you can come back. Definitely recommended!", "rating": "4", "date": [2012, 2, 19]}, "0": {"description": "There's nothing like a barber shop where you can get a great cut and here some great conversation.  I suggest you check it out, especially coming from a New Yorker - Queens, the home of great cuts.", "rating": "5", "date": [2014, 10, 25]}}, "latitude": 41.6895294, "neighborhoods": ["Roseland", "Morgan Park"], "categories": [["Barbers", "barbers"]], "address": ["11255 S Halsted Street"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "No"}, "longitude": -87.6420288, "category": "Beauty", "rating": "4.5", "price": "$$", "number_of_reviews": "2"}, "see-thru-chinese-kitchen-chicago-6": {"comments": {"1": {"description": "Ordered delivery a total of three times here.  Never once did they get my order correct.  Most recently I ordered an item which they no longer make and instead of being informed of this over the phone they made a completely different substitution.  I called top confirm my suspicions which yielded a sheepish affirmation.  I wouldn't have minded if it was delicious.  And it didn't taste good.  Below average.  The beef had no flavor, overly battered, and the sauce was weak.I previously ordered a combination meal which was 10% protein and 90% onions.  I did not order onions and meat.  I did not like fishing for meat in a sauce floating onions.  Tasted ok.  Prior to that, years ago, the meal was ok but I cannot recall specifics.While I appreciate the option of delivery, if it is for food I didn't order which doesn't even taste good I will not return here for food again.  My first experience was good.  Second below average. This was terrible and I felt tricked.", "rating": "1", "date": [2016, 2, 20]}, "2": {"description": "This Chinese food is ok. We never had any problems with it. The shrimp fried rice is good and the lobster with shrimp sauce is ok too. The egg rolls that come with all meals are nasty. They taste like trash. There are also people always loitering outside of the restaurant door and the owners haven't bothered calling the police yet. Thugs and dread head Rasta 's smoke and talk right outside near the doors. If you want to risk getting robbed and if you want a quick bite come here", "rating": "2", "date": [2015, 4, 25]}, "0": {"description": "Look chinese food for the black man is extremely important to his diet secretly its up there with chicken and watermelon if in the area from 113th to 85th this place has the most consistent food it will always be good (not great but good) if you don't want to try a new place you can bet on them to come through for you consistency is what they do not let's talk about customer service great people when you call they take your order very quickly and respectfully but every now and then they don't pay attention and you end up with with something not spicy or drink that you didn't orderNow LET'S DISCUSS THEIR DELIVERY DRIVER THE REASON WHY I WAS TEMPTED TO SAY FU$% It I had to argue outside to get this dude to walk out side of his car and bring the food to my door like that's not his fu#%#%#$ job now if  this was a one time issue it would be cool but guess what it is not he curses in mandarin I guess he thinks I'm not an educated and don't speak it (surprise it's a smart black guy asshole) and he wonders why I don't tip his goofy ass now when the young guy comes it will be cool but i think he went to school so yall treat him with respect but all I can say is then that middle aged dude comes please try your best to not whoop his ass other than that enjoy", "rating": "3", "date": [2014, 12, 25]}}, "latitude": 41.7225202918053, "neighborhoods": ["Roseland"], "categories": [["Chinese", "chinese"]], "address": ["9440 S Lafayette Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Good for Groups": "Yes", "Delivery": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.62510843575, "category": "Restaurants", "rating": "2.0", "price": "$$", "number_of_reviews": "3"}, "khalil-food-and-liquors-chicago": {"comments": {"0": {"description": "Khalil is the typical liquor store. Liquor is cheap.", "rating": "4", "date": [2005, 11, 16]}}, "latitude": 41.70738, "neighborhoods": ["Roseland"], "categories": [["Beer, Wine & Spirits", "beer_and_wine"]], "address": ["146 W 103rd St"], "attributes": {"Bike Parking": "No"}, "longitude": -87.62776, "category": "Food", "rating": "4.0", "price": "$$", "number_of_reviews": "1"}, "bon-ton-family-dining-chicago": {"comments": {"3": {"description": "I never had a meal here but I had quite an experience with this place. My sister had her wedding reception here and I thought it was a cool place for her budget and the number of people she invited. We rented the space for $85/hour which was cool for my sister. The owners were outgoing and appeared friendly. However, there were a few things that turned me off. The booths were a little dusty or was chipping away and got on the back of my light colored jeans, leaving black spots for me to dust off. Also, behind the booths were mouse/insect traps. If I were eating at the time and saw that, I would have lost my appetite. Children were also present and could have easily picked those up. They were visible. I would only suggest wiping the booths and hiding the mouse/insect traps. Overall, I had an okay experience and I applaud you guys for maintaining and offering your service to the Roseland community. Would I visit you guys again? I just may  (:", "rating": "3", "date": [2015, 4, 1]}, "1": {"description": "Amazing customer service. The food was completely delicious. My boyfriend and I normally come up here for breakfast. We get the bacon, waffles w/powdered sugar, and the hashed browns. Pretty much everything you order from here is great.", "rating": "5", "date": [2015, 3, 31]}, "2": {"description": "Fresh blend of Greenwood, Mississippi home cooked flavor with solid Chicago, Illinois family styled wholesome and healthy for 30 years.  This Soul Food Lite is for the Good Life!", "rating": "5", "date": [2014, 8, 27]}, "5": {"description": "Sit-down dining in Roseland? What a pleasant surprise! Delicious food, pleasant atmosphere, very accommodating waitstaff. Ms. Wendy rocks! I had the salmon croquettes. Perfectly seasoned, good portions. Tasty! The meal included hashbrowns/rice or grits, eggs and toast or biscuits. The hubby had the daily special - 2 huge pancakes, egg and your choice of meat for less than 5 bucks. You can't beat that. All in all a great experience. We will be returning for dinner soon. They are also BYOB.", "rating": "4", "date": [2011, 1, 7]}, "6": {"description": "This spot is one of Roseland's well kept secrets. I didn't know that they were open yet and was just driving by and decided to give them a try. The young lady that took my order was so nice. I had the Salmon Croquette special (2 croquettes, 2 eggs, rice or has brown and biscuits or toast). It was DELICIOUS!!  That's alot of food for only $7.95!!!  The only bad thing is CASH ONLY, but that's ok.   I had been craving salmon croquettes for almost a month! I am a breakfast person and to know that they serve breakfast all day is a BLESSING!! Now that I know where to get them, this is going to be a regular thing for me. True the neighborhood isn't that greatest, but once you get inside you honestly forget where you are. It was such a nice, pleasant, friendly and clean atmosphere. Roseland needs more places like this.", "rating": "4", "date": [2011, 1, 31]}, "7": {"description": "This is my first time going here and I just bought some food to go and I just sampled a lil bit of spaghetti and greens and Omg (oh my goodness) Delish and everyone should go. This is a come up for the Roseland area BIG TIME!", "rating": "4", "date": [2011, 10, 22]}, "8": {"description": "Good food Pleasant Service. Thanks Wendy!", "rating": "4", "date": [2011, 3, 3]}, "0": {"description": "Delicious Steaks and Grilled Fish! Breakfast all Day. Have you very private event here also, best hand made turkey burgers in town.  Salmon croquettes. Greens, sweets,Mc n cheeze, amoung outher sides. Come check us out!", "rating": "5", "date": [2015, 9, 14]}, "4": {"description": "I really forgot what my girl and I had.But i do know it wasn't good.And the waitress had a bad attitude.Will never return.", "rating": "1", "date": [2013, 1, 22]}}, "neighborhoods": ["Roseland"], "latitude": 41.69569, "longitude": -87.621132, "rating": "4.0", "times": {"Mon": ["8:00 am", "3:00 pm"], "Thu": ["8:00 am", "6:00 pm"], "Sat": ["8:00 am", "6:00 pm"], "Wed": ["8:00 am", "6:00 pm"], "Tue": [], "Sun": ["9:00 am", "5:00 pm"], "Fri": ["8:00 am", "6:00 pm"]}, "price": "$$", "categories": [["Soul Food", "soulfood"], ["Breakfast & Brunch", "breakfast_brunch"]], "address": ["10914 S Michigan Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Takes Reservations": "Yes", "Good for Groups": "Yes", "Good For": "Breakfast, Lunch, Dinner"}, "category": "Restaurants", "number_of_reviews": "9"}, "sky-lake-chineses-kitchen-chicago": {"comments": {"3": {"description": "I order from the 103rd location. I like the fact you can see the entire kitchen. The food isn't the best but compared to other places in the area its way better. The potstickers are my favorite thing to order", "rating": "3", "date": [2014, 7, 6]}, "1": {"description": "The Chinese food is average at best .You would think how long they have u waiting , that the food would be really good.Every time I order from them I call in first.Wait 20 mins , get there and wait another 20 to 25 mins .....not worth it!!!", "rating": "2", "date": [2014, 8, 9]}, "2": {"description": "First and last time I will order from here,food is just nasty ! They made me wait over 1 hour for this nasty greasy food! Waste of time and money garbage!!!", "rating": "1", "date": [2015, 8, 29]}, "5": {"description": "Awful!  They have two locations and they know have one on 111th.  I ordered dinner for two.  Most of the food I could not even eat....going in the trash.  The fried rice is more sticky with a free green onions thrown in at the end.  The orange chicken...the batter is ok but the chicken taste horrible.  The egg foo young is actually good.  No need to go on.  Want chinese do not stop here.", "rating": "1", "date": [2010, 12, 11]}, "6": {"description": "Hmm.  I actually like this place. Fresh smoothies, savory shrimp w/lobster sauce, shrimp fried rice loaded with shrimp, and amazing chicken teriyaki strips. We're pleased every time we order.", "rating": "4", "date": [2012, 7, 3]}, "7": {"description": "i've been to the one on 111th across the street from work, and everytime i eat something from here i hate myself for making the wrong decision. their fried rice used to be decent and big portioned. now they are sold in much smaller boxes and the meat that they put in is very scarce. i ordered the beef fried rice and had a small piece of beef for every 6 spoonfuls of rice. weak. if i'm ever aching for 'bad for you' chinese food, i'll just order 3 chicken wings and a small white rice and call it a day.", "rating": "2", "date": [2012, 2, 19]}, "0": {"description": "I order from this place all the time. The food is decent compared to other Chinese restaurants in the area. Delivery can't take long at times but I'm fine with that.", "rating": "4", "date": [2014, 7, 24]}, "4": {"description": "Wow this was terrible a waste of almost $50.00, First i place the order by phone the guy taking the order repeats it back to me everything was correct. Once i arrived to the location on 103rd i was given a completely different order but didn't noticed until i got home, so i call them up and let them know... I go back and they make me wait 30more minutes finally i get my order when i get home the fries on the ribtips/fries combo were so stale and over cooked as well as very tough to chew, the ribtips i couldn't even eat i literally had to feed them to the dog as well as the bread on the combo smelled like it was moldy.... this is sad i blew so much money on food and couldn't even get a decent meal.Kinda dissapointed because i use to frequent this place regularly and usually they're good, but this time they have failed me.", "rating": "1", "date": [2012, 2, 11]}}, "neighborhoods": ["Roseland"], "latitude": 41.707428, "longitude": -87.623718, "rating": "2.5", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["11:00 am", "10:30 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["12:30 pm", "10:00 pm"], "Fri": ["11:00 am", "10:30 pm"]}, "price": "$", "categories": [["Chinese", "chinese"]], "address": ["2 W 103rd St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Loud", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "8"}, "walmart-express-chicago-8": {"comments": {"1": {"description": "Wal Mart opened its first express store in the Chatham neighborhood today and it was a very interesting experience because it's a scaled down version of the typical Wal Mart store. It's basically geared towards people getting the things they need such as toiletries for the house and food versus the Wal Mart store where you get anything and everything there. It's also situated in an area where it's needing accessable stores because not everyone owns a car and some are having to do their shopping trips on public transportation. I live about 10 minutes away from this store and it's convenient when I don't feel like shopping elsewhere and dealing with the crowds which is pretty common for Wal Mart. This location also has a pharmacy so you can get your prescriptions filled all while you do your shopping. As I was walking in two women in the parking lot sat around complaining about the store being there when I see it as it gives people a choice of where they want to shop. I shop at multiple stores for things one store may not have that one may have. I do have a problem with how they don't seem to have a policy in place enforce appearance nobody should be working where they have tattoos showing and one employee had teeth missing. As a working professional you would want to look your best when working and tattoos and missing teeth is hoodratish and just plain wrong. I do like how they provide a feedback box where if you want something in particular they will work to get it for you but they do stipulate that not all items may be available due items being seasonal, regulatory, and other restrictions. If you live within walking distance it's helpful because not everyone has cars to drive to Wal Mart and the closest one is in Evergreen Park for the south and southwest side of Chicago. Staff was friendly and working hard to accomodate the flow of customers that came through the doors. It was very organized and Chicago Police was present to ensure that public safety was an utmost priority. The store was clean and well stocked with mostly common items people buy from milk to toilet paper. Parking was not a problem and you could find a spot even though you had to walk a few steps. I will be shopping here again.", "rating": "4", "date": [2011, 7, 27]}, "0": {"description": "First time encountering a Wal-Mart of this sort. I'm not sure if its common in the city, but  i'm glad there is something like it! The express is fast and convient. It offers a variety of produce, food, snacks, toiletries, and whatnot. What i also like about this express is the fact that its opened pretty late. Its clean and organized. One thing that caught my attention though... is the price! I was a bit shocked to see their prices based on the fact that wal-mart tends to be cheaper. However when you factor in convenience, location, and items offered, I'd definitely be back!", "rating": "4", "date": [2013, 5, 11]}}, "latitude": 41.7434039711952, "neighborhoods": ["Roseland"], "categories": [["Convenience Stores", "convenience"]], "address": ["8301 S Holland Rd"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.6320365816355, "category": "Food", "rating": "4.0", "price": "$$", "number_of_reviews": "2"}, "nails-today-chicago": {"comments": {"1": {"description": "The owner BJ & his wife Cindy are so u professional! Some of the staff are not friendly and have very nasty attitudes! They are argumentative with the clients & I guess because the location is somewhat in the \"hood\" they feel like they can LACK professionalism!! Only a few of the employees smile at you. I have put up with the lack of professionalism because the quality of what I was getting done has been good for the PRICE.....that's it!! But enough is enough! I will never return there, I will not recommend anyone to go there and I will tell all of the people I know that go there not to go anymore! Their attitudes would be different if they were in evergreen park, oak lawn or other neighboring suburbs! After they are done being disrespectful they go off & start talking in their native language to one another when everyone speaks English! So You know they are talking about you!", "rating": "1", "date": [2016, 2, 4]}, "0": {"description": "A small neighborhood nail shop that's well worth it.  I've been coming to this nail shop since 2009.  Michelle, one of the nail techs, and B.J., the owner, are two of the best nail techs I've experienced (I haven't been able to find nor match the quality of service in even some of the most expensive places within the city and out of state).  It's a small and simple nail shop (nothing fancy and no fancy services), however, I routinely come ever two weeks when I'm not traveling.  Also, when Michelle isn't working, ask for her sister.  While all of the techs do an excellent job (all appear to have regulars who come in and request for them by name) she and her sister are the two I always get services from.", "rating": "5", "date": [2014, 6, 30]}}, "attributes": null, "neighborhoods": ["Washington Heights", "Brainerd"], "categories": [["Nail Salons", "othersalons"]], "address": ["1546 W 95th St"], "latitude": 41.7214249, "longitude": -87.6612099, "category": "Beauty", "rating": "3.0", "price": "$", "number_of_reviews": "2"}, "jacks-wings-and-sandwiches-chicago-2": {"comments": {"3": {"description": "I simply love this place! Their super taco dinner is absolutely delicious!!! Every time I stop there my order is perfect and my food is piping hot!!  This is my favorite fast food neighborhood joynt!!!", "rating": "5", "date": [2012, 6, 9]}, "1": {"description": "I always order from here. They're food is just so delicious. I love their buffalo wings, cheeseburgers, and so much more. They have good customer service but sometimes they can't deliver to you. Nonetheless it's still a great place for good food", "rating": "5", "date": [2015, 3, 31]}, "2": {"description": "By fast food standards, tis place is pretty awesome and impressively clean every visit. Have tried the wings, chicken pita, gyros, polish, fried fish and have never been disappointed. Had a polish today based on precious reviews. It was perfect!!! Each bite had the perfect balance of perfectly cooked polish, grilled onions, jalapeño and mustard. May return tonight for another. Lbvs", "rating": "4", "date": [2013, 7, 5]}, "5": {"description": "when the cafeteria at the hospital is closed on the weekends, this is a nice, very affordable option. the wings are fine, gyros are good, and i am a fan of the footlong polish. they may take a little while to prepare the food, but that's expected since it's made right when you order it. they have daily specials, and if you're in the area this is likely your best choice when you consider quality and price", "rating": "3", "date": [2012, 2, 19]}, "0": {"description": "Just ate at Jacks, my corn beef was hot, fresh and the customer servivce was great. Will eat there more often.", "rating": "5", "date": [2015, 10, 14]}, "4": {"description": "This place seems to be wing-focused, and you can order hot and fried wings in huge quantities, but their menu has pretty standard Chicago food features that you'd find at places that do Italian beef, polish sausage, hot dogs, burgers, gyros, etc. Everything is made fresh and you get big portions. Great service with friendly staff. The dining area has unexpectedly comfortable window stools on a bar setup. Everything looks really clean and polished for a \"fast food\" place (nice granite counters), with a pretty visible and open kitchen area. The gyro sandwiches are HUGE, hot, full of onions, tomato, and really good tzatziki sauce. I can usually get 2 meals out of one sandwich. The polishes are big and smoky, with hot peppers, onions, and mustard. Crispy hot crinkle fries come with sandwiches. Prices are pretty reasonable. Great place.", "rating": "4", "date": [2009, 6, 20]}}, "neighborhoods": ["Roseland"], "latitude": 41.69281, "longitude": -87.626022, "rating": "4.5", "times": {"Mon": ["10:00 am", "11:00 pm"], "Thu": ["10:00 am", "11:00 pm"], "Sat": ["10:00 am", "12:00 pm"], "Wed": ["10:00 am", "11:00 pm"], "Tue": ["10:00 am", "11:00 pm"], "Sun": ["11:00 am", "10:00 pm"], "Fri": ["10:00 am", "12:00 pm"]}, "price": "$", "categories": [["Fast Food", "hotdogs"], ["Sandwiches", "sandwiches"]], "address": ["100 W 111th St"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Good For": "Lunch", "Attire": "Casual", "Ambience": "Casual", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Drive-Thru": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "6"}, "sarafina-hair-braiding-chicago-2": {"comments": {"0": {"description": "First off if you are reading this do not purchase the voucher deal it is a scam!!!! I went to get my hair braided it was my second time going. The first experience was okay, the lady that braided my hair was really fast so I decided to give it another try. Well this particular time I purchased the voucher deal from Yelp for $200.00. I told the lady before she even started braiding my hair that I had it. Needless to say when she was done I told her I had it again, she told me that she was not accepting it and she had informed Yelp to take it down and I should have called her first before purchasing.. Okay so I gave her my card to run and the CC machine was not even plugged up. So I told her I would leave my Driver's License and go to the ATM. She made it seem like I was going to run off and told me the other hair braider would  take me. My fiancé  who was waiting outside, ended up going to the bank. After all of this I go outside to get the money and the lady comes outside with my bag telling me I didn't have to come back in, which left my fiancé and I baffled as to why she felt it necessary to stop braiding someones hair to come outside. Yeah I'm never going back to this shop. Be more professional in the future!  Yelp refunded my money today", "rating": "2", "date": [2015, 3, 24]}}, "neighborhoods": ["Roseland", "Morgan Park"], "latitude": 41.6895110160112, "longitude": -87.6421505212784, "rating": "2.0", "times": {"Mon": ["9:00 am", "5:00 pm"], "Thu": [], "Sat": [], "Wed": [], "Tue": [], "Sun": [], "Fri": []}, "price": "$$", "categories": [["Hair Salons", "hair"]], "address": ["11257 S Halsted St"], "attributes": {"By Appointment Only": "No", "Bike Parking": "No", "Good for Kids": "No"}, "category": "Beauty", "number_of_reviews": "1"}, "brian-keiths-grooming-lounge-chicago": {"comments": {"3": {"description": "They have a stylist named Mr. Young and he really knows haircare and how to grow hair. I got soo many compliments. You must let him create for you.", "rating": "5", "date": [2016, 2, 26]}, "1": {"description": "I've had wonderful experiences visiting BKGL. My sons and I patron this cool and relaxed barber shop whenever we need a cut. Bear and Vino (Brian & Alvin) are excellent in managing this classic establishment.", "rating": "5", "date": [2016, 2, 24]}, "2": {"description": "Just my second visit.  I get a great style by Al Young III, comedy and customer service.  I'll be back.", "rating": "5", "date": [2016, 2, 27]}, "5": {"description": "Love coming here! Alvin and now Al have taken great care of my coif! I'm a woman who is quite persnickety about her haircut and they put up with my demands in a humorous and loving way! It's a plus that as a woman I am ALWAYS treated with the utmost respect when I'm there. Excellent Barbers!", "rating": "5", "date": [2016, 2, 29]}, "0": {"description": "This is the only place I get groomed. BKGL is a wonder place! The professional staff the atmosphere and the best grooming in Chicago! This is the only place my son and I come to get cleaned up! I highly recommend BKGL! Brian, Alvin, AY3, Anthony, Dre' and Corey all these gentlemen SLAY!!! Make your appointment TODAY...Get Groomed!!!", "rating": "5", "date": [2016, 2, 27]}, "4": {"description": "Excellent service. I love getting my haircut there, the staff is amazing, and not to mention the free snacks while waiting to get a haircut. Two thumbs up!!!", "rating": "5", "date": [2016, 2, 26]}}, "neighborhoods": ["Roseland"], "latitude": 41.7068033273336, "longitude": -87.6387820020318, "rating": "5.0", "times": {"Mon": ["9:30 am", "7:00 pm"], "Thu": ["9:30 am", "7:00 pm"], "Sat": ["9:00 am", "8:00 pm"], "Wed": ["9:30 am", "7:00 pm"], "Tue": ["9:30 am", "7:00 pm"], "Sun": [], "Fri": ["9:30 am", "7:00 pm"]}, "price": "$$", "categories": [["Barbers", "barbers"]], "address": ["617 W 103rd St"], "attributes": {"By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No"}, "category": "Beauty", "number_of_reviews": "6"}}