{"sleepys-chicago-12": {"comments": {"3": {"description": "Amadoo is great, he was very helpful and not pushy at all. I had a very good experience at sleepy's.", "rating": "5", "date": [2015, 5, 6]}, "1": {"description": "Darrel was so good to us. Came in for a mattress. Gave us a good deal. He was awesome. Thanks for the help. I recommend this sleepys. Very nice people to deal with.", "rating": "5", "date": [2015, 8, 30]}, "2": {"description": "Great experience @ Sleepy's. Outstanding service provided by Darrell Abernathy. Went to 2 other places 1st and felt like I was being sold a used car. He was knowledgeable, personable, and very helpful.", "rating": "5", "date": [2015, 9, 26]}, "9": {"description": "A good friend recommended Sleepy's for a great mattress. I am so glad that I listened to her. I walked in and was greeted by the lovely Karen. She made the experience a blast. I was laughing the entire time. She made me feel like a friend and not like a sale. She was attentive to what I was looking for and also taught me some interesting things about my sleeping patterns. Karen made finding a new mattress a fun experience. I appreciated all her help and can't wait to  get my new bed all set up.", "rating": "5", "date": [2014, 12, 29]}, "10": {"description": "Simply put, Paul was amazing! Amazing enough that I decided to fill out this form and add the recently opened store to Yelp. Don't want to read the details? Skip to the summary and head to Sleepy's!!I moved to Chicago from California with an apartment lined up, but no furniture. I figured the RoomPlace / the MattressPlace on Cicero would be a great option to get  a mattress quickly as they were advertising a sale, The place was clean and had a nice set-up, but the salesmen were aggressive and oozed shady. They refused to negotiate until they realized that though I flew in that morning, I wasn't born that morning. When they provided me with their 'best' price, I told them I would check out the surrounding shops to compare. The cocky salesman informed me that I would be back. The other shops I tried on Cicero aren't worth mentioning. They simply lacked quality. Then I stumbled into Sleepy's as a last resort before heading back to the shady salesman at the RoomPlace. Paul greeted me at the door and was professional yet personable. He was a true gentleman and gave honest feedback on the pros and cons of each mattress. I was thoroughly impressed with his knowledge. As opposed to trying to wheel and deal he simply let the facts speak for themselves. I found a mattress I liked and wanted to compare it to the one down the block at the RoomPlace. Paul understood me wanting a peace of mind and off I went to sit on the other bed. The shady salesman was quite smug and hovered as I sat on the bed trying to get a feel. I noticed that their pillow top bottomed out and my decision was made. I went back to Sleepy's where I received better service & a higher quality. Paul quickly checked me out and the delivery was accurate and smooth for an amazing price!Summary: Mistake = going to the RoomPlace / the MattressPlace. Another Mistake = checking out the other small shops around. BEST DECISION EVER = going to Sleepy's and working with Paul. Make your next move your best & head to Sleepy's!!!", "rating": "5", "date": [2013, 8, 16]}, "4": {"description": "Terence was very knowledgeable and helpful, and not at all pushy.  He guided us to the best bed for us and made for a very pleasant buying experience. We feel like we got a great deal, and would recommend Terence and this store location to anyone.", "rating": "5", "date": [2015, 6, 13]}, "6": {"description": "Such a disappointment!  I came here on Black Friday because I've been putting off getting  a new mattress for awhile.  Apparently everyone else decided to was time to buy a new mattress too because it was crowded.  Whatever, it was black Friday, I can handle this.  The sales guy said hello to me when I walked in but wasn't able to help me.  I was surprised they only had two people working!  I figured this couldn't be too hard, they're beds I can just look around and figure this out myself.  Wrong.  This could be the case if I needed a bed that has twenty positions, a remote, and built in coffee maker.  I just need a regular bed but apparently those are hidden in a different part of the store because I couldn't find them.  Without anyone to help me I was sick of waiting and decided to leave.  Bummer.  No bed for me.", "rating": "1", "date": [2014, 11, 28]}, "11": {"description": "Had such a great experience! Karen is an awesome Sleepy's Professional! Can't wait for my delivery!", "rating": "5", "date": [2015, 2, 15]}, "5": {"description": "Darrell was very professional/helpful & was able to answer all of my questions.  I haven't had the mattress long, but so far I'm very satisfied..", "rating": "5", "date": [2015, 4, 22]}, "7": {"description": "Myself and my husband finally conceded we needed a new mattress - not something either of us wanted the hassle of doing.  We walked into Sleepys as it was first on our list of stores to hit. We were unsure want we wanted but Darrell helped us on our quest. He was friendly, funny, informative and talked us through options.  He made the whole experience easy and gave us a great package deal on the set we wanted and we took it.  I cant recommend Darrell enough he is an asset to Sleepys!!!", "rating": "5", "date": [2015, 9, 1]}, "8": {"description": "The sales man Darrell was very professional, eager to help and went out if his way to help us. The man knows what he's doing!", "rating": "5", "date": [2015, 6, 13]}, "0": {"description": "My husband and I walked out of Sleepy's with a sense of piece knowing that we picked the right place to pick our long over due mattresses. Darrell was very helpful and kind and made sure we were pleased. We were very well taken care of, and Darrell definitely knew how to deal with us as his customers. He gave us the space that we needed to discuss what we can afford to make a decision on our purchase. And let's not forget, we got a free 2 night stay at a hotel with our purchase. Sleepy's was going to be one of others to shop for mattresses and compare prices, but after being guaranteed with a price match we cold not refuse. Very pleased with his services!!!", "rating": "5", "date": [2016, 2, 16]}}, "latitude": 41.7451836168766, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Mattresses", "mattresses"], ["Home Decor", "homedecor"], ["Furniture Stores", "furniture"]], "address": ["8117 S Cicero Ave"], "attributes": {"Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.7411629259586, "times": {"Mon": ["10:00 am", "9:00 pm"], "Thu": ["10:00 am", "9:00 pm"], "Sat": ["10:00 am", "9:00 pm"], "Wed": ["10:00 am", "9:00 pm"], "Tue": ["10:00 am", "9:00 pm"], "Sun": ["11:00 am", "7:00 pm"], "Fri": ["10:00 am", "9:00 pm"]}, "rating": "4.5", "price": "$$", "number_of_reviews": "12"}, "southwest-book-and-video-chicago": {"comments": {"3": {"description": "An institution in the area.  Obviously, you can find much bigger stores if you are willing to drive 30 minutes, but for being 5 minutes away, not a bad store at all.  I like the little layout of, \"Fun and non-offensive in the front of the store, raunchy in the backroom.\" It's far less intimidating that way instead of a burly bouncer asking for an ID at the door as he sits next to the hardcore raunch.  My only complaint is the pricing.  I'm well aware of the cost of smut, but really, with the internet entertainment being free and convenient, 40 bucks for a dvd seems pretty high.", "rating": "4", "date": [2010, 9, 2]}, "1": {"description": "One of my favorite store to shop for my vibrators. I am a single girl so I have to keep myself occupied lol.", "rating": "5", "date": [2015, 1, 15]}, "2": {"description": "Me and my boyfriend came here to purchase a new toy to spice things up. We found one that we liked and the lady took it out of the package to turn it on and show us it had different levels of vibration but she did not hand us the toy to personally check it out ourselves. We decided to check out and when we got home I went to turn it on and within about 10 seconds it died. I opened the bottom to change the batteries and it had cum scum in it. Literally dried up flaking off hard old cum in the bottom part that you screw on. Then I noticed the black string that is connected to it was all filthy... I have never in my life been so grossed out. Then come to find out a friend of mine has done a return there! If you flirt with the girls and you're cute they will take your items back! This is fucking disgusting and I will never step foot in that shit hole again!", "rating": "1", "date": [2015, 4, 8]}, "5": {"description": "Looking for something creative to do at 4am when you are feeling lonely and depraved?  Check out the selection of adult book, movies, toys and general collection of pornographic material found here.  Not your typical movie/smut house, for it's actually really clean, and there are no creepy guys (or girls) just hanging about looking to pick someone up.  And the best part, you can go whenever you feel the need.  It is open 365 days a year, 24 hours a day.   Holidays included.", "rating": "5", "date": [2007, 1, 17]}, "0": {"description": "This is the first adult store I've ever been to, so needless to say, I was a bit apprehensive. However, when I walked in, it looked more like a gift store than a sex shop. The nice girl behind the counter was very welcoming and guided us to a back room with all the toys and videos one could ever want.  Amazing things about this place are:1) the prices ( everything is soooooo cheap)2) selection- they have lots of things for all types of people3) \"the girl behind the counter\" was nice enough to give suggestions while not trying to sell you the most expensive item.You can have a conversation with a knowledgeable salesperson about adult toys just as easy as asking about batteries at Radioshack.  Love this place!Diverse clientele too!", "rating": "4", "date": [2010, 1, 16]}, "4": {"description": "The last time I was in this joint was about five years ago, my driver's license that allowed me smokes and porn. So where did I go? Here.Classy? nope. When I first entered a gigantic phallic object was pointed my way; a sign of things to come. The place is clean, not many customers in the day time. Decent selection, though I must add, I can't compare it to much. Absolutely more than any 7-11. Anyway, they offer the typical gag gifts as well as clothing and videos. Location's pretty tricky. Basically, you're on a hope and a prayer to go southbound on Cicero from 4pm-6pm.Open everyday, all day.", "rating": "3", "date": [2007, 10, 25]}}, "neighborhoods": ["Scottsdale", "Ashburn"], "latitude": 41.7520405, "longitude": -87.7412726, "rating": "3.5", "times": {"Mon": [], "Thu": [], "Sat": [], "Wed": [], "Tue": [], "Sun": [], "Fri": []}, "price": "$$", "categories": [["Lingerie", "lingerie"], ["Adult", "adult"], ["Bookstores", "bookstores"]], "address": ["7733 Cicero Ave"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "No", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "6"}, "gfs-burbank": {"comments": {"0": {"description": "This place is excellent if you're planning on hosting a big party.  They sell most things (napkins, plates, cookies, pretty much everything) in bulk.  It's nice because you don't need a membership and their prices are reasonable.", "rating": "5", "date": [2014, 6, 16]}}, "neighborhoods": ["Scottsdale", "Ashburn"], "latitude": 41.7446538805962, "longitude": -87.7412621676922, "rating": "5.0", "times": {"Mon": ["7:00 am", "8:00 pm"], "Thu": ["7:00 am", "8:00 pm"], "Sat": ["7:00 am", "8:00 pm"], "Wed": ["7:00 am", "8:00 pm"], "Tue": ["7:00 am", "8:00 pm"], "Sun": ["12:00 pm", "5:00 pm"], "Fri": ["7:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Grocery", "grocery"]], "address": ["8146 S Cicero"], "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "1"}, "taqueria-el-taco-to-go-chicago": {"comments": {"3": {"description": "It seems they do not pay attention on taking orders at all. Five times I had to reorder because they kept making mistakes. Either they brought me my burrito with sour cream when I didn't ask for, or brought it with chicken instead of steak, or brought the wrong drink. I was fed up with it that I just left without any regards to let them rectify themselves. Never again should I step foot into here. Disaster of a business. Should have read the reviews on here prior to going.", "rating": "1", "date": [2011, 10, 13]}, "1": {"description": "My father and I went here for lunch a couple years ago and we soon realized it was a big mistake. First of all, the tacos here are literally about the size of the palm of your hand. Second, the meat in the tacos was burnt to the point where it didn't even taste like meat anymore. And third, the price of the food is bs, for the same price I can get a real taco and a very good tasting one at Paco's Tacos (which is located on 60-something Pulaski. In conclusion, I don't really recommend this place to anyone, unless you like burnt meat.", "rating": "2", "date": [2014, 2, 21]}, "2": {"description": "I also don't understand the one star reviews unless someone got burned here.  I've been going to this place scores of times since it opened (the site used to be a Jr's hot dogs in the 80s).   I've never had a bad experience.  The food is fresh and cooked in front of you.  The staff is friendly.  The food is tasty.  The meat is not rubbery.  The selection is good. The horchata is flavourful.    The salsa is top 10 in the area.  What more do you want?  This place is very good, even with all the other options on the So side.", "rating": "4", "date": [2013, 7, 11]}, "0": {"description": "Aww man...I thought this would be my first \"first\" review, if that makes sense..Probably not.Also, I'm not hispanic but, Taqueria el Taco makes no sense to me, \"taco reastaurant the taco?\" plus the addition of English \"To Go\" ?? I'm at a loss for words here..Anyway,  I've gotten delivery from this place a couple times because its near the hospital where I'm at.1st time: \"holy crap, they have a TWO FOOT burrito? Let's get that\"  About 5 pounds of steak and beans, not much else, but hey, it didn't give me or my burrito partner diarrhea so thumbs up with that experience2nd time: TETTG: \"Sorry we're closed\"Me: \"Really? because your take out menu says you're open till 10\"TETTG: \"We're closing early.  Sorry its been really hard because of the economy\"Me: \"Really? Because We're about to PAY you for food\"TETTG: \"Hold on let me talk to my manager... ok, we'll take your order\"We get the order and everything is TERRIBLE, slopped together, soggy mess, tasted badI DIDN'T FINISH MY FOODI ALWAYS FINISH MEXICAN FOOD!So I dunno, we kinda feel bad for the place and some of our staff has liked the food from there, but it was just horrendous that one time, so I can't give them Yelp Love.Sorry TETTG", "rating": "2", "date": [2009, 8, 26]}, "4": {"description": "Wow one reviewer out of five loves this dump and he gets all whiny, OK so maybe you're not a liar but instead a person with horrible taste in Mexican food.", "rating": "1", "date": [2012, 4, 27]}}, "latitude": 41.740818, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Mexican", "mexican"]], "address": ["8346 S Pulaski Rd"], "attributes": {"Attire": "Casual", "Waiter Service": "No", "Take-out": "Yes", "Wheelchair Accessible": "No", "Accepts Credit Cards": "Yes", "Good for Groups": "No", "Outdoor Seating": "Yes", "Delivery": "Yes", "Good for Kids": "No", "Takes Reservations": "No"}, "longitude": -87.722023, "category": "Restaurants", "rating": "2.0", "price": "$$", "number_of_reviews": "5"}, "los-taquitos-el-pilon-burbank": {"comments": {"1": {"description": "Had this place once. Ordered 3 burritos, first they didn't have regular sized tortillas for them.. Alright not too big of a deal. I had literally given them list of what we wanted on the burritos. I get home literally not one of them has anything that we asked for. I return and explain that none of the burritos were prepared right and then one of the cashiers there has a real crappy attitude that I was complaining that nothing in my order was correct. The bummer is I can walk to this restaurant from my house but after the hassle I had on my first visit I'll never return.", "rating": "1", "date": [2011, 10, 29]}, "0": {"description": "The joint is fairly small however the food is fresh and home made and the service has been great! This little joint has great \"salsas\" which is hard to find in Mexican restaurants and the \"Agua Frescas\" are also great! I highly recommend checking this place out.", "rating": "5", "date": [2011, 5, 24]}}, "latitude": 41.7377465218306, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Mexican", "mexican"]], "address": ["8508 S Cicero Ave"], "attributes": {"Wi-Fi": "No"}, "longitude": -87.741010710597, "category": "Restaurants", "rating": "3.0", "price": "$$", "number_of_reviews": "2"}, "little-caesars-pizza-chicago-17": {"comments": {"1": {"description": "Service here is horrible. The employees are extremely rude and roll their eyes at you.", "rating": "1", "date": [2015, 3, 22]}, "0": {"description": "Hot and ready? No.  Pizza was hot but not ready.  We had to wait for it to be made.  I was surprised because it was around dinnertime and figured they would plan ahead.  Whatever, can't beat it for $5.", "rating": "3", "date": [2014, 11, 25]}}, "latitude": 41.7479503154755, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Pizza", "pizza"]], "address": ["7963 S Cicero Ave"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Takes Reservations": "No", "Good for Groups": "No", "Outdoor Seating": "Yes", "Delivery": "No", "Good for Kids": "No", "Has TV": "No"}, "longitude": -87.7412614971399, "category": "Restaurants", "rating": "2.0", "price": "$", "number_of_reviews": "2"}, "fajitas-mexican-restaurant-burbank": {"comments": {"1": {"description": "Good Food.", "rating": "4", "date": [2016, 2, 10]}, "9": {"description": "This is one of the worst Mexican Restaurant places I have ever went too and I don't say that to be mean but because it is a fact!If you check the reviews from this place many are from 2010 and 2011 and we all know that a Restaurant can go downhill if management changes or cooks!We sat down and was greeted by the cashier/waitress who placed two bottles of salsa and chips!  Yes you read right bottles, are you telling me that as a customer who is sitting down to dine we can't get at least some fresh salsa in a bowl so that we can dip our chips instead of squirt the pre-made salsa that has been sitting in a bottle for who knows how long.After we places our order we were given some tomato soup with noodles that was very bland so we squeezed some lime in it a tip we got from Cesar's and that helped give it a bit of a zing to an other wise lack luster cup of soup.My friend ordered the Burrito what was funny to us is that the picture displayed rice and beans with the Burrito we were quickly told that was just a picture and if we wanted the rice and beans that would be extra!  Now that is not on the menu where the Burrito actually is but they do have it in the inside of the menu.They need new menus because I want to look at a picture just to be told that isn't what I get and if it is true then mark it some place so that I know right off the back!When the platter came out it had a pretty good looking Burrito on it(looks can be deceiving) some dry day old looking rice and beans!  The steak was flavorless and fatty the best thing about the Burrito was the tortilla it was wrapped because it wasn't what was in the Burrito. My friend ate most of her fussing the entire time lol, saying they better be glad she hadn't ate all day but the food really didn't agree with her she was feeling sick by the time she got home that night!I ordered the steak taco salad again the presentation was amazing I couldn't wait to dive right into my dish and all I got was a disappointing heap of unappetizing mess.  I ended up just eating around the salad and tossing the rest away.  I couldn't even force myself to eat that unappetizing meal!I was also disappointed that with the Groupon you only order non-alcoholic drinks which although they weren't that expensive it left us scrambling for other things to purchase.The Groupon is also for dine-in onlySo, my friend got the rice water I believe it was called and she said it was good!I got an avocado it was fresh and a sprite that was the only thing that was eatable in my opinion.My warning to people is this before you buy any Groupon and you check the reviews make sure they are recent otherwise you maybe sorely disappointed as we were from the Fajita Mexican Restaurant who shouldn't say they are authentic!Yuck!", "rating": "1", "date": [2012, 11, 19]}, "23": {"description": "This place has great mexican food, I kinda miss the beef stand that was here before but glad to see someone invested in this neighborhood and opened another food joint, burritos, tacos and fajitas are all great, prices are really good too for the quality of food you get.", "rating": "4", "date": [2009, 5, 3]}, "12": {"description": "I just saw someone's review stating that they are selling Restaurant.com coupons but not honoring them because of new management. I want to stress how they really don't like coupons! The waitresses seems angrier than normal when you tell them you have a coupon, (I have bought Groupons a couple of times) and they will go on to give you the rules: 1. Does not include alcohol (which I was not ordering because I had children with me). 2. Cannot be used with any specials, (which means if you are ordering any special, you cannot use the coupon, or you have to pay full price for your item, weather or not you are spending the required amount besides the special!) and most of all they want you know 3. Tips are not included and you should be paying a tip based on the full amount BEFORE the coupon. I am normally a good tipper when I get good service, but I don't appreciate being barked at by the staff. If they don't like the coupons, stop selling them! Like I said previously, I have not, and will not be back!", "rating": "1", "date": [2014, 4, 12]}, "21": {"description": "I tried this place after getting a good deal through restaurant.comWe got there on a Friday evening about 7PM and there were a handful of people there so we were seated right away. Here's what we had:Chips and Salsa (complimentary): salsa could have been spicierFideo soup (complimentary): good tasteHorchata: perfect not too sweet, not too watery, not too thickCoke in a glass bottle: ahhhh! no comment necessary I thinkFish Taco dinner: awesome tilapia tacos with cabbage on top, rice and beansSteak Fajitas: I didn't try this but they looked an smelled deliciousChicken taco: a lot of chicken! nice and softTres leches cake: just good...nothing I hadn't tastedThe portions are huge, and the tacos are overstuffed with the meat choice as well as the fajitas. The waitress was very nice and patient when my little rascal decided to wander around the restaurant. Decor is nice and plasma TV. I'd definately go back for those fish tacos, not too many places you can find these.", "rating": "5", "date": [2011, 2, 3]}, "16": {"description": "My wife and I love this place. The food has always been awesome and the prices can not be beat. The Good: The food. I love the Carne Asada dinner (which is on special on Saturdays). I could eat it once a week. The rice and beans are also very good. My wife loves the Taco Salad, which she substitutes the rice for meat. The soup they provide for you at no cost is also very good. The prices are very good as well. These days it is close to impossible to get a good diner for 2 for under 20$ and this place breaks that rule. The Bad: No liquor license. The only thing that makes a great Mexican diner better is a Margarita. Best Mexican food in the area. Try it, you will not be disappointed.", "rating": "5", "date": [2010, 5, 11]}, "17": {"description": "I tried this place after getting a good deal through restaurant.comWe got there on a Friday evening about 7PM and there were a handful of people there so we were seated right away. Here's what we had:Chips and Salsa (complimentary): salsa could have been spicierFideo soup (complimentary): good tasteHorchata: perfect not too sweet, not too watery, not too thickCoke in a glass bottle: ahhhh! no comment necessary I thinkFish Taco dinner: awesome tilapia tacos with cabbage on top, rice and beansSteak Fajitas: I didn't try this but they looked an smelled deliciousChicken taco: a lot of chicken! nice and softTres leches cake: just good...nothing I hadn't tastedThe portions are huge, and the tacos are overstuffed with the meat choice as well as the fajitas. The waitress was very nice and patient when my little rascal decided to wander around the restaurant. Decor is nice and plasma TV. I'd definately go back for those fish tacos, not too many places you can find these.", "rating": "5", "date": [2011, 2, 3]}, "10": {"description": "Absolute worst service and management I've ever seen.  Mind you, this was 6 months ago and I'm just now getting around to the review.  The manager actually had the gall to sit at a table, serve his family food and drinks while the rest of us patrons sat around hungry and thirtsty, watching all this, because the only poor waitress there was so busy taking tables AND answering the phone.  It was to the point where all us PAYING customers started conversing with one another loudly about what a joke the place was. He could of cared less as long as his darling wife had her margarita.  BTW, we ordered queso fundido...what a joke unless you like cheese globs that resemble brains.", "rating": "1", "date": [2014, 6, 11]}, "5": {"description": "I love it! My last day for a Groupon so I came with the partner at around 8:45 (they close at 10). I asked the young lady if these are the same owners from a few years ago and she said no. The place obviously changed due to it not being a \"fast food\" order and sit type of restaurant that it was a few years ago. My partner use to frequent the place since he worked not far from here. He also stated that the ambieance seems to of changed also. Newer Mexican looking and very authentic furniture, art and all together I had the Caldo de Res (Beef soup) and can I just add that the vegetables in this soup were giant! They also give you a small sampling of their homemade caldo de conchas (shell shaped soup) I still ate it!The food was really good and considering I thought I would'nt like it due to some reviews (and this is why I don't read reviews until after I try a place), I was really quite pleased. This is defintely super real (not authentic) Mexican food at its near best. Tortillas may not have been home made, but the food hit hard and just stood out. I also had a Corona (regualr sized) for $1.99 since it seems they have drink specials at any given time. See their menu's.All in all, Iam also happy that they have gift certificates available. $40 for $50 worth of food? Awesome. They also have smaller denominations. Oh and it  did not matter if liquor isn['t used with groupon since out of pocket after Groupon was used, I only paid $4.56 for dinner for two and take out of large concha soup!", "rating": "4", "date": [2013, 5, 1]}, "11": {"description": "Good food...the huevos rancheros weren't spicy enough and had too much pepper.  I would still recommend this place and I will be back. By the way,  the horchata was delicious.", "rating": "4", "date": [2013, 12, 30]}, "22": {"description": "My wife and I love this place. The food has always been awesome and the prices can not be beat. The Good: The food. I love the Carne Asada dinner (which is on special on Saturdays). I could eat it once a week. The rice and beans are also very good. My wife loves the Taco Salad, which she substitutes the rice for meat. The soup they provide for you at no cost is also very good. The prices are very good as well. These days it is close to impossible to get a good diner for 2 for under 20$ and this place breaks that rule. The Bad: No liquor license. The only thing that makes a great Mexican diner better is a Margarita. Best Mexican food in the area. Try it, you will not be disappointed.", "rating": "5", "date": [2010, 5, 11]}, "0": {"description": "Groupon : Pros ample parking , friendly waitress , Burritos descent enough meat but somewhat bland , beans and rice pretty good , margarita was good  fried pork taste like chitterlings , fair chips and gauc was bland . Worth the trip if you can get a Groupon", "rating": "3", "date": [2015, 11, 13]}, "20": {"description": "Best Mexican restaurant in the area... and I've tried most of them since I moved to Oak Lawn 5 years ago. Friendly staff, reasonable prices, and great food. Highly recommended.", "rating": "4", "date": [2011, 3, 24]}, "19": {"description": "Best Mexican restaurant in the area... and I've tried most of them since I moved to Oak Lawn 5 years ago. Friendly staff, reasonable prices, and great food. Highly recommended.", "rating": "4", "date": [2011, 3, 24]}, "2": {"description": "This hidden gem on 86 st and Cicero ave Is a very well-kept secret. They have the best Pozole every day of the week. On the weekends they make in my opinion the best menudo in Chicagoland. It's meaty and has a whole palate pleasing taste. They also make shrimp soup which will be my next purchase. Prices are reasonable and the eat-in part of their restaurant is clean and inviting. Try it for yourself. You won't be disappointed!!!", "rating": "5", "date": [2016, 1, 17]}, "18": {"description": "Don't know what happened. It used to be great but I think there is new owners. Lucky Burrito is much better.", "rating": "2", "date": [2012, 9, 30]}, "13": {"description": "Ok, it was Mexican food.  Nothing knocked our socks off.  The food was hot and fresh.  I ordered the chicken burrito dinner and my wife got the chicken enchilada dinner.  We drank horchata and everything was delicious.However, we were most impressed with how nice the staff was.  The servers weren't trying to be nice because they knew it was appropriate, or working on a generous tip, they simply seemed like genuinely pleasant people.  This made the food taste even better.", "rating": "4", "date": [2013, 4, 7]}, "4": {"description": "Ok, so I've driven by this place with the burnt out sign a million times and finally decided to try it when I saw they were on groupon.  If you don't have a groupon, don't waste your time.  First of all they bring you chips but no salsa.  Salsa is extra.  What?!  They did bring you soup that was pretty good.  I ordered chicken tacos and my boyfriend had steak fajitas.  I was impressed at how much rice and beans they gave you.  However, the actual entrees were disappointing.  First of all, I don't particularly like spicy foods and this was too bland for me.  There was just no taste to it.  My boyfriend said his fajitas were not much better.  The worst part was the bill.  Without the groupon it would of been $30.  $30 for two drinks and two crappy meals!? We could of gone to a restaurant that was nice with actually good food for that price!  I won't be back, with or without a groupon.", "rating": "2", "date": [2014, 12, 16]}, "6": {"description": "My burrito was huge and it was good!  Rice and beans good as well.  Waitress was sweet and fast.  I would recommend if you want decent fast Mexican food at a fair  price.", "rating": "3", "date": [2015, 3, 5]}, "15": {"description": "It is not a very comfortable place - hard benches.  It looks like a converted Taco Bell.  I knew I was in trouble when the salsa came in squeeze bottles.  The red and green salsas were tasteless and the chips were hard.  My dinner came with a cup of vegetable soup - the best part of my meal.  The steak fajitas were flavorless and the refrained beans were watery.  I had the fried ice cream for dessert.  It was more like a sundae as it is served in a tortilla shell.  It was also a let down.  The shell had too much cinnamon for my taste and the scoop of ice cream was small.  The only thing good about this place is the waitstaff - friendly and attentive.", "rating": "1", "date": [2012, 12, 23]}, "7": {"description": "This place has the worst service around I definitely will never go back again . I always knew the service wasn't good but I kept goin because the fajitas were good..But the last 2 or 3 times I've been here the food was garbage ...never again", "rating": "1", "date": [2014, 12, 22]}, "8": {"description": "The only thing I like from this place are the fajitas. The service is horrible. They won't even be busy and they still ignore and just stand there behind the counter talking. The only reason I go there is because they have a groupon but once that stops, so will my service.", "rating": "2", "date": [2014, 6, 30]}, "3": {"description": "The food sucks!!! Very disappointing. No flavor what so ever. Meat is hard and the lettuce taste funny.", "rating": "1", "date": [2015, 11, 18]}, "14": {"description": "This review is based on giving this place two tries.I once stopped in here late at night craving a pork burrito to go. The gentleman behind the counter was really nice and took my order.  I get home and my burrito is sloppy and falling apart and extremely soggy. Now I know your first thought is that the drive home may have hampered the burrito, but that cannot be the case as I live 7 blocks away. It takes me literally 90 seconds to get home, and 2 minutes later I'm munching. Nonetheless, it was quite difficult to tackle.Second time, I ate here with a couple a friends and ordered a burrito. Same result. You want tacos and burritos? Just go to Zaca Tacos on 71st and Pulaski. It's 10 minutes away, cheaper, and tastier. Even my Mexican friend said this place is no good. I guess if you don't know any better, you can hand this place all the stars you want.", "rating": "2", "date": [2011, 6, 6]}}, "neighborhoods": ["Scottsdale", "Ashburn"], "latitude": 41.7368469, "longitude": -87.741066, "rating": "3.0", "times": {"Mon": ["9:00 am", "10:00 pm"], "Thu": ["9:00 am", "12:00 am"], "Sat": ["9:00 am", "12:00 am"], "Wed": ["9:00 am", "10:00 pm"], "Tue": ["9:00 am", "10:00 pm"], "Sun": ["10:00 am", "10:00 pm"], "Fri": ["9:00 am", "12:00 am"]}, "price": "$$", "categories": [["Mexican", "mexican"]], "address": ["8550 S Cicero Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Has TV": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "Beer & Wine Only", "Delivery": "Yes", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Ambience": "Casual", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "24"}, "aldi-chicago-30": {"comments": {"1": {"description": "I like this Aldi, prices here are really fair, love the generic versions they have too. It's really quiet & peaceful as well so you can do your shopping really peacefully. There's always plenty of people in the store, the cashiers are really friendly. There's a weird rent-a-cop chilling by the exit but still i've been coming here for years and will continue coming.", "rating": "4", "date": [2016, 1, 14]}, "2": {"description": "I'm definitely an aldi girl.  Mainly because I'm cheap.  They have most basic grocery items for a fraction of what you would pay at jewel or most other grocery stores.  Most of the things they carry are generic items but I think they're just as good as the brand name stuff.  They even sell wine! The reason I gave four stars instead of five I'd that sometimes the lines get really long and if you can't find something it's hard to find someone to help you.", "rating": "4", "date": [2014, 6, 16]}, "0": {"description": "Love this store! Clean and organized and incredible deals. We bake a lot so this store is a lifesaver. Can't find a better deal on flour, sugar, milk, eggs, cream cheese etc. Great prices on nuts we use for baking as well, a bag of pecans is $2.99 here and double the price at local grocery stores.Be prepared to do things a little differently though. Have a quarter ready because you need to put one in the shopping cart. Don't worry, you get your quarter back once you return your cart. Genius isn't it? People want to get their quarter back which eliminates the need for and employee to gather carts and helps keep prices low. You might find yourself walking up to the register and find no one there. Don't worry, the cashier will come around in a minute or two. Aldi pays they employees very well, but has them do multiple jobs. When the cashier has no one in line, they sneak off for a few minutes to straighten up the store and restock items.Also, either bring your own recyclable bag or  you can buy a bag at the register for a mere .10. You will also bag your own groceries, there is no bagger. Love that they encourage people to bring in their own bags, another smart way they cut down on overhead and keep prices low!This is a great place to come for toys as well, the selection may not be huge but you can find some incredible deals. Especially around the holidays. They also sell random seasonal items for a good price, so well with popping in here on a regular basis. Don't be fooled by the low prices and think it's low quality. They are just very smart and efficient about running their business, cutting down on unnecessary over head and know how to keep prices low while paying employees well. They also happen to be owned by the same parent company as Trader Joe's which us my absolute favorite grocery store!", "rating": "5", "date": [2015, 4, 10]}}, "neighborhoods": ["Scottsdale", "Ashburn"], "latitude": 41.7418225038967, "longitude": -87.740899734199, "rating": "4.5", "times": {"Mon": ["9:00 am", "8:30 pm"], "Thu": ["9:00 am", "8:30 pm"], "Sat": ["9:00 am", "8:30 pm"], "Wed": ["9:00 am", "8:30 pm"], "Tue": ["9:00 am", "8:30 pm"], "Sun": ["9:00 am", "7:00 pm"], "Fri": ["9:00 am", "8:30 pm"]}, "price": "$$", "categories": [["Grocery", "grocery"]], "address": ["8333 S Cicerob Ave"], "attributes": {"Take-out": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No"}, "category": "Food", "number_of_reviews": "3"}, "vape-312-burbank-burbank": {"comments": {"3": {"description": "Great place! I've only been into this Vape312 a few times but they treat me just as well as the one in the city that I'm used to going to but now I got an option much closer to me! Best part about it is the staff is some of the friendliest people, they're bar is huge and the seats are comfortable at the bar. They def took the time with all the details here. The couches are comfy and the distance board for cloud comps and the pool table tops it off. Love this place and plan on making it a regular stop for my Vape shop list!", "rating": "5", "date": [2015, 10, 16]}, "1": {"description": "This vape shop is by far my favorite. The people there are so friendly and the environment is even better. Patrick Hughes is the best. He is funny, handsome, and very knowledgeable about vaping. I am new to this and Pat helped me with what juice I liked and what vape things I should get. Pat deserves a raise because of how well he represented your store! Keep up the good work, would definitely come here for any vaping stuff.", "rating": "5", "date": [2016, 3, 5]}, "2": {"description": "I love the feel of the shop, always re stocking on new hardware that everyone always wants. Keeps the options always open and wide. Great staff, makes you feel welcome and want to stay and hangout. Bien is also a savage", "rating": "5", "date": [2016, 2, 18]}, "5": {"description": "Went here for some batteries, juice, & a tank. This place has a ton of variety to choose from. Also very knowledgeable staff. Bien the (Asian guy) really knew his stuff I bought a mod & it just wasn't working right & he fixed it right up for me. Thia she helped me out with juice & she really knew what I liked from a brief description of what I gave her. Great shop I will definitely be doing business here in the future.", "rating": "5", "date": [2015, 10, 16]}, "0": {"description": "Very helpful wonderful costomer service .  Ryan and iza. Has everything you need. Great people and great selection of juice . Treats you like a family when you walk in the way vapers community should be treated", "rating": "5", "date": [2016, 3, 7]}, "4": {"description": "The clouds hung low when I walked through the door. Reminiscent of a bowling alley after an entire evening of league play back when you could still smoke in public. Nice low mellow lighting. Super chill atmosphere. Some very relaxing looking couches and a pool table in back.If I were to envision what a vape lounge should look like this would be it. They stock and display their e-juice like fine wines in a rack. And yes, they stock some nice flavors. Bought some new hardware here and they were very knowledgeable about it. Friendly staff too. I just might be to old for this scene though..I still don't really get the vape lounge concept. Its not a bar, restaurant or club. Seems like there is a lack of activities to do in there. I do my vaping at home or in my car. I don't need a social scene to vape.", "rating": "4", "date": [2015, 9, 22]}}, "neighborhoods": ["Scottsdale", "Ashburn"], "latitude": 41.7465183, "longitude": -87.741453, "rating": "5.0", "times": {"Mon": ["11:00 am", "9:00 pm"], "Thu": ["11:00 am", "9:00 pm"], "Sat": ["11:00 am", "9:00 pm"], "Wed": ["11:00 am", "9:00 pm"], "Tue": ["11:00 am", "9:00 pm"], "Sun": ["12:00 pm", "7:00 pm"], "Fri": ["11:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Vape Shops", "vapeshops"]], "address": ["8050 S Cicero Ave"], "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "6"}, "lowes-home-improvement-chicago-3": {"comments": {"12": {"description": "The staff here is proactive and in a good way they approach you to be helpful.  They're knowledgable enough to suggest ways to maximize the value of what you purchase.  The location is well organized and easy to navigate.", "rating": "4", "date": [2013, 3, 22]}, "3": {"description": "I experienced the worst customer service here than any other location. I wanted to do a phone order and was told that they did not do that at this store. Which due to numerous purchases knew that was not the case. Manager got involved and shared the same lie. He tried to tell me that each store's policy was different from one another which was another lie because this is a corp owned chain.", "rating": "1", "date": [2015, 6, 14]}, "1": {"description": "I have always had good times with Lowes. They almost always have what I'm looking for except spray paint (city law prohibits them). Anytime I have had to return anything it has been hassle free. The only reason why I'm giving it 4 stars is because the evening shift at times is filled with young people who don't know there job. So best bet is to go during the day or afternoon.", "rating": "4", "date": [2015, 3, 28]}, "2": {"description": "This store has no idea as to the meaning of customer service. Gives Lowes a bad rep. Have taken my lawn mower for repairs TWICE and both times Ive had the most awful experience tracking the status and its whereabouts. I call and am placed on hold multiple times for at least 20 minutes. Employees, and managers for that matter, need retraining!", "rating": "1", "date": [2015, 7, 23]}, "9": {"description": "I wish I could give this Lowes lower than 1 star my experience here was the worst I would NEVER recommend anyone to shop here. I purchased a floor model refrigerator for a good price exactly what I was looking for, free delivery and haul away and It would be delivered Monday I purchased on Saturday night. Too good to be true I got a call Sunday saying my item was damaged when taking it off the floor but they found me a new one from another store I just had to wait until Wednesday for delivery. Tuesday night came I received another call saying that the second fridge was damaged too and I can come in and get a refund. Finally Thursday after the manager had another associate call me to offer a different fridge for the same price I received a new fridge but a completely different one the one I wanted wasn't available anymore and was not the same as what I wanted but I needed a fridge. After calling another day and speaking to the appliance manager I was told that my fridge was not damaged it was over sold so obviously I was being lied to all along. I was told Management would return my call two different times and still to this day I have not received a call. This store clearly has poor management and very poor customer service skills.", "rating": "1", "date": [2015, 3, 14]}, "10": {"description": "Not trusting any of the big box stores, I always call ahead to make sure things are in stock.  Seems like they always have what I need in stock, and their staff is very helpful.", "rating": "4", "date": [2013, 2, 1]}, "13": {"description": "I had a wonderful experience the other day that I wish could happen for every shopping experience at a hardware store.  I called up Lowe's first to see if they had a part that I needed.  I wasn't sure what department I needed so I had the operator transfer me to the right department when I explained the part to her.  I told the guy in the department the generic term of what I was looking for, a double gang low voltage plate and he found it, told me the price, which aisle, and what color the box was.  I drove to the store, followed the guy's instructions, found the part, went to the cashier (no wait, which was nice), paid for the part, got a nice and friendly thank you from the cashier and was on my way.", "rating": "5", "date": [2011, 4, 19]}, "16": {"description": "Excellent customer service!  We needed a window air conditioner on short notice in time for the latest heatwave.  We found one on line, ordered it by phone.  Not only was it delivered the next day during the promised time-frame but for the same price brought upstairs to our second floor apartment.  We chose this retailer because of these customer service touches.  Other places were not able to respond as quickly or as thoroughly.", "rating": "5", "date": [2011, 7, 16]}, "6": {"description": "Bought a house, flipper, he did things pretty cheaply.  We just could not get the hot water heater to work, and it was brand new.  I looked it up online, saw that it's a piece of crap that people continuous sink money into plus GE's help line was no help at all, so we opted to sink whatever repair money into getting a new one.  Our bad:  it was a Sunday, but we knew going in what we were getting into.  We had no choice though.Only store we could find a well rated hot water heater in stock with someone who could install it same day, so that's why we went.  The sales guy was very nice, very helpful.  The sweetheart said well, since we're here let's get a lawnmower too.  Ok fine.  The sales guy there was super nice and helpful too.  Even the checkout girl was very nice.  Overall, I'm not a huge Lowes lover (it's like a home improvement center extra-lite), just a personal choice, but we had a good experience here.The bad:  the installation guy.  Yes it was a Sunday, yes we paid nearly as much as the heater to have it installed (ugh), yes it was stupid hot out.  He showed up and while I kept the dog at bay, the hubs dealt with the guy who appeared to be very very grumpy.  The guy said he couldn't find street parking, could he park in front of our garage in the alley.  Sure, why not, everyone else does it up and down the alley.On the plus side, he got the job done in a speedy manner, maybe 45 minutes tops.  But every time I looked out the window and saw him, he was pissy.  My hubs even said he was pretty grumpy.  So, the guy is leaving and says hey wait, I got a $150 ticket for parking in the alley, um....help me out?  My sweets was a tad confused as no one in our alley ever gets a ticket and some folks park out there all day, so he said um, take the old water heater with you.  Thankfully he didn't give the guy cash as, upon reflection, we both think he was trying to pull a fast scam for some extra pocket money.The store called a bajillion times to see how happy we were with our purchase, blah blah.  We always missed their calls and we didn't have a chance to call back.  But, I wish they hadn't called as many times as they did -- it was annoying.So, decent enough store, beware of hot water heater installation guy, know you'll get a trillion post-purchase phone calls.", "rating": "3", "date": [2013, 9, 7]}, "15": {"description": "Holy crap I walked into Lowe's to get a new storm door and to my astonishment when I got to the door dept.  some asked me if I needed any help! better yet not only did he help me he was knowledgeable and helped me get  the door I needed. I also went to Lawn dept to shop for a Weed whacker and once again got a very helpful employee,, What's with this place? The last time I was in Home Dept I had to shoot a flare gun to get someone's attention! I will definitely will come back to this store over HD and Menards", "rating": "4", "date": [2011, 8, 16]}, "0": {"description": "This review is primarily for the kitchen department, and specifically for the wonderful kitchen designer, Melissa, who deserves a raise.  She helped me in 2009 when I wanted to redo my kitchen.  Fast forward to September 2011, when I came back and got very serious and committed.  (I had a 10x10' kitchen that I couldn't take anymore: A kitchen with barely any installed cabinetry and countertop, a portable dishwasher, stained & chipped laminate, oven next to the wall, no space-saving microwave, and a fridge that was a mistake purchase for such a small room.)  We drew up a plan and I knew where I wanted everything.  She helped me and gave me extremely honest opinions and input about what was really necessary.  Thankfully this is a newer store and it had the latest cabinetry.  No old stuffy cabinets & old kitchens here!  She led me to a wonderful cabinetry company called Shenandoah, with a limited lifetime warranty.  They have almost all the features of Kraftmaid without the high, premium price.  Don't get me wrong, Shenandoah will still set you back.  I had pages and pages of written questions in person and I must have called this lady 15 times.  She not only answered all my questions, she got back to me in a timely matter with pertinent info as if she was my own personal assistant.  That's customer service!  She's honest and gave me all the insider info I could have asked for.  And she led me to the right decisions in choosing an independent contractor, down to tiny decisions like choosing a garbage disposal.  She is truly a gem!After ordering, she was there every step of the way.  She was there when there was a question on trimming a panel from the installer and she was there when I had a claim for the cabinet company to send a few new parts and cabinet pieces.  The cabinetry was by far the most expensive part of the remodel and somehow, it was the easiest decision once I found the right store and the right designer!  A few months later, we bought the most beautiful, realistic, artificial Christmas tree in their Christmas department.  It was a pleasurable experience.  Sometimes you end up paying a little more at Lowe's than Home Depot, but it's an infinitely better experience.   A well organized, well lit, customer friendly store.  I will be shopping at Menards and Lowe's in the future.  Thanks to the kitchen department and Melissa, I have a beautiful new & functional maple kitchen that I will enjoy for a very long time.  Thank you sincerely.", "rating": "5", "date": [2012, 1, 16]}, "5": {"description": "went in for roofing supplies near closing and the Hispanic girl in that dept. was extremely helpful, then I went to pay and the cashier Juan was not just extremely handsome, but very cooperative trusted his judgment on A beverage and although I was making a mess at the soda coolers he was considerate fast and attentive great customer service all around in this store DONT CHANGE ANYTHING!", "rating": "5", "date": [2015, 9, 7]}, "11": {"description": "I really wish I could like this place because Home Depot doesn't exactly excel in the customer service department and Mendard's isn't bad just a little cheap when it comes to certain merchandise.  So we came here looking for patio furniture because Home Depot and Menard's didn't have what we were looking for.  We did find a nice patio set and the salesperson was nice enough to help us with some additional items we needed for their upkeep.  We made our purchase and scheduled the furniture to be delivered & assembled in a few days.But that's where the \"great\" customer service ended.  I had to take the day off from work on the delivery day because they don't do evening deliveries. And that was okay because I figure this is a big deal after all.  But when the furniture arrived, the delivery guys were nice but told us assembling the furniture wasn't included in the delivery and said Lowe's lied to us.  But, they still helped assemble it anyway and that's when we found out one of legs on the conversation chair was bent in half.  We complained to the delivery guys about this and they said to call Lowe's and have them delivery me a replacement.So I called Lowe's and explained everything to them.  At first they asked why the delivery guys didn't return the damaged furniture.  Really.  After being put on hold for almost a half hour, I finally got to speak to the manager, Jose, who was rude.  He didn't apologize at all nor offered any credit for having to replace said chair.  The only thing he offered me was to replace it which would mean I'd have to take another day off work.  When I explained this to him he said that was my problem.This is really unfortunate, because I felt up until the point that we bought the furniture, Lowe's would become my new Go To place for buying all my home improvement needs.  But not so.  First rule in business, always take care of the customer.", "rating": "1", "date": [2012, 8, 12]}, "8": {"description": "I'm a big fan of Lowe's its kind of like Menards and Home Depot in one Hybrid store.  It's big inside, and they have a lot of merchandise like Homedepot, but its also nice, bright, and organized like Menards is.  This location is near me, so I've been in here a few times.  The customer service is really good, just about every employee who walked past me either said hello, or asked if I needed any help.", "rating": "4", "date": [2013, 1, 2]}, "4": {"description": "they don't even deserve a star Worst customer assistance ever , i asked for help with custom cutting the plywood i waited 10 min than i asked someone else , was told to hold on while they paged another person than i called the store while i waited in the store and no help after 6min a guy comes and says i will be back with a cart and takes for ever i was standing there for a total of 20min being pushed off from one to the other, i just left; ur better off going to home depot!", "rating": "1", "date": [2015, 8, 4]}, "14": {"description": "I heart hardware stores.. I have a problem with the smell of freshly cut wood.. I can admit it  lolGreat store, good friendly folks and always have what I need and some stuff I want ;)", "rating": "4", "date": [2010, 10, 8]}, "7": {"description": "Do not purchase an appliance from this location!  If your appliance needs repair you be unbelievably disapointed and frustrated.  After waiting SIX weeks for a part to come in for my washing machine, I am still without one!  Lowes contracts a company called All Star Appliace, located in Lincolnwood, and they are the WORST!  I have never experienced such appaling customer service.  Any attempt to get Lowes to help has been unsuccessful!  I am at a loss as to how to resolve this situation.  I hope I can save someone the hassle  and frustration - take your hard earned money elsewhere!!", "rating": "1", "date": [2014, 11, 12]}}, "latitude": 41.7482135746138, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Hardware Stores", "hardware"], ["Building Supplies", "buildingsupplies"], ["Nurseries & Gardening", "gardening"]], "address": ["7971 S Cicero Ave"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.7396786889142, "times": {"Mon": ["6:00 am", "10:00 pm"], "Thu": ["6:00 am", "10:00 pm"], "Sat": ["6:00 am", "10:00 pm"], "Wed": ["6:00 am", "10:00 pm"], "Tue": ["6:00 am", "10:00 pm"], "Sun": ["8:00 am", "8:00 pm"], "Fri": ["6:00 am", "10:00 pm"]}, "rating": "3.0", "price": "$$", "number_of_reviews": "17"}, "gamestop-chicago-2": {"comments": {"1": {"description": "This location is not usually busy when we go in. The same salesperson has waited on us the last two times, which is Meagan and she is always nice and very informative.", "rating": "5", "date": [2013, 4, 18]}, "2": {"description": "Typical Gamestop. I'm always greeted when I walk in the door. Nothing special.", "rating": "3", "date": [2013, 4, 16]}, "0": {"description": "Best gamestop period mostly due to the cool staff and the awesome boss Adriana. She is always helpful and super cool and nice.", "rating": "5", "date": [2013, 10, 3]}}, "latitude": 41.748406291008, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Videos & Video Game Rental", "videoandgames"], ["Investing", "investing"]], "address": ["7945 S Cicero Avenue"], "attributes": {"Parking": "Private Lot", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.741277590394, "rating": "4.5", "price": "$$", "number_of_reviews": "3"}, "cvs-pharmacy-chicago": {"comments": {"1": {"description": "I felt like I was getting stalked by a white lady or manager. She was like a half.  I left everything and walked out. And didn't let my daughter can a product to check the price. Smh never going there just because the way she made me feel.", "rating": "1", "date": [2015, 9, 4]}, "2": {"description": "So, I recently moved from the suburbs into the city, and simultaneously didn't have a phone for a short span of time. Naturally, in this span of time, my medication came up for renewal.I know my doctor, she knows me, she's told me previously to never worry about getting refills on this particular medication, because it's a daily required dose without which I become very, very sick. In fact, within three missed doses, I start to enter a violent withdrawal state that I can only describe as being like the flu plus insomnia plus weakness plus mild electrocution.Knowing this, I set up a prescription transfer to a pharmacy a block away from my new place. This CVS gives the new pharmacy the wrong doctor's info, and me being without a phone, am unable to get a hold of my doctor to get things straightened out.It's basically a downhill shitstorm from this point involving another terrible CVS location on the north side. As of today I've been without my medication for ten days, am sick and miserable, but have a new phone and am getting my script filled at Target, because CVS can eat a bag of dicks.", "rating": "1", "date": [2013, 2, 12]}, "0": {"description": "Cvs was able to resolve my problem with the insurance and my doctor in a timely manner.", "rating": "5", "date": [2015, 2, 24]}}, "latitude": 41.7351837158203, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Drugstores", "drugstores"]], "address": ["8639 S Cicero Ave"], "attributes": {"Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.7404708862305, "category": "Shopping", "rating": "2.5", "price": "$$", "number_of_reviews": "3"}, "carters-babies-and-kids-burbank-2": {"comments": {"0": {"description": "Maybe one of the ladies who work there can be a little nicer, I needed help and she answered so rude.", "rating": "3", "date": [2015, 8, 31]}}, "neighborhoods": ["Scottsdale", "Ashburn"], "latitude": 41.752782985568, "longitude": -87.7415397763252, "rating": "3.0", "times": {"Mon": ["10:00 am", "9:00 pm"], "Thu": ["10:00 am", "9:00 pm"], "Sat": ["10:00 am", "9:00 pm"], "Wed": ["10:00 am", "9:00 pm"], "Tue": ["10:00 am", "9:00 pm"], "Sun": ["10:00 am", "6:00 pm"], "Fri": ["10:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Accessories", "accessories"], ["Children's Clothing", "childcloth"], ["Shoe Stores", "shoes"]], "address": ["Burbank Station", "7716 S Cicero Ave"], "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Fashion", "number_of_reviews": "1"}, "american-mattress-burbank": {"comments": {"1": {"description": "I purchased a mattress a month ago the salesperson said I had 30 days to try it and my Wife was not happy with it so we went back and told him we wanted another mattress he said ok we just have to pay the difference of $150 plus $60 shipping. I told him I wouldn't do that. He called his Manager and said I'll have to do is pay the $60 for shipping my wife said no so I said no I first got charged $30 for shipping the 1st time. He said that's their 30 day comfort policy. I told him I regret going to American Mattress. i should went back to Bedding Experts. The whole 30 day is just a switch and bait. I do not recommend American Mattress got to other stores.No recomendo a esta tienda y compania!", "rating": "1", "date": [2014, 9, 10]}, "0": {"description": "Ivan was very nice.  He gave us a very good deal on our mattress.  I would highly recommend them to anyone who needs a new bed", "rating": "5", "date": [2016, 1, 8]}}, "latitude": 41.7479798197746, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Mattresses", "mattresses"]], "address": ["7959 S Cicero Avenue"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.7412628382444, "times": {"Mon": ["10:00 am", "9:00 pm"], "Thu": ["10:00 am", "9:00 pm"], "Sat": ["10:00 am", "7:00 pm"], "Wed": ["10:00 am", "9:00 pm"], "Tue": ["10:00 am", "9:00 pm"], "Sun": ["11:00 am", "6:00 pm"], "Fri": ["10:00 am", "9:00 pm"]}, "rating": "3.0", "price": "$$", "number_of_reviews": "2"}, "cvs-pharmacy-chicago-81": {"comments": {"1": {"description": "This location is rather decent. No major issues stand out. Its clean, organized, kinda slow but service is adequate to the numbe of customers.", "rating": "3", "date": [2013, 12, 5]}, "2": {"description": "Everytime I walk in, it smells horrendous. I only go for a bag of chips or some cashews every now and then. Customer service is ok. But that smell is atrocious and needs to be dealt with.", "rating": "2", "date": [2013, 8, 28]}, "0": {"description": "Love this place, always very friendly, the staff remebers you by name, they dont mind when i have a cart full, and a fist full of coupons, I love them, the pharmacy staff is always very helpful!", "rating": "5", "date": [2008, 2, 22]}}, "latitude": 41.741879, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Drugstores", "drugstores"]], "address": ["8300 S Pulaski Rd"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.722054, "category": "Shopping", "rating": "3.5", "price": "$$", "number_of_reviews": "3"}, "play-n-trade-burbank": {"comments": {"3": {"description": "I preordered here one time and they didn't even get my game. They also refused to refund my money. This manager is the worst, he is pushy and rude. He also buys products from walmart to resell at an inflated price. His employees even have tax exempt cards that say church of play n trade so they can avoid paying taxes when they buy their scam products.", "rating": "1", "date": [2013, 10, 3]}, "1": {"description": "I never had any problems personally with the people that worked there. I only come to this place as an alternative to other game outlet stores. I also like how they carry retro games which is another reason why I come here. Wait until emulators come out! They try to pressure you into a membership you'll never use. The games are a bit expensive. This place scammed my friend into upgrading his hard drive on his PS3 from 120GB to 500GB and charged him $250 with data transfer. OUTRAGEOUS!", "rating": "1", "date": [2016, 1, 14]}, "2": {"description": "Step inside of here and you'll think you're buying a used car.  The owner is very shifty, shady, and sketch.  SSS.  Which also translates to $$$ because that's what this place is, a RIPOFF.  But hey, to their credit, pretty much ALL Play N Trade's are.  If you thought it couldn't get worse than Gamestop, look again.  Gamestop may try to upsell you some new preorder or coverage, but this place takes the cake.   I feel like I'm in Agrabah haggling over rugs.  AND I DON'T EVEN WANT TO BUY THE RUG.They had a brand new Animal Crossing New Leaf Nintendo 3DS XL for almost double the price, the day it came out, but said they were sold out of preorders.  So basically they pulled a Gamestop, and just marked up the price.  Even Gamestop will at least sell it to you for it's original cost if no one picked it up.Steer clear. Some of these places might have some deals, but it's not worth stepping into this one.", "rating": "1", "date": [2014, 7, 22]}, "0": {"description": "Never had any problems with be employees like others mention here. Have you ever known one of these places NOT to be a ripoff? I like that they have retro games but the selection is totally lame, it's essentially all the shovelware unplayable games for nes/SNES/genesis. There was like ten copies of the little mermaid for nes and the wanted $9 for it! I can buy an amazing nes game like  metroid for $2 on amazon, why would I pay more for less.On top of this the store just reeks! I think it's because they leave their food garbage from lunch rotting in the trash behind the counter.", "rating": "3", "date": [2015, 1, 4]}}, "latitude": 41.7513313, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Videos & Video Game Rental", "videoandgames"]], "address": ["7784 S Cicero Ave"], "attributes": {"Parking": "Private Lot", "Accepts Credit Cards": "Yes"}, "longitude": -87.7416153, "rating": "1.5", "price": "$", "number_of_reviews": "4"}, "payless-shoesource-chicago-16": {"comments": {"0": {"description": "I live nearby to this store and sometimes feel that the stores in the area aren't that great.  They're not as well stocked as the other stores and just kind of run down.  This was not the case with Payless.  They were well stocked and the workers were professional and kind.  I will definitely be going back!", "rating": "5", "date": [2014, 6, 24]}}, "latitude": 41.7464729, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Shoe Stores", "shoes"]], "address": ["8055 S Cicero Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.7410901, "category": "Fashion", "rating": "5.0", "price": "$$", "number_of_reviews": "1"}, "party-city-chicago": {"comments": {"3": {"description": "Receive excellent customer service from Everardo and the store manager. Can't say enough about Everardo who helped me until I had everything I needed.   Back and forth to the storage room smiling politely and friendly all the way. Hats off to them. I had a beautiful event for 50.", "rating": "5", "date": [2014, 5, 6]}, "1": {"description": "Went to party city today to get balloons for my daughter's 8th birthday and they were pretty much out of EVERY balloon I wanted....the staff didn't greet me and they were NOT friendly I also needed help due to the change of their store's layout NOT one associate helped me even after I stated I couldn't find any thing ..... It would be a big fat lie for me to say I will never shop at party city it just won't be this location ..... I only gave two stars because at the end of the day I compromised   and found nice balloons that will make my big girls day!", "rating": "2", "date": [2015, 10, 6]}, "2": {"description": "I'm seeing a trend with places in the Scottsdale shopping area...stores that were complete dumps a few years ago have really made a turn around.  I remember last time I was in Party City the place was a mess but they're cleaned up the store.  I thought it was cool that they even have personalized graduation stuff for the local high schools already made.  (Queen of Peace obviously being the best.) I'm giving 3/5 stars because the line was long with only one cashier working and their prices are kind of high.  Even though the dollar tree across the street is a dump, their party supplies are much cheaper.", "rating": "3", "date": [2014, 7, 31]}, "0": {"description": "my favorite stop for affordable party and holiday decorations.", "rating": "5", "date": [2015, 1, 14]}, "4": {"description": "This is your typical party store where you can find everything under the sun to throw a party.  Except..... they discontinued and no longer carry those big keg buckets.  How can you throw a party without one of those!?  I am very disappointed.  - 1 star-1 more star for long lines and not enough cashiers.", "rating": "3", "date": [2009, 9, 5]}}, "latitude": 41.7438787, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Costumes", "costumes"]], "address": ["8141 S Cicero Avenue"], "attributes": {"Parking": "Private Lot", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.7409849, "rating": "3.5", "price": "$", "number_of_reviews": "5"}, "honeybaked-ham-chicago": {"comments": {"1": {"description": "The Good: The ham. It's the classic honeybaked ham that I grew up with. They claim to be the original and I suspect they are. They also have good coupons online. The Bad: Driving all the way to Ford City to pick up the yummy ham.The Ugly: The side dishes. I had a coupon for 3 free \"sides\"  with the purchase of a ham. G-R-O-S-S!! I served them today (xmas).  Salty, fake cheese, made all our tummies hurt. Just gross. Bottom Line: Go for the ham. Avoid everything else.", "rating": "3", "date": [2007, 12, 25]}, "0": {"description": "In a vast wasteland of sub par food fast food options a beacon of light in the distance. Lo is it mattsons? Toysrus? No behold the glory that is the HoneyBaked Ham company. Upon entering find yourself greeted by the kindest purveyors of that cloven hooved animal which we are so pleased to put in our bellies.Well I wish for the sides and to go items were available in their lunch boxes with this sandwiches, the BBQ bacon stack a ham sandwich did me just fine.", "rating": "4", "date": [2014, 11, 20]}}, "neighborhoods": ["Scottsdale", "Ashburn"], "latitude": 41.7438049, "longitude": -87.7409821, "rating": "3.5", "times": {"Mon": ["10:00 am", "6:00 pm"], "Thu": ["10:00 am", "6:00 pm"], "Sat": ["10:00 am", "6:00 pm"], "Wed": ["10:00 am", "6:00 pm"], "Tue": ["10:00 am", "6:00 pm"], "Sun": [], "Fri": ["10:00 am", "6:00 pm"]}, "price": "$$", "categories": [["Meat Shops", "meats"], ["Sandwiches", "sandwiches"], ["Delis", "delis"]], "address": ["8159 South Cicero Avenue"], "attributes": {"Accepts Credit Cards": "Yes", "Takes Reservations": "Yes"}, "category": "Restaurants", "number_of_reviews": "2"}, "arbys-chicago-9": {"comments": {"3": {"description": "One of the few Arybs in the Chicago area this place always gets my attention when we past by the food not that bad. The roast beef sandwiches Arby's serves is delicious and this one is no different. PS they have a drive thru.", "rating": "4", "date": [2013, 8, 6]}, "1": {"description": "Mouth-watering Mozz stix!It's been eons since the last time I patronized an Arby's, and I rarely eat junk food, but lately I have developed a weakness for mozzarella sticks, my fave being from White Castle. Well a craving hit & with no nearby WC, I ventured through Arby's drive-thru to gamble on their mozz stix which come in a 4 or 6 piece pack as opposed to 3, 5, or 10 at WC. It took nearly 5 min to receive my single 4 piece order. I don't qualify that as \"fast\" in my book, but as the woman gave me my bag she warned me to be careful because they were just made & very hot to justify my wait. She was right, these stix were piping-hot indeed & the perfect ratio of crispy breading, just enough to encase the overflowing, ooey-gooey, melty mozz cheese. (I hate when I get mozz stix that are almost all fried shell & little cheese inside). In other words, these mozz stix were worth the wait & the calorie bomb & get 5 gems (can't vouch for the rest of the food here) & were effin' good & give my fave White Castle ones a run for their money, and if I'm faced with the 2 drive-thrus side-by-side, I'm gonna be in a pickle!", "rating": "5", "date": [2014, 4, 11]}, "2": {"description": "Open 24 hours!  The have the best fast food curly fries, and cheese sticks.They may not be fast, but it always comes out hot and tasty!The staff has always been friendly and make sure you get what you ordered.", "rating": "4", "date": [2014, 2, 14]}, "0": {"description": "I love arbys. I stop eating at a ton of fast food restaurants but arbys wasn't one of them. However they discontinued the cheese and bacon potatoes triangles. Broke my heart.", "rating": "4", "date": [2015, 4, 10]}, "4": {"description": "I love Arby's and my companion loves tool shopping.  I think I devised the most perfect plan.  We go tool shopping at Harbor Freight and then we can get Arby's from across the street.  I must be a genius.  All went well, I got my beloved Super Roast Beef Sandwich.  My roast beef was cold and apparently the worker at the drive in window had very touchy hands.  Oh well, this won't really stop me from wanting to try this again.", "rating": "3", "date": [2008, 7, 12]}}, "latitude": 41.75021, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Fast Food", "hotdogs"]], "address": ["7821 S Cicero Ave"], "attributes": {"Take-out": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "longitude": -87.74099, "category": "Restaurants", "rating": "4.0", "price": "$", "number_of_reviews": "5"}, "chicago-cheese-steak-chicago": {"comments": {"28": {"description": "Five characteristics make Chicago Cheese Steak a five star fast food experience. Quality, quantity, great service, everything is very fresh, and a unique menu. The cheese steak is so tasty I seriously have to restrain myself from eating 87 of them in one sitting. They have the standard size and king size.  If you go for the king, bring a hearty appetite. The bread is cloud like soft, similar to a mexican bolillo. And it's filled with just tasty meaty goodness. The steak, onion, and pepper mix fills it to the point where they need to bend the sandwich to fit in the take out container. Whatever they use to season the meat really just makes this an amazing sandwich. The fries are always cooked to a golden crisp perfection. And the gyro burger is kick ass as well. I mean how can you combine gyros and burgers and not expect pure awesomeness to result from this?The owner is a really cool dude. He'll ask how your day was and strike up some small talk while you wait. The prices are reasonable and he doesn't nickel and dime you to death for condiments. Chicago Cheese Steak is a class operation and a fine representation of good south side food fare.", "rating": "5", "date": [2014, 1, 16]}, "1": {"description": "After reading the wonderful reviews I was so looking forward to trying this place. Unfortunately, my meal was ruined due to the delivery driver. All my items arrived cold. I don't mean not hot....I mean cold. The driver called me in the process of this delivery and literally questioned if I knew my own address because he couldn't find the place. Are you frigging kidding me!?! Now I'm sure people do enter addresses wrong, we're human mistakes happen but to say it in such a tone to make it sound as if you're implying I'm too stupid to know my own address? Not happy, poor customer service lead to me wasting nearly  $18 on lunch.", "rating": "1", "date": [2016, 1, 15]}, "39": {"description": "Gr8 food & Gr8 service!", "rating": "5", "date": [2011, 3, 23]}, "9": {"description": "I love the food at Chicago Cheese Steak. I tried chicken tender, traditional wings, whole wing, Chicago cheesesteak sandwich , and fresh made cheese burger. All of them tasted really great. On my next visit I like to try gyros.It been a month I didn't eat at Chicago cheesesteak. Now I'm there it's time to try the gyros. The gyros meat is like other places it's from Kronos. The meat was very tasty. The most thing I like is the gyros sauce. I never tried a gyros sauce that tasty. It was thick and rich with flavor.", "rating": "5", "date": [2015, 7, 23]}, "29": {"description": "Greatest cheese steak sandwich ever. Been eating here for years now, quality never changed. Always fresh and hot. Buffalo chicken is also very good.", "rating": "5", "date": [2013, 8, 26]}, "23": {"description": "I had a horrible experience here. I was really surprised because someone recommended this place to me and because of all the great reviews. First off, when i saw the prices, i opted for a drink instead of fries with my burger. The guy that took my order was too busy creeping on me to get my order correct though. After 20 minutes (there was 1 person ahead of me and two cooks in the kitchen) i received my greasy, previously frozen by-product of a double cheeseburger with some overdone fries i said i didn't want with my soda that i could swear was a generic cola, not coke. Although on that last part, i can't verify it wasn't name brand, i can assure you i didn't enjoy it. Set me back $8 and some change,  and i was running late getting back to work, so i couldn't even finish my overdone fries.Not happy. Won't be back. Womp womp.", "rating": "1", "date": [2014, 7, 9]}, "5": {"description": "I had a horrible experience here. I was really surprised because someone recommended this place to me and because of all the great reviews. First off, when i saw the prices, i opted for a drink instead of fries with my burger. The guy that took my order was too busy creeping on me to get my order correct though. After 20 minutes (there was 1 person ahead of me and two cooks in the kitchen) i received my greasy, previously frozen by-product of a double cheeseburger with some overdone fries i said i didn't want with my soda that i could swear was a generic cola, not coke. Although on that last part, i can't verify it wasn't name brand, i can assure you i didn't enjoy it. Set me back $8 and some change,  and i was running late getting back to work, so i couldn't even finish my overdone fries.Not happy. Won't be back. Womp womp.", "rating": "1", "date": [2014, 7, 9]}, "31": {"description": "Stopped here today after reading a few of the reviews - this place is down the street from my house, but I've never noticed it before.Tiny place - a few tables, probably wouldn't eat in, though a few people were.   I walked in and was met by a great smile and friendly service.   The lady (owner?) was so warm and welcoming.    The other patrons that came in, seemed to be regulars, as the people behind the counter seemed to know everyone by name/order.I got the Chicago cheese steak and the chicken parmesan cheese steak  - to go.   I would rate the Chicago as 10 stars.  The steak was so thin and flavorful - loaded with cheese, onions, peppers - so, so good!   The Chicken parm, I would not recommend at all - the chicken was not good and the flavor was off.The bread!  Oh - the bread!   The rolls these sandwiches are served on is some of the best, freshest I've ever tasted!The fries were just 'eeehhh'.  I think they were supposed to be crispy, they looked like they were going to be.  But they were kind of soggy and tasted old.I would absolutely come back for the Chicago Cheese Steak and the great service!", "rating": "4", "date": [2013, 3, 9]}, "25": {"description": "Had the cheese steak and fries because of the reviews we read here. They were really, really good!  Nice, friendly service.", "rating": "5", "date": [2014, 5, 12]}, "12": {"description": "I love this place. I wish they accepted Bitcoin. i'd be here everyday.", "rating": "5", "date": [2015, 3, 4]}, "37": {"description": "This place is the real deal. Owner is a pro at makin sandwiches and a nice guy. The place has got some history to it as well. Gotta try it to believe it.", "rating": "5", "date": [2012, 1, 18]}, "21": {"description": "I visited the establishment last week with a new employee of my company. The experience was very impressive. The entrees we ordered were prepared and delivered in a timely fashion that was surprising considering the line of people waiting to order their food. It was busy at the time of the visit, around 11am, which was a good thing for them. The establishment was governed by and family specifically by a father and son. I would recommed visiting and will visit again in the near future and order somehting diferent from the menu this time around to try something different", "rating": "5", "date": [2014, 8, 5]}, "16": {"description": "Had the cheese steak and fries because of the reviews we read here. They were really, really good!  Nice, friendly service.", "rating": "5", "date": [2014, 5, 12]}, "17": {"description": "Best place in town can't believe people are bad mouthing this restaurant. Excellent service the cook in the morning is amazing at his job and has excellent  customer skills. Keep up the good work guys the fries are fresh and the sandwiches have excellent  flavor.", "rating": "5", "date": [2014, 11, 28]}, "10": {"description": "This is my second time here! My second visit was better from the first one. There Chicago Cheesesteak is delicious, friendly employee. This is a great quick stop for a delicious lunch or dinner when you are on the go.", "rating": "5", "date": [2014, 8, 27]}, "11": {"description": "Horrible place. Food sucks.service sucks. Fries are burnt. If you can't cook a French fries right. Then you shouldn't be cooking food. It like eggs and bacon. Really hard to mess up. They could give a crap about you. Service sucked. Funny how most of these compliments are old. Isn't  even the same owner. Come on if your foods good. Get rid of these old comments. Quit biting another guys complishments. Should say new owner ship. But dudes to scared to put it out there. Cause he knows the food sucks", "rating": "1", "date": [2015, 4, 13]}, "26": {"description": "Best food in the area. I've never been disappointed. Every sandwich is extremely delicious. I am always serviced with a smile. Fairly priced.", "rating": "5", "date": [2014, 5, 1]}, "27": {"description": "Excellent! Excellent! Excellent! I have been coming here for almost ten years, ever since I once worked at the nearby Target and went here just by chance on a lunch break. To this day, every once in awhile I will get that craving for some cheesesteak and feel compelled to drive on by. And I have only one time gotten something other than cheesesteak because it is just that good, which was the gyro burger and that was awesome, too; very big. I love that they have bottles of ketchup, hot sauce and barbeque sauce at the counter, I recommend everyone who comes here to squirt hot sauce and ketchup on their fries before they leave or sit down because when it soaks in, it is divine! They also have daily specials which is nice even though this is the kind of place you don't mind paying full price because it is a local shop that one wants to keep in business. And the service is the second best thing about this place next to the food. It is a family owned business, the owner is such a nice, down-to-earth gentleman who you can tell strives to make sure the customers are satisfied. His wife is also such a sweet lady. And it's funny to think, I've actually watched their son, who works there occasionally, grow from a young little dude to a grown-up now who you can also tell takes after his dad because he is so welcoming and kind.", "rating": "5", "date": [2014, 2, 9]}, "35": {"description": "Great Sandwich!Awesome Customer Service!Great Value!", "rating": "5", "date": [2012, 10, 10]}, "8": {"description": "Cheap steak, cheap cheese, etc.., get the picture. Your better off getting an Italian beef, more value for the money.", "rating": "2", "date": [2015, 7, 5]}, "0": {"description": "Always the best!I call on Chicago Cheese Steak to fill my belly at least once a week. Great food, nice people, fast delivery!I recommend the Chicago Cheese Steak Sandwich!!", "rating": "5", "date": [2015, 12, 10]}, "38": {"description": "WOW the service.....awesome service and the best cheesesteaks in chicago hands down! Try them you'll love them.", "rating": "5", "date": [2011, 7, 19]}, "20": {"description": "I just had the cheese steak sandwich and fries combo and it was perfection! The service was great and the place is very clean with a welcoming atmosphere. I will definitely be back because it's close to my work and of course for the foood! Thanks again for a great meal!", "rating": "5", "date": [2014, 8, 23]}, "19": {"description": "So I'm a big cheese steak fan so this place before and they were closed about 6 months ago service was good the food came quick but this was a onion and bread  sandwich very little meat and the fries tasted like fake potatoes keep it up I can see this place close soon I feel violated.", "rating": "1", "date": [2014, 11, 23]}, "33": {"description": "The food was amazing and you get a lot for what you pay! The prices are fair and the service is the most wonderful I've had in a long time. I went there for my birthday and the owner came out and was really nice the whole time; made the experience much more fun and friendly. You can get good service anywhere, where you'll just be another table, but here you get great service and you're treated as a person. Again, I highly recommend this is if you're in the mood for some quick, delicious, and cheaply priced food!!", "rating": "5", "date": [2013, 1, 25]}, "2": {"description": "My husband and I were returning from a trip and driving back home from Midway and looking for a quick bite to eat. I found this place on Yelp and was so excited bc I LOVE Philly cheesesteaks and I saw they had 4 stars on Yelp.I ordered the cheesesteak combo and my husband ordered chicken fingers only bc he needed something he could eat while driving. I was a little worried bc as we were waiting I read some of the reviews on Yelp and it seemed most of the good reviews were from a while ago. My husband mentioned to the guys that were at the counter that we were on the way home to see our 2 little boys and one of the guys pulled 2 quarters out and insisted we pick something for them out of the little toy machines for our boys. Yeah, it was only 50 cents but such a thoughtful gesture on their part.We got our food I would say in 5-7 minutes, not long at all. We hopped in the car and I started in on my cheesesteak. YUM! I was so pleasantly surprised, the steak was flavorful, there was plenty of it and the cheese (please see my picture for reference) and the peppers were cooked perfectly, not undercooked or over cooked. The fries were also great, definitely freshly fried, crispy on the outside and soft on the inside.I don't know who this Sal person is that people keep talking about since it was my first time there, but give this place a try, even without him. Change doesn't necessarily have to be a bad thing!", "rating": "5", "date": [2014, 12, 14]}, "34": {"description": "On the day I went to try this place, I think a bunch of people had the same idea as it seemed as if they were overwhelmed and I think the owner was training new staff (which explains my 4 stars instead of 5 and I will probably change it to 5 after a second trip there) my hot dogs were way overcooked but they were still delicious and the cheese fries were beyond amazing! If I could I would eat an entire meal of just cheese fries they were that great! The person I went with had a cheese steak sandwich and he seemed to enjoy it quite a bit.", "rating": "4", "date": [2013, 1, 20]}, "32": {"description": "I love Cheesesteaks!! I'm extremely picky.  These are the best I've had in Chicago.  Sal, the owner is very friendly and an excellent cook.  He knows customer service.  You can eat in or take out, the seating is limited.  These cheesesteaks are loaded with meat and the buns are just right.  Perfect!  Their fries are great and they load them on.  Everything is made to order just as you order it.  They have several other sandwiches too, burgers, hot dogs, chicken-cheesesteaks and others that look very good, but I can't get past the Chicago Cheesesteaks!  This is definitely a fast food place, very casual.  You've gotta try the Cheesesteaks here, one of the best food items on Cicero Ave.", "rating": "5", "date": [2013, 3, 3]}, "18": {"description": "Stopped here today after reading a few of the reviews - this place is down the street from my house, but I've never noticed it before.Tiny place - a few tables, probably wouldn't eat in, though a few people were.   I walked in and was met by a great smile and friendly service.   The lady (owner?) was so warm and welcoming.    The other patrons that came in, seemed to be regulars, as the people behind the counter seemed to know everyone by name/order.I got the Chicago cheese steak and the chicken parmesan cheese steak  - to go.   I would rate the Chicago as 10 stars.  The steak was so thin and flavorful - loaded with cheese, onions, peppers - so, so good!   The Chicken parm, I would not recommend at all - the chicken was not good and the flavor was off.The bread!  Oh - the bread!   The rolls these sandwiches are served on is some of the best, freshest I've ever tasted!The fries were just 'eeehhh'.  I think they were supposed to be crispy, they looked like they were going to be.  But they were kind of soggy and tasted old.I would absolutely come back for the Chicago Cheese Steak and the great service!", "rating": "4", "date": [2013, 3, 9]}, "13": {"description": "Fast delivery and an excellent sandwich!!! Loved this place. I have had numerous experiences with this restaurant and I have never had a bad sandwich. Awesome food and excellent service", "rating": "5", "date": [2015, 6, 28]}, "4": {"description": "Good chessesteaks. I had the buffalo chessesteak. I would have liked more cheese, but was satisfied with the amount given. Friendly and helpful staff. This place is just a few miles south of midway airport. I would recommend this place for a quick bite after work or a quick lunch.", "rating": "4", "date": [2015, 1, 5]}, "24": {"description": "It was ok. Not very expensive. Staff was friendly. The tables and chairs were a bit grimy, food was nothing to write home about. Fry portions were good. I had the cheeseburger gyro. Burger meat was not great and gyro meat was ok.", "rating": "2", "date": [2014, 5, 20]}, "6": {"description": "The food here is great, a quick stop and friendly service. The only down side would be the space, its very small to have sooo many tables.", "rating": "4", "date": [2015, 12, 15]}, "22": {"description": "UNDER NEW OWNERSHIP! Sal is no longer affiliated with this place. Don't let the new people try to tell you different and believe me they will lie to you. They said Sal has been out of town for the last two months but he never left Illinois. He opened a new location on 79th and Roberts Road. I tried them anyway foolishly believing them and its not the same. They skimp on the cheese, the meat was overcooked and there was more bread than meat. These are new people trying to ride the money train that Sal started. They will never get another penny out of me. Spread the word about Sals new location. He deserves the new and old customers.", "rating": "1", "date": [2014, 8, 1]}, "15": {"description": "Cheesesteak was delicious! Soft/tasty bun, just the right amount of onions/peppers. And the fries were probably some of the best fries I've ever had. Fresh, delicious, with a great texture. Very reasonably priced as well!!", "rating": "5", "date": [2014, 12, 30]}, "40": {"description": "I used to work in a store near this place for six years, but didnt start eating at this place til my last year at the store.  All those years I was so close but ddnt realize what I was missing.  This place has burgers, melts, gyros...etc   The value here is great, typically you can order a burger + fries for under 6.  They give you alot of fries and the burgers are pretty big.  I would eat it for lunch, but would be too full keep working after lunch lol.   The owners/workers are very friendly too.", "rating": "4", "date": [2008, 12, 1]}, "7": {"description": "Now that I found out Sal is not the owner anymore, it is clear as daylight why the service is so crappy. My girlfriend and I LOVED this place, the food was always good and service was very fast and extremely friendly. But my last experience was horrible! My fries were borderline burnt and my order was wrong which wasn't even the deal breaker as I could deal with a slight mix up, but waiting 30 minutes for two meals. That is CRAZY! You would think that it would take some time if the joint was busy but it was only a few other people before us.I also overheard other people getting upset that they had been waiting around for a while as well. Joke's on us for trying to pass of this place as the same establishment, I'm going to check out Sal's new place.", "rating": "2", "date": [2015, 2, 19]}, "36": {"description": "The best steaks in chicago a must try", "rating": "5", "date": [2012, 8, 24]}, "30": {"description": "OMG!!!!!!!!!!!!!!!!!!!!!!!!  Chicago's finest!  The best!  They aren't nice but with food this darn good who needs to!!!!!!!!!!!!!!!!!!!", "rating": "5", "date": [2013, 4, 17]}, "3": {"description": "Not bad.. very tasty sandwich.  Pretty much a fast food joint.  Small tables, Free wifii, unappealing dining area.", "rating": "3", "date": [2015, 10, 7]}, "14": {"description": "UNDER NEW OWNERSHIP! Sal is no longer affiliated with this place. Don't let the new people try to tell you different and believe me they will lie to you. They said Sal has been out of town for the last two months but he never left Illinois. He opened a new location on 79th and Roberts Road. I tried them anyway foolishly believing them and its not the same. They skimp on the cheese, the meat was overcooked and there was more bread than meat. These are new people trying to ride the money train that Sal started. They will never get another penny out of me. Spread the word about Sals new location. He deserves the new and old customers.", "rating": "1", "date": [2014, 8, 1]}}, "neighborhoods": ["Scottsdale", "Ashburn"], "latitude": 41.75143, "longitude": -87.7412555, "rating": "4.0", "times": {"Mon": ["10:00 am", "10:00 pm"], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "10:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": ["11:00 am", "6:00 pm"], "Fri": ["10:00 am", "10:00 pm"]}, "price": "$", "categories": [["Cheesesteaks", "cheesesteaks"], ["Burgers", "burgers"]], "address": ["7759 S Cicero Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Good For": "Lunch", "Attire": "Casual", "Wheelchair Accessible": "No", "Ambience": "Casual", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Drive-Thru": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "41"}, "asia-buffet-and-grill-chicago-2": {"comments": {"3": {"description": "People don't go there! My husband and i went there for a dinner buffet, got a food poising from the fish, I didn't eat the fish and I was fine! But he got huge poising, high fever and his whole body is full of red spot!! We have to go to hospital right away!! DON't go!!!!", "rating": "1", "date": [2013, 8, 29]}, "1": {"description": "This place is pretty good. Some of the food here isn't that bad at all but it always seems pretty duty.", "rating": "3", "date": [2015, 6, 14]}, "0": {"description": "How much do you regular eat at MacDonald's ????????????????I paid $6.30 after tax eatting at this buffet place.Food is a little salty. place is a little greasy. But Judge for yourself.They accept take out too.", "rating": "4", "date": [2012, 7, 13]}, "2": {"description": "I was once a fan of this place many years ago, in fact we were regulars and we were one of the first families to go there when it opened I believe in 1997, but that was then and this is now. Not the cleanest of Buffets any longer. I mean, you have kids as young as 3 serving themselves and putting food back (umm that's where I draw the line). I just don't get how parents let their kids run amuck inside an establishment anyway. Just doesn't make sense. Although it has been \"remodeled\" it really doesn't matter. If the food is brought out in little heaps and they wait till people are scraping the containers than I think we have a problem Houston! I don't really care for the Asia Buffet any longer, but once in a while, I do pass by to see if anything has changed, and not to my surprise, it hasn't.", "rating": "2", "date": [2010, 11, 15]}, "5": {"description": "always full of a lot of families & older people", "rating": "3", "date": [2013, 1, 29]}, "6": {"description": "Update! Today my companion and I were joined by an uninvited guest--a COCKROACH crawled along the wall toward our table. Needless to say, we left quickly--roaches out in broad daylight indicate a huge problem with pest control.  Worse, we notified the cashier, who just shrugged and said \"Sorry.\" Obviously we were not the first people to have this appetite-killing experience. I can no longer recommend this restaurant. Too bad.Update to the update:I let the restaurant know that I posted the above caveat, and the manager called me right away, apologizing profusely.  She explained that the place was just treated for pests and that sometimes, immediately after insecticide is applied, roaches emerge from their hiding places. I know that's true, according to my friends in the pest control business. She also offered to comp my friend and me lunches on our next visit. I doubt I will be returning, because I don't think I will ever be able to eat without worrying about their \"problem,\" and maybe I should have insisted on a refund. But I think she was sincerely upset and tried to make restitution, which is what counts. I guess the lesson for the manager is that people can and will tell others about their experiences, and it will reflect, for better or worse, on their business. Therefore, it's important to train employees to handle this sort of complaint. And the lesson for me is, the next time something like this happens--go to the manager/owner on site ASAP and politely explain the problem. The cashier's reaction was almost as off-putting as the actual roach.  Yech.", "rating": "1", "date": [2011, 5, 31]}, "7": {"description": "My limited time working at the new office in sunny Scottsdale (not AZ) has proven a couple of things.1) Suburbia has spilled back into this southwestern strip of the city along Cicero Ave. with all of the chain stores and strip malls leading all the way down to Southwest Highway.2) The people in the area are very nice in general.3) If you are looking for buffet heaven away from the bright lights of Vegas, you can't do much better than Scottsdale.Now I haven't tried any other buffets other than this one (there are seemingly about 10 of them in this small area), but if the others are nearly as good, then my preconceived notions about poor quality of food at buffets here in Chicago should be thrown out the door.Here you will get a very American version of Chinese food, along with a hodge-podge of other American buffet staples like mac 'n cheese, chicken fingers, pizza and so forth.The thing about this place is that their dishes are consistently pretty good!  Considering the cost involved (about $8 for lunch) and that they offer a lot of different kinds of seafood, I think it is a great deal.The prawns are a great deal in themselves.  If you like tearing into the whole-bodied prawns and can't get enough of them- come here.  For $8 you can gorge yourself on as many as you can handle!", "rating": "4", "date": [2010, 3, 22]}, "8": {"description": "Oh boy....here I am writing a review for an Asian buffet....located in a suburban mall....The end of the world is fast approaching.That's a FACT.So does this place really deserve 4 stars?!? Not quite. But I want to push it up because really this little hole in the wall (ok, it's a figure of speech - it's actually quite big) does a pretty good job in its category. So....oomph.....move a little bit......up......a bit on the left....THERE.Here you go. 4 stars!!After hearing rave reviews about it from someone (clue: we share the same address) I decided that I wanted to give it a try, just to say that I had had lunch in Scottsdale. So after a few stops in a couple of glorious furniture stores, losing my phone, finding it at a store counter and calming my racing heart - we pushed the door, paid the $7.95, chose a table and started working our way.Traditional fare but a few things worth mentioning:- wonton soup- mussels in black bean sauce- onion prawns - gigantic and whole (yep, with the head. Love tearing them apart!) and most of all, perfectly cooked. A small miracle in a buffet!- crab legs- salmon on the plank (not very Chinese, sure, but still delicious)- steamed asparagus- octopus with chili peppersProbably not worth all the way down there but if you find yourself around for whatever reason (and I am sorry for you, really), a nice little spot to stop by.", "rating": "4", "date": [2010, 3, 19]}, "9": {"description": "I ate here about a week ago. It wasn't that bad. I don't feel it was worth 10.00. The place was very  clean.  The food wasn't that bad. I had sushi it was pretty good! All you can eat sushi! Yummy. I would visit it again, but only for lunch. It was cheaper!", "rating": "3", "date": [2007, 12, 15]}, "10": {"description": "This place was right across the street from the hotel I was staying at near Midway Airport.  That's the only reason I went.  All in all, you would be better off starving than spending $10.50 eating at this place.  It's no different from the millions of other Asian buffets; probably worse...", "rating": "2", "date": [2006, 7, 3]}, "4": {"description": "all the Chinese buffets in the area all have one thing in common....The quality of food is diminished. Was a fan of this place for years, but the last two times have found low food temperature and old food on the line. Complained to the cook, couldn't understand me but brought me fresh  hot crab Rangoon. Just sad how prices go up, but quality goes down.", "rating": "2", "date": [2011, 9, 14]}}, "latitude": 41.7461573, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Chinese", "chinese"]], "address": ["8059 S Cicero Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "longitude": -87.7410786, "category": "Restaurants", "rating": "2.5", "price": "$$", "number_of_reviews": "11"}, "leonardos-pizza-chicago": {"comments": {"0": {"description": "Food came 2 hours later, and was ice cold.. will try again and see if it was just a bad day", "rating": "1", "date": [2013, 3, 6]}}, "latitude": 41.7367362976074, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Italian", "italian"], ["Pizza", "pizza"]], "address": ["8555 S Cicero"], "attributes": {"Take-out": "Yes", "Has TV": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Delivery": "Yes", "Outdoor Seating": "No", "Caters": "Yes", "Takes Reservations": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "longitude": -87.7405242919922, "category": "Restaurants", "rating": "1.0", "price": "$", "number_of_reviews": "1"}, "kenwood-wine-and-liquors-oak-lawn": {"comments": {"28": {"description": "Kenwood has the lowest prices of beer, wine or spirits anywhere. Well worth the trip to the south suburbs. As a matter of fact people come from as far away as Ohio to take advantage of the prices. Be prepared, the place is small with a great selection. But it can get very crowded and the parking lot gets hectic especially around holidays. And bring cash, they don't take credit cards.", "rating": "5", "date": [2010, 6, 11]}, "1": {"description": "Kenwood has always been the place to go for liquor if you happen to find yourself on the Southside. And i've been to their other location many times. So when I found out they had another location I had to check it out. It took quite a while before I actually got the chance to go to this location but I am glad I finally was able to get here. I must say I am very glad I did, not only did I realize this one is closer to me than I originally thought, but they seemed to have a slightly bigger selection than the other. And the best part about it no city tax, yeah!  Now being that I had more to get done that day, I didn't get to peruse the variety as I might've wanted to, but I did see that they have quite a variety to suit everyones tastes. Whether you're a wine drinker or you fancy liquid spirits, you're guaranteed to find what you are looking for here. Now like other reviewers have stated the parking lot is very small and compact, and can be quite a traffic jam when it's full. But it's hardly a deal breaker considering.I am looking forward to revisiting this place when I have a bit more free time. This place definitely has the potential to be one of my go to spots.", "rating": "5", "date": [2015, 4, 20]}, "9": {"description": "I think everyone in the SW burbs knows that Kenwood is the place to go for liquor - the cheapest prices around.   Seriously, they beat everyone on prices.   You see people leaving this place with cases and cases of beer, wine, spirits.   You don't just come here to pick up a 6-pack....you stock up.The place isn't big.  The aisles are not big.  The place is packed tight with as much alcohol as possible.  It is almost impossible for 2 people to be in aisle at the same time.  There are workers everywhere - trying to keep the place stocked.   Beer is flying off the shelves, stacks, friges as fast as they can stock it.  The prices are that good!Parking kind of sucks - they have a lot, but it is not big.  People are parking down the street and across the street.    I try to come at 'off' hours, and never on weekends.  Can't beat the prices!", "rating": "4", "date": [2013, 5, 2]}, "29": {"description": "Cheap prices. Always packed. Cash only. They will special order. Even better it's less than a block from my house!", "rating": "5", "date": [2010, 3, 6]}, "23": {"description": "This place is an experience. It's like watching an elaborate cuckoo clock of booze-- a small, perpetually crowded, filthy, bizarre cuckoo clock of booze. The cashiers look like they should be in a police lineup. The stock boys struggle to keep bottles on the shelves as what seems like the entire south side takes them away. I was here once on Christmas eve, and someone managed to get on the store intercom and started singing My Country Tis of Thee. Nobody batted an eye.In all seriousness this place has a wide and cheap selection, but getting it can be a complete ordeal.", "rating": "4", "date": [2011, 5, 18]}, "5": {"description": "Apothic Red Wine always on sale for $6.99 - everywhere else in the area the same bottle goes for $9.99 and up. Thank you Kenwood! Insane selection of craft beers and wines. It takes a few minutes to make up your mind with all of the options, which is a good thing.", "rating": "5", "date": [2015, 5, 1]}, "31": {"description": "The hard liquor prices are the best I've seen anywhere. The tequlia selection is extensive as is the whiskey, scotch and vodka. The beer is the best priced around and there is a good selection. The wine selection is something I've looked at, but  have never bought anything, it is a very basic  selection.   The champange prices are very good as well,  again the selection is basic.We stopped in last Saturday night at about 9:50 p.m.,  and as usual it was packed. I have never been here when it isn't  crowded or packed. Bring plenty of cash.", "rating": "5", "date": [2009, 7, 31]}, "25": {"description": "Update - they take credit cards now - woo hoo!  Fantastic prices (especially on wine) but the layout of the entry and 1st aisle as well as the parking lot are both a large pain in the butt.  There is a 15% discount on 6 bottles of wine - not just a case!  I am the \"Northside\" supplier of various cases of wine due to the fact their prices are $3.00 per bottle lower than Binny's - lol!", "rating": "4", "date": [2010, 12, 7]}, "12": {"description": "It's like a miny Binny's. Half the selection (which is still extensive especially given the size) and more often than not even lower prices! I've found handles of Johnny Walker cheaper at Costco and a few beer cheaper in Binny's but for the most part it's the cheapest game in town. Cash only.Parking can be tough.It only seems to get busier at night. The Police drive around this block frequently so you know stuff is going down regular in the vicinity. I feel like I'm starting to reveal too much about myself now that I'm reviewing Liquor stores. Let's just say I've been to a few.", "rating": "4", "date": [2012, 10, 2]}, "37": {"description": "Are you throwing a party or are you a beer connoisseur? This place is awesome. It is the cheapest liquor store with the largest selection you will ever find. If you live south or can be near this store, it is worth the drive. You can buy in bulk and get an even better price on wine and champaign.", "rating": "4", "date": [2007, 6, 11]}, "21": {"description": "Hands down, BEST prices and BEST liquor selection in town (...or around town.)  However, the parking lot is a joke.  Only holds a couple dozen cars and the parking situation makes you feel like you're going to hit a patron or another car regardless of which way you try to maneuver your vehicle.  I typically park in the residential side streets to avoid the lot altogether.  Would also be VERY nice if I could use my debit card or a credit card because I usually stock up, spending way too much to cover with the little amount of cash I usually carry.  I had to blow the dust off my checkbook cover the last time I was there because I didn't have enough cash and they wouldn't take my card.  Alas, even these things don't keep me from shopping there though, the prices are just too great.", "rating": "5", "date": [2011, 10, 12]}, "16": {"description": "I come here for their craft beer, which they have gotten much about about organizing in the past year or so. They have the best prices in the neighborhood as well as a  great selection. My only complaint is that they keep practically none of the good stuff in the fridge... not the end of the world.  Oh yeah, and cash only is kind of a pain. However the prices here definitely make the trip here worthwhile, instead of George's, who sometimes charge $3+ more for a six pack than Kenwood does. Their beer guy knows his stuff as well.", "rating": "4", "date": [2013, 8, 28]}, "17": {"description": "Great prices, great selection.Just make sure you have no one under 21 in your car. They have people patrolling the parking lot and the nearby street, staring into your car to make sure you don't buy for underagers. Creepy and annoying, but.Oh, and they don't take credit cards.", "rating": "4", "date": [2011, 8, 12]}, "10": {"description": "**Cash only**I love this liquor store. The prices are crazy cheap. The staff is always asking if you'd like help and they have helped me pick out various gifts that have always been well received. I just have to constantly remind myself of the cash only thing. There is an ATM inside though if you forget.", "rating": "5", "date": [2013, 1, 4]}, "11": {"description": "I love this place. From the helpful staff down to the whole retro, neighborhood go-to, kitchy vibe, this store makes me so happy!As for the parking complaints, well.  The small lot is often packed because of the selection and prices, duh!  I find the occasional minor inconvenience completely worth it. Denise in particular is always super helpful and knowledgeable, especially regarding wines.  She'll help you find what you need and send you on your way with a smile.  And yeah, I've come across a curmudgeon or two in the establishment as well.  I get a kick out it, I think it adds to the charm.  If you expect corporate prices and stale, disingenuous corporate customer service, then be my guest and grab your overpriced crappy beer at Jewel.  They now accept credit as well as cash, though I didn't mind when they didn't.  I just moved from Chicago Ridge to pretty far north of Kenwood, but I plan on making trips down to this store now and again.  I think this spot is really endearing, down to the blinking lights of their 50s sign out front!", "rating": "5", "date": [2014, 2, 4]}, "26": {"description": "I grew up in the southwest 'burbs. My parents used to buy booze from Kenwood, so for the last two years we headed to Oak Lawn to pick up some beer for our holiday party. By \"we\" I mean myself and my girlfriend. The last time we went, we were told they did not accept state ID's as a valid form of identification. That is not legal. Even so, we went in this time and I decided to purchase the alcohol because I have a valid driver's license. I handed the cashier my license, and--with serious attitude--she demanded to see my girlfriend's license. I said she has a valid state ID, but doesn't drive. She said she could not sell a 27-year-old woman and her 27-year-old partner a 12-pack of beer because she does not have a driver's license? That is NOT legal. The cashier tells me it is an Oak Lawn policy. That is false. It is an ILLEGAL store policy. Also, I find it strange that no one else I know has had that problem. I never pull the \"homophobia\" card--but I'm pulling it now. We were CLEARLY discriminated against. Also, their cash-only policy is suspect. I feel like if this place were even mildly investigated--there would be some dirt. I've seen better alcohol prices at Jewel, and I really hope the Village of Oak Lawn does something about their illegal and discriminatory policy. Kenwood will never see a dime of mine--or my family's--money again. I also plan on being very vocal about my experience there.", "rating": "1", "date": [2010, 12, 4]}, "27": {"description": "I don't get the hype.  I've been to this store twice now, and always have a bad experience.  Parking is a nightmare, it's VERY hard to find anything, forget about needing to ask for help, and as for prices, really, compare around, it's nothing special.  I wasn't aware by any sort of signage at all that they didn't take credit cards, which was a massive inconvenience.  Overall, that big of a hassle to save maybe a dollar? No thanks.  The logic of driving that far out of my way and wasting that much gas to save pennies just doesn't make sense.For my buck, I'd rather go to Stadium Liquors in Burbank.", "rating": "1", "date": [2010, 9, 2]}, "35": {"description": "Best and cheapest liquor store ever.  Holy fuck.", "rating": "5", "date": [2008, 8, 28]}, "8": {"description": "PRE-NOTE: Paste this into your youtube browser, NOW! Händel Messiah - Hallelujah ChorusDo eeeeeet! Only this song will justify the feeling I had this past Saturday when I sauntered on in to Kenwood *It'sall good!\") to stock up on some holiday spirits. After plopping down an obnoxious amount of alcohol on the counter and waiting to hear the death toll, I strained my shoulder while taking out the giant wad of cash I had extracted from my bank's nearest ATM. While I was taking in a deep breath in preparation to pull it from my wallet, I noticed a strange blinking device on the counter with a small computer screen and what seemed to be a swiping strip for a credit card. ..in Kenwood?!  I stared for a moment, captivated as people behind me started to angrily grunt to express their dissatisfaction in waiting an extra thirty seconds. I finally spoke to the cashier, eyebrows furrowed in confusion.Me: \"...the hell is that?!\"Cashier: \"Six weeks now.\"Me: \"What?! It's a Christmas miracle! I'll hang onto these Benjamin Franklins, if you don't mind sir...I'll take full advantage of this!\"The cashier looked at me in confusion, though I'd like to think he was in awe of my personal discovery. I've been griping about Kenwood not having modern payment options since 1999! I nearly kissed him before swiping up my booze (Which they packed lovingly into a nice, easy-carry box.) Skipping out the door, I bid a Merry Christmas to the stock boys, whom stared at me with equal confusion. They do then, were in awe!Merry Christmas and happy shopping!", "rating": "5", "date": [2013, 12, 23]}, "0": {"description": "Forget about Binnys, Kenwood has the best customer service around, Dave Larry Justin John Andy Tim.... All of them! Superb selection, great prices, they don't mark up the popular beers like Binny's does! They certainly reward customer loyalty. And I love how even today after so many years they are not comfortable just doing the same thing they are always looking to improve the experience for the customers. Great job guys see you on my next beer run.!", "rating": "5", "date": [2016, 3, 3]}, "38": {"description": "This place has a huge selection of wine beer and liquor.  If there is something out of the ordinary that I am specifically looking for than most likely they have it here.  The prices are reasonable and did I mention that they have a huge selection!  This place can get very crowded and they do not have a very big parking lot.  Your best bet is park on the side street.", "rating": "4", "date": [2006, 4, 8]}, "20": {"description": "The best way to describe the parking lot here is,  Mad Max beyond thunderdome. save yerself the hassle of the cash only policy and purchase your boose and any one of a hundred different stores in the area. If saving 25 cents is an issue for you, shop here.", "rating": "1", "date": [2012, 2, 25]}, "19": {"description": "I grew up in the southwest 'burbs. My parents used to buy booze from Kenwood, so for the last two years we headed to Oak Lawn to pick up some beer for our holiday party. By \"we\" I mean myself and my girlfriend. The last time we went, we were told they did not accept state ID's as a valid form of identification. That is not legal. Even so, we went in this time and I decided to purchase the alcohol because I have a valid driver's license. I handed the cashier my license, and--with serious attitude--she demanded to see my girlfriend's license. I said she has a valid state ID, but doesn't drive. She said she could not sell a 27-year-old woman and her 27-year-old partner a 12-pack of beer because she does not have a driver's license? That is NOT legal. The cashier tells me it is an Oak Lawn policy. That is false. It is an ILLEGAL store policy. Also, I find it strange that no one else I know has had that problem. I never pull the \"homophobia\" card--but I'm pulling it now. We were CLEARLY discriminated against. Also, their cash-only policy is suspect. I feel like if this place were even mildly investigated--there would be some dirt. I've seen better alcohol prices at Jewel, and I really hope the Village of Oak Lawn does something about their illegal and discriminatory policy. Kenwood will never see a dime of mine--or my family's--money again. I also plan on being very vocal about my experience there.", "rating": "1", "date": [2010, 12, 4]}, "33": {"description": "Low prices and great selection. My only qualm with this store is that if you go on a weekend or holiday, the parking lot is ridiculous! People always coming and going - which is a review in itself!", "rating": "4", "date": [2008, 9, 23]}, "2": {"description": "Kenwood is a suburban gem! The Good: * Prices here are the lowest around, no city tax since you're in the burbs! Yes, even better than any Binny's.* The selection here is tits. Looking for something you can't find anywhere else? These people probably have it. I've never been disappointed by not being able to find what I went in for. * They always have samples. Now I do have a qualm about this because it's always things that everyone already knows about. Jack Daniels, Malibu, etc. If I'm going to be persuaded into buying something, I want it to be new and exciting! Whatever.The Bad * When you enter, it's hard to navigate through because there is an overwhelming amount of product stacked like a corn maze at the entrance. The Ugly* The parking lot. Ughhhhh it's awful. Obviously The Bad and The Ugly are not serious enough to dock any stars because this place is amazing.", "rating": "5", "date": [2015, 2, 28]}, "34": {"description": "+ Low, low prices+ Huge Selection+ Generally friendly and helpful staff- Insanely busy around holidays- Not nearly enough parking especially on holidays. (I once had to park on a side street two blocks over west of the store and walk.  I made the mistake of letting my dad sucker me into going there on a Friday before a holiday weekend.)- They only take cash, but as long as you know that before you get there it's not a problem.Despite the negatives this truly is a 5 place.  It is well worth the trip.", "rating": "5", "date": [2008, 8, 29]}, "32": {"description": "This place is fantastic.  First off, they only accept cash, but they do have an ATM in the store.  Prices are cheap, the selection is HUGE, and the staff is very helpful when you're trying to locate something.  It's not glamourous, but it's a liquor store.  The lines were absurd on New Year's Eve at about 4:30, but that's my own fault for waiting until then to go get booze.  Parking is a bit tricky, but there is street parking so if the lot's full, it's worth the walk rather than waiting to get a spot.", "rating": "5", "date": [2009, 1, 14]}, "18": {"description": "OMG! This place is like Toy's R Us for adults! We actually like the new one in Homer Glen better and go there now that it is open. Their everyday prices are better than any other. Yes, they beat the hell out of everyone, even Binny's. Also, if you can't find what you are looking for here, it isn't available anywhere. Saturdays they always have tastings which is great, but it really makes the store crowded. Believe me when I say, this is worth the drive, regardless of how far away it may seem!", "rating": "5", "date": [2011, 5, 2]}, "13": {"description": "I came here with my friend who had been coming here for years and said it was an inexpensive place with a very good selection. I figured why not? So we walk in and the lady and the older gentleman were very nice and friendly, and the selection was indeed good.After we picked out our beers, we went to go pay, and that's when things went downhill. My friend was ahead of me and went to go pay, and when he was carded he gave the nice lady his state ID. That's when this short gentlemen rudely interrupted and said \"We only take Driver's licenses\". I butted in and asked him \"Really? It's a valid ID though\".He offered no clarification, no explanation, he just rudely stated again \"We only take driver's licenses\", not even looking us in the eyes.I'm sorry, but we're not there to drive a car, we're there to buy liquor. A state ID is more than adequate for this purpose, as it is a state ID that proves your identity and age, and is accepted everywhere else.Then a couple of days later my younger friend in her mid 20's who always gets carded everywhere we go bought liquor there and said her state ID was just fine, so either the rules are flexible for some people, or the guy decided he was having a bad day and took it out on us.Either way, Mr. Napoleon Complex and the lack of accepting credit cards outweighs the savings, so I'd rather take my business elsewhere. However I do want to thank the lady and the older gentleman, as well as the stock person roaming the isles though for being nice at least.", "rating": "2", "date": [2013, 5, 19]}, "4": {"description": "Its been said before and it will be said again, this place is a true gem. Anywhere that has dolly's as well as carts is clearly a winner. Sure, the parking lot is small and the place is crowded. I don't know what size parking lot you're expecting from a Cicero front corner store that is surrounded by residences in the back, OR, why you'd like your liquor store to be a ghost town. Its busy because its cheap and has good customer service. The lot is small because the neighborhood is old, as is the location. I myself kind of enjoy the entrance where you're greeted by every dirty 30 they've got in stock, including Strohs (which is awesome fyi).They do this so you don't have to carry the really heavy stuff halfway across the store (or so I imagine, thanks for thinking of me Kenwood!) Once you've made it past the college carry-alls of Natty Ice and Keystone you're embraced by the well stocked aisles of wine, liquor and beer. Sure, it doesn't have quite the breadth of offerings like Binny's, but it also doesn't occupy an old bowling alley, so instead of crying about it, why don't you go brave the small parking lot and buy an entire trunk full of booze using their dollys so you don't have to come back as often...", "rating": "5", "date": [2016, 2, 2]}, "24": {"description": "OMG! This place is like Toy's R Us for adults! We actually like the new one in Homer Glen better and go there now that it is open. Their everyday prices are better than any other. Yes, they beat the hell out of everyone, even Binny's. Also, if you can't find what you are looking for here, it isn't available anywhere. Saturdays they always have tastings which is great, but it really makes the store crowded. Believe me when I say, this is worth the drive, regardless of how far away it may seem!", "rating": "5", "date": [2011, 5, 2]}, "6": {"description": "No parking even though they have a decent lot.   It sobusy.   I feel like I walking through  a cattle run.   Iwould rather go elsewhere with low prices.   There are many other stores in the ares.", "rating": "1", "date": [2015, 12, 19]}, "22": {"description": "Great prices, great selection.Just make sure you have no one under 21 in your car. They have people patrolling the parking lot and the nearby street, staring into your car to make sure you don't buy for underagers. Creepy and annoying, but.Oh, and they don't take credit cards.", "rating": "4", "date": [2011, 8, 12]}, "15": {"description": "Go-to place for liquor in this area! You won't find any other place that's cheaper than Kenwood. The downsides: it's usually quite packed (especially on weekends) so parking is a pain, space inside is pretty cramped and for as long as I've been coming here, they only take cash. However, what I love is that we can find anything we want here and we're paying less than what you'd pay at other grocery & liquor stores. My husband's favorite bargain here: they sell bundles of Monster (24 cans in all) for a seriously discounted price.", "rating": "4", "date": [2013, 11, 11]}, "7": {"description": "This place has always had the best liquor pricing in the area. The parking lot is tight, but there are additional spots on the side street as well as about a dozen spaces on the north side of the building. The few problems I had with Kenwood several years ago have been addressed: they now accept credit/debit cards and their craft beer selection has grown immensely. Plus sometimes they'll have crazy-low pricing on overstock.", "rating": "5", "date": [2015, 4, 21]}, "36": {"description": "Great prices and good selection...Very crowded during the holidays , not enough parking..I need to  pickup some Patron'..", "rating": "4", "date": [2008, 1, 14]}, "30": {"description": "Amazing prices and Russian Standard Vodka!!", "rating": "5", "date": [2009, 8, 8]}, "3": {"description": "Best selection of liquor in the area. You name it, they got it. Amazing, never-ending variety of liquor, beer & wine. This includes the high-end items like Don Julio 1942 & Shafer one point five select cabernet sauvignon. Very small parking lot, only park here if you can magically maneuver your car! Wine gift bags also sold here for you last minute gift givers.", "rating": "5", "date": [2014, 12, 30]}, "14": {"description": "The prices here are the lowest I have ever seen in my life.  The selection of alcohol here has everything you need.  The workers here are very knowledgeable with all types of alcohol (there are different wine and alcohol specialists).  They also have a good amount of sampling going on during the weekends.The only downside is the store and parking lot is a bit small, so it does get a bit cramped.  Last time I checked, they still don't take credit card.  Aside from that it's still worth it as I'll drive 20 min from my home to shop here.", "rating": "4", "date": [2012, 9, 25]}}, "latitude": 41.696596, "categories": [["Beer, Wine & Spirits", "beer_and_wine"]], "address": ["10750 S Cicero Ave"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.740328, "times": {"Mon": ["9:00 am", "10:00 pm"], "Thu": ["9:00 am", "10:00 pm"], "Sat": ["9:00 am", "11:00 pm"], "Wed": ["9:00 am", "10:00 pm"], "Tue": ["9:00 am", "10:00 pm"], "Sun": ["9:00 am", "7:00 pm"], "Fri": ["9:00 am", "11:00 pm"]}, "rating": "4.0", "category": "Food", "price": "$", "number_of_reviews": "39"}, "deanas-salon-chicago": {"comments": {"0": {"description": "deana is awesome ..great cuts for the kids only 5-10$Cut and color 65$ Eyebrows wax 10", "rating": "5", "date": [2014, 4, 26]}}, "neighborhoods": ["Scottsdale", "Ashburn"], "latitude": 41.7492340266145, "longitude": -87.7234053611755, "rating": "5.0", "times": {"Mon": ["10:30 am", "6:30 pm"], "Thu": ["10:30 am", "7:00 pm"], "Sat": ["10:30 am", "7:00 pm"], "Wed": ["10:30 am", "7:00 pm"], "Tue": ["10:30 am", "7:00 pm"], "Sun": ["10:30 am", "4:00 pm"], "Fri": ["10:30 am", "7:00 pm"]}, "price": "$$", "categories": [["Barbers", "barbers"], ["Hair Removal", "hairremoval"], ["Hair Stylists", "hairstylists"]], "address": ["4051 W 79th St"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "No", "Good for Kids": "Yes"}, "category": "Beauty", "number_of_reviews": "1"}, "dunkin-donuts-chicago-244": {"comments": {"1": {"description": "I went there this morning to get some breakfast for my family.  I was excited when I got there because they were doing a survey in the drive thru where you got a $2 gift card.  Score.  So I took the survey and gave them good answers because everything was going great...until I got home and realized my entire order was wrong!", "rating": "1", "date": [2014, 7, 26]}, "0": {"description": "It took 10 minutes to get my bacon, egg & cheese bagel. The people there were vary rude and obnoxious! And they didn't even apologize.", "rating": "1", "date": [2015, 6, 9]}}, "latitude": 41.7489588260651, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Donuts", "donuts"], ["Coffee & Tea", "coffee"]], "address": ["7905 S Cicero Ave"], "attributes": {"Outdoor Seating": "Yes", "Bike Parking": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes"}, "longitude": -87.7412943542004, "category": "Food", "rating": "1.0", "price": "$", "number_of_reviews": "2"}, "dollar-tree-burbank-2": {"comments": {"1": {"description": "Nasty attitude,cashier Karla if that's her name didn't  even greet me when I said hi looked like she didn't even want to be there. Why do they hire these useless people that just want to collect a paycheck and make shoppers not want to come back.", "rating": "1", "date": [2015, 5, 13]}, "2": {"description": "This is a horrid store.  It gives a bad name to a really great company.  We went here today, 12/7/2013.  Not only is this store small, it's a miserable experience with poor management.  The store was packed for no real reason, but that's of course not their fault.  What was their fault was the filthy floors and baseball and other cards and boxes all over the ground at checkout, and the 20 minutes+ it took to checkout!  I counted at least SEVEN people who worked here yet nothing was getting done in a prompt manner!  There were four checkout lanes open and being used, and the dozens of people in line waited forever for a store WITH EVERYTHING PRICED AS A DOLLAR to checkout!  The credit card machine took about 2 minutes to take my payment that usually takes seconds.  To top it off, the parking is packed and sucks as well.    If this store was any slower, it'd automatically turn into a molasses factory!  Never again.    Please go to the Merrionette Dollar Tree instead, it's fast, neater, and much, much larger!!", "rating": "1", "date": [2013, 12, 7]}, "0": {"description": "Yeah this place is kind of a dump.  I go there because it's close to my house and I have a few items I but there regularly.  The line is always long and the place is always a mess.  The employees are rude too.  I used a basket once when I was in there and after I was done putting my items on the counter I put my basket on top of the other baskets that were next to the counter.  The cashier was like that's not where they go, huffed at me, and moved the whole stack of baskets by the front door.  Sorry lady, the other five baskets must of thrown me off.", "rating": "2", "date": [2014, 6, 8]}}, "latitude": 41.7443599, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Discount Store", "discountstore"]], "address": ["8144 S Cicero Ave"], "attributes": {"Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.7412961, "category": "Shopping", "rating": "1.5", "price": "$", "number_of_reviews": "3"}, "lee-nails-chicago-2": {"comments": {"3": {"description": "Horrible service. I asked for no chip manicure and the lady kept saying acrylic.  I kept telling her no that they were my real nails not fake ones and she kept insisting and I kept telling her no. When I thought she had gotten the point she tried to pull my nail off!  Never going there again!", "rating": "1", "date": [2013, 11, 25]}, "1": {"description": "Horrible experience.  Bad service...The girl was watching a movie on her phone while she was doing my nails. She didn't do what I wanted.  Never going back!", "rating": "1", "date": [2014, 3, 15]}, "2": {"description": "So decided to give them another shot even though it's new management. Ugh, bad idea. Had bad experience with pedicure. Lets just say I walked out limping with a bandaid, no apologies, and no discount. Manager was there, she seen, and nothing. Never again. Im picky with nail salons, miss the old management :( . After some searching finally found my new spot, I highly recommend the new place I go to yelp.com/biz/e-nails-chi…", "rating": "1", "date": [2013, 7, 25]}, "5": {"description": "I must say that I was very pleased the way my nails came out today my first time here, I got the PINK&WHITE set, it's more expensive than the acrylic or gel nails, but well worth it! Vu did my nails, he is good! I will definetely come back!!!!!", "rating": "4", "date": [2010, 11, 4]}, "0": {"description": "This used to be my regular go to. However, recently there was an ownership change. While there are two or three ladies from previous owners that still work here, overall it has gone downhill. I used to love this place now I'm on Yelp looking for a replacement. Cleanliness, friendliness, and overall feeling is no longer acceptable.", "rating": "2", "date": [2012, 8, 4]}, "4": {"description": "Terrible service, the place was extremely dirty. The woman who was doing my nails used dirty utensils and didn't bother cleaning up the women's mess before me. She actually had nail clippings all over her station. Definitely never going back!", "rating": "1", "date": [2011, 9, 11]}}, "latitude": 41.7489934, "neighborhoods": ["Scottsdale", "Ashburn"], "categories": [["Nail Salons", "othersalons"]], "address": ["7903 S Cicero Ave"], "attributes": {"Parking": "Private Lot", "By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.7412151, "category": "Beauty", "rating": "1.5", "price": "$$", "number_of_reviews": "6"}}