{"margaritas-pizza-chicago": {"comments": {"12": {"description": "Hello, My name is Tammy and I am a Pizzaholic.My friend calls me a Pizza Snob and I wear the crown gracefully.So, last night was my 3rd tasting of Margarita's. I would have given them 4 stars but you'll understand why.In my opinion, Margarita Pizza Makers/Chefs give me the feeling that they once worked at Italian Fiesta. If I were blind-folded and had to choose which one was from  I.F., I couldn't guess. The XL Pizza's are TRULY EXTRA LARGE. They're ingredients were fresh. I ordered a sausage/pepperoni for the kids and a sausage/mushroom/black olive for myself. EXCELLENT!!! I also ordered a 4 wing dinner that included fries and mostacholi and garlic bread.  If you're a fan of BIG/Full Figured Chicken wings this is the place for you. I prefer smaller wings however they could be seasoned a little better. The mostacholi was decent with plenty of meat in the sauce. Delivery was within an hour yet the Pizza wasn't piping hot. (I like to see steam). The only drawback is the pricing. While I am willing to pay for quality food, I spent $61.73 for 2 XL Pizzas, a 4 wing dinner, and delivery.", "rating": "3", "date": [2012, 2, 24]}, "3": {"description": "if you love Italian Fiesta, you will definitely love here! great Mexican food also. Well priced.", "rating": "4", "date": [2015, 10, 25]}, "1": {"description": "My family historically (like for generations) ate Italian Fiesta until I found Margarita's in 2000. If you love Italian Fiesta, you will definitely love them! Great thin crust, fresh ingredients. Beggars and the rest pale in comparison!  They also have excellent Mexican food and fried chicken. Well priced. They've had the same in-store manager for almost 20 years. Hey Luther!Try them, u won't be disappointed.", "rating": "5", "date": [2016, 2, 9]}, "2": {"description": "Very good pizza! Nice,  thin, greasy, flavorful pizza!", "rating": "4", "date": [2015, 11, 10]}, "9": {"description": "This was my first time ordering...pizza came on time...piping hot...fresh...delicious!!!", "rating": "5", "date": [2015, 4, 17]}, "10": {"description": "Pizza is delicious thin crust its in the hood so it's carryout only I believe they have delivery we got a super sized cheese and sausage cook perfect people very nice and it came with a liter of soda working in the neighborhood and if I'm back in the hood I will order again", "rating": "4", "date": [2015, 1, 28]}, "4": {"description": "Got to say some of the Best pizza in Chicago in the 2010's. Hands down. I tried them all. Consistently I'd stick with California Pizza kitchen, Connie's and Home run Inn but I wanted to make this list.It would go in this order- 1980's-Italian Fiesta-71st & Jeffery1990's-Ginos east pizza-Superior& Michigan2000-Giordano's Pizza- Rush Street & Wabash2010's-Margarita's Pizza-79th Street", "rating": "5", "date": [2014, 12, 9]}, "6": {"description": "We ordered a med pizza and an Italian combo. The order taker and female delivery person was very nice. However, there's a Hispanic guy I spoke w/who was the ruddest person I talked with!! The combo was horrible and his attitude was just as horrible!!! When I explained who hirrid the meat was, he said it's all the same. So we ordered the jumbo shrimp at 9:28pm. It's is 10:45pm and still waiting!. I called the guy(same one), he said they will be here in a few minutes. Still waiting at 10:47pm. Im totally disgusted w/this place as well as the manager. Horrible attitude. We pd 27.00 w/a 5.00 tip. Very disappointed. Never again.", "rating": "1", "date": [2015, 11, 14]}, "0": {"description": "One of the best pizza spots in Chicago! In the hood but pizza so good!Great family size pizza. Better than the location on 75th lol", "rating": "4", "date": [2016, 3, 6]}, "5": {"description": "Ordered a cat fish well done gOt A greasy half done mess", "rating": "1", "date": [2015, 8, 30]}, "13": {"description": "The pizza is AWESOME, but I just can't get past the rude person answering the phone. But it's so good. What to do???? Lol", "rating": "2", "date": [2011, 1, 26]}, "11": {"description": "I ordered individual pizza with sausage and onions and it was great. It is enough to feed two. I also tried their chicken wings and this is where they get the fifth star...chicken was very crispy and flavorful..not greasy at all...these were fried wings..I would definitely recommend..and they deliver to the pill hill area. Please try them if you can.", "rating": "5", "date": [2014, 5, 25]}, "8": {"description": "Pizza ok ! Dry cardboard really with chesse this place was ridiculous I don't know who thought this was what you call pizza but is nothing compared dry sandpaper", "rating": "1", "date": [2015, 5, 13]}, "14": {"description": "Best thin crust pizza in Chicago. Nice crispy edges, tasty toppings. Fast delivery (usually about 45 minutes). Good Italian sandwiches, fries and cole slaw, too. Take out and delivery only, no tables for eating in. Prices very reasonable.", "rating": "5", "date": [2010, 1, 29]}, "7": {"description": "The prices are affordable. The pizza is the next best thing to Italian Fiesta. I usually get a veggie pizza or pepperoni with fries, it's worth trying.", "rating": "4", "date": [2015, 5, 22]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7517952620983, "longitude": -87.5587029755116, "rating": "3.5", "times": {"Mon": ["10:00 am", "12:00 am"], "Thu": ["10:00 am", "12:00 am"], "Sat": ["12:00 pm", "12:00 am"], "Wed": ["10:00 am", "12:00 am"], "Tue": ["10:00 am", "12:00 am"], "Sun": ["10:00 am", "12:00 am"], "Fri": ["12:00 pm", "12:00 am"]}, "price": "$$", "categories": [["Pizza", "pizza"]], "address": ["2705 E 79th St"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Wheelchair Accessible": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch, Dinner"}, "category": "Restaurants", "number_of_reviews": "15"}, "dunkin-donut-chicago-12": {"comments": {"3": {"description": "This is the only Baskin Robbins around here that has the Gold Medal Ribbon ice cream flavor. Plus their waffle cones taste fresh and the ice cream consistency is always perfect.", "rating": "5", "date": [2015, 10, 28]}, "1": {"description": "Two stars for my breakfast sandwich that was amazing!!! If you haven't tried the sausage egg and cheese croissant, the. You don't know what your missing. It blows McDonald's and Burger King away. However that coffee is disgusting or maybe I'm just a coffee snob who enjoys paying way too much at Starbucks!! But at least their coffee is delicious. I had the iced mocha swirl with cream and sugar today and I just wanted to throw the whole cup out the window while driving but didn't for fear of it splashing into the open mouth of a driver and that driver would end up passing out from the horrible taste.. I don't even know how to describe the taste of this grotesque and disgusting drink.. But all I can say is I won't be buying coffee from them in a long time..", "rating": "2", "date": [2015, 9, 2]}, "2": {"description": "Slower service but still Dunkin' Donuts!  The staff is friendly and the product is good, but it takes a long time to get through basic orders.  Perhaps they were short staffed due to drive-thru.Lucky I needed coffee.", "rating": "4", "date": [2015, 8, 24]}, "0": {"description": "This 24- hour sweet shop is definitely an asset to the community. Fast service, friendly staff, and fresh goods. Don't be put off by the dark,  Old-school, street lighting  (blame it on the city). This location is as secure as any downtown shop, in the middle of the day, or any time of night. Chicago's Finest , as well as CTA drivers are extremely frequent customers.", "rating": "4", "date": [2015, 11, 20]}, "4": {"description": "Can you pretty please have more variety of donuts? Every time I walk in there's only plain . Where is the lemon filling donuts? More jelly please, coconut, apple pie?  can you offer gluten free??", "rating": "2", "date": [2015, 12, 10]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7297707, "longitude": -87.5521698, "rating": "3.5", "times": {"Mon": ["12:30 am", "12:00 am"], "Thu": ["12:30 am", "12:00 am"], "Sat": ["12:30 am", "12:00 am"], "Wed": ["12:30 am", "12:00 am"], "Tue": ["12:30 am", "12:00 am"], "Sun": [], "Fri": ["12:30 am", "12:00 am"]}, "price": "$", "categories": [["Donuts", "donuts"], ["Coffee & Tea", "coffee"], ["Sandwiches", "sandwiches"]], "address": ["9100 S Commercial Ave"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Outdoor Seating": "No", "Delivery": "No", "Good for Kids": "Yes", "Has TV": "No"}, "category": "Restaurants", "number_of_reviews": "5"}, "mayas-pizza-chicago": {"comments": {"3": {"description": "This has got to be the best pizza on the east side. The crust is perfect, the sauce is delicious and the cheese is melted and melts in your mouth. I love this place. I have been searching for a good pizza place near and found a great one. They have specials that are awesome and the sizes are true to size. you wont be disappointed at all.", "rating": "5", "date": [2014, 8, 5]}, "1": {"description": "Very rude unprofessional service, I called once to place an order and the man over the phone told me to put my parents of the phone, shocked I told him i was over 18 and have called before multiple times without any issue and he proceeded to tell me to \"go f*** myself* IF I COULD GIVE THEM NEGATIVE STARS I WOULD. Their food is not worth being disrespected and insulted, go to capri or de arco's instead!", "rating": "1", "date": [2015, 6, 8]}, "2": {"description": "WORST PLACE TO ORDER FOOD FROM. The manager is an asshole who will not take orders if you forget to pick up an order ONCE. They are highly unprofessional. The staff act like they are still in high school. I have found a roach in my bag on more than one occasion and they tried to blame it on me . EAT HERE AT YOUR OWN RISK.", "rating": "1", "date": [2015, 3, 13]}, "5": {"description": "I tried the pizza yesterday and I must say \"Yay! I'm a fan\". The prices at Maya's Pizza definitely does not hurt your pockets...in fact it does the exact opposite. They have many specials like 2 jumbo pizzas for under $24 and a small 1-topping pizza for under $8. One of the other amazing factors is that the location is only a 5 minute drive from my apartment. I will definitely be back whenever I am feeling the need to cheat with my diet again!", "rating": "4", "date": [2013, 10, 31]}, "6": {"description": "5 stars for their Italian beefs with cheese or no cheese...", "rating": "5", "date": [2014, 1, 17]}, "7": {"description": "The huge slices of DELICIOUS pizza are worth the trip here!I'm not even a pizza person, but this is somewhere I make a special trip.", "rating": "5", "date": [2012, 6, 28]}, "8": {"description": "Good food when u want something fast n quick..pizza is good...", "rating": "3", "date": [2010, 11, 2]}, "9": {"description": "They have pretty good pie here.  We usually order the sausage or ground beef.  If you get one of their menus, they have several specials on pizza from which to choose.Hidden gem here are the potato wedges.  They are huge and quite tasty.  They aren't listed on their menu but come with an order of broasted chicken if you ask.  The chicken's ok but I've had better.I'm not too crazy about their sandwiches except the meatball which is fine.  They also have rib tips, fish, shrimp, and other items too numerous to mention.If you get delivery the guy will usually call you when he approaches your place.", "rating": "3", "date": [2009, 12, 3]}, "0": {"description": "Headed to the southside for some much deserved pizza (he'll I loves me some pizza) found this hole in the wall (no disrespect) the cheesy bread was delicious,  I order a very simple sausage and cheese pie and loved every bit of it...... the reason for 4 and not 5 stars is because there was no place to really sit and this is definitely a take out spot so while gulping down a pizza in my car was amazing it wasn't as comfortable, still great pizza", "rating": "4", "date": [2015, 12, 10]}, "4": {"description": "I was skeptical to try the pizza here but I thought it was a Mexican restaurant because of the neighborhood it's in. Someone suggested it to me, so I gave in to my skepticism and the pizza here is off the chain! Not only is it cheap but it tastes good. They have a lot of specials, and their grilled chicken salad is good too. Did I mention they deliver? They're fairly close to my apartment but with the upcoming Winter, I think I'll be utilizing their driver a lot more. Good jumbo pizzas at pocket friendly prices. You really can't beat that.", "rating": "5", "date": [2013, 12, 14]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7395553588867, "longitude": -87.5518493652344, "rating": "3.5", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["11:00 am", "10:00 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["2:00 pm", "10:00 pm"], "Fri": ["11:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Pizza", "pizza"]], "address": ["8550 S Commercial Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch, Dinner"}, "category": "Restaurants", "number_of_reviews": "10"}, "neveria-lluvia-chicago": {"comments": {"0": {"description": "I've gone to this ice cream store every summer (and even once recently) to get my delicious HOME-MADE fixes! Try the yummy home-made liquid nut yogurt with your choice of natural fruits, cut on spot, and granola, raisins, and coconut on top! I also like strawberry yogurt with banana, strawberry, guava, and papaya, but you can add a lot more, such as pineapple, apple, red grapes, and more! The service is very friendly and organized. The place is clean and always has customers.Try the home-made ice cream, especially the non-alcoholic tequila and gansito! Most flavors are very good. Get some home-made popsicles to go for a hot summer day--unique flavors, too! Other Mexican snack foods are also sold, such as taco salad chips in-a-bag or different foods with \"cueritos\" (if you like \"pork skins\"--I'm not a fan). (I must say that if you're not from the neighborhood, don't go here when it's dark outside to be safe.)", "rating": "4", "date": [2016, 2, 17]}}, "latitude": 41.7357143839532, "neighborhoods": ["South Chicago"], "categories": [["Desserts", "desserts"], ["Ice Cream & Frozen Yogurt", "icecream"]], "address": ["3006 E 88th St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.5508974120021, "category": "Food", "rating": "4.0", "price": "$", "number_of_reviews": "1"}, "gomez-tacos-chicago": {"comments": {"3": {"description": "While I'm not a fan of their mexican food, but that's just me being picky about mexican food outside of actually cooking it mysefl. Gomez is a south chicago staple. Don't get me wrong their mexican food is well enough (my mom always orders their tacos), but I always much rather prefer their americanized staples. Their bacon double cheeseburger is always huge and so good. Their pizzas slices are awesome. And I love ordering the fries with the orange hot sauce! Any south sider has to know that.", "rating": "4", "date": [2014, 1, 5]}, "1": {"description": "Orded 70 worth of food last night.3 orders were don't incorrectly.tryed to resolve this but got no where.take yoursub par food and put it where the sun doesn't shine,I'm sure you know where that is.lost dozens of my friends and family for ever.learn how to write orders correctly.", "rating": "1", "date": [2015, 12, 16]}, "2": {"description": "Whoever took our order on the phone did not sound like she should be taking the order over the phone not to pleasant. Still waiting for food now so crossing my fingers that it all comes right.", "rating": "3", "date": [2014, 6, 23]}, "5": {"description": "This south side greasy spoon has some items on their menu worth mentioning, their tacos and burritos.  The burritos are of a monstrous size and the tacos have an authentic taste to them.  other than that its your average fast food restaurant that sells multiple fast American cuisine; cheeseburgers, pizza slices, onion rings etcetera.", "rating": "3", "date": [2010, 8, 23]}, "6": {"description": "This is my \"go-to\" place for cheese fries in the 'hood. A small serving is under $2 and ready in less than 5 minutes. Their menu has Mexican food as well as burgers, pizza, etc. Most people get their food to-go but there is a decent seating area.Staff is friendly and busts their arses. I was watching the woman working the pizza station through the windows and she was gettin' it done. I also dig Gomez because they donate (good) food to our special events. Way to support the community!", "rating": "4", "date": [2008, 10, 29]}, "7": {"description": "great food and great service,  My favorite food to order from them is the  Qasadillia  chicken dinner. My mom's favorite meal is the steak burrito with extra cheese, avocado, and sour cream. Let me tell you how great their customer service is. One night, my mom ordered a burrito from Gomez and instead of putting steak in her burrito it was chicken. My mom was upset and called about it and they came all the way to her house and replaced the burrito and took the wrong burrito back. They came back because they wanted her to enjoy her meal. They didn't harass her or anything. That is real customer service and some need to learn from them. Love you Gomez Taco's", "rating": "5", "date": [2011, 2, 7]}, "0": {"description": "Food is good. Owner is great, he always make sure you're satisfied and ordering exactly what you want. My only issue are the order takers in person and over the phone. Its like they have an attitude and sometimes the order is slightly incorrect when you arrive. Overall, they're always open when I need something to nibble on.", "rating": "4", "date": [2016, 2, 5]}, "4": {"description": "Yesterday I got on the Metra and the entire metra car smelled like a Pepe's or mexican restaurant.  Of course this made me now want some mexican food. Normally I would stop by Cocula but lately they have been really rude so i've made up my mind not to patronize them until they get it together! Recently I received a flyer stuck on my door for Gomez Tacos's and this was the perfect time to give them a try. They are supppppper slow. It was like 3 ppl in total in the restaurant and it took about 20 minutes to get my 3 tacos. I made up in my mind this was the one and only chance they got from me. But!! When i got home and opened my food i was plesantly surprised. The tacos were nice and fat and piled high was goodness. The food was good, not great, but good.", "rating": "3", "date": [2011, 12, 29]}}, "neighborhoods": ["South Chicago"], "latitude": 41.730377, "longitude": -87.550507, "rating": "3.5", "times": {"Mon": ["9:30 am", "12:00 am"], "Thu": ["9:30 am", "12:00 am"], "Sat": ["9:30 am", "12:00 am"], "Wed": ["9:30 am", "12:00 am"], "Tue": ["9:30 am", "12:00 am"], "Sun": ["9:30 am", "12:00 am"], "Fri": ["9:30 am", "12:00 am"]}, "price": "$", "categories": [["Mexican", "mexican"]], "address": ["3016 E 91st St"], "attributes": {"Take-out": "Yes", "Has TV": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Alcohol": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Wheelchair Accessible": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "8"}, "capri-pizza-chicago": {"comments": {"28": {"description": "I'd heard a lot of great things about Capri's pizza, so I was originally worried that it wouldn't live up to the hype... But the first bite with hot, crisping cheese over some awesome toppings on an insanely good thin (but not too thin!) crust made me a believer! This pizza can seriously compete with the best in the country! It's not a dine-in place, but I think the reviewer who gave one star on the basis of the neighborhood (welcome to South Chicago, random Texas lady...), but didn't even try the pizza made a HUGE mistake - she'll never know how close she came to a slice of food perfection!The broasted chicken (think fried but more juicy and delicious) has the best crispy skin you'll ever try, and their diverse menu has quite a few other gems, but I can't seem to bring myself to stop eating the pizza long enough to explore!", "rating": "5", "date": [2011, 1, 1]}, "1": {"description": "Oh noooooo. What happened to this place? I grew up in the neighborhood and have had this pizza as a kid for 30 years plus. Now living in California, I was excited to order one on a return trip. Bad news, pizza doesn't taste the same. Crust texture was like cardboard. Tasteless sauce. Worst service ever. Ordered an xl half sausage half green pepper/onion. Arrived to pick up and pizza was not ready. \"5min sir\". An hour passed since the phone order was placed. 15min later and 5 employees hover around the order slip discussing what  should go on the pizza. \"5min sir\". Finally I walked up to ask again if they forgot to make the order. \"Oh no, it's almost ready\". Finally, pizza is ready. 1 hour plus. I ask for some Parmesan cheese. \"Oh that's extra\". Then he decides to not charge. Geez thanks. Get home and open pizza. Pepperoni!!!!!   A little green pepper and onion spread here and there. FAIL. Never ordering here again.", "rating": "1", "date": [2015, 10, 3]}, "9": {"description": "Okay I'm in the neighborhood working.  Me and a co worker order a pizza.   Thing crust with sausage, green pepper, mushroom, onion, extra sauce and well done.  Simple enough.  Pizza is GREASY, we used 15 napkins to soak em up.  Gross.  After we start eating we noticed that they used canned mushrooms instead of fresh, gross.  This was just your typical cheap pizza.  21 bucks for a medium pizza.  Dont come here", "rating": "1", "date": [2015, 1, 28]}, "29": {"description": "WARNING!So on my way through Chicago, I wanted some good pizza.  I used Yelp to find this place, chose it on the basis of the reviews I read on here, and proceeded to take my in-laws and my husband.  We parked a few blocks away and walked through a VERY seedy neighborhood... I was extremely thankful it was broad daylight and had two men with me!  We got to this location and were surprised that it is a walk-up counter in a very dirty room.  We asked about seating and were directed outside and back in a different door, covered with bars, and saw three booths next to a pick-up window.  I did not want to sit down on those booths, much less order.  Needless to say we quickly left and were thankful to make it back to the car before someone had broken into it!  So I cannot comment on the food quality, but the neighborhood and the \"restaurant\" itself were extremely less than desirable.  Just a warning to any other unsuspecting people who read these \"five star\" reviews and want to know what this place really looks like!", "rating": "1", "date": [2010, 8, 22]}, "23": {"description": "Ohhohoho. Capri Pizza is an institute. If you're from the south side, you know it to be the best. And it is. Their pizza is the. best. thin. crust. you will ever eat. And their broasted chicken? I love it. And I hate fried chicken. I know, it's odd, but I do.. but I will eat Capri's chicken. You just have to eat there, plain and simple. It's a take out service or delivery, but really. My mouth is literally watering at the memory of their pizza. So much cheesy goodness to be had.", "rating": "5", "date": [2014, 1, 5]}, "5": {"description": "You won't find a better pizza place in South Chicago. I grew up on this pizza and sometimes drive all the way from the west suburbs for this pizza. Love the thin crust pizza.", "rating": "5", "date": [2015, 12, 28]}, "31": {"description": "truly great pizza, to find pizza this good on the far southside is amazing. the thin crust is good, and the deep dish is awesome. I stand by the original of cheese and sausage, but i have had a variety of toppings from italian beef, black olives, onions, to gardinera peppers, pepperoni and green peppers.also, the hot wings are good, the broasted chicken can be a hit or miss depending on if it was fried too hard or not, but when its on, it's dead on.", "rating": "4", "date": [2010, 6, 22]}, "25": {"description": "Pizza Capri is simple, fresh, well prepared food... It is definitely the gem of the dismal Hyde Park eateries. The pizza is awesome. They have a nice wine list, good specials, nice service for a simple family restaurant. It's nothing fancy, but it's a great place to have a decent meal on the south side (a rare compliment).", "rating": "3", "date": [2012, 12, 26]}, "12": {"description": "I've tried so hard to not fly off the handle every time (which ends up being almost every time I order from here) my order is wrong but what happened tonight was the last straw. Who is responsible for managing this place?! I just blew $50 plus a $10 tip (delivery) on something that is so wrong it almost seems like a cruel terrible joke. I am not the only person who has had this problem and it seriously seems like no one cares, I really hope some sort of management responds to this and has the common courtesy to apologize to me. I don't even care about the money, just call me and pretend like you care at all, because the truth is we all know you don't. The history of mistakes is undeniable and the lack of professionalism has reached a new low, please train YOUR staff!!!!! If you do respond (and I hope you do) I will give you every detail of my horrendous experience today. Thank you for your time and to any potential customers reading this, the food is good, but order something ridiculously simple, pick it up in person, and open it BEFORE you pay. Don't be like so many of us who have been disappointed over and over again.", "rating": "1", "date": [2015, 9, 11]}, "37": {"description": "If you're in the South Chicago area you can never go wrong by getting a bite to eat at Capri Pizza.  They've been in business at this location since 1955.  Their whole menu is great.  The pizza is like none other.  Every pizza is made fresh to order.  They have daily specials and also lunch specials.  The beef sandwiches are the bomb always fully stacked with italian beef and made fresh to order.  I like mine toasted with melted mozzarella cheese, red sauce and hot peppers.  Their hot peppers are oven rosted daily.  Yumm!!!  Try the place out.... the food is great and the prices are very reasonable.", "rating": "5", "date": [2008, 1, 5]}, "21": {"description": "I have always enjoyed this pizza place, hidden gem on the south east side of Chicago. I have never been disappointed or unsatisfied with my order.", "rating": "4", "date": [2014, 2, 24]}, "16": {"description": "Use to be good.  Not worth it anymore.  Order clerk I talked to doesn't pay attention and gets address wrong all the time.  Also prices are too high for poor pizza.", "rating": "1", "date": [2015, 7, 6]}, "17": {"description": "I have always enjoyed this pizza place, hidden gem on the south east side of Chicago. I have never been disappointed or unsatisfied with my order.", "rating": "4", "date": [2014, 2, 24]}, "10": {"description": "UPDATE: After giving this place more chances  i am no longer a customer! i haven't personally ordered from this place in a year or so because they always screw up my orders. However, my sister still orders pizza from here so since it was convenient, i ate.. but it is frustrating when they repeatedly get orders wrong when the person taking your order repeats and confirms your order. You cant screw up an XL sausage/pep/EXTRA mushrooms/jalapenos! this isnt a special request! and it is most definitely NOT rocket science. Are these people incompetent?i had absolutely no mushrooms on this pizza and got onion instead. This business needs to hire new managers/employees because they cant ever get any orders correct. They cant even things as simple as the sauces for wings correct. i reached out to them and still haven't heard from them which tells me they don't care.in the past they have offered to fix their mistakes for free but why would i want to wait an additional hour for them to fix it? i have counter offered to save that free pizza for another time and they have said that i had to do it that day to get if for free. If i get the pizza free today why cant i get it another day? it is the same difference. why inconvenience your customers?Its never about the issue thats the issue, the issue is how they handle it.", "rating": "1", "date": [2015, 2, 9]}, "11": {"description": "Absolutely love this place, you can't go wrong with anything! Sausage pizza? The best. Fried chicken? The best. Italian beef? One of the best. Heck even the fries are great! If you're ever hosting a party, watching the game or just don't feel like cooking then you NEED to call Capri, I guarantee you will not be disappointed.", "rating": "5", "date": [2014, 9, 30]}, "26": {"description": "By far the best pizza in Chicago. Great prices too. I am willing to drive long and far to get a slice. I am not a big fan of chicken, but I can tell you that their broasted chicken is the best chicken I have ever had.", "rating": "5", "date": [2011, 11, 30]}, "27": {"description": "Love this Pizza place. They have great pizza and ribs. They are courteous and I have been ordering from them since 2003. Love you Capris. :)", "rating": "5", "date": [2011, 2, 14]}, "35": {"description": "OK, so if you're from S.Chicago or the East Side you know there's only one place to get great thin crust Pizza.  In fact when family and friends say, \"who wants pizza?\" no one even asks from where, you automatically know it's Capri's.  It's like the heaven's opened up  and an XL thin crust w/ sausage and cheese fell out of the sky. Seriously it's that good.  My husband and I are even pizza snobs now.  We never eat at chain pizza restaurants like Domino's, Pizza Hut and Little Cesar's. we would rather have our intestines taken out and wrapped around the tailpipe of a truck going down Calumet Avenue. When ordering pizza make sure to get fries. Oh ya, and  ask them for hot sauce. Yes, I know hot sauce on pizza and fries? I must be joking right? Wrong. Here in the East Side/ S.Chicago area we like hot sauce on are fries AND pizza. And not just any hot sauce, it has to be Hector's Hot Sauce (or as it's referred to Heine's- but that's a whole other review). My North Side and Indiana friends look at us crazy when we bring out our neon orange hot sauce. But after they try it, they love it. There is also an Indiana Capri right off of Calumet Avenue.  That one offers the same high quality pizza as the one in South Chicago.  A word to the wise: It has the best regular pizza not Deep dish or Stuffed whatever you want to call it.  That pizza is just a chunk of bead with some sauce. Stay far away from that.", "rating": "5", "date": [2008, 1, 25]}, "8": {"description": "Just left Capri Pizza absolutely love this pizza I got a large  chesse, spinach, mushrooms, chiclen, everything was fresh , customer service was great. This will be my new Pizza Place .", "rating": "4", "date": [2015, 5, 9]}, "0": {"description": "Love their pizza and chicken also their pasta is good, that's one place we always go back to , great for parties they have a lot of good things on their menu so I really recommend this place !!!!!!!!!!!", "rating": "4", "date": [2016, 2, 12]}, "20": {"description": "I dont know what is going on with Capri pizza, but something has changed. I ordered my usual, large sausage, extra sauce,  and peppers, when I got home, no extra sauce, sparse peppers,  and somewhat bland. Naturally I assumed they had an off night. The next time I ordered, I shared my unpleasant experience with the young lady taking the order. She assured me it was just an off night. I placed my same order. When I arrived to pick up my order, I was informed she failed to add extra sauce to the order.  As I was talking to the cashier,  the owner walked up.  I explained what happened, he sorta frowned at me, said he would talk to her, and started writing new orders.  No apology,  or refund for the ingredient left off my pizza.  I did not feel like arguing over 85 cent, so I left.  When I got home, I was not impressed. Barely any peppers on the pizza and less sausage  on my pizzas than the last twenty years. I am now looking for a new pizza spot. To add insult to injury,  they recently went up on their prices. I can no longer recommend this establishment.", "rating": "1", "date": [2014, 5, 18]}, "19": {"description": "I love this pizza, it's as good as it gets. Good price, the sauce is on point, and when delivered, it's always hot and fresh. I've been eating pizza from here since I was a kid, and it has always been consistently good. The staff and delivery guys are nice as well.", "rating": "5", "date": [2015, 1, 2]}, "33": {"description": "When we go visit friends in the south side a Capri pizza is a must, It's the one thing I miss from that area, since we moved It's just a little too far away now to go often.", "rating": "4", "date": [2009, 3, 9]}, "2": {"description": "Should've listened to new reviews this place gets my order on the phone I repeated like about 5 times and they still get it wrong disappointed!!!! Now to eat something I didn't order because it's closed and I can't get ahold of no!!!!!!!!!!!!!!!!! I will be calling tomorrow!!! Oh and to top it off it was even cooked right!", "rating": "1", "date": [2015, 10, 17]}, "34": {"description": "Tried it for the first time last week. Its not bad , although I have had much better. State line pizza in Hammond Indina for one. I ordered  and waited. Capri does do a lot of buisness.", "rating": "3", "date": [2009, 2, 18]}, "32": {"description": "Everyone on this side of town (S. Chicago, S. Deering, E. Side) knows about this place.  They have some of the best pizza in the area.  Their broasted chicken is pretty good too.  They have daily specials M - Thurs.Their beef or sausage sandwiches are delicious with optional peppers but i'm not too hip to the meatball for some reason.They have pasta (mostaccioli, spaghetti, ravioli) and appetizers (buffalo wings, poppers, zucchini)They have ribs too but i'd only order them only if you really have a taste for ribs. They are meaty but a little bland and loaded with bbq sauce.Lastly, they do offer catering and it is worth ordering for sure.", "rating": "4", "date": [2009, 12, 2]}, "18": {"description": "So this place is an oldie but a goodie. This is the best pizza on the southeast side...let me paint the picture. Back then Capri was always just kinda so-so, a thick thin kinda crust, and a generic type of sauce; you know the type I'm talking for kids taste, if that makes any sense. Anyway about a month ago I was feeling kinda nostalgic and ordered, of course not expecting anything mind blowing. All I can say was wow. Tastier, cheesier, richer and seasoned better. I don't know if they changed or tweaked the recipe a bit but it is definitely for the best. Way to go and keep up the good work. You have revived an old customer...", "rating": "5", "date": [2014, 12, 4]}, "13": {"description": "Probably one of my favorite pizza places. They can be a bit greasy, but is one great pie. The boasted chicken, and pizza combo is the way to go for a Friday night in with a couple of movies friends or family.", "rating": "5", "date": [2015, 3, 15]}, "4": {"description": "This place used to be very good. Now they cut corners and cheap it out. You need to travel out of this neighborhood to find good pizza. The Capri in Whiting Indiana is slightly better. If people keep buying this lousy pizza, then they have no reason to improve. We live in the greatest pizza city in the country. If you think this is good pizza, then you need to get out of this neighborhood and try some of the other truly delicious pizza places around the city that deserve your patronage (Salernos, Peace, DiNella's, Lou Malnati's, Pizano).", "rating": "1", "date": [2016, 2, 5]}, "24": {"description": "A little hidden gem on the southeast side of Chicago. Pizza is consistently good and priced right. I've never had a bad pizza from this place.", "rating": "4", "date": [2013, 7, 6]}, "6": {"description": "This used to be my favorite pizza place... Every time that I wanted to get my pizza fix, Capri's was the place to go. But guess what, not anymore. Not after the multiple bad customer service experiences I've had at this location. Once I even ordered for pick-up and the rude lady working the counter said that they never got our order. I won't miss this pizza especially when they don't even serve fresh ingredients. I hate canned mushrooms on my pizza!", "rating": "1", "date": [2015, 8, 14]}, "22": {"description": "For a long time, Capri Pizza has always been a treat to me!! Their ingredients are fresh! The pizza dough has always been made from scratch! And, their \"world-famous\" broasted chicken has always been the best a la carte with the pizza! Capri Pizza, in my opinion, has always been a \"thumbs up\" while Pizza Hut and Domino's are a \"thumbs down.\" I just hope they never go out of business!! Bon apetit!!", "rating": "5", "date": [2014, 2, 16]}, "15": {"description": "Love their pizza!! And the broasted chicken is really good. I would  recommend  this place!", "rating": "5", "date": [2014, 12, 11]}, "7": {"description": "Great pizza. Sauce is sweet & tangy.  Price is very reasonable compared to others of a quality pizza. Only issue is with coupons that I did not get to use from valpak. They do not have an expiration on them but was informed they are not honoring them anymore. Come on now. Its only 4.00. Give me a break! Especially when I have given them free advertisement. I have gotten them a few new customers & have been ordering from them over 20 years. Ive been loyal now we fall out over a coupon...hmmmm really. Pizza places are PLENTIFUL. KEEP it up & one of your comp etitors are going to WIN ME OVER. Capri nite will have another name. Well Home Run inn here we come!", "rating": "3", "date": [2015, 8, 4]}, "36": {"description": "I've been eating Capri's Pizza since forever....there have been numerous  other big franchise pizza places (Pizza Hut, Domino's) try to come into the neighborhood and they never last. They were all run out of town with their tails between their legs. This is a South Chicago staple. Their pizza is amazing, best with a side of french fries. Also their spaghetti and meatballs is also great.", "rating": "5", "date": [2008, 1, 16]}, "30": {"description": "Hands down the BEST pizza in Chicago I mean in the world.  Established in the late 1940's by Tony Ciannamea...more than 60 years later Capri is still the strongest and most authentic, a true staple of Chicago's southside.  You will fall in love with Capri at your very first bite, guaranteed.  : D", "rating": "5", "date": [2010, 6, 24]}, "3": {"description": "They really deserve no stars. New owners nothing like the quality of food we grew up on. Prices are high for below average pizza and fish.", "rating": "1", "date": [2016, 2, 12]}, "14": {"description": "What can I say about my all time fave pizza joint? It's usually very tasty( I've had a few misses) but they make it exactly how you want. Delivery n service are usually pretty standard and prices are always decent. If you live in the area and want yummy pizza delivered go with capri....word to the wise I would NEVER go pick it up, that area is so sketchy I wouldn't go there with my cop brother....just saying.", "rating": "4", "date": [2015, 1, 17]}}, "neighborhoods": ["South Chicago"], "latitude": 41.73483, "longitude": -87.55174, "rating": "3.5", "times": {"Mon": ["3:00 pm", "11:00 pm"], "Thu": ["3:00 pm", "11:00 pm"], "Sat": ["3:00 pm", "12:00 am"], "Wed": ["3:00 pm", "11:00 pm"], "Tue": ["3:00 pm", "11:00 pm"], "Sun": ["3:00 pm", "11:00 pm"], "Fri": ["3:00 pm", "12:00 am"]}, "price": "$$", "categories": [["Pizza", "pizza"]], "address": ["8820 S Commercial Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "No", "Ambience": "Casual", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch, Dinner, Late Night"}, "category": "Restaurants", "number_of_reviews": "38"}, "el-guero-supermercado-chicago": {"comments": {"3": {"description": "This place was damn good.  I got the steak burrito and the whole thing was so freakin tasty and the steak is cooked right.  I had the fried pork (Carnitas) Gordita and man was it good as hell, I highly recommend the gordita here, my brother had a El Pastor one and he said is some good shit too!  I will definately be back and it is a sigh of relief after eating at nasty TNT down the street a while back.", "rating": "5", "date": [2014, 3, 3]}, "1": {"description": "Hmmmmm I don't know where to begin with this place. I think this place is actually really good but I only gave it two stars instead of four because of the customer service. If your not Mexican you will not receive a warm greeting even if you give one. I walked in and said hello and it being my first time there the cook just walked right pass me without any acknowledgement or anything so I just stood there till he ask he what did I want. Which is exactly what he said but when his Mexican buddies came in they got the what up amigos and a smile... Um why couldn't I get that???? Another black person came in after me and straight attitude again. Ugh that disgusted me if you don't want black ppl in your store, put up a sign so I can sue. Just rude. But never the less I ordered a steak burrito from here and it was delicious. It had beans, seasoned to perfection steak, lettuce, tomato and cheese that was all rolled up inside if a tortilla. It didn't come with fries or anything, I assume you had to order that separately if you wanted it but whatever. Over all it was really good food from what I had bit I don't think I would be back because of the awful customer service. I don't pay people to treat me like crap. So I can't pay them even though their food was delicious..7/16/15Everyone: please look at the picture that I posted that someone sent me and you will understand my response So I am NOT changing a single thing that I wrote in response to how I felt when I walked into this establishment..but I will response to Arthur R. From Lansing sent he felt it was his responsibility to correct me on my opinion and my feelings since he is obviously an African American young lady named Tamara (I didn't know I had an exact replica of myself but cool!!!) even though it's none of your business how I paid for my food, but a co-worker paid for me that day because we needed a quick bite to eat and it was her turn to buy lunch.. So therefore No I did not pay for my meal and Yes it was DELICIOUS. What does Bill Cosby have to do with anything? I don't know him and he don't know me?I NEVER claimed anyone in there to be a racist, I just wanted a warm greeting like every Latino that walked in there. Since you said most black people don't know how to act in the inner city including me. you don't know me or my demeanor. Don't judge me by other peoples actions judge me for me. I had a smile on my face, I was properly dressed given the fact that I was working, and I spoke proper English.. So why can't I get a simple hi?? Yes I did say if they don't want black people in their store to put up a sign so I can sue and I stand by it!! By the way that goes for any place I visit. Have I been back since that review?? yes I have.. did I pay for anything?? No I did not.Did I steal anything? No I did not. I just happen to have a coworker who like the place. Last time I checked Money is GREEN and that's the only color I know and it all spends the same and finally I am the consumer that wanted to buy a product and No I didn't need to spend my Hard Earn Money on someplace that cannot say hi to me and everyone in there spoke perfectly good English and Spanish so there were No language barrier..Now I don't need to explain myself to you or anyone else for that matter Arthur R. From Lansing IL. But I took the time to respond to your ignorance about me and how I felt because I forgot I guess I don't me or my emotions and a complete stranger that I never meet knows me better then I know myself.. Keep the nonsense to yourself and thank you for reading.. At least I know my reviews are being read.. #NeverOnThatLevel.. Who the real racist.. Not me so I guess that's you.yelp please don't delete this, let other people learn from his stupid mistake. #ImAboveTheNegativeFacebookTwitterInstagram Can all get a good laugh", "rating": "2", "date": [2014, 5, 28]}, "2": {"description": "Kinda sketchy area, but the burrito con pollo that I ordered was really good and well worth the price. CASH ONLY. I thought that it was really good, and I am glad that I decided to go there.", "rating": "4", "date": [2015, 3, 29]}, "5": {"description": "GORDITAS!This is a grocery store that has a little lunch counter. Gorditas are damn good and one ($2.35 each) fills me up. Every once in a while I like to try out my Spanish but lately I've been ordering in English because I'm chicken.And no, white boy, those red and yellow bottles are not ketchup and mustard.*pictures", "rating": "5", "date": [2008, 5, 28]}, "6": {"description": "Delicious! I visited from Tucson AZ and am used to Sonoran style food. This place was awesome. I loved the way the carne asada was so finely chopped and well seasoned.  I had a taco and a gordita and wanted to try the chicharron and adobada but was too full. I liked the sour cream, and although we use cabbage and not lettuce, it was a good combination. The Agua de Melon could have been a little sweeter but I will definitely eat here again when I am in the area.", "rating": "5", "date": [2012, 4, 10]}, "7": {"description": "Mmmmmmmmm.....Try a gordita de lengua and a torta de milanesa.  So good and super cheap!  Friendly gentlemen behind the counter who call everyone \"primo\"(spanish for cousin) :)", "rating": "5", "date": [2010, 1, 28]}, "8": {"description": "EXCELLENT GORDITAS, you must try, you have no idea what your missing, this place is truly a gem.", "rating": "5", "date": [2009, 9, 18]}, "0": {"description": "Do you like tacos, gorditas, burritos, and tortas?! Are you looking for the best of these in the entire city of Chicago?!Well you're going to need to come out to South Chicago and get yourself ANYTHING from El Guero's food stand! BUT, this spot is cash only. So don't forget that key piece of information.Their service is quick, the cooks are friendly, and all the food is made as you order it. You can, however, call in to place your order to get your food quicker. If you do this, I'd suggest you eat there because the food doesn't travel too well in the aluminum foil it gets wrapped.Now, on to the food! The meat is just plain delicious, no matter what you get. Personally, I'm more of a fan of carne asada and theirs stands above the rest that I've tasted throughout the city. They have a decent variety of meat, which is good so you don't get overwhelmed with too many options. You can get carne asada, al pastor, chicken, chorizo and a few others.To drink, they have your typical canned pop as well as bottles, as well as water. But, if you really want to enjoy your food, you simply cannot skip out on the agauas frescas! I'd suggest the horchata, which in my opinion, goes head to head that of Lalo's. They also have pineapple water and jamaica.To sum it up, this is absolutely the best Mexican fast food spot in the city.", "rating": "5", "date": [2011, 6, 19]}, "4": {"description": "Hands down, THE BEST tacos and gorditas in South Chicago!Quick, friendly service. CASH ONLY. Takes orders ahead of time over the phone for minimal waiting. Delicious homemade salsas to accompany your food and a variety of different kinds of meat (carne asada, al pastor, chicken, chorizo, etc.). You can your tacos with either cilantro and onion or lettuce, tomato, onion, cheese, but I recommend getting it with cilantro and onion.Also, the aguas frescas are THA BOMB DOT COM! Their horchata (rice water) is PERFECTION and the agua de melon is THE antidote for a nasty hangover! p.s. this place DOES deliver but to businesses ONLY and for a minimum amount $15 in food. \\CASH ONLY, people!", "rating": "4", "date": [2010, 7, 25]}}, "neighborhoods": ["South Chicago"], "latitude": 41.730983, "longitude": -87.550859, "rating": "4.5", "times": {"Mon": ["8:00 am", "9:00 pm"], "Thu": ["8:00 am", "9:00 pm"], "Sat": ["8:00 am", "9:00 pm"], "Wed": ["8:00 am", "9:00 pm"], "Tue": ["8:00 am", "9:00 pm"], "Sun": ["8:00 am", "9:00 pm"], "Fri": ["8:00 am", "9:00 pm"]}, "price": "$", "categories": [["Mexican", "mexican"]], "address": ["9029 S Commercial Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "9"}, "taaza2u-chicago": {"comments": {"3": {"description": "I really want to love this--the meat is solid and I love the convenience of delivery and online ordering. But for the last four times I've had deliveries, the company has not delivered during my requested time. Usually they call a few hours before the delivery window and tell you that they are coming the next day, instead, which is really inconvenient if you planned to be home that day to receive the delivery.  I had a delivery scheduled for yesterday, got the call that they were coming today from 3-6p, and got a call at 11:30 am, saying that they were coming in the next hour or two, before the delivery window!  Unless you are at home CONSTANTLY, this is crazy!  I called customer service and they cut me off when I told them the situation.  I am giving one more chance here, but the next time they mess up, it's over.  Too bad they can't get the delivery process right--convenience is the whole point!!", "rating": "2", "date": [2015, 7, 8]}, "1": {"description": "First timer & got burnedFor 3.65lb of chicken ordered, actual quantity received was 1.87lb, For 10lb of goat, actual quantity received was 8lb.On talking to their customer service, I was told \"may be the bird (chicken) which I got was too small\" & the goat should have been atleast 9lb.I should have received approximate quantity irrespective of bird being small or big.Failed my expectation, going back to B&M stores.", "rating": "1", "date": [2015, 6, 27]}, "2": {"description": "You know what they say about the first impression? Well this company made a horrible one! I ordered online on a Wednesday and a little while later was told that I would be getting my delivery on Saturday instead of Friday because they were having some refrigeration issues. I told the lady I wouldnt be home so she was like Monday evening. Monday Morninf get a call saying it will be Tuesday because they aren't delivering Monday...that's it, that was the excuse! Tuesday I get a confirmation that it will be coming after 7PM. I get a call around 6 that the delivery man will be there in 20 minutes. Well I wasnt home because I was told after 7! Luckily someone was home and so I got the delivery, when I opened it, their was writing on the inside of the box that 1 item was missing and out of stock! Noone had said anything to me about this at any point!  Any apology I got throughout this ordeal from the people on the phone was so generic and pathetic. There was no genuine concern or sympathy and they were the ones that screwed up. I will not order from these people again. They customer service was so below standards and the apologies made me even more mad. They said nothing to make the situation better for me as a customer, they must not care about their reputation and image. Well I'll be letting my friends and family know and you readers should also be prepared!!", "rating": "1", "date": [2015, 6, 9]}, "5": {"description": "We used their 'We Grill You Chill' service where they come on-site and BBQ.  Everything was excellent.  Food was great, service was awesome.  Would highly recommend.", "rating": "5", "date": [2013, 8, 12]}, "0": {"description": "A year later, and I must say that they have greatly improved on customer service!! They do make mistakes here and there but I order from them often enough that it's expected and they always do what they can to correct it. They even make follow up calls the day after delivery to see if everything was ok with the order so you don't have to worry about maybe forgetting to call about a mix up. I definitely respect a company who works at improving!!", "rating": "5", "date": [2015, 1, 26]}, "4": {"description": "I had placed an order with taaza2u for my daughter's graduation party for 20 people and was expecting the delivery the night before for a BBQ on Thursday. The day before the scheduled delivery on Wednesday I received a call from a woman saying they can't deliver and did not even apologize. I asked to speak to a manager but she said she is the customer service. I then received a call from a man who was apologizing and he would send me a free sampler (which of course I never received). I was extremely disappointed because I was informed last minute and had to prepare the night before my daughter's graduation for a lunch of 20 people without any prior notice. I found their customer service to be completely unprofessional. Would not recommend them due to them being unapologetic and unreliable.", "rating": "1", "date": [2014, 7, 4]}}, "latitude": 41.7272072, "neighborhoods": ["South Chicago"], "categories": [["Food Delivery Services", "fooddeliveryservices"]], "address": ["9229 S Baltimore Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.548233, "category": "Food", "rating": "2.5", "price": "$$", "number_of_reviews": "6"}, "huas-open-kitchen-chicago": {"comments": {"3": {"description": "Hello tasty nibblers out there! I wanted to write about my favorite Chinese delivery place near my home. It is HUA'S Open Kitchen.  Located right next door to Gomez Tacos in near South Chicago. One of my favorite delivery options is Chinese takeout and Hua' s gives you a FREE egg roll or soda with $10.00 or more or  a FREE Small Shrimp Fried Rice with $20.00 or more purchase. The portions are large and I save mine for lunch the next day. I always order from their special combination plate section on the back of the menu. Almost all combos are $5.50 or less! They include 2 pc Crab Rangoon or 1 Egg Roll and a Shrimp Fried Rice or White rice with any of the following entrees: Vegetable Delight, Szechwan Beef or Chicken, Orange Chicken, Sweet and Sour Chicken, Pepper Steak, Shrimp Chop Suey, General Tso's Chicken. Kung Po Chicken, Mongolian Beef/Chicken, Shrimp Egg Foo Young (2), Fried Chicken Wings (6 pc) and my favorite Chicken with Cashew Nuts!The Chicken with Cashews was great. The gravy was not too thick and had a very light taste of soy.  It was more vegetable stock and plum sauce. It had a good mix of nuts to veggies which I like. Over all a good dish with lots of zucchini and carrots!I bet you to try and compare HUA's with Kwan's and you will see the difference. Call right now at 773-375-1800.Sample MenuBeef Fried Rice 5.25 lgKung Po Chicken 7.25 lgEgg Drop Soup 2.75Pot Stickers (6) 3.95Seafood Lo Mein 8.50 lgThere hours are Mon- Thursday 11 am - 9:30 pmFri and Saturday 11 am - 10 pmSunday 12 pm - 9:00 pmRemember Kwan's is closed on Monday.", "rating": "4", "date": [2010, 10, 28]}, "1": {"description": "I actually do like this place. The prices are right and the food is delicious and the portions are huge! I have yet to be disappointed from this place and I do hope that I never will be. Today I ordered the crab ragoon, which was a lot that I shocked myself when I couldn't finish it all. That's a sad day in my eating history. I always finish my crab ragoon but not today I guess. I also had the fried shrimp, which I come to realize that I am not a fan of. It was good, but it was more of a medium size shrimp that had been overly breaded took fool the eye into thinking that your eating a large or extra large shrimp when your not. So that was disappointing, it was good but not as good as I thought it would be. I also had the shrimp fried rice which was cooked to perfection and the shrimp and broccoli dish which was also good, However my only complaint is that the broccoli could have been cooked more. It was just a little too under done.I am going through a no meat phase in my life so this is why you see all of these seafood dishes plus I am a true fan of seafood so its ok. Overall this is my spot on the southside if I am ever looking for some good Chinese food.", "rating": "4", "date": [2015, 2, 12]}, "2": {"description": "I love love love this place and I was so upset that I moved out of the delivery area...but I will take the drive just to get their orange chicken wings...oh just the thought of these big flavorful wings makes me do my signature happy dance...and you would have thought I found gold when I found an old menu from this place because I had lost my phone which meant I didn't have the number and because I always got my food via delivery I had never been to the establishment so I am so happy and I will be going there for sure this weekend.Since, I have only experienced this pace via delivery that is what my review will be on as well as the food.It was fast and the driver was always so nice and pleasant even when one day I had 4 dollars in change.Besides the orange chicken wings they have great egg rolls, crab ragoon,shrimp and lobster sauce, egg foo young, Mongolian chicken, and they also have special combo plates so if my experience is just as good when I step into the doors of this place as it was when they delivered...I will give them 5 stars because they deserve it!", "rating": "4", "date": [2012, 9, 26]}, "0": {"description": "Omg, how did I not review this place yet? The food is cheap and awesome. They have the best crab Rangoon and General Tso's chicken around, with generous portions. And they're friendly on top of that. And fast. We don't have any papers or anything, but we're practically married.", "rating": "5", "date": [2013, 11, 24]}}, "latitude": 41.730377, "neighborhoods": ["South Chicago"], "categories": [["Chinese", "chinese"]], "address": ["3014 E 91st St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "longitude": -87.550606, "category": "Restaurants", "rating": "4.5", "price": "$", "number_of_reviews": "4"}, "t-n-t-mexican-restaurant-chicago": {"comments": {"3": {"description": "Well I see why there are only two other reviews, and also why the place was empty when we arrived.  This place has a terrible set up and it reminds you of a depressing mini banquet hall.  The staff sits at tables and stare right out at you as they eat their own food and fold napkins etc....how tacky!  But seriously I do not give a shit about that it's really all about the food, I just wanted to point out how bizarre of a set up they have and how they have not cleaned up the gang graffiti in the bathroom like ever!  The bathroom is saturated in graffiti from every gang in the South Chicago neighborhood.  The fact that it was not cleaned up just shows that they do not care and have given up, and that the place is gang turf and not their own business.Now it is time to get to the food, the single most important thing that can make one forget about to depressing decor, the gang graffiti, the awkward stare downs of the staff facing you while you eat and they eat and fold napkins is the food.  The food can be a saving grace for places like this that fail in set up and decor, but in this case, nope.First we got the complementary chips and salsa, or should I say store bought type chips with spicey ketchup.  The salsa was very spicey and burned with spiciness; however, the taste was just like the crappy store bought B.S. you get from the store like Pace or Tostidos, it was jsut not good.  For the first time we actually had an empty chips basket and still half of the salsa.  When the waitress asked if we wanted more chips and salsa I declined.  I ordered the steak burrito and two tacos to sample one with El Pastor and one with the pork stew; however, I never recieved the El pastor taco which was good for two reasons; first, I was full from the burrito and other taco so I was in over my head, second, my brother ordered the El Pastor taco and he said it was horrible.  Well my pork stew taco was tasteless, so they did not make the meat right.  My brother said his chicken enchiladas were not that bad and he said the beans were not bad either.  Now as for my burrito........geez........well the waitress brought it out and cautioned me that the plate was really hot, OMG red flag!  When you are at a regular Mexican restaurant and they nuke your plate it means they probably nuked your food too.........yup, they sure as hell did.  See, they wanted to have melted cheese on top of the burrito, so they figured they would sprinkle it on then nuke it for awhile, ahhhhhhh!  That is horrible!  The steak in the burrito was a little tasty but dried out thanks to the microwave, hey do not look at me, I did not order melted cheese on top this is their normal practice!  Also to mention the first bites of the burrito burned my tongue and the roof of my mouth from the heat.  That is NOT supposed to happen when eating a burrito.  Let me think of the last time a burrito burned me, uuuummmm, never!  There was also rice inside the burrito which usually ticks me off, especially since it was rice and peas which is a Puerto Rican idea, well the garlicy rice was actually good.  My brother liked his rice too, in fact, it was the best thing they served!  Well half way through my burrito I found it laboreous to keep eating it yet I forced myself, the meat was just too frickin dry!  Finally we were done with our aweful meal and left with a dissatisfied feeling and a burned, numb tongue, I will never return here, but hey, $4.50 for the burrito I guess you get what you pay for, well I would rather pay another $1.50 elsewhere and get good quality.", "rating": "1", "date": [2014, 1, 20]}, "1": {"description": "I came here a few years ago and the food was pure trash. The steak tasted like a foreign  animal. My ex husband and I walked out and didn't EVER EAT there again!", "rating": "1", "date": [2015, 3, 22]}, "2": {"description": "I've come to this restaurant since I was a child. It's very low key and sometimes hard to find. I have to admit I order the same thing every time but that's because it's amazing! (Chorizo with papas and eggs) My friends have ordered other things on the menu and have said it's so-so. The staff is friendly and pretty fast. Decent spot for the area.", "rating": "3", "date": [2014, 8, 12]}, "5": {"description": "Yummmm...yes, this place is pretty divey with the plastic-coated table clothes and sparse decor. But the food is delicious and inexpensive. The chorizo on the taco was perfect, not too salty but full of flavor. Get the horchata  - it's fantastic. My only complaint are the chips and salsa - the chips were stale and the salsa was too spicy for enjoyment (and I like spicy food). I'll be back :)", "rating": "4", "date": [2013, 1, 13]}, "0": {"description": "I was actually told not to come here.  My friend  told me the food was awful.  And why did I come anyway?  Because she recommended another place which ended up sucking, so I just assumed she had bad taste.And she probably does.  But now I know that if *she* dislikes something, it must be really bad.When I walked in around noon on a chilly Tuesday, the first thing I thought was \"Where am I?\" Because it was dark.  I waited a few moments for my eyes to adjust to the lighting, and was able to make out a few things.  A couple morosely staring down at their tablecloths, looking as if they were breaking up.  Two middle aged men in wife beaters, with numerous tattoos all over their arms; they looked at me as if I were interrupting something important.  Broken Christmas lights strung around the entire room.  Iron bars over the tiny windows, which barely let in any light.  And a suprisingly perky waitress who smiled at me and immediately put me at ease.  She's the reason TNT gets two stars instead of one.So how does naive little AK interpret this scene, you ask?  How rustic and adorable.  Clearly people aren't here for the ambiance.  They must be here for the food.  It's probably authentic and amazing!After being asked if I was from the health department and assuring them I wasn't, I was seated next to the a window, right next to the hot neon sign that announced \"open\" to those on the sidewalk.  Twenty minutes later, the waitress remembered me and came to ask me if I wanted a drink.  Twenty minutes after that, she got my meal order. Thirty minutes after that, she brought me my tacos.  And when I bit into my chorizo taco, the first thing I thought was that this DIDN'T taste like bad Mexican food; it tasted like bad Indian food.  The \"steamed\" tortilla was dry, crispy, and had visible burn marks.  It tasted like a day old burnt chapati.  The chorizo was mixed in some chunky sauce that tasted a lot like the brown mystery cream of the sort of generic \"chicken curry\" you find at an all-you-can-eat Indian buffet.  I had asked for green sauce.  When she brought me red sauce, I tried to explain myself more clearly, but she assured me that the sauce she brought me was correct. \"That's green.\"  I must be colorblind.    Maybe it's the lighting.  But wait, there is something green in here.  Something slimy.  Something that won't be speared by my fork.  Wait, is it?  It is.  It's an OKRA.  wtf?I left my tacos with an ample pity tip and left.", "rating": "2", "date": [2009, 4, 15]}, "4": {"description": "The bathrooms are full of gang graffiti. The staff stares at you while they are eating on the dining room floor. All the food had shortcut after shortcut, and it was all microwaved. The wait staff screwed up half of my order. The all pastor tasted old. The carne asada was dry and old. The beans had a hard skin on them from the microwave. The salsa tasted store-bought and bland. The only edible thing was the rice.", "rating": "1", "date": [2014, 1, 20]}}, "latitude": 41.73281, "neighborhoods": ["South Chicago"], "categories": [["Mexican", "mexican"]], "address": ["8929 S Commercial Avenue"], "attributes": {"Attire": "Casual", "Waiter Service": "Yes", "Take-out": "Yes", "Has TV": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Good for Groups": "Yes", "Delivery": "No", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.55091, "category": "Restaurants", "rating": "2.0", "price": "$", "number_of_reviews": "6"}, "romas-village-bar-and-grill-chicago": {"comments": {"1": {"description": "This place is a cute little place. They have a bar next door. I definitely prefer this place to olive garden. The portions are huge. Its by my house so its convenient. Entrees are no more than $15.", "rating": "3", "date": [2009, 3, 2]}, "0": {"description": "I live in South Chicago and Roma's has been around for a long time. We recently went and had a good experience. I had the fettuccini Alfredo and the portion was massive. My mom had the lemon chicken and enjoyed it. Overall food was good and service was decent. The bar is connected to the restaurant and I could hear the Bears getting their ass kicked, besides being a Bears fan everything else was great.", "rating": "4", "date": [2015, 11, 29]}}, "latitude": 41.7272945, "neighborhoods": ["Calumet Heights", "South Chicago"], "categories": [["Italian", "italian"]], "address": ["9247 S Commercial Avenue"], "attributes": {"Attire": "Casual", "Waiter Service": "Yes", "Take-out": "Yes", "Has TV": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Good for Groups": "Yes", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Good for Kids": "Yes", "Takes Reservations": "Yes"}, "longitude": -87.5509739, "category": "Restaurants", "rating": "3.5", "price": "$$", "number_of_reviews": "2"}, "walgreens-chicago-188": {"comments": {"0": {"description": "This is a nice clean and well stocked!! store and the Pharmacy is nice and Thorough as far as cross checking for interaction of different meds also will try to save you a few dollars with something maybe OTC.", "rating": "5", "date": [2015, 10, 11]}}, "neighborhoods": ["South Chicago"], "latitude": 41.751347, "longitude": -87.575317, "rating": "5.0", "times": {"Mon": ["8:00 am", "9:00 pm"], "Thu": ["7:00 am", "10:00 pm"], "Sat": ["7:00 am", "10:00 pm"], "Wed": ["7:00 am", "10:00 pm"], "Tue": ["7:00 am", "10:00 pm"], "Sun": ["8:00 am", "10:00 pm"], "Fri": ["7:00 am", "10:00 pm"]}, "price": "$", "categories": [["Drugstores", "drugstores"], ["Cosmetics & Beauty Supply", "cosmetics"], ["Convenience Stores", "convenience"]], "address": ["2015 E 79Th St"], "attributes": {"By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "1"}, "carls-red-hots-chicago": {"comments": {"3": {"description": "If I want a quick turkey burger or a sub, then Carl's is the spot!  My kids love the chicken wings with mild sauce......not the healthiest meal, but they swear by it!  Subs, hot dogs, Super tacos...all with a smile and pretty quick service.  Not bad for a fast food joynt!", "rating": "4", "date": [2013, 10, 26]}, "1": {"description": "I was a regular at Carl's 50 years ago, but now its across the street and the old ladies with hair nets are long gone. It was a nice blast from the past and you can't ruin a Vienna Polish with mustard and onions. Food was good but its a different vibe.", "rating": "4", "date": [2014, 5, 17]}, "2": {"description": "Quick review for a quick bite.I needed a quick bite before a church event, so I stopped by Carl's Red Hots. My first mind told me to get a polish and fries, but I got the fries and tamales instead. Big mistake. The tamales were not made by Carl's and were not even close to good tamales...please stop selling this! The fries were good, hot and yummy.I give Carl's one extra star for great customer service even when there were loud kids around, the place was clean for a food joint, and it was warm inside the lobby for their customers. Prices were good overall.Maybe one day I can re-visit and get a Red Hot or a polish.", "rating": "3", "date": [2011, 12, 15]}, "5": {"description": "Reasonable prices, quick service, good food and not a whole lot of attitude from the employees!!! I definitely recommend this place; especially after a night of drinking! LOL!", "rating": "5", "date": [2010, 3, 30]}, "6": {"description": "Great food for when you're in a rush to get lunch.  Super specials, as well as quick service.  I really like coming here because it has a variety of different food (I'm a fan of the hot dogs!) and it even has a drive through!  I'll be seeing a lot of Carl's this school year!", "rating": "4", "date": [2008, 10, 7]}, "7": {"description": "I grew up with Carl's Red Hots since the 60's. I remember the wonderful greasy bags of fries and the wonderful dogs and the orange Nehi. I was of course only like 10 years old but my memories are wonderful. I do miss their old shack across the street of the current location. Something about eating in a little shack", "rating": "4", "date": [2009, 8, 6]}, "0": {"description": "I am 75 year old.  Carl's Red Hots Stand was my first job in 1955.  I loved working for  Carl and Mr. Siegel.  (he was so sweet)  He would have this saying....\"If you know what I mean.\"  I remember him always looking over his eyeglasses.  Smile..  One time, I a friend stopped by the stand to see me...I gave him a free hot dog.  One of the customers saw this and told on me.  Carl was so kind and told me how he made this his living and I should not give it away.  I cried but he forgave me.  I had a greater sense of respect for working hard and be honest.  He taught me how to forgive and forget.  He never brought it up again.    We sold nothing but Red Hots with fries for .25 cents, cold drinks and hot tamales.   At that time, I made 75 cents an hour...and I saved enough to buy my Senior Prom Dress...$50.  Which was a lot of money back then.  Carl would never let me ride the bus home when I worked closing...he made sure I got home safe.  He drove me to my  home.  Always a very kind and caring man who worked very hard.  I am so glad to hear Carl's Red Hots is still around.  I now live in Phoenix, AZ.  One day I will stop by and have a Red Hot for ole time sake ..hope I get to meet Carl's son.  God Blessings on you.   June Hyman Esposito", "rating": "5", "date": [2013, 6, 26]}, "4": {"description": "apparently you not only need a sandwich with beef on it but you also need italian sausage. then you need to have this said artery clogger dipped to go along with a bag full of greasy french fries. and then you need to wash it down with a coke. i was unaware of these things that i needed until we made a quick stop at carl's to grab some food...and it was a very good idea. the sandwich was awesome but this is not for the waistline watching crowd. you just have to suck it up that you've gained 1lb just by looking at the menu and 5lbs when finishing this delicious meal. and the prices are well within reason so at least your wallet doesn't take a hit!", "rating": "4", "date": [2011, 12, 3]}}, "latitude": 41.7440948486328, "neighborhoods": ["South Chicago"], "categories": [["Fast Food", "hotdogs"]], "address": ["1957 E 83rd St"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Accepts Credit Cards": "Yes", "Good for Groups": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.5761489868164, "category": "Restaurants", "rating": "4.0", "price": "$", "number_of_reviews": "8"}, "cocula-restaurant-chicago-3": {"comments": {"29": {"description": "I love this restaurant...they have live music, great waitresses & the best of it all FAST SERVICE!!", "rating": "4", "date": [2012, 9, 30]}, "42": {"description": "MMM good. Food is flavorful and fresh. I go there maybe 2-3 times per month for a quick, healthy bite.  Love their tortas & long island ice tea. Service is good and food is pretty authentic. This is my local, late hour, spot with parking.", "rating": "4", "date": [2010, 4, 30]}, "23": {"description": "I'm positive that this is the best restaurant in the area. The food is excellent and truly authentic. The ambiance isn't fancy but it is pleasant, and service is decent. They've never missed, and I have been here more than once. Their burrito suizo is unbelievably good.", "rating": "5", "date": [2014, 6, 15]}, "8": {"description": "Had the tostada camaron with arroz & frijoles and it was amazing. They give you a lot of food for great prices. My best friend got the asada burrito and it was huuuge!", "rating": "5", "date": [2015, 7, 14]}, "31": {"description": "always crowded.. they make a great taco and nachos. the parking lots always full so it has to be good", "rating": "4", "date": [2012, 1, 23]}, "34": {"description": "You get what u pay 4!!! The food is very tasty and the sit-down area is ALWAYS busy - so if u go to eat-in, be prepared 2 wait. As far as the service goes, the guy on the register is always friendly. The waitresses may or may not be fluent in English BUT so what, u get a decent meal for a decent price and u can always ask the register guy for help if language becomes barrier. I go back frequently and will continue to do so.", "rating": "5", "date": [2011, 10, 10]}, "16": {"description": "I love the lemonade here & if you sit in to eat they make the lemonade like a virgin daiquiri. I like the tacos but the steak burrito is my favorite. I took two of my nieces and they loved the steak quesadilla. The salsa is ok but I have had better.", "rating": "4", "date": [2015, 6, 17]}, "13": {"description": "I went there and ordered something different, breaded shrimp,  I should of stuck to the regular steak or tortas. It was ok but I go there expecting way better, but this time i was disappointed.  To top it off, The waitress was not friendly at all. Next time I'll stick to the regular and carry it out.", "rating": "3", "date": [2014, 11, 2]}, "11": {"description": "I was just there on Friday and I ordered 3 tacos and a side of rice. It was delicious. I enjoyed the tender steak tacos and rice was full of flavor. I think I will slide by tonight and get a few more. Yum!", "rating": "4", "date": [2015, 3, 22]}, "39": {"description": "I LOVE THIS PLACE!!!! I literally grew up here!!! I've been coming here since I was 14 and it was in a grocery store down the street! I'm 46 now!!! The Carne Asada dinner will make you slap your momma! LOL I've eaten at every single one of their resturants! I love them all! This one and the on on 57th and Pulaski are my favorite. 57th is very pretty and fun on Sun nights with the band! 88th and Commercial is my hood that I grew up in! My husband and I lived here when I was pregnant!", "rating": "5", "date": [2011, 2, 21]}, "37": {"description": "Want good Mexican Food? Yep! Then check Cocula out! Anytime I have gone to different ones the food has been good. I have to say I was not impressed with the service and atmosphere but I tried to get pass all of that to enjoy the food which I did. The staff doesn't speak a lot of English so pointing to the menu or knowing a little bit of Spanish will go a long way here. I ordered the chorizo tacos and they were delish. Everything tasted and appeared to be fresh. I have been here twice so far and never had any issues.", "rating": "4", "date": [2011, 8, 22]}, "0": {"description": "Cold winter afternoon , so it's time for a steaming bowl of Mexican chicken soup (caldo de pollo).  La Cocula's caldo was almost as good as mine  Very light chicken broth garnished with a chicken thigh and leg,  boiled potato ,carrots.  chayote, & zucchini .  All that was missing was a piece of corn on the cob. Sprinkled with cilantro , some sliced onion,  & served with Mexican yellow rice and tortillas. It  was just what the doctor ordered.   Solid Mexican restaurant choice on the far Southside.", "rating": "4", "date": [2016, 1, 17]}, "38": {"description": "I left this place so upset, i will NEVER sit down and eat here again!!!  Usually, i call in my order and pick up my food. This time my brother was with me so we decided to \"dine in\". First off they give me a menu and the pages were sticky and slimy. I ask a passing by waitress can i get another one bc the one i had was slimy, she gives me a confused look and takes it and never returns with another.  When our waitress finally made an apperance she barely spoke english and i had to repeat and point to what i wanted several times. The food was on point and delicious, that was a non issue. But seriously folks can we get a competent server.  So we are eating our spicy dishes and need refills. I catch our waitress attention several times and she never comes back to the table. What in the world, seriously, we have tacos, enchiladas, spicy salsa and you don't think maybe we might need to cool down our mouths a little...geeshi... Just sayin. Anyway, I stop eating and just conversate with my brother. We continue to sit there and she visits all the other tables except ours. By this time i am ready to go and heated. So i get up and go to the register and ask for my bill. She pops up and asks do i need help, uhhhhh you think, i've been trying to get your attention for the last 20 min but you chose to ignore us. She gives me the bill and asks was everything ok,  um NO!!!!! So in a hurry i pay the bill and we leave. I normally always give tips and give people the benefit of the doubt but today was not the day. I think i need to find a new mexican spot, bc this was seriously RIDICULOUS!!!!!!!!!!!!!!!!!!!!!!!!!", "rating": "1", "date": [2011, 3, 14]}, "27": {"description": "Some of the BEST Mexican food I've ever had in my entire life. Coming from a hispanic family myself, I feel that's saying a lot. I found this place because it was mentioned in another review by another Yelper. I saw the pictures and was convinced to give it a go. The first time I came here, I got the burrito suiza with the rice and beans, chicken nacho appetizer, fonduta (cheese dip) appetizer, and my boyfriend got an asada (steak) burrito. Everything was so damn good. We were so full we damn near needed a wheelchair to get out of the place. We still had enough leftovers for another entire meal. Since then, we've been back 2-3 more times, and it's been fairly consistent. Definitely a go-to place for some of the best mexican food on the south side of Chicago.ps) I also had the enchiladas...they were decent but not all that. The chorizo fonduta is to die for!GO! Your mouth will thank you.", "rating": "5", "date": [2013, 3, 25]}, "32": {"description": "I been coming here for years. Always great service and great food.", "rating": "5", "date": [2011, 12, 19]}, "44": {"description": "YUM! I was in the area for a meeting with a local non-profit and we decided to stop here for lunch - what a delicious surprise! I'm always looking for great Mexican food in the city...and it's hard to find. Cocula had a casual atmosphere and the waitress was super friendly. I think I got the Guadalajara combo...crispy taco, enchilada and chalupa with rice and beans...way too much food, but I wanted to try a little bit of everything. It didn't disappoint! The chips and salsa were also amazing - and prices were even better! Cocula please build another location closer to the South Loop!!", "rating": "4", "date": [2009, 9, 21]}, "24": {"description": "Cocula is the only place I will eat Mexican food outside of 1 other restaurant, and my home. I'm Mexican and am picky about eating mexican food outside of the house. Cocula is always the best. I love their tortas (though I'm really partial only to their chicken torta or avocado torta; cus I'm weird and dont care much for red meat). Their horchata too! It's the best, and sometimes I'll just go in for that. And their prices are really on point. Most favorite thing on their menu? Their caldo de siete mares (7 seas fish soup). Waitresses are always kind and attentive as well.", "rating": "5", "date": [2014, 1, 5]}, "7": {"description": "Plenty of parking at this South Chicago restaurant with a lot of food for the price. We had four people in our party and we could have fed twice that.The menu was large. It is a Mexican cuisine and the selections were fantastic! T", "rating": "4", "date": [2015, 8, 24]}, "40": {"description": "The scene: I'm hungry, and my taste buds are asking for something with a little Mexican flair! What do I do? I either cook something up myself or have my Mom whip something for me! Or, I head on over to Cocula's on Commercial!Yes, they are a local Chicago chain but believe me, this is the BEST one. I don't know what the cooks do here that's different, but the food is just better at this particular location than than the other ones.This is one of my favorite restaurants in my area! Their food is really good, and always hits the spot! I'm obessesed with their steak fajita dinner, tortas, seafood, and drinks! Their horchata is especially good, as well as their limonadas (try it, they bring it you in this huge glass goblet and its like a limeade slushi). They also have a good selection of imported Mexican beers and tequilas, and are open 'til about 3:30a.m.! How can you go wrong? Lately, I've been ordering their \"Combinacion\" dinners which is the #4 (a tostada, enchilada, and a taco, with your choice of meat. I prefer the the tostada and the taco be picadillo and the enchilada be chicken! and have the tostada be brought you on the side so that it doesn't get soggy!). Ahh yes, another South Chicago staple reviewed on Yelp!", "rating": "4", "date": [2011, 1, 17]}, "30": {"description": "This restaurant has quality Mexican grub. There aren't too many options where I work, so it's worth the twenty min drive to pick up some tort as here.", "rating": "4", "date": [2012, 8, 1]}, "46": {"description": "3.5 starsThis is our go-to place in the 'hood when celebrating with a group. Their margaritas and pina coladas are pretty good. I usually get a burrito but today I had the carne asada taco dinner (yep, had it for lunch). I definitely have enough leftovers lunch the next day. Can't really go wrong with any of the dinners/combos.It's always nice to have a spanish speaker in the group but it's not necessary. The waitresses even played a birthday song for me on the jukebox and a friend kindly translated it;)", "rating": "3", "date": [2008, 4, 9]}, "1": {"description": "I was on the hunt for menudo because I always seem to be wanting that, but \"timing\" is often off and likes to play games with me!  In other words, menudo is an item that's typically offered on Saturdays and Sundays only.  As a retail professional, having to work on the entire weekends is just what the business demands.  However, I was \"awarded\" for having a Saturday off.  In order to prepare this \"menudo\" feast, I counseled the Google search engine.  I found out that the menudo from  \"Cocula Restaurant\" was top-rated in Chicago.  This time, Mr. Timing was on our side since hubby was finishing up a service call in Highland, Indiana.  I suggested him to come here for lunch.  Haha, he took the bait!  Where Cocula Restaurant is located isn't in the best hood, yet it's not definitely the worst I've seen in Chicago.  Many of you may disagree with me on this point that I'm about to make: I don't mind citizens drinking in public or using illegal substances on middle of the streets.  You may pursue your happiness whatever way you desire, but the consequences and responsibilities are on you.  That's how libertarian I am as an individual.  Well, let's delve into the food that we consumed happily in Cocula.  Parking is more than plenty, so you stay safe there, my friend (and police do pop in a lot to place orders).Menu from Cocula was one of the most extensive ones I've ever seen.  They had an entire page of Mariscos!  While trying my best to not be distracted by my BFF (seafood), I stuck with my original choice, menudo.  On the other hand, hubby requested chilaquiles with huevo only without any meat.  The service was attentive.  The young lady even asked if I preferred my menudo with or without bones!  I usually like mine without the bones since science has told me that the dropping of heavy objects in the soup tends to cause splashes.  Ten (10) minutes after the deliveries of salsa/chips and two (2) large horchata on our table, hubby's chilaquiles arrived.  Chilaquiles are versatile and can be made with different kinds of meat or without meat.  Who doesn't like crunchy salsa chips mingled with fresh veggies, avocados, eggs and beans?  The young lady friendly informed me that the menudo was coming soon, while preparing the condiments (fresh-chopped white onion, poblano peppers, and oregano).  Wow, that menudo (dreaming about lovely tripes dancing in my mouth...) didn't skimp on the amount of tripes.  Every single scoop until the last bite was tripe-ful!  The tripe tasted tender and was easy to chew and swallow.  The broth was also flavorful, and there was no need to boost the acidity by adding lime juice.  The Italian soccer game on TV and lively Mexican folk music kept us busy.  After some intellectual conversations about soccer between hubby and I, our food was steadily transported to our stomaches.  The price points were also reasonable.  Our total with two (2) grande horchata, huevo chilaquiles, and menudo came to under $23 before tip.  I wish that heavenly menudo was offered everyday of the week.  Now you should know Rosa J.'s best companion on the weekend is menudo.  We will be back, as least I will certainly lure hubby to service more calls in this direction of the city.  I want to try their Mariscos next time when I come in.", "rating": "5", "date": [2015, 5, 30]}, "9": {"description": "The food was awful the breaded fish was fried hard and burned. The meat from my torta tasted old.", "rating": "1", "date": [2015, 12, 4]}, "26": {"description": "I LOVE this restaurant! I have been here at least 50,11 times and every time I come here, I leave as full as a fat lady's purse when giving free samples. Everything is fresh, except for the chips on certain days, you can taste the hours have they not been eaten but besides that no complaints. The waitresses with all their makeup and lure are respectful and present great customer service. I recommend this place to anyone with an Mexican food itch to scratch.", "rating": "5", "date": [2013, 9, 25]}, "25": {"description": "Ordered a chicken flauta dinner and a steak taco.  Steak taco was tasty best i've had on the southside so far. Flautas were big but a bit dry. So filling.. I was only able to eat the taco and a bite of the flauta.", "rating": "3", "date": [2013, 10, 21]}, "12": {"description": "Never expected to find this great mexican at this location, glad we stopped.Chips and salsa, great!Steak taco - best I've ever had!Beans - awesome flavor (made with chorizo)Piña Colada - though it was freezing out made me feel like I was at a resort! YumAl pastor  - flavor missing something too much sauce for our liking, sorry.Horchata pitcher - very good and ice served on the side, so nice to pay for the drink and not the ice! Menudo - BEST EVERService - very attentive*** loved the way they served bowls of chopped onion on the side of salsa, nice touch so some could add and others didn't have too.Extra bonus nice TVs to watch a game.Next time we are in that neighborhood we would go back, but just found out they have two other locations!", "rating": "4", "date": [2015, 2, 23]}, "21": {"description": "The place to go for authentic Mexican food!!! Their chips and salsa are the best !!! Sometimes I go in just to buy that! Their piña coladas are also my favorite from all that I have had!!! And for the people that partied a little bit too much on the weekend they have great micheladas!!! The neighborhood that it's in the the down side!!!", "rating": "4", "date": [2014, 8, 12]}, "17": {"description": "What are you waiting for?   Arriving to Cocula's Restaurant has a unique feeling like no other. Tire shops and factory workers surround the restaurant, making it stand out like a \"diamond in the rough\". Once inside of the gated parking lot the smell of Mexican cuisine hits you urging you to walk faster.    Walking into the restaurant it is a sight to see. Large wooden tables on one end and vibrant colorful tables on the other, traditional Mexican music coming from the juke box, and the smiling faces of everyone inside seemed so unreal. The art pieces hanging off the walls intrigued my eyes as I scanned the large room. The drastic contrast between inside and outside made it take a while to settle in and find a table. Decisions, decisions   Once I made my seating decision, my smiling waitress then approached me with a menu and chips with salsa. The menu is well organized and filled with many authentic Mexican cuisines. Adding pictures of their cooked meals menu does a great job at accommodating non-Spanish speakers. With over fifty reasonably priced items to choose from I was not at all ready to place my order in a timely fashion. All of the different cuisines had me planning my meal for the next time I would eat here. Eventually I was drawn to their Cocula dinner meal, which offered one tamale, taco, and a tostada with a side of rice and beans.More please!   As I glanced around at the wall paintings, my waitress reappeared to fill my drink without me having to call her over, and had a brief conversation with me. Unlike many big restaurants, my waitress was able to focus on my needs as a customer. After a short waiting time my food was ready. My waitress approached my table with my steaming hot meal. I took no time to dig into my delicious meal. The steak was hot and well seasoned to my likings. So much food on one plate was delightful to see especially for only $9.95. Is there room for nine more?   While I enjoyed my meal I couldn't help but notice the large family sitting across from me ordering their food with three small children running around the table.  At one point one of the waitresses even encouraged the young girl to run faster. It was interesting to see this because in most restaurants families are encouraged to keep their children seated, but because this is a family restaurant the behavior was encouraged. Fantástica!   My experience at Cocula's Restaurant was one of the best I have had in a long time. Between family warmth, Mexican culture, tasty food, inexpensive prices, and the warm customer service I am not sure which I enjoy most.  Overall Cocula's Restaurant gets 5 out of 5 stars because they made sure to integrate Mexican culture in the customers dinning experience. If you are looking for a family spot to eat ethnic Mexican cuisine with the Mexican culture surrounding you, this is surely the place to go.", "rating": "5", "date": [2014, 9, 23]}, "10": {"description": "I read all the rave reviews. And one night my boyfriend and I decided we were going to stop by and grab a bite to eat. To not make this dreadful long story very short, this was our most tasteless  restaurant experience ever. The cleanliness sucked and the food sucked even more very bland tasteless food! I'm going to post some pics which is a perfect example of how looks can be very deceiving..... Save your money!!!", "rating": "1", "date": [2015, 6, 19]}, "5": {"description": "I thoroughly enjoyed my meal today. The flavor was outstanding. The only issue that I had was that our waitress rarely checked on us and took a little long to bring the bill and to-go containers. But I will undoubtedly be back.  Hopefully soon.I had to come back and update my review. My leftovers were just as delicious as the day I originally ordered. And I really got to see how fresh the ingredients were. I want another burrito right now.", "rating": "4", "date": [2015, 3, 7]}, "3": {"description": "Been her a couple times and it's ok. The staff is always friendly except for the chunkier older gentleman that is behind the counter. The drinks are always amazing though. But not the best Mexican food.", "rating": "4", "date": [2016, 2, 10]}, "35": {"description": "Changing my review since my wife and I will not eat here anymore.  We were regulars there over the last two years but one waitress in particular kept getting the orders wrong and always blamed us for it.  The last straw was when she claimed I ordered a chicken burrito when I had said steak.  I had always ordered a steak burrito with a coffee so was rather confused.  My wife also heard me say steak.  She refused to return the food so i tried to eat it but was too angry to take more than a coupla bites.  The same waitress had botched a coconut shake order with chocolate on the previous visit but we figured it was a language issue.  Plus the shake turned out to be good.  Not so much the chicken burrito.  We don't like being called or treated as liars so will pick another out of the gazillion Mexican restaurants in Chicago.", "rating": "1", "date": [2011, 9, 16]}, "19": {"description": "Some of the BEST Mexican food I've ever had in my entire life. Coming from a hispanic family myself, I feel that's saying a lot. I found this place because it was mentioned in another review by another Yelper. I saw the pictures and was convinced to give it a go. The first time I came here, I got the burrito suiza with the rice and beans, chicken nacho appetizer, fonduta (cheese dip) appetizer, and my boyfriend got an asada (steak) burrito. Everything was so damn good. We were so full we damn near needed a wheelchair to get out of the place. We still had enough leftovers for another entire meal. Since then, we've been back 2-3 more times, and it's been fairly consistent. Definitely a go-to place for some of the best mexican food on the south side of Chicago.ps) I also had the enchiladas...they were decent but not all that. The chorizo fonduta is to die for!GO! Your mouth will thank you.", "rating": "5", "date": [2013, 3, 25]}, "28": {"description": "Fast service and good tacos", "rating": "3", "date": [2013, 2, 25]}, "45": {"description": "My friend Mike + I's \"Burrito Sunday,\" search continued, last week, as we drove out to Chicago's southern lakefront towards South Shore's S. Commercial strip. There were few options up the strip, granted it was a Sunday evening. We passed Cocula + it's Chile's exterior a few times but were eventually won over by it's parking lot option + overall slim pickens elsewhere. First couple of thoughts upon entering Cocula: \"Did this used to be a Wendy's?\" + \"It's packed!\". A mix of good/bad signs, depending how you look at it. We found a booth + were soon handed our menus (their menus resemble that of a Mexican Denny's) + a basket of chips/salsa. The chips were a lot like Tostidos + the salsa was a standard red w/ a lot of cilantro thrown in perhaps to cover up the store bought flavor. I gave Cocula an extra star due to the fact that they not only had horchata but they had it by the PITCHER. I was sold! Sure, it wasn't the best horchata I've had but the pitcher option was a big selling point in my starved state. While we waited for our order, I noticed a girl no older than 9 eat an entire vat dressed in a goblet of dark red shrimp cocktail. She managed to pick out the tempting slices of avocado + left them to the side. I then looked behind Mike to see the couple seated behind us who I'm assuming had ordered a pitcher of Bloody Mary but it resembled Heinz 57, more so. I had ordered my usual veggie burrito w/ avocado (which they forgot). It arrived with a side of pasty beans + rice, which had three kernals of corn + two green peas. I was hungry so overlooked the redundancy of the rice/bean mix. The burrito was ok, no flavors really jumped out at me. Mike had ordered a steak burrito + was pleased with it's medium/well-done texture. I could have gone with more spice, something more memorable but my burrito definitely left me feeling full + I had to pass on the last cupful of horchata left in the pitcher. All that said, the staff was rather nice + the price was resonable. I'm sort of bored with writing this review ...Sort of like my Cocula experience.", "rating": "3", "date": [2008, 7, 19]}, "33": {"description": "This place has great authentic Mexican food. The burritos, tortas, enchiladas and tampiquenas are great. Service is average and the drinks are very tasty and affordable. Plenty of seating and parking is also available. This place knocks out the competition in most of Chicago.", "rating": "4", "date": [2011, 10, 26]}, "43": {"description": "Named after the city of Cocula, Jalisco, Mexico. Stands out from its surroundings because it's big, new-looking, and has its own large parking lot. Open until 3 AM, if you are on the far South Side in the dead of night, here is a good place to go.Meal starts out with a lot of complimentary tortilla chips, salsa, and escabeche vegetables. All of these were OK but not outstanding. Also included slices of fresh lime, which is somewhat uncommon. Iced tea arrived in a huge glass goblet and also had a slice of lime. Was impressed by that but disappointed to find that it is pre-sweetened instant tea, not real brewed. Very slick menu, with breakfast, lunch, and dinner selections lavishly illustrated with color photos. This aspect made me feel as if in a Mexican version of \"Denny's\" or something like that, I found out later the reason is that it's one of several \"Cocula\" restaurants in a chain.Ordered the chiles rellenos. With corn tortillas, actually received flour tortillas. Oh well, I like flour tortillas also, and it's 2:30 AM, and.. I'm hungry... Quantity is above average, getting really a lot of food and enough to take out the leftovers for another small meal at home. The salad accompanying the meal was above average and includes avocado, red cabbage, onion, and dressing. Other than that, I felt everything is good but not outstanding. The building is a work-in-progress at this time: because it's new, they haven't painted most of the walls yet, there is no ceiling installed yet so you see the ventilation ducts and wiring above. Will be nicer when they finish it and I would predict this to become a popular hang-out for the neighborhood. Prices a little bit above average but still inexpensive. The proprietor and waitress were very kind. This place may have the effect of competing with more unique / idiosyncratic taquerias and small restaurants in the area. But overall have to see it as a good thing.", "rating": "3", "date": [2010, 3, 13]}, "2": {"description": "Overall i enjoyed my food! They forgot my steak and I cancelled it and she bought it out late anyway and charged me! I will go again cause I haven't been here since'91 i want to try 7 seafood soup!", "rating": "4", "date": [2015, 10, 2]}, "18": {"description": "Hands down, the best tacos on the south side of Chicago, or East side. You might not like the location, but you'll be amazed by the food. Drinks are very good too.....didn't expect it but, they have tv's so you could watch the bears game while you enjoy their masterful, authentic as all hell, yummyfied tacos.... Also, you have to try the parillada for two...", "rating": "5", "date": [2014, 10, 21]}, "41": {"description": "great for a quick mexican fix. The drinks could be better, but the food is delicious. The latin music coming from the juke box ties it all together and the staff has great table manners, in addition it was also recently renovated and expanded.", "rating": "4", "date": [2010, 6, 22]}, "4": {"description": "If you want some Mexican food, this is the place to go. It is a clean establishment. The waiters are very nice and helpful. It's also inexpensive. You will enjoy your food.", "rating": "4", "date": [2016, 1, 14]}, "6": {"description": "I ordered a ground beef taco dinner to go.  Nothing about it was authentic to me.  The taco shells fell apart, the meat texture  was not ground beef.  The beans were just beans with some cheese.  And my napkins had spots on then.  I had been here before for a late night meal but in the light of day ... Not so sure I like it as much.", "rating": "1", "date": [2016, 2, 18]}, "22": {"description": "Fantastic Authentic Mexican Food! Really good horchataoh yeah Tortas are terrific!! ! I changed jobs, and it never stopped being one of my favorite lunch spots!", "rating": "5", "date": [2014, 8, 3]}, "15": {"description": "Tasty and affordable Mexican food with spice level ranging from just enough to hoo-boy! Try the soups. I had ENCHILADAS MEXICANAS because I had a craving for mole sauce. Scarfed 'em down without stopping for breath. Also, their guacamole is the best I have ever had anywhere. The large keeps four-plus people happy while the entrees are prepared.", "rating": "5", "date": [2015, 4, 3]}, "20": {"description": "I tried the \"camarones a la plancha\" they where very good I had not tried some shrimp that good. I would definetly recommend this restaurant and the service is great.", "rating": "4", "date": [2014, 9, 1]}, "36": {"description": "One of my favorite places to eat.  Starting with the chips and salsa.  GREAT!  Move on to the steak fajitas or chicken flauta dinner.  FANTASTIC!  Then wash it down with the best ever horchata.  YUMMM!You can't go wrong here.  The food is very impressive.  I love it.  Thanks.", "rating": "5", "date": [2011, 8, 25]}, "14": {"description": "Tacos were good.  But my order was wrong and the waitress didnt check on us once. The place could be cleaner too.", "rating": "3", "date": [2015, 7, 22]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7339822, "longitude": -87.5511616, "rating": "4.0", "times": {"Mon": ["7:30 am", "12:00 am"], "Thu": ["7:30 am", "12:00 am"], "Sat": ["7:30 am", "3:00 am"], "Wed": ["7:30 am", "12:00 am"], "Tue": ["7:30 am", "12:00 am"], "Sun": ["7:30 am", "12:00 am"], "Fri": ["7:30 am", "3:00 am"]}, "price": "$$", "categories": [["Mexican", "mexican"]], "address": ["8847 S Commercial Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Delivery": "No", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Casual", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "47"}, "mcdonalds-chicago-88": {"comments": {"3": {"description": ": I went tonight to get a late snack and there was a gentleman in front of  us walking. He was walking because it was late and only the drive thru was open. He made his order and they told him he could not order because he did not have a car. So he asked me if I could order for him and he gave me his money. So I did or at least I tried to at fist I told him I wanted to make two separate orders and he said that McDonald's does not do separate orders over the drive thru . The guy ( the manger) said I could not order for the other persons order. This McDonald's manager was a total asshole. I don't know if he didn't want to take his order because he didn't have a car or if it was because he was a young African American male. I do know the mangers name is Hugo. I thought McDonalds is a business and there primary objective is to make money and to keep the customer happy.", "rating": "1", "date": [2014, 6, 3]}, "1": {"description": "This is just about the crappiest McDonald's you could go to.. I'm really not sure how it's still in business. It's ghetto and dirty and for some reason the chick in drive thru never gets your order right! No ice means no ice. Fresh fries does not equal uncooked fries. This will be my last time visiting this place and I'm sure the only reason it's still in business is because ppl in this location unfortunately cannot eat or have access to anything better.", "rating": "1", "date": [2015, 2, 14]}, "2": {"description": "HORRIBLE. The worst McDonald's. Their fries are burnt, they never have anything, and the food is just nasty!!! Don't go trust me. I've lived around here for 15 years and at first it was okay but in the last 7 years they've become crappy.", "rating": "1", "date": [2015, 10, 15]}, "0": {"description": "It's a McDonalds. There's a drive thru. There's an indoor playground. Most of the patrons were yelling on their phones. The wifi was down and apparently had been broken for awhile.My hot chocolate from the McCafe was really good.", "rating": "2", "date": [2014, 11, 14]}}, "latitude": 41.7279663085938, "neighborhoods": ["South Chicago"], "categories": [["Burgers", "burgers"], ["Fast Food", "hotdogs"]], "address": ["9211 S Commercial Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.5508117675781, "category": "Restaurants", "rating": "1.5", "price": "$", "number_of_reviews": "4"}, "rotofugi-designer-toy-store-and-gallery-chicago": {"comments": {"58": {"description": "i am crazy about rotofugi, the adorable, beautiful toys, and the awesome people who work there. to be more specific, these are the kind of people who will sit around making the dolls dance with each other when it gets slow. if you have a problem with that, you hate happiness. the gallery is even more amazing than the toy store itself. openings are always warm and unintimidating with the requisite free snacks, wine, etc. i'm bad at making aesthetic generalizations, but all the art i've seen here has been incredible/excited me more than many other local galleries. many of the artists definitely have a playful quality to their work/explicitly \"play\" with images one might typically categorize as adorable/innocent. beyond that, the only thing the artists seem to have in common is that they all rule.", "rating": "5", "date": [2011, 5, 29]}, "56": {"description": "There is a gallery in the back, but the entire store is a gallery in itself. Regulars will quickly develop love/hate relationships with the blind boxes. The concept of leaving the purchase up to chance is like that of toy vending machines (wiki gashapon for more info). Sure, it's frustrating not to get the figure that you want, but the joy of (finally) getting \"the one\" makes it worth the trouble, just like the lottery (oh vices). And, of course, the blind boxes are an excuse to make more purchases ;DThe prices are just right; buying one or two on a visit won't seem a splurge, but the urge to collect all of them will burn a bigger hole in your wallet over time. The great service does not help my pocketbook ;P", "rating": "5", "date": [2011, 6, 30]}, "29": {"description": "This is a very cool shop for unique toys, apparel, accessories, and art.  I love coming in here and browsing through all of the products.  Once my brothers get to an age where they don't break everything, I'll buy them some stuff from this place.  The prices are a little high but I doubt you'll see stuff like this in any other store in Chicago.  It is worth an excursion inside!", "rating": "5", "date": [2013, 1, 16]}, "42": {"description": "I've been to a lot of awesome toy stores in my day, but I keep coming back to you, Rotofugi! And your new location and store-size just takes it to the next level. Truth be told, when I'm across the country for work, I still by all my designer toys from you guys. Why? Because that's just the love I got for you.Your prices are great, and you aren't restricted to one genre of art toys and accessories. You got a little bit of everything, and boy does it work for me.Never go out of business, yeah?HEART!", "rating": "5", "date": [2011, 12, 29]}, "23": {"description": "I cannot say enough wonderful things about this place!  I stop in fairly regularly to add to my vinyl toy collection and am still wowed every time.  They have a great variety of toys, posters, books, magazine and so much more.  I love the \"Roto-O-Rama\" (one of those classic Mold-O-Rama machines) in the back there you can make your own plastic toy.  I have met one of the owners and she was extremely nice and friendly, as are the rest of the staff.  This place is a must for any vinyl toy or lowbrow art lover!", "rating": "5", "date": [2013, 9, 26]}, "47": {"description": "I mean... what's not to love?  I recently dropped some serious coin at Rotofugi and didn't think twice about it.  This place AWESOME.", "rating": "5", "date": [2011, 9, 16]}, "8": {"description": "Love coming here, faboulous designer toys and artwork! I can't leave without at least buying one dunny!", "rating": "5", "date": [2014, 3, 10]}, "31": {"description": "This place is AMAZING! My boyfriend, family, and I went here while visiting relatives who live outside Chicago (I live in Anaheim, CA). We looked up reviews here and once we saw pictures we absolutely had to make a trip since my boyfriend and I are vinyl-addicts and my younger sister loves Tokidoki.The inside of the store is awesome- very spacious and there's tons of vinyl everywhere. Even my parents who don't \"get\" the whole vinyl toy thing had fun looking around. There's really something for everyone! My boyfriend and I bought tons of Labbit blindboxes, stickers, and Unicorno blindboxes, but in hindsight I wish I had bought more stuff. I think I was just a little overwhelmed, the selection is MUCH larger than the Kidrobot we have in Los Angeles, and Rotofugi carries tons more brands.Coming here was completely worth the trip, the only downside is I wish there was one over here in California! Good thing they have a great online store.", "rating": "5", "date": [2012, 12, 3]}, "34": {"description": "one star off for high prices...4 stars for a very entertaining store :)i luv all the knick knacks and toys and books and paintings...very ecclectic...very fun...artfully arranged and easy to browsethink of it as urban outfitters on crack...minus the clothing and housewares", "rating": "4", "date": [2012, 7, 26]}, "16": {"description": "Bottom line:  While most of the vinyl toys are meant for collectors, children with discerning tastes will be well served here in the gift department with reasonably priced blind boxes, unusual plushies (check out the Pecanpals) and tees. $5 to $40 range.Inspiring collection of the best designer toys with something in every price range ($5 to several hundred).  Mostly new vinyl, maybe a tiny selection of vintage Japanese.  Lots of one of kind pieces and big names here.  More Secret Base than I've ever seen in one place in person.  If you have understood this review so far...you are drooling perhaps.If you are into graphic design or toys at all, you really must go._________________________________________________________I want to give you six stars, Rotofugi.  The best big kid toy store I've been to in the US.  Designer vinyl toys to make you cry.  Bigger, badder and more dangerous now that they've consolidated all their holdings into one giant, light filled space.The gallery is beautiful, huge.  It's as big as La Luz de Jesus in LA!  I had the pleasure of attending the opening of Ralph Cosentino and Martin Tsu (Ruby Gloom fame) during this sojourn to Chi-Town.  My heart was happy, my wallet was lighter and my walls now have 3 Cosentino prints! (I'm braggggging!)Thank you to the owners and staff for being so kind, so approachable. No hipper than thou at Rotofugi, thanks!   Thank you for shipping my prints happily, explaining things to me and...even giving me great tips on where to eat in town!", "rating": "5", "date": [2011, 6, 15]}, "13": {"description": "Honestly CANNOT say enough good things about Rotofugi. I haven't been to the shop, but their online customer service is seriously top-notch. Every time I email them with questions, they're not only friendly but EXTREMELY helpful and crazy fast with replies (they always reply within a few hours which is something i've never experienced from any other businesses). They answer everything in detail and truly put an effort to be helpful whether or not they have the product in stock. I've always been super impressed by their customer service. Other designer toy stores need to learn from them *cough*3Dretro*cough* (warning- don't buy from them, i''ve experienced the worst non-existent customer service from them).Roto's prices are always fair and reasonable and they dont jack up prices for pieces are harder to find elsewhere. Flat rate shipping is cheaper than most toy stores and they even use PRIORITY 2 DAYS shipping!! From what I've experienced, not many stores are willing to use priority 2 days...I usually always have to wait at least a week for orders. I received my package and it was very carefully packed, even filled with packing peanuts even though my toys weren't that fragile. And here's the thing that blew my mind- they wrapped every boxed toy individually in paper (taped up and everything like a present) so it was pretty freakin awesome being able to unwrap every item as if I were unwrapping presents!!!! (it was like christmas  in January! and I don't even get to unwrap presents on xmas at this age...)If possible I would've given roto 10 stars. Will definitely be buying all my toys here from now on :) so worth it! Hope they stay in the toy scene/business for a loong looooong time!", "rating": "5", "date": [2015, 1, 17]}, "11": {"description": "Fun, clever, and imaginative. Rotofugi is a brilliant mix of collectible, modern toys and art. The shop is in the ground floor of a beautiful vintage building, they have high ceilings and lots of windows which makes Rotofugi just a great space to be in.The toys are awesome and there is something for everybody, no matter what their age or interests. The art in the gallery area changes regularly and is always great to check out. This is a great place to bring out-of-towners, go gift shopping, or spend part of an afternoon just looking at all the cool stuff.Very glad to see you are doing well Rotofugi, I can't wait to shop again!", "rating": "5", "date": [2015, 3, 4]}, "39": {"description": "Going to this store was a new experience for me. Never been to a place like this before, and it took me a while to take in all this place has to offer. My brother, being a huge fan of kid robot, brought me here while we were on a mission to find him a traveling \"gnome\". We eventually picked out a plush labbit. I also purchased a charger for my android, which resembles the green Android robot, whose name is Andru. I digress.This store is brightly lit, well-organized and very clean. All the products are arranged very neatly on shelves, so neatly I feared touching any of them because it will ruin their arrangement, sort of, not really. I really enjoyed this place because it made me feel like a kid again, playing with toys and laughing at how entertaining they can be. Oh, the many things I miss about being a child.This was a fun adventure I embarked on with my brother and I loved it all. Kudos.", "rating": "5", "date": [2012, 5, 22]}, "37": {"description": "We had no intention of going to this store....We wanted to grab a drink at Delilah's and they weren't quite open yet. So we decided to stop in to this store to kill like 15 minutes. Little did we know, we would end up spending almost an hour...in sheer amazement. They have so much cool stuff! Trinkets galore. A ton of cutesy erasers (my friend Mel grabbed the macaron ones). Little zipper pulls and figurines. A gun note pad! Buttons! ORIGAMI POSTCARDS!I really didn't think there was gonna be anything I'd want, but I actually found a print by Shannon Bonatakis that I fell in love with. I couldn't leave without it. I wasn't looking for art, I almost never buy art. I just couldn't help myself. Had to have it. They also have a couple of artists on display and there was a dinosaur piece up that I reallllly liked (just because I love dinos) but it was like $250 and I'm not rich. So glad Delilah's wasn't open yet, would have missed a really cool spot. I would go back just to look at the art work.", "rating": "4", "date": [2012, 7, 1]}, "0": {"description": "Rotofugi is a toy store for grown-ups!  Kids are going to like it too.  I don't know anything about collectibles or much of the nerdy stuff that's here, but I did buy an adorable plastic/vinyl figurine of Peanuts' notorious bossy gal, Lucy Van Pelt.  I also picked up X-Files' Mulder & Scully figurines for my friend.  From Disney princesses to aliens, these figurines are only $11 each and can perk up a cubicle or fancy pants office.T-shirts, tote bags, notepads, pens, and toys, toys, toys!  This is a spacious spot that also includes lots of art on the walls and a separate space that hosts a small art gallery.  Check it out - I dare you to not spend a dime here!  If not for yourself, you'll find something for someone else.", "rating": "5", "date": [2015, 8, 10]}, "38": {"description": "a little bit toy store a little bit art gallery and LOADS of designer FUN!*remember* munny . kid robot . and other random japanese toys . art . books?this place has it all~ just go and *explore*~*~a definite stop for a blast into the past . a picker upper . and to see sup in the artS ;p", "rating": "4", "date": [2012, 7, 1]}, "51": {"description": "can't wait to visit this store when i hit up chicago! My rating is based on their online business. Fast Shipping and cool free stickers added to  my order. Marshalls are the best. We need a Rotofugi in Boston", "rating": "5", "date": [2011, 7, 27]}, "27": {"description": "I have recently been to Rotofugi Designer Toy Store & Gallery and I have to admit that I was impressed by the wide array of exclusive toys, accessories and arts that it offers. It was a pleasure for me to take a look at all the products and to buy several fascinating toys for my kids. I have to say that the toys are excellent for teenagers who are fond of art. And you can even take them with you when going to this store because there is an astonishing gallery situated in the back of the store that displays an amalgam of national and local artwork. The staff is really polite, helpful and kind and it never forces you to buy something. All the goods are well-arranged on the shelves, so it is impossible not to find what you are looking for. This place has something to offer to everyone, so don't hesitate to go there!", "rating": "5", "date": [2013, 5, 25]}, "32": {"description": "This gallery is the sh_t.Go if you like cool things.Do not go if you hate your life.Just kidding, but seriously - Rotofugi is amazing and every city should have a comparable gallery.  Space + toys + art selection + friendly albeit sort of hipster snooty staff. (Quit hitting on my Filipino girlfriend!) ;)Keep being awesome RotoF.", "rating": "5", "date": [2012, 12, 2]}, "54": {"description": "this place makes my head explode i love it so much. tables and shelves of the most creative objects ever. blind boxes GALORE. t-shirts. plush. friendly people behind the counter and art hanging in an adjacent gallery makes for a perfect moment. every time. bring your imagination and your checkbook!", "rating": "5", "date": [2011, 7, 6]}, "48": {"description": "I am an avid designer toy collector and this place is great. It's in a really good area of town, too. I think this location is a step-up from their previous location, space-wise. It holds more products and has more space for the art gallery. They have a pretty good inventory of toys, magazines, and other random stuff. The workers are always super friendly, and sometimes I'll see the owners with their dog (which I think is pretty awesome!) I definitely recommend this place for anyone, toy collector or not.", "rating": "5", "date": [2011, 9, 14]}, "44": {"description": "Rotofugi   - If you love vinyl collectibles, blind boxes, unique gifts this is the place to shop.  I usually go here a couple of times a year.  I always find some little vinyl figure that I must have and I'm addicted to those blind boxes.  They have a large collection of ugly dolls, books, original artwork and limited edition pieces.  It's a fun, funky little shop with a wide range of prices that start at just a couple of bucks.", "rating": "5", "date": [2011, 12, 10]}, "24": {"description": "This has to be one of the best places to works everyone is always happy helpful and Kirby the owner is always super nice. It is a designer toy store with awesome unique doo dads to show off and impress your friends. They have things only your imagination should have, for sale. Cool artwork, stickers, toys on every wall and shelf. It's very easy to get in a lot of trouble with a credit card here.", "rating": "5", "date": [2013, 8, 8]}, "7": {"description": "Rotofugi is one of the most creative and crazy places I've ever been in my life!It's a veritable playground for anybody who loves quirky characters, funky art, and thinking outside the box. Kids and adults alike will go nuts for everything they have to offer. Rotofugi is a store filled with things I never knew I wanted but once I see them I feel I need! They've got an extensive merchandise offering in-store as well as online, and for the true art lovers there's a gallery in back showcasing artists and their talent.Go on a visit to Rotofugi, and experience what it's like to be a kid again (and a kid with way more spending money, at that!)!", "rating": "5", "date": [2014, 11, 9]}, "49": {"description": "About three weeks ago I was sitting in the front window at Delilah's having a beer and looking outside, into Roto's gallery window.When from inside the gallery this little mutt looking dog slowly waddles up to their windowstops in the windowlooks across the street at melifts its legand pees on their radiator.Mutt gives me a wink, turns around, and walks back into the gallery.Stars for having a kick-ass dog wandering around after hours.Cool products for sale, too.", "rating": "5", "date": [2011, 9, 4]}, "40": {"description": "I absolutely adore this designer toy shop!  I've been a fan of Shawnimals and Ugly Dolls for a few years now and finally got a chance to stop by this store.  The selection is awesome - ranging from cute to funky toys.  They would definitely be great gifts for people looking for something unique.  There aren't any cookie cutter things in this shop.  Also, the gallery in the back looked super awesome - I will definitely check that out since I got there pretty late Saturday and didn't have that much time to browse.Great toys at great prices.  Will definitely be back when in the area again.", "rating": "5", "date": [2012, 2, 20]}, "53": {"description": "Rotofugi was one of the main reasons for visiting Chicago and this store did not disappoint. The store is large, open and any toy collector's dream. We shopped around with baskets and filled each of ours up with blind boxes from various designers, some bigger vinyl characters and got some t-shirts. The two guys behind the counter were super nice and told us to check out the gallery when we have time. The gallery is simple but impressive as well. Great store, great employees and they carry an amazing variety of toys.", "rating": "5", "date": [2011, 7, 20]}, "30": {"description": "Wet dreams.", "rating": "5", "date": [2012, 12, 19]}, "46": {"description": "Hold onto your hearts because they're about to explode with cuteness.The storefront lined with adorable toy models might draw you in.  The stuffed animals, or stuffed personified food, might make you squeal with delight.  The sets of tiny sushi that are smaller than your fingers might make you giggle.  The funny stickers might make you want to buy them all.  I'm just saying these are things that might happen to you when you visit Rotofugi.", "rating": "4", "date": [2011, 9, 28]}, "1": {"description": "I love all things nerdy! They have all sorts for all ages..cute baby items and souvenirs if you like..The art canvas of the wall was beautiful! I love the mix of colors and I'm sure there was a reason there was a bear on all the canvas but I'm not sure why. Other animals would've been as much appreciated..food for thought.Overall: I got a positive energy being there! That's one way to be recreational!", "rating": "4", "date": [2016, 2, 22]}, "55": {"description": "One of the best and most fun stores ever. I was concerned about the move from Chicago/Damen to Racine/Lincoln/Diversey, unwilling to give up brunch at someplace like Jam or Cleo's and then Roto, but it's a six-of-one thing, as the new location offers its own nearby treasures, such as the Powell's used bookstore on Lincoln about a block north of the Roto store. Plus, the staff is absolutely the very best, and the prices are very reasonable - just one of my favorite places anywhere. The new gallery space is awesome, too. And the gallery shows have for the most part been excellent. My only gripe is nominal: I'd like to see shows with more larger-sized pieces, sometimes too small seems too small and too precious to me, but I totally get smaller, especially when smaller means more saleable/affordable, so kudos to Roto's owners for keeping art accessible and affordable in that sense.", "rating": "5", "date": [2011, 7, 1]}, "9": {"description": "This is probably one of the best stops that we've made while we are visiting Chicago!!! There are so many cool & fun toys in the store, it made us so happy :D I like that you can purchase the toys on their website and the shipping is only $5 if you spend less than $100 (it's free if you spend $100). Highly recommend to check out this place if you're a toy nerd!", "rating": "5", "date": [2015, 5, 19]}, "26": {"description": "This place was made for my girlfriend and I. We both adore blind boxes and designer toys, and Rotofugi is the place to get them! Best place outside of Japan to find stuff like this.", "rating": "5", "date": [2013, 6, 20]}, "25": {"description": "Everyone that works at Rotofugi is extremely nice.  They have everything!!! If you are looking for Muni or Kidrobot toys they have them... the only problem with this store is you will want to buy everything there.", "rating": "5", "date": [2013, 7, 16]}, "12": {"description": "Whenever I'm in a bad mood, I head to Rotofugi.They have a million bazillion cute and fun things, as well as one of those plastic mold toy makers (the roto-matic). There's nothing quite like the smell of just-molded warm plastic.An excellent place for gifts as well! I hit them up pretty much every holiday.", "rating": "5", "date": [2014, 6, 4]}, "59": {"description": "A toy store for big kids? Sign me up. It might not be the place that you take your 5 year old to buy a Barbie/GI Joe/whatever kids play with these days, but its perfect for me. I always have a great experience shopping here and some days its fun even just to window shop because there is always something new. I love the huge new location and the staff is always cool. I wish the t-shirts didn't cost so much but hey, what are you going to do? I still love the place and I will be back again, and again, and again....", "rating": "5", "date": [2011, 4, 22]}, "21": {"description": "This place is heaven on earth. Remarkable selection of rare and unique toys, including my fave Frank Kozik. Picked up 2 pretty cool prints too, which I didn't know they carried. The managers (or owners, not sure) were very friendly and helpful and made me feel like less of a nyerd than I normally do. Even if you don't take yourself to be into these sorts of collectibles, stop in, and you might be surprised.", "rating": "5", "date": [2014, 1, 8]}, "17": {"description": "How lovely, great place to stop in and take a look. They have everything fun under the sun! Not an exaggeration. Reminds me of my childhood when I would look into the department stores with my Mom and just wish for all the Barbie's and the toys I could possibly handle.Don't go here with kids though, you won't come out with a penny to your name!", "rating": "5", "date": [2014, 1, 2]}, "10": {"description": "My son is really into some of the brands of toys sold here so we took a special trip. The layout is done so you can appreciate each of the items. It's very organized and artistically pleasing. The selection of Pop figures was a little lacking so if you are looking for a specific item, I would call first. But many cute things from Japanese erasers  and stickers to vinyl figures. The salesperson was very helpful and welcoming.", "rating": "4", "date": [2015, 4, 7]}, "5": {"description": "I used to go here all the time when it was in UV, and its my first time I have been since they moved.  The visit came as a request of my nephew, who I used to spoil with the Kid Robot Dunny toys, and he asked if we could go. I have totally forgotten about Rotofugi somehow, and I\"m so glad we went today.  What an amazing space!  Huge, open and what an amazing selection!  Wonderful art gallery too!  I loved it!  I'm actually going back tomorrow because I'm regretting a couple purchases I didn't make.Keep up the awesome work Rotofugi, you are one of a kind!", "rating": "5", "date": [2015, 1, 18]}, "3": {"description": "These aren't the toys we were looking for. Don't get me wrong, there's nothing wrong with the place..just not our cup of tea.  My 7yr old son spotted a couple interesting things but the majority of the stuff in here is more suited for teens to adults.  I added a star for their attached art gallery, which had some cool stuff. They had a pretty slick Star Wars AT-AT that we really liked.", "rating": "3", "date": [2015, 3, 29]}, "35": {"description": "Every time we go to Chicago, we HAVE to visit this vinyl toy store.  They have wonderful, eclectic, humorous and, sometimes, very hard to find goodies! The staff is always helpful, pleasant and NEVER pushy.  Their tee shirts are always new and different, and we can always find a few kid friendly toys to bring home to our son.The art gallery in the rear of the store is worth an extra 15 minutes of exploration as well.  One never knows who's art is going to be on display, maybe a local who has never shown, or maybe it's Mister Frank Kozik signing Labbits....yep....", "rating": "5", "date": [2012, 7, 25]}, "19": {"description": "A really fun toy store!  I have never seen many of the items that were available here.  The art and figurines are unique and there is so much to look at!", "rating": "5", "date": [2014, 7, 29]}, "28": {"description": "Since moving to the Lincoln Ave space, it's even easy to shop during gallery openings, as there's sooo much space.The Rotomatic is working!", "rating": "5", "date": [2013, 2, 20]}, "45": {"description": "I finally had the opportunity to stop in here.  This place is an adult toy store and I really liked it.  This place is perfect to find things to put on your desk at work.  Everyone has the mug...\"World's Greatest Boss\" but if you shop here you can get a Marsh mellow puking!!!  Now that is a perfect addition to any desk. (I know it sounds bad but it is done really tastefully...pun intended)It was a bunch of fun to walk around and check out the different toys.  I found a Hugh Heffner doll too.  I wonder if Hef knows...he would love it.  Attention marketing department...mail one to the Playboy Mansion.I also loved that one of the dolls had a brick mobile phone.  I had to try and explain to my little one that cell phones were that big.  Sad part is that the guy behind the counter also was learning from my story too.  Am I really that old?Great use of space...there is also an art gallery here too.  I love there new space...I remember when they were crammed in on Chicago Ave.So if your looking for some cool and unique toys for your desk, then this is the place!!!", "rating": "5", "date": [2011, 11, 14]}, "33": {"description": "This is the perfect store for a grown up art kid who can still tap his inner child.The new(er) digs are great and allow you to more room to browse and concentrate on the merchandise, which features a little bit of everything. I really liked the collector t shirts with the local flare. I will warn you, I don't think this is the best place for kids. Teens maybe, little kids no.If by chance the toys aren't enough, there is a gallery in the back of the store featuring a mix of local and national artwork that you can view and sometimes buy.The store offers easy access, just about seven blocks west of the brown line. If you get the chance, you should stop by and check it out.", "rating": "5", "date": [2012, 8, 6]}, "43": {"description": "This place makes me feel like I'm 10 years old again, seriously. It's only downfall for me is... I'm more likely to spend more money than I should on cute vinyl trinkets for my desk. Nerds/graphic designers, beware. This is a place that carries Kid Robot, Tokidoki, and all those other fun exclusive toy brands.I will say it's fun to go there to check out what they have and admire their displays. Plus they have a gallery in back which is cool for us artsy folk to check out. My interaction with the staff has been minimal, but they've always been super friendly and seem like people I'd hang out with.", "rating": "5", "date": [2011, 12, 29]}, "2": {"description": "I have never liked dolls, still don't. But I wouldn't say no to one of the pop culture figurines from Rotofugi.  I'm still waiting to hear if they will get more of the Mia Wallace figurines for my desk, but even if that doesn't come to fruition, I'm sure I'll be happy with some other pop culture doll. This store is full, FULL, of interesting designer toys, paper products, Chicago-themed home decor/gifts, pens/pencils, art projects and a small rack of funky t-shirts.  One section of the store is a small art gallery which is worth checking out too. I purchased a super cute pizza slice t-shirt for my son and a zip pouch made from recycled material for me. This is a store for someone who loves attention to detail and pop culture. Clean, sleek...you could probably find something new each time your walk around the store.", "rating": "4", "date": [2015, 8, 26]}, "18": {"description": "Full of win!!! Looking for something funky, imported Japanese toys, t shirts, artwork... the list goes on and on. This is my go-to shop for unique fun things for my husband or teenage son. We have bought several pieces of original artwork from them over the years as well as many blind-box keychains and toys. There is something here for every budget and all ages. The staff and extremely knowledgeable and passionate about their store and their products and honestly, it is just always super FUN to visit!", "rating": "5", "date": [2015, 4, 25]}, "41": {"description": "One of my favorite places to shop. They stay open for you, they are so nice, and the stuff they have is so awesome!", "rating": "5", "date": [2012, 1, 10]}, "52": {"description": "I wanted to buy some cool toys and the toys you can buy here are prohibitively expensive. This appears to be a store run by wealthy art-school kids.  I was so sad. If you are a wealthy art school kid you will LOVE it though, it does have a lot of arty toys and art on display.  Be sure to bring a full wallet, though.", "rating": "1", "date": [2011, 7, 26]}, "50": {"description": "A toy store for the big kids!It is definitely a \"designer\" toy store. Even though everything looks like it is geared towards young children, it is really more for the adult collector who likes to look and admire rather than play.Their store is very cool. It's located at the corner of two streets and is shaped like a triangle. You walk in and there are display cases everywhere. Stuff animals, blind boxes, and huge statues cover the room. I liked the layout, but at the same time, the place seemed pretty empty. They may need to add a little more inventory to so it looks more inviting, but if they are going for a gallery look, then they are right on the money.I did have a chance to talk to the owners (or a couple who worked there) and they seemed pretty stuck up when I asked about the difference between their store and the Kidrobot store in SF. Looks like they are very protective of their store. This store is way bigger than the Kidrobot store in SF and has the same items and more. I bought the Street Fighter and Futurama blind boxes. The prices were reasonable. Less than ten bucks for both. I can see the appeal of the blind box. You hate it, yet love it at the same time. The anticipation and excitement gets you. Once you open the box, you will either be extremely happy or disappointed. It's all in fun. They have an online store so if you don't want to make the trek out to the actual store (which is pretty far from downtown Chicago btw), you can easily access them from the convenience of your own computer.", "rating": "4", "date": [2011, 8, 6]}, "4": {"description": "If you love cute little things, you will love this place.  They have so many figurines that it will blow your mind.  You will want to buy everything there until you get the figurine of your liking.  They sell blind boxes.  They also have an art gallery section and feature different artist all the time.  Caution: this is not a place for small children who like to put things in their mouth, it may result in a choking hazard.", "rating": "4", "date": [2015, 10, 4]}, "6": {"description": "I'd been meaning to go to Rotofugi for a long time, even if just to see what they had to offer beyond rare toys that I'd never buy. I wasn't disappointed. The nicest thing about this place is that they have a huge amount of merchandise that's unique (at least in Chicago) and very affordable. I was looking for a few small gifts--the kind of thing one could send in the mail without much hassle. If anything, I had so many options that it was a bit overwhelming. That's not a bad thing.While I'm not necessarily the target audience, it's a great store for browsing through custom-made stuffed animals, weird toys, and a wide variety of other items, whether they be cute or a little warped. The store's in a beautiful space with tons of natural light, the staff is very friendly and helpful, and it's certainly a place that might easily contain the exact thing you never knew you wanted but now can't imagine exiting Rotofugi without adding it to your collection.", "rating": "5", "date": [2015, 3, 20]}, "22": {"description": "How lovely, great place to stop in and take a look. They have everything fun under the sun! Not an exaggeration. Reminds me of my childhood when I would look into the department stores with my Mom and just wish for all the Barbie's and the toys I could possibly handle.Don't go here with kids though, you won't come out with a penny to your name!", "rating": "5", "date": [2014, 1, 2]}, "15": {"description": "Vinyl collector or not you'll find something every time. I have been shopping here for years and their inventory is PHENOMENAL. Love this store, the owners and staff are the best and I will forever come again and again and again to shop!!!!!", "rating": "5", "date": [2014, 11, 12]}, "57": {"description": "Bottom line:  While most of the vinyl toys are meant for collectors, children with discerning tastes will be well served here in the gift department with reasonably priced blind boxes, unusual plushies (check out the Pecanpals) and tees. $5 to $40 range.Inspiring collection of the best designer toys with something in every price range ($5 to several hundred).  Mostly new vinyl, maybe a tiny selection of vintage Japanese.  Lots of one of kind pieces and big names here.  More Secret Base than I've ever seen in one place in person.  If you have understood this review so far...you are drooling perhaps.If you are into graphic design or toys at all, you really must go._________________________________________________________I want to give you six stars, Rotofugi.  The best big kid toy store I've been to in the US.  Designer vinyl toys to make you cry.  Bigger, badder and more dangerous now that they've consolidated all their holdings into one giant, light filled space.The gallery is beautiful, huge.  It's as big as La Luz de Jesus in LA!  I had the pleasure of attending the opening of Ralph Cosentino and Martin Tsu (Ruby Gloom fame) during this sojourn to Chi-Town.  My heart was happy, my wallet was lighter and my walls now have 3 Cosentino prints! (I'm braggggging!)Thank you to the owners and staff for being so kind, so approachable. No hipper than thou at Rotofugi, thanks!   Thank you for shipping my prints happily, explaining things to me and...even giving me great tips on where to eat in town!", "rating": "5", "date": [2011, 6, 15]}, "20": {"description": "Love coming here, faboulous designer toys and artwork! I can't leave without at least buying one dunny!", "rating": "5", "date": [2014, 3, 10]}, "36": {"description": "It's a motherload of randomness in here.  I've visited a few times now, and the art on display is always creative, often graphic-art-cartoonish, and occasionally disturbing.  The toys they have shelved run the gamut of cute to crazy: zombies, breakdancers, Simpsons figures, samurais. You'll easily spend at least 20 minutes checking everything out and it's tough avoiding an impulse buy.  It's a good spot to buy a gift for a tchotchke collector.", "rating": "4", "date": [2012, 7, 11]}, "14": {"description": "I finally had the opportunity to stop in here.  This place is an adult toy store and I really liked it.  This place is perfect to find things to put on your desk at work.  Everyone has the mug...\"World's Greatest Boss\" but if you shop here you can get a Marsh mellow puking!!!  Now that is a perfect addition to any desk. (I know it sounds bad but it is done really tastefully...pun intended)It was a bunch of fun to walk around and check out the different toys.  I found a Hugh Heffner doll too.  I wonder if Hef knows...he would love it.  Attention marketing department...mail one to the Playboy Mansion.I also loved that one of the dolls had a brick mobile phone.  I had to try and explain to my little one that cell phones were that big.  Sad part is that the guy behind the counter also was learning from my story too.  Am I really that old?Great use of space...there is also an art gallery here too.  I love there new space...I remember when they were crammed in on Chicago Ave.So if your looking for some cool and unique toys for your desk, then this is the place!!!", "rating": "5", "date": [2011, 11, 14]}}, "neighborhoods": ["Lincoln Park", "DePaul"], "latitude": 41.9321031962245, "longitude": -87.6580238342285, "rating": "5.0", "times": {"Mon": ["11:00 am", "7:00 pm"], "Thu": ["11:00 am", "7:00 pm"], "Sat": ["11:00 am", "7:00 pm"], "Wed": ["11:00 am", "7:00 pm"], "Tue": ["11:00 am", "7:00 pm"], "Sun": ["11:00 am", "7:00 pm"], "Fri": ["11:00 am", "7:00 pm"]}, "price": "$$", "categories": [["Toy Stores", "toys"], ["Art Galleries", "galleries"]], "address": ["2780 N Lincoln Ave"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "No", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "category": "Shopping", "number_of_reviews": "186"}, "commercial-fish-market-chicago": {"comments": {"0": {"description": "This place has the best shrimp cocktail ever!! Love this place. They have fried fish dinners as well. The prices are reasonable, the guys are really friendly as well. You can home here to pick out a fish from the tank 2 take home 2 cook as well. Everything you need is probably here. Definitely worth noting.", "rating": "5", "date": [2009, 3, 31]}}, "latitude": 41.7331731, "neighborhoods": ["South Chicago"], "categories": [["Seafood Markets", "seafoodmarkets"]], "address": ["8913 S Commercial Ave"], "attributes": {"Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.5511359, "rating": "5.0", "price": "$", "number_of_reviews": "1"}, "dedas-barber-shop-chicago": {"comments": {"0": {"description": "These guys should be TEACHING all the other shop how to give a Cut & Shave!!!! After getting a shave and go two days later without shaving, and you don't have any razor bumps shows they have the skills and training to teach others whom NEEDS to know this!!! CALL before you show to make sure you will get a cut or shave or both.", "rating": "5", "date": [2012, 11, 25]}}, "latitude": 41.7442055, "neighborhoods": ["South Chicago"], "categories": [["Barbers", "barbers"]], "address": ["2045 E 83rd St"], "attributes": {"By Appointment Only": "Yes", "Accepts Credit Cards": "No"}, "longitude": -87.5747986, "category": "Beauty", "rating": "5.0", "price": "$$", "number_of_reviews": "1"}, "kfc-chicago-11": {"comments": {"1": {"description": "This is hands down, THE WORSE fast food place I have ever been. I have been here hundreds of times throughout the years, every since its opening. The management is lazy and untrained. I frequently get passive service at best, and l I'm constantly told about a 15-20 minute wait on basic menu items. I'm ashsmed of myself everytime I go back!", "rating": "1", "date": [2014, 9, 12]}, "2": {"description": "Ok so the employees are nice. They ALWAYS forget or mess up at least one part of my order and the long lines are getting tiring. This location has been here for years so there's really no excuse at this point.", "rating": "1", "date": [2011, 12, 29]}, "0": {"description": "This by far is one of the friendliest fast food establishments that I've been to. Maybe it's because I go there so often for coworkers (and myself!), or just because they're so nice, but I've always loved how they treated their customers. Sometimes food takes longer than usual, but I don't mind, as everything seems to be made to order, and is FRESH! yay!!", "rating": "4", "date": [2009, 2, 10]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7443, "longitude": -87.5752, "rating": "2.0", "times": {"Mon": ["10:00 am", "10:00 pm"], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "11:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": ["10:00 am", "10:00 pm"], "Fri": ["10:00 am", "11:00 pm"]}, "price": "$$", "categories": [["Fast Food", "hotdogs"], ["Chicken Wings", "chicken_wings"]], "address": ["8307 South Chicago Avenue"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "3"}, "el-jacalito-chicago": {"comments": {"3": {"description": "The super taco is the best taco in the city. Hand made tortillas made as you order. Not a real big place but excellent.", "rating": "5", "date": [2014, 1, 2]}, "1": {"description": "This place should be on Chicago's Best it's a hidden gem I stumbled upon it while getting my car fixed across the street you could smell the amazing seasonings throughout the block trust me you will not be disappointed best spot for authentic mexican cuisine simply amazing.", "rating": "5", "date": [2015, 12, 1]}, "2": {"description": "I've gone here for many, many years. It's right down the block. Don't let the outside fool you. The food is always fresh, hot and delicious! Every now and then they will have tamales so ask. Super taco- the huge shell is made right in front of you, Their Steak Torta is divine!! Their soups are good too. They do Pasole one day of they wee to I believe. Good authentic eating!", "rating": "5", "date": [2014, 12, 4]}, "0": {"description": "Never imagined this small place would serve such great food.The tacos are literally Mexico Style, tortillas made by hand there on the spot. They taste just like the tacos I have tried in Mexico City.", "rating": "5", "date": [2016, 2, 27]}}, "latitude": 41.74182549119, "neighborhoods": ["South Chicago"], "categories": [["Mexican", "mexican"]], "address": ["8465 S Commercial"], "attributes": {"Take-out": "Yes", "Has TV": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "longitude": -87.551446929574, "category": "Restaurants", "rating": "5.0", "price": "$", "number_of_reviews": "4"}, "diamond-nails-chicago": {"comments": {"3": {"description": "When we walked in we were not greeted, there were also 3 people working with about 10 customers in there. We sat and waited and weren't told anything so we asked how long the wait would be. They said 10 minutes ( we had been there 10 min) after 10 (more) minutes went by we left and went to another salon.", "rating": "5", "date": [2015, 8, 5]}, "1": {"description": "Diamond nails do good job on every,  nails,  toe, eyelashes,  eyebrow,  In here you will be satisfied with the service", "rating": "5", "date": [2015, 7, 19]}, "2": {"description": "This place is amazing. They do wonderful work and treats you like family.They take the time to get to know you. I love this place I'll never go anywhere else!Thanks Helen!!!!", "rating": "5", "date": [2015, 6, 24]}, "5": {"description": "I was looking for a conveniently located, clean, and effective nail salon. I researched nail salons in my area and came across Diamond Nails. How could I pass with a name like that?!? Diamonds are a girl's best friend you know!!! I decided to go with a no chip manicure and spa pedicure. Tutu was my technician and I loved her! She will have a regular customer from now on! Thanks Tutu and Diamond Nails!", "rating": "5", "date": [2014, 12, 30]}, "6": {"description": "I saw this place had good reviews and I checked out their work on instagram.  I was impressed. I got there around 4:30 and didn't walk out until 7:30. After 45 minutes I felt that I might as well wait it out. But I definitely  didn't expect the wait to be that long.  There was only 3 technicians working. They definitely need more people to accommodate all the business they get. They weren't very welcoming at all. I walked in, no one greeted me and when I asked the woman how long the wait would be I had to ask 3 times because she acted like I wasn't even standing there. The woman who did my nails did a good job. I like the shape and color is applied well. But she left all this residue of the acrylic around my nails. Now I have to pick that all off. Needless to say I won't be coming back.", "rating": "2", "date": [2015, 7, 10]}, "0": {"description": "I love this place!  They do eyebrows amazingly.  I work in the Loop downtown and those places don't measure up to this place at ALL!  I highly recommend this place to anyone who wants their eyebrows to look perfect.I haven't had my nails done here in a long time since I do them myself but when I did come here I liked getting designs because they really out do themselves.  This place always has people getting mani's and pedi's so I'm guessing they still do a great job.", "rating": "5", "date": [2012, 2, 4]}, "4": {"description": "So I saw these reviews and decided to go for a visit since I couldn't go to my usual nail salon (Celine's Nail Salon is one of THE BEST) when I got here 20 minutes past opening there were only 7 people and 4 nail salon people, not enough. The wait was super long and my nails came out bubbly (WHICH I HATE) way different from the pictures on here. A lot of loud and rude people coming in and when I saw a fight right outside I just can't. Like I'm never coming back. I do not recommend this place AT ALL.", "rating": "2", "date": [2015, 5, 23]}}, "latitude": 41.7297568917274, "neighborhoods": ["South Chicago"], "categories": [["Nail Salons", "othersalons"]], "address": ["9111 S Commercial Ave"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.5511632859707, "category": "Beauty", "rating": "4.0", "price": "$$", "number_of_reviews": "7"}, "la-altena-chicago-2": {"comments": {"1": {"description": "Sunday morning breakfast.... Delish!!!! Tamales were really good and tasty! And the carnitas weren't bad.... When it comes to food I'm very very picky and not a fan of trying new things, but I can say I was very pleased that I was forced into having this yesterday. I def will be back!", "rating": "5", "date": [2014, 8, 11]}, "0": {"description": "This place has the best Carnitas its in a grocery store in middle of the block neighborhood. You pick your own meet I always go here on Sunday. They sell Menudo and Tamales as which are the best and usually sold out if you don't get there early.Also their pico De hallo and guacomale is to die for!", "rating": "5", "date": [2013, 10, 21]}}, "latitude": 41.73468, "neighborhoods": ["South Chicago"], "categories": [["Grocery", "grocery"]], "address": ["8827 S Escanaba Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.55372, "category": "Food", "rating": "5.0", "price": "$$", "number_of_reviews": "2"}, "c-and-g-restaurant-chicago": {"comments": {"3": {"description": "Seriously, this place is a shithole.The grease they fry their food in tastes like it hasn't been changed in seven years and is beyond bland. Their donuts are always stale and really sketchy people go and spend their day there. The only thing I love about this place is that they have this old school 1950's orange juice machine that churns out FRESH, SQUEEZED orange juice every morning. I love subsituting my coffee with a large cup of this juice! Other than that, if you're looking for decent diner food, head to ROMA'S down the street!", "rating": "2", "date": [2010, 7, 15]}, "1": {"description": "I was rather disappointed by my food experience here.I got the steak skillet and the meat was tough and had no flavor and the American cheese that oozed through the skillet seem to over power the dish.  You could choose between French toast, regular toast or Pancakes.  The pancakes were ok but I have tasted better. It also began to make my stomach feel queasy so I felt like $11.00 went down the drain. My daughter also got the steak skillet and she didn't like it either...:(It looked so good when the waitress sat the food in front of us but basically we had a skillet filled tough and uneatable food.My granddaughter got the 2+2+2 meal which she enjoyed.  She had pancakes(that she didn't finish) that's unusual for her, but she did like the sausage, eggs and potatoes.I think if you dine here you should keep it simple leave the skillets to another restaurant.  Our waitress was very nice and apologized for us not enjoying our food, but we didn't get a discount for our lackluster experience.  All in all I won't be running back here any time soon even if I am back in the area and starving.You only get one chance to make a first impression and for me that didn't happen!You know how I do!!!!Enjoy!", "rating": "2", "date": [2015, 9, 3]}, "2": {"description": "We went here for lunch today instead of waiting in Firestone for an oil change. But the food was not very tasty and the service was bad. There was something floating in my water and my pancakes had hair in them. Needless to say I will not be back.", "rating": "1", "date": [2015, 1, 31]}, "5": {"description": "My husband used them for catering of a large sports banquet.  The gentleman he dealt with was Tony and according to my husband he was amazing - very helpful and extremely generous.  The food was awesome - fried chicken, baked chicken, pasta, salads, breads...... ALL tasted incredible and there was nothing remaining.  There were about 200 happy guests.  Tony even threw in some dessert cakes and delivery was free.  Can't comment on the dine in experience but from a catering standpoint they were the best priced, food was hot and fresh, and the customer service was great.  For anyone looking for catering services on a budget I would highly recommend C & G catering", "rating": "5", "date": [2013, 7, 1]}, "0": {"description": "C&G is the intersection of Black & Latino Southeast Chicago.You're going to be eating next to abuelos y abuelitas y \"eses\" y homies from 93rd & Essex yelling in their cell phones talking about \"Yo, I want my money, son!\"And then you'll see folks like me and my dad, \"middle-class\" folk from the other side of Commercial Avenue, having breakfast after church. And in between all this neighborhood theater, there are pancakes and French Toast, and hot buttered rice and grits and fresh squeezed juice. There are big sandwiches, like you'd make at home, and spaghetti dinners. Is it outstanding food? No. Is it a \"shithole?\" No. I like C & G because it does pretend to be anything more than it is: a neighborhood diner. A place where all parts of the neighborhood can eat, together, safely, and be on their way. I can live with that.", "rating": "3", "date": [2011, 7, 5]}, "4": {"description": "I used C and G to Cater an event!! It was the best experience I've had. I will be using them for all of my future events. I recommend C and G for your catering events.", "rating": "5", "date": [2013, 7, 1]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7281058, "longitude": -87.5509279, "rating": "3.0", "times": {"Mon": ["7:00 am", "6:00 pm"], "Thu": ["7:00 am", "6:00 pm"], "Sat": ["7:00 am", "6:00 pm"], "Wed": ["7:00 am", "6:00 pm"], "Tue": ["7:00 am", "6:00 pm"], "Sun": ["7:00 am", "6:00 pm"], "Fri": ["7:00 am", "6:00 pm"]}, "price": "$", "categories": [["American (New)", "newamerican"]], "address": ["3003 E 92nd St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "6"}, "de-arcos-pizza-chicago-2": {"comments": {"3": {"description": "If this place is anything like the one on 63rd then u definitely give it 2 thumbs up. Delicious family owned restaurant with huge slices of pizza", "rating": "5", "date": [2015, 3, 3]}, "1": {"description": "I called for delivery, got a small pizza, fries&a pop. Place is literally about 8 mins from my house. I was told 40 mins which turned into 11/2 hrs. Pizza was cold, fries were cold, etc. Nothing like the one on 63rdst. Place sucks. Pizza was nasty, more cheese than ingredients, never again.  I would've gotten pizza Hut had i known this was gonna be crap.  Save your money & go elsewhere.", "rating": "1", "date": [2016, 1, 24]}, "2": {"description": "I love De Arcos' spinach pizza! For the past year,  I have been coming here to get my pizza fix. Just Yum!", "rating": "5", "date": [2015, 8, 14]}, "5": {"description": "Love their grilled chicken salad!! My husband always gets the Gyro pizza...good crust. FYI don't order rib tips", "rating": "4", "date": [2014, 1, 17]}, "6": {"description": "Hooolllyyyyy crap!!Am I really the FIRST to review this place??! Awh, come on! I know it's in the hood but De Arco's slices are EPIC.Biggest slices ANYWHERE, without a doubt. Bigger than Baci's! Cheaper too. And better tasting in my opinion. For five measly dollars you can get a slice of pizza that could feed an entire African village for a day or two, small fry, and a can of pop. They use quality, fresh ingredients and keep the pies toasting in the oven for overall freshness (a lot of times when you go to places where they sell pizza by the slice, if the pie sits for too long, it doesn't taste too good after all and loses its appeal) at ALL times. Sucks that this place is in such a dangerous neighborhood. Use your discretion when going! A lot of CPD frequent during weekday lunch hours, though! If that makes you feel any better!", "rating": "5", "date": [2010, 8, 5]}, "0": {"description": "De Arcos has the best pizza & pasta ever ! Friendly staff & Very Clean Facilities ! I would highly recommend you come here ! I promise you won't be disappointed !", "rating": "5", "date": [2016, 1, 24]}, "4": {"description": "I was not impressed with the delivery or the food.....I think they are overpriced and the food was horrible.....I had a gyro that contained more sauce than meat and the pita bread was very hard, I didnt get to taste the fries because they were frigid an hour and 20 minutes after they were cooked and delivered......im glad I was treated to this meal cuz I would have been livid if I fed this to someone....never again unless they reimburse me and give me credit and fire the cook and delivedy driver in that order....", "rating": "2", "date": [2013, 12, 18]}}, "neighborhoods": ["South Chicago"], "latitude": 41.737621, "longitude": -87.554893, "rating": "4.0", "times": {"Mon": ["11:00 am", "11:00 pm"], "Thu": ["11:00 am", "11:00 pm"], "Sat": ["11:00 am", "11:00 pm"], "Wed": ["11:00 am", "11:00 pm"], "Tue": ["11:00 am", "11:00 pm"], "Sun": ["11:00 am", "11:00 pm"], "Fri": ["11:00 am", "11:00 pm"]}, "price": "$", "categories": [["Pizza", "pizza"]], "address": ["2832 E 87th St"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Accepts Credit Cards": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Wheelchair Accessible": "No", "Good for Groups": "No", "Good for Kids": "No"}, "category": "Restaurants", "number_of_reviews": "7"}, "beautiful-sisters-nail-spa-chicago": {"comments": {"3": {"description": "I have been to Beautiful Sisters in the past and wanted them to be my go to place. I have lots of wonderful friends and we love doing things together. Needless to say all 15 of us will never see this place. This was my third appointment with them. The first time they were nice but late. We over looked that and even added on another service. The second time she was more than an hour late. My friends were there to keep me company so it wasn't so bad. However I guess that left the gates open to be a running thing. I was looking forward to this appointment as I was celebrating my favorite cousins birthday. I bought a living social for a no chip. My appointment was for 2:30. I called 3 times and text twice I want to see if I could add a fill in to my appointment. No one ever called back. Assuming I was not going to get the added service I went somewhere else for the fill in. My cousin had appointment 30 minutes before me and she tells me she is running late and do we switched. PERFECT. I called again left a message and my cousin called no answer. I arrive at 2:00 ready to get a perfect polish and I see closed sign with a clock pointing to a little before 2:15. I stayed till 2:27 no call or answer. I got my Living Social voucher refunded. I still have not gotten a return phone call from anyone. I do understand emergencies. You still were not back when you said you were and I took a cab there. By the way I'm always on time for my appointments with them. The search continues. I would rather have a mediocre nail tech that is on time with good customer service. This is no way personal I think Bianca's personality is personable and sweet. I just can't do 2 lates and a no show and still no word or apologies.", "rating": "1", "date": [2015, 4, 29]}, "1": {"description": "I have been going to Beautiful Sisters Nail Spa for almost two months now to get No Chip Manicures and Pedicures.  My experience each time has always been great and I've never had major issues.  I have referred many friends to this salon, as I feel their prices are unbeatable, they take their time, and does good work. My last recent visit I got a No Chip Manicure and a Pedicure.  I noticed in less than 48hrs 2 of my nails started chipping.  I was very shock to experience this so I decided to send the salon a message, along with a picture of my nails.  Less than 2hrs later, a few more nails started to lift up and I was able to literally pull all of the No Chip off my hands without soaking them.  I also messaged the salon about this as well, in hopes they would reach out to me. It has been 2days so far and I have not recieved a response regarding my issue.  I read a review here on yelp from a recent customer who seemed to have had the same issue.  I'm not sure if something was done different than in the past, but my nails have never came off unless I soaked them in acetone. I was told that I probaly won't get a response back or get my nails fixed by previous customers (one being a friend I referred), because they have had the same problems. At this moment I'm more so hurt than upset that no one has reached out to me, seeing that I was becoming a loyal customer (so I thought). Before I decided to visit this salon, I read all the not so satisfying reviews here on yelp, but it didnt deter me from trying out the salon.  I figured everyone experience is different and I needed to see for myself.  I was very pleased with their services, but not so much with their customer service skills now.  Acknowledging the problem and being willing to resolve it, is what I would have appreciated. Despite my current feelings, I still think that the ladies at this salon are talented. The biggest issue I have is them STANDING BEHIND THEIR WORK.  Anything that you specialize in and are confident about you should be able to guarantee. Needless to say, I have decided to go back to my orignal Nail Technican, whom I stopped going to due to distance. However, at this point I will make the travel sacrifice and pay the higher cost.", "rating": "2", "date": [2015, 3, 25]}, "2": {"description": "I was so excited to go to this salon, because of reading the reviews of it being such a great business in one of our neighborhoods. They had a livingsocial deal and I purchased it for an express no chip. I wanted to test out the place before I decided to become a regular, which would've been great since its a 10min drive from my home. I arrived and was greeted by the nail tech and her daughter. We had a great conversation and she talked about how much she and her sisters really caterers to their customers and pride themselves on customer service. I was excited because you rarely find this when visiting reasonably price nail salons. My nails looked great, I tipped and left the salon. Woke up the next day (not even 10 hours later) and 3 nails were chipped. It was a Sunday morning, so I knew they weren't open. I left a message to let them know. I figured they might not be open on Monday, so was expecting a call back by Tuesday. By that time, half of my nails had chipped. It's been over three weeks, and no one has returned my call. This isn't an example of great customer service, so I definitely will not be returning. I'll continue to travel to the north side.", "rating": "1", "date": [2015, 4, 24]}, "9": {"description": "Good morning ladies. I live close by & was excited 2 see a Black (sister) owned Nail Spa, around the corner. Well that excitement was short lived when I attempted 2 enjoy a mani/pedi this morning at ur spa. I called yesterday to inquire about ur business hours  & was told u open at 10:00 a.m. I drove past @ 10:00 & u were closed. I went home for a few minutes, came back, & u still were not open. I waited on the front, bcz I parked I  the side street, for about 15 min, & still no one showed up. I went to my at & sat until about 10:45. Came back 2 the shop & a lady opened the door. She asked what services I wanted & I told her a pedi. She stated there was a wait bcz of 1 person in front of me. I told her I had been waiting for since 10 & she told me, she knows, she saw me outside! I asked how long is the wait & she said an hour. I told her I couldn't wait ANOTHER hour & I left. With that being said, I received no apology or anything & felt as if if u didn't get my business, there would be others. And that is not how u want ur customers to feel. To the owners, ur already faced with the stereotypes of Black people are always late, unprofessional, etc... To me, u seem to have played right into it. I hope u take this as constructive criticism from the customer, & not as bashing. I would really like to revisit ur establishment, but I probably won't! I do wish u the best.", "rating": "1", "date": [2014, 4, 11]}, "10": {"description": "I just hung up from a HORRIBLE experience with this \"spa\".  On the phone or on hold for almost 15 minutes, called today at 5:30 pm.  Here is what happened:  I purchased a Groupon for this nail spa and scheduled an appointment.  Upon arrival the spa was closed with a sign in the window saying it was closed due to an emergency.  Not great but life happens, right?  I called the next day (Thu) left a voice mail. No response. Called again Sat, explained what happened and that I wanted to reschedule, did not give my name yet. The woman who answered went at me said that I gave them the wrong telephone number. Went on & on about the number so I asked what number she had for me. I interrupted to say that I was feeling a bit attacked.  This must have been the wrong question because I got to hear another 4-5 minutes on the phone number. I had to interrupt to say that i was really trying to find out if I could reschedule. She literally did not stop talking for another few minutes for me to give her my number or explain why this was so important that she could not schedule me without the phone number first.  My guy overheard the conversation and told me to hang up[ and get a refund, that this was unprofessional.  She then proceeded to tell me that I had a bad attitude.  WHAT THE F???  I said, I am trying to support a business of people that look like me and let's start over and reschedule.  I gave her my phone numbers and she put me on hold, only to come back after 3 minutes. Now she told me she could not continue to ARGUE with me, she has a customer in front of her and perhaps I should NOT reschedule and get a refund.  I offered again to move forward and asked if she was refusing me service.  The answer was yes.  Now she has my name so I asked her name, she refused to give me her name. WOW!!!  This was the worst phone experience I have EVER had with any business.  Especially when I was only reacting to her overly aggressive response to a customer calling to reschedule!  If she is the owner, this business will fail soon.  If she is not the owner, I hope the owner takes appropriate action.  This salon is near my mom's home and I  am a professional woman that has money to spend.  I guess I will continue to spend it elsewhere!    I cannot comment on the service, but for customer service I would give it a ZERO", "rating": "1", "date": [2014, 5, 24]}, "4": {"description": "So it pains me to write this review because my first experience  here was great and I hate being negative to small businesses  BUT I do feel this feedback is needed as a professional buisness  owner. I wanted to come here for months but due to time I hadn't. Finally went about a month ago. Made appt on styleseat and everything  was cool. Get to my appt and I was told it would be a wait. Cool. I waited. April did my nails and she did amazing. I also got a pedi. All no chip. Loved her and her service. No complaints about that first experience. Fast forward to 3 weeks from then,I made an appt on styleseat for a Monday and Bianca was my nail tech.  I get there and I was told I had to wait an hour. Even though  I had a appt.  Fine. So I waited for an hour and a half. I did however enjoy Bianca and her convo and passion for her craft. I got a no chip mani. MIND you my no chip pedi from April was still in tact and flawless weeks later from the first time I was there. So I got my nails the same color I had before. So that was a monday. Tuesday I noticed some lifting but it wasn't a big deal but by wed two whole nails came completely  off. So me being the nice  customer I am called the shop. Bianca answered and I politely  told her that I got my nails done on Monday and it's wed. And they are coming off and wanted to know if I could come in a get them  fixed. I was told that there was nothing that could be done about it because they don't guarantee  that no chip last. (I've had no chip before and I have never had this issue EVEr)  Then she goes on to say that I am more then welcome  to rebook for a soak off and a manicure again.and that they do this everyday all day and that it was probably  my lifestyle. (I don't do heavy labor or swim around in oils so I'm not sure why that was said to me).  I just disliked the tone and how she turned it around on me. Me being the respectful person I am I just said okay and hung up. After that phone call about 1 hour later all of my nails came off.  Safe to say 30 dollars was lost and so was a customer. I'm not saying  that I needed something for free but a apology and a we will try and fix on your next service for a discounted fee or something. As a customer you want some sort of solution to be offered not a dismissal.  The quest for a nail tech is still on. Sigh.", "rating": "1", "date": [2015, 3, 10]}, "6": {"description": "I loved everything about my experience here! I took my grandmother here in hopes to find a black owned and operated nail salon with great service and that's exactly what I found. Bianca did my pedicure and no chip and I am in love with the results along with the price. It was so refreshing to finally be able to feel comfortable in a salon while getting my treatment. Those other salons just wasn't doing it right. This was by far the best pedicure I have ever received! Keep in mind it took an hour but it was definitely worth it. I would recommend this place to anyone who wants their service done correctly, safely, and respectfully. I will be sure to make this place our go-to spot for our spa days.", "rating": "5", "date": [2014, 4, 22]}, "11": {"description": "I absolutely love this place!!! The costumer service is great. The work they do is great. The work they do is great. And you can't beat these prices.  I found my permanent nail salon. Please come check them out they are great.", "rating": "5", "date": [2013, 11, 22]}, "5": {"description": "In response,  I am very computer savvy and I know how to follow directions. On styleseat, it does say if an appt time is not available that you need, then to call the salon. I had done just that, which made the entire situation frustrating.   I am all for supporting black business.  This has nothing to do with racism,  its customer service.  I use yelp and styleseat often before booking anything. It made me want to come to your salon because of pictures and reviews. I understand staff may be limited and its appointment only; but maybe that note should be changed on styleseat if no one is available to answer the phone.  In the future I still hope to try your salon.", "rating": "2", "date": [2014, 9, 5]}, "7": {"description": "April and Bianca are sisters who own and operate a nail salon here in South Shore. It is important to them to be able to provide a spa-like experience to people in the community they live in. To this, they have a created a little oasis in this concrete jungle. The work is stellar. April's pedicures leave your feet clean and smooth and she'll let you know the health benefits of every move she makes. Bianca is an artist! Her designs are flawless and she can adapt to your personal aesthetic. Be sure to make an appointment online and to allow a few hours as they take their time and do not rush you out the door. Beautiful Sisters is a gem on East 79th Street.", "rating": "5", "date": [2014, 6, 7]}, "8": {"description": "The absolute best pedicure I have gotten in my 25 years of life! The salon is owned and operated by 2 (no pun intended) beautiful sisters. The salon space is set up GORGEOUSLY- its clean and professional looking. The nail tech was better than anyone I've ever encountered- she asked questions about my comfortability, any health problems & various things that I have never encountered in Asian nail salons. I had lost faith in black owned businesses but coming here my faith has been completely restored. She was patient & meticulous in doing my pedicure- and all the tools used came out of a sealed (what appeared to be sterile) pouch.  I'm recommending Beautiful Sisters to all my family & friends, & anyone looking for amazing services at extremely inexpensive prices. I'm completely blown away.", "rating": "5", "date": [2013, 11, 9]}, "0": {"description": "I enjoyed my services received from Beautiful Sisters. I had a pedicure done two weeks ago and the nail technician (April) did an outstanding job.  I went back two weeks later to have my nails done by other nail technician and she performed an awesome job.  I can't stop looking at my nails.   The customer service is great!!!!  I will continue to support this local business....", "rating": "5", "date": [2014, 5, 18]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7515667, "longitude": -87.5793628, "rating": "3.0", "times": {"Mon": [], "Thu": ["10:00 am", "5:00 pm"], "Sat": ["10:00 am", "8:00 pm"], "Wed": ["10:00 am", "7:00 pm"], "Tue": ["10:00 am", "7:00 pm"], "Sun": [], "Fri": ["10:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Nail Salons", "othersalons"]], "address": ["1836 E 79th St"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "By Appointment Only": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "12"}, "marseillais-african-hair-braiding-chicago-4": {"comments": {"3": {"description": "Awesome shop... They did a fantastic job on my braids. Very neat, friendly, affordable  & professional. I will differently be returning back here.", "rating": "5", "date": [2015, 3, 22]}, "1": {"description": "I went there yesterday to get senegalese twist she told me $160 over the phone. When I get there the lady ask me how much she told me. I states $160 she was like no we charge $200 so she call the lady on the phone so they arguing back & forth on the phone about price in front of the customers which is so unprofessional. So I get up about to leave another lady was there she was like please don't leave. I was like well it seems like it's problem. She was states don't worried about us we talking in our language.  She ask me how much money I had on me I told he $180. She was like we take that. I said okay so in the middle of her doing my hair she ask for  me pay her. So I did then so when lady was almost done with my hair I guess she's the owner ask to speak with me in a junky dirty closet. Telling me she didn't tell me $160 so I stated why would I drive all the way from Indiana with $180 & she wanted me to go get the rest of the money I thought that was so unprofessional. I always tip the person whoever do my hair or nails so that's why I bring $180. So the lady that was doing my hair ask me where I was going I told. I told her I was leaving she ask why so I told her. I ask for half my money back or quarter of money back  of course they wasn't going back.So I told them  they can keep my money! Just let me go! So they beg for me stay talking about you one of us & she wanted to finish my hair. Smh. The shop is dirty, messy,and junky! The tv keep going in & out. So another client & I was tring watch TV when it comes in I guess she's  owner started playing music on her phone turned it loud so we couldn't hear the tv. Smh. The lady that did my hair she was nice & did good job & I did go back & paid her the $20 but I didn't give her no tip. The owner is rude lil b$tch! The moral of story stay away from this dump it's dirty & messy. They tell you one price on the phone but it's whole another price when you get there.  The only reason I gave one star cause I had to.", "rating": "1", "date": [2016, 2, 27]}, "2": {"description": "This was my first time coming to this shop and I think they did a wonderful job on my twist. I would definitely be going back again!", "rating": "4", "date": [2015, 3, 22]}, "9": {"description": "They did a very great job, very neat and nice and very fast and they are nice and the prices are cheap", "rating": "5", "date": [2015, 1, 28]}, "10": {"description": "I made an appointment on Saturday for a next day appointment (Sunday morning) for Senegalese twist. The staff was very  accommodating. My twist were very neat and the service was excellent! will be returning for my touch up!", "rating": "5", "date": [2015, 3, 29]}, "4": {"description": "Had my hair done in this place and it's old and nasty.... The lady did a horrible job on my Mohawk.... My braids look matted when she did them and look old after only two days... Beware!!! She lie about the prices when u call and when u get there she go up.. A lady came in screaming about her sons hair I should have left then!!! She talks on several phones while servicing you... She is just flat out NASTY!!", "rating": "1", "date": [2015, 6, 11]}, "6": {"description": "Horrible experience! Added 2 hours to my appointment by picking up/ talking to walk-ins, box braids were neat, but extremely thin with choppy ends and CHEAP hair!", "rating": "1", "date": [2015, 10, 9]}, "11": {"description": "I Went here today to get my Senegal twist they did an awesome job! I recommend this place it was fast && neat && so worth it. I will be coming back to get more braids done", "rating": "5", "date": [2014, 11, 8]}, "5": {"description": "I get nothing but compliments for my braids. They are fast and do a great job. Josephine asked questions to ascertain exactly what I wanted. I am so glad she did because we were not thinking the same. I got box braids but I didn't want straggly tails at the end so she curled them instead. Also I misunderstood her price and gave her too much money. Lo and behold she returned the amount I overpaid. To be honest I still don't understand the price structure. Even so, I will definitely return. I forgot to mention they also took down my old braids faster than lightening. 2 people working on my head. I feel it is worth the extra money. The 4 stars rather than 5 is because of the confusing price.", "rating": "4", "date": [2015, 6, 3]}, "7": {"description": "This was my first time getting my hair braided in a long while so I went to this shop, when I called for pricing for senegalese twist she told me from 180-220 ok I went she settled on 200, a week later I sent my niece 4 jumbo twist she stated on the phone 150 point blank but when my niece got there she again tried to up the price to 200, my question is how in the hell is both hair styles 200 dollars? And she was suppose 2 get 30 dollars off and the braider would not honor it, no doubt in my mind poor business practices and I will not be going back...KIMBERLY", "rating": "1", "date": [2015, 4, 16]}, "8": {"description": "Marseillais did a Awesome job with my box braids. She didn't kill me braiding too tight! They are so pretty. Thanks!!!", "rating": "4", "date": [2014, 11, 26]}, "0": {"description": "Iv only been to this shop one time but I can tell you guys I will be back they are quick and neat Love my braids", "rating": "5", "date": [2016, 3, 3]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7518901893322, "longitude": -87.5611370801926, "rating": "3.5", "times": {"Mon": ["8:00 am", "9:00 pm"], "Thu": ["8:00 am", "9:00 pm"], "Sat": ["8:00 am", "9:00 pm"], "Wed": ["8:00 am", "9:00 pm"], "Tue": ["8:00 am", "9:00 pm"], "Sun": ["8:00 am", "9:00 pm"], "Fri": ["8:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Hair Extensions", "hair_extensions"]], "address": ["2602 E 79th St"], "attributes": {"By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "category": "Beauty", "number_of_reviews": "12"}, "tropic-island-jerk-chicken-chicago": {"comments": {"3": {"description": "Great break from the fast food joints along 79th st.  Great Oxtails and great jerk chicken.  I", "rating": "4", "date": [2011, 1, 6]}, "1": {"description": "As far as quantity for the price they are awesome but as for quality it seems they have good days and not so good days as far as flavor.... So I'll give a star..", "rating": "1", "date": [2014, 1, 31]}, "2": {"description": "Quality authentic Jamaican food on the south side.   Spicy, fresh cooked chicken made to order and well made sides.   Worth a visi!", "rating": "4", "date": [2012, 1, 21]}, "0": {"description": "Great jerk and couldn't be better located. The only other food around is shitty fast food and this place does a great job of offering quality food, somewhat fast. It's located east of the 79th red line, just a few stops on the 79 bus.The chicken is made to order and the rub has a great flavor, a mild-medium spice. All the sides are prepared throughout the day in place in front of you. The greens are so tasty with a nice combination of savory, salty, and just a little bitter left in them. Can't go wrong with the sweet potatoes either (they call them yams), which were loaded with cinnamon and a great almost dessert. The lunch plates come with an entree, rice & beans, two sides, a piece of white bread, and (hot) sauce. I thought it was a great deal under $10 with how much even fast food charges for junk.Best things about this spot: you can support a local business, get some deliciously marinated meat, and some quality sides that remind you of mom. I wouldn't call the food healthy in any respect but I would definitely call it good!", "rating": "4", "date": [2016, 1, 11]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7516423761845, "longitude": -87.5775548815727, "rating": "3.5", "times": {"Mon": ["11:00 am", "8:00 pm"], "Thu": ["11:00 am", "8:00 pm"], "Sat": [], "Wed": ["11:00 am", "8:00 pm"], "Tue": ["11:00 am", "8:00 pm"], "Sun": [], "Fri": []}, "price": "$", "categories": [["Caribbean", "caribbean"], ["Seafood", "seafood"]], "address": ["1922 E 79th St"], "attributes": {"Take-out": "Yes", "Has TV": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Delivery": "Yes", "Alcohol": "No", "Caters": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "4"}, "hymans-ace-hardware-chicago": {"comments": {"3": {"description": "I am a big proponent of good customer service. Family owned businesses typically provide the best customer service.   I was drawn here by a 50% off coupon but I know I will return.  It might not be a great neighborhood but you can generally get a free parking space on the street out front.   I'll spend my $ here from now on.", "rating": "5", "date": [2013, 11, 30]}, "1": {"description": "I just left this hardware store, and I must say I am impressed...which does not happen often. This hardware store has that small town family feel, without having exorbitant prices, which I highly appreciate. I was assisted throughout the process by young lady named Felice, who was professional yet very friendly. I was also assisted by a gentleman in the back with whatever I needed and asked if I had questions and promptly answered them and showed me exactly where I needed to go to get the items I needed.Another gentleman went above and beyond in looking online for other types of organizational bins and drawers for me that they may carry. I actually bought more than I ever intended when I walked in! I came there for a box cutter, and left with almost $400 worth of organizational supplies, cleaning products, and items to stock our warehouse.Jerome also very kindly and efficiently took all of my many boxes, bags, bins, etc. to my car and loaded them in there for me. The only reason I took away one star is because the store is slightly tight and a bit cluttered, but not dirty. Mostly because the young lady that rang me up seemed to be a bit off-kilter. She treated another gentleman and lady (prior to my check out) with a bit of condescension and seemed a bit abrupt with them. Although she did not treat me that way, I feel customer service and respect is of the utmost importance in any establishment. Overall, I rate this business highly and will definitely be going back (regularly) for supplies as needed.", "rating": "4", "date": [2015, 3, 6]}, "2": {"description": "Really the only hardware store in the neighborhood. What I like,  unlike home depot is the employee's ask \"Can I help you find what your looking for\"  I do a lot of rehab in this area and they seem to have a lot of the small items I'm looking for.", "rating": "5", "date": [2015, 6, 6]}, "5": {"description": "This is a pretty decent sized hardware store and not too ghetto considering the neighborhood it's in. I come here to buy nails, masking tape, wire.....you know, the basics for making art projects.My favorite thing about this store? There are usually two employees standing inside the entrance waiting to ask you what you're looking for! Why can't more stores be like this?", "rating": "4", "date": [2008, 6, 5]}, "0": {"description": "Good location, Friendly Employees, Neiborhood friendly ! Good people to do business with !", "rating": "5", "date": [2015, 10, 14]}, "4": {"description": "Good store, very nice and friendly owner. I can always find what I need from here.", "rating": "4", "date": [2012, 1, 23]}}, "latitude": 41.73867, "neighborhoods": ["South Chicago"], "categories": [["Hardware Stores", "hardware"]], "address": ["8614 S Commercial Ave"], "attributes": {"Parking": "Street", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.55181, "rating": "4.5", "price": "$$", "number_of_reviews": "6"}, "mcdonalds-chicago-109": {"comments": {"3": {"description": "this McDonald's service is horrible. Last time i was in here i waited 20 minutes for cold greasy food. How do you wait that long for cold food? Due to shitty service here i Will never eat here or McDonald's period.", "rating": "4", "date": [2014, 12, 24]}, "1": {"description": "I've stopped here probably 20 times on my way to work.  The food is fine, and I've never actually been inside, but the drive-thru is hit-or-miss.  Sometimes, you get through quickly, but others, it takes over ten minutes to get through and get a coffee!  When I have time, I prefer to drive over to the Starbucks at 71st and Stony Island, but McDonald's works for a quick stop.", "rating": "2", "date": [2015, 12, 9]}, "2": {"description": "Where do I begin. Ok let's see from the moment you pull up it starts. The young lady ask what my order is I give it to her twice and she still can't comprehend what I said, then I get to the pay window which is disgusting have never been cleaned since forever another nasty stink attitude these people are just plain rude. The service here is horrible not only do they serve your food out of a nasty drive thru which glass looks like a million hands has been on it but they're just plain mean. I guess the only reason they're here is because of the location and the money that they're making off the black people in that area!!! Don't waste your time here. I rather drive to a different location than go to this one and this one is closer to my house :(", "rating": "1", "date": [2014, 4, 7]}, "0": {"description": "This McDonald's has multiple personalities. At times, they're super fast and helpful; at other times you might be in the drive-thru all day while you watch them help all the customer who are in line inside. Generally everything is a-ok, though.", "rating": "3", "date": [2012, 11, 23]}}, "latitude": 41.7516051, "neighborhoods": ["South Chicago"], "categories": [["Burgers", "burgers"], ["Fast Food", "hotdogs"]], "address": ["2425 E 79th St"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Loud", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "No", "Good For": "Breakfast", "Attire": "Casual", "Waiter Service": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.565265, "category": "Restaurants", "rating": "2.5", "price": "$", "number_of_reviews": "4"}, "walgreens-chicago-193": {"comments": {"0": {"description": "Not the best but its not the worst..just another walgreen", "rating": "2", "date": [2012, 1, 23]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7283549, "longitude": -87.5529199, "rating": "2.0", "times": {"Mon": [], "Thu": [], "Sat": [], "Wed": [], "Tue": [], "Sun": [], "Fri": []}, "price": "$$", "categories": [["Drugstores", "drugstores"], ["Cosmetics & Beauty Supply", "cosmetics"], ["Convenience Stores", "convenience"]], "address": ["2924 E 92Nd St"], "attributes": {"By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "1"}, "jordans-beauty-supply-chicago": {"comments": {"3": {"description": "Great customer service from knowledgeable practioners. I've found a new place to shop.", "rating": "5", "date": [2013, 1, 4]}, "1": {"description": "I've been going to this place for years and I have yet to have a bad experience. They are very helpful and extremely knowledgeable about their products and about improving your hair. So they have given the best product selections. Everything I have bought from them actually worked like they told me it would. Great place to go!!", "rating": "5", "date": [2014, 6, 1]}, "2": {"description": "I agree with all.  I went in once last summer to do a haul of hair products before moving to Portland and I experienced the best customer service I have experienced on Chicago's South side than I can ever remember in all my life.  Instead, of re-stocking my products on the internet, I will be making a stop to Jordan's on my next trip! Great staff, please keep up the excellent work!", "rating": "5", "date": [2011, 2, 6]}, "5": {"description": "Their service is great and their choice of quality products are unbeatable. Whenever I need professional hair products Jordan's Beauty Supply is the place for me. You can't go wrong here they have everything you need from products to ceu classes.", "rating": "5", "date": [2008, 6, 28]}, "6": {"description": "Jordan's is hands down the best beauty supply in Chicago.  The staff is friendly and extremely knowledgable about all of their products.", "rating": "5", "date": [2008, 8, 18]}, "0": {"description": "Hello!  BLACK OWNED  BEAUTY SUPPLY!  And staff actually trained in the products?  And an incredible range of products, including many that are usually only available at salons?Paydirt, people!  There's a new location west, as well, but this is worth the trip.", "rating": "5", "date": [2008, 8, 30]}, "4": {"description": "I often get overwhelmed when I walk into this beauty supply because there are such a wide variety of products. As a cosmetology student or professional, you get a huge discount and you save so much money rather than going to your neighborhood beauty supply. They sell dozens of professional brands and their customer service is great as well. Oh yea, they offer classes to students and professionals. I effin' LOVE this place!  :)", "rating": "5", "date": [2010, 6, 18]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7514551, "longitude": -87.5778868, "rating": "5.0", "times": {"Mon": [], "Thu": ["9:00 am", "6:00 pm"], "Sat": ["8:00 am", "3:00 pm"], "Wed": ["9:00 am", "6:00 pm"], "Tue": ["9:00 am", "6:00 pm"], "Sun": [], "Fri": ["9:00 am", "6:00 pm"]}, "price": "$", "categories": [["Cosmetics & Beauty Supply", "cosmetics"]], "address": ["1911 E 79th St"], "attributes": {"By Appointment Only": "No", "Wheelchair Accessible": "No", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "7"}, "new-chop-suey-chicago": {"comments": {"0": {"description": "omg. How come no one has reviewed this place?? I love, love, love their chinese food. It's my staple in chinese food restaurants. I mean, aside from all the dishes being textbook 101 chinese fast food. Their portions are HUGE and their prices are awesome. I've moved from the neighborhood before, and can never find a chinese food place that holds a candle to this one. Everywhere else is either always so expensive or their portions are off, or the food just doesn't taste as well. I love their combo platters, 1 combo meal could feed 2 people easy. Or if you're adventurous and all, eat it all yourself. The crab rangoons are great. And they don't put peas in their fried rices! Sorry. That just really irks me when places do.", "rating": "4", "date": [2014, 1, 5]}}, "latitude": 41.7294399, "neighborhoods": ["South Chicago"], "categories": [["Restaurants", "restaurants"]], "address": ["9119 S Commercial Avenue"], "attributes": {"Good for Groups": "Yes", "Take-out": "Yes", "Delivery": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "longitude": -87.5508399, "rating": "4.0", "price": "$", "number_of_reviews": "1"}, "hyde-park-produce-chicago": {"comments": {"58": {"description": "There should be 3.5 stars because that is exactly what I would give here. There are two good places to get your produce in this side of Hyde Park: HPP or Treasure Island. I like HPP better than TI because it is relatively inexpensive and quality of food is pretty good.Thumbs up:1. Fruits and Produce: who can resist fresh and bright veggies? They even have karela (Indian bitter gourd).2. Quality and selection: as opposed to other grocery stores they have tremendous varieties of produce and they all are of good quality. Nothing goes bad for weeks.3. inexpen$ive: although things are of good quality, they are not as expensive as in TI.4. Staff are friendly also.Thumbs down: 1. Selection of meat: whats up with that? I almost always have to go to TI to get meat because any kind of meat is super expensive here.2. Selection of pasta: limited packets of pasta available.But for produce  it is numero uno!!! Go HPP!!!", "rating": "3", "date": [2011, 12, 4]}, "56": {"description": "Very good produce, dairy products, baked goods, and a good delicatessen section too. I'm hooked. The prices are more than reasonable.  The staff know what they are doing and are committed to their work. Yes, there is life in Hyde Park!", "rating": "5", "date": [2012, 2, 29]}, "29": {"description": "This is one of the best markets I've ever patronized. I used to shop in the old location when they were in a tiny store front. Now that they have expanded, it is even better. It has a wonderful mix of nice imported, prepared foods as well as extremely good and inexpensive produce. This is a great one stop shop for most of your grocery needs, and is definitely preferable to alternatives in the neighborhood. The staff is pretty friendly.", "rating": "5", "date": [2013, 12, 21]}, "42": {"description": "Great little grocery in Hyde Park. We shopped there for some basics (fresh veggies, butter, eggs, half & half). I found the prices to be okay and the veggie selection to be fresh. No complaints!", "rating": "4", "date": [2013, 2, 15]}, "23": {"description": "This is a really nice store and I enjoy the variety that is there however, the produce is not too consistent sometimes good and sometimes it's bad. When it comes to the other items in the grocery store they are kind of pricey...but I understand it's a small neighborhood store and I want to give back to small businesses. Customer service is nice. Overall they try to keep the store clean.", "rating": "3", "date": [2014, 4, 2]}, "47": {"description": "This place has great selection and really competitive prices. Non-produce selection is limited though, for example... no angel food cake mix", "rating": "4", "date": [2012, 10, 18]}, "8": {"description": "This place made my weekend! Having only been shopping on 55th's Treasure Island  and Open Produce, I really wanted to check out what Hyde Park Produce offers. Initially, I didn't even go in with a basket. I thought to myself I am just going to browse. However, as soon as I got in, I saw the $2.99/ lb Rainier cherries and the $1.49 for a 16oz. fresh organic strawberries. I had to read and re-read the signs to make sure I was reading correctly. I even waived down a customer service person to help me read the signs. So yes, things are cheap here. I quickly grabbed a basket thinking that I may only walk away with a few things.As I continued down the aisles, I found that the one drink that I have been looking for all summer last year in Maryland. The blueberry soda. OMG! This place carries it. I grabbed the last bottle and heard that they will stock it up again soon. So excited! So, yes this place offers really unique things. Another product that I got was the pink lady apple juice. I love pink lady apples, so we'll see how I like this drink.The deli/ cheese section is also very good. They have a good nice selection. The servers behind the counter are also very helpful and nice.I love, love this place!", "rating": "5", "date": [2014, 7, 14]}, "31": {"description": "This place is in a convenient area, and the inside looks a lot nicer than the outside leads you to believe. Produce section is actually pretty good and some of the prices in the veggie aisle are not too bad. The prices on the raw meat on the other hand? Atrocious. Place is pretty expensive for most things but there isn't much to choose from in the area with the lack of super markets and grocery stores. All in all, if you are too lazy to drive further or you don't mind spending a bit more coin, then this place is acceptable.", "rating": "3", "date": [2013, 11, 10]}, "34": {"description": "I remember this location from years ago, when it was a nothing-special, run down supermarket. Friends had recommended it over the past couple of years and I finally went back recently. It's just become my every-day choice for fresh groceries.Produce is clearly their focus. Fruit and vegetables are high quality and re-stocked frequently. Organics are available for many things, but not all. There's usually a mark-down bin for \"use it right away\" stuff like yesterday's ripe bananas. Variety is not vast but fully adequate, seasonal, with a few out-of-the-way items you won't find elsewhere.  They have the best fresh herb section I've seen outside of Whole Paycheck.Prices are much better than other stores I've tried in Chicago. That goes for pre-packaged items like juices and dairy too, not just the fresh produce area.Bakery is decent. I can't always find unsliced whole grain bread, but that may be my fault for tending to shop late in the day. My guess is that they ship everything in daily, rather than having some items finish-baked on site like some stores.Deli is your standard Boar's Head slice-o-mat. If you want grab-and-eat, you can get a better sandwich a few blocks away at Jimmy John's or Potbelly for about the same price.Fish selection is minimal and shrinkwrapped, which is the biggest drawback for me. I wish there were a butcher or seafood shop around the corner like in olden days.This is a grocery store. Don't expect it to double as a corner druggist and light hardware store the way some chain stores do.I haven't been going long, but I've been impressed by the service. Friendly but no nonsense. My kind of place.", "rating": "4", "date": [2013, 8, 29]}, "16": {"description": "This is a really nice store and I enjoy the variety that is there however, the produce is not too consistent sometimes good and sometimes it's bad. When it comes to the other items in the grocery store they are kind of pricey...but I understand it's a small neighborhood store and I want to give back to small businesses. Customer service is nice. Overall they try to keep the store clean.", "rating": "3", "date": [2014, 4, 2]}, "13": {"description": "This place is in a convenient area, and the inside looks a lot nicer than the outside leads you to believe. Produce section is actually pretty good and some of the prices in the veggie aisle are not too bad. The prices on the raw meat on the other hand? Atrocious. Place is pretty expensive for most things but there isn't much to choose from in the area with the lack of super markets and grocery stores. All in all, if you are too lazy to drive further or you don't mind spending a bit more coin, then this place is acceptable.", "rating": "3", "date": [2013, 11, 10]}, "11": {"description": "The best grocery shop in Hyde Park (not that there's a lot of them :P). Veggies and fruits are fresh and really cheap, other things are also not too expensive (for sure cheaper than in Treasure Island). And I love their blueberry muffins!!!", "rating": "5", "date": [2015, 8, 2]}, "39": {"description": "This is a gem in Hyde Park, and their fresh, cheap, diverse selection of produce is why you come here. Plus, the staff are always so friendly and helpful. Brandon behind the deli counter is awesome--he always has a smile and asks how your day is going.Five stars for their selection, for the produce prices, and for the all around atmosphere", "rating": "5", "date": [2013, 5, 19]}, "37": {"description": "Bottom line: Cheap-as-HELL produce whose quality far outstrips anything at Jewel, Dominick's, or even Treasure Island on a good day--and for significantly less money.  The only downside is that a lot of the dry goods are ridiculously overpriced (or are imports that will cost more anyway: $17 olive oil and the like), so it can be hard to do all of your shopping at HPP if you're on a budget.  Deli counter's competitively priced and offers the usual range of cold cuts and cheeses plus some more exotic fare.  The meat case leaves something to be desired, as does their bread selection.  You can find some interesting dessert items from the former Soviet bloc that are fairly affordable.  The cheap and fresh produce is the real reason to hit up this store, though.Other pros: -the staff are super friendly and remember you.-there's often a nun camped out in the front of the store selling delicious baked goods.  Hyde Park randomness at its very best.", "rating": "4", "date": [2013, 6, 21]}, "0": {"description": "This place is sooo amazing. I'm pissed I didn't know about it before now as I usually visit Kimbark next door. They have everything you need (within reason) -- quality produce, meat, a deli with Boar's head (the best meat around), and did I mention the produce? They have a good selection of hard to find items as well, which one can always appreciate.The service was great on my way in, through checkout, and on my way out. The cashier was genuinely interested in my experience!And bonus was I didn't go broke trying to shop. This is definitely my new go-to!", "rating": "5", "date": [2015, 11, 9]}, "38": {"description": "In my previous review I may have been a bit harsh.  Hyde Park is down to two choices for groceries: Treasure Island and Hyde Park Produce... Despite the lack of choices if you live in Hyde Park it is almost impossible not to frequent these two places.  Truth is you can find better, fresher, more varied produce in Treasure Island, albeit at a much higher price!  I continue to frequent Hyde Park Produce because you can dash in and dash out with a quick fix, and sometimes be very surprised at a special.  The deli has a great selection of Boar's Head meats and cheeses.  They also carry an excellent selection of artisan breads (sour dough, challah, bagels, brioche, pita, French, Italian) ...not that they bake, but from various suppliers who are quite good.  Rounding our their inventory are European butters, Cabot cheeses, pasteurized eggs, and the usual canned pantry items that are way over priced.  They carry a variety of organic meats if you don't mind spending $8 for one lonely chicken breast.  So as frequently as I find myself in and out of its doors, I have to recommend it as a usual stop, and you should check it out too.  It's a good place, and it has good things, just not everything.  Sometimes the produce looks a little sad, not always but sometimes.  More often than not you will be pleased with your visit.  Hypercritically yours...  Below are my most recent tips:Good selection of breads11oz box blueberries .99 cents!Fruit & Deli fix!Try the pesto and guacamole in the deli!  Meanwhile I'm a big fan of lo carb/hi fiber breads from Today's Temptations, they carry them!Fruit fix!  They also have fresh squeezed orange juice!  Good guacamole, and fresh home made pesto!Fruit fix to dilute my burgerPerfect Day for a fruit fixNice assortment of artisanal breads for the \"carboholic\" in you!  Bagels, ciabatta, demi baguettes, sour dough, naan, pita, challah, and the list goes on...1/2 off floral bouquets today!Found basil plants for $1.79!  They are $4.98 at Treasure Island.  I am hit & miss w/this store but it's convenient!They have Parmigiano Reggiano but clerk says \"it's not cut & I don't cut the cheese, so come back tomorrow.Only place nearby that has Silk Soy Creamer... Great home made pesto, & guacamole...also Boars Head meats", "rating": "3", "date": [2013, 5, 28]}, "51": {"description": "I am really glad HPP is in Hyde Park. I much prefer this place to Treasure Island. The produce is fantastic, and the staff is usually pretty friendly. I can purchase an entire bag stuffed full of produce for less than $20.00. HPP is pretty great!", "rating": "4", "date": [2012, 7, 7]}, "27": {"description": "Great place for produce, and good prices. You can always find exotic fruits there. The sandwiches at the deli counter are great and come with a bag a chips! This is the only place I've ever seen sell Boar's Head hummus which is amazing. Also they sell cobra corn, which is some amazing popcorn. They have a good selection of organic/ethical/green meat, but never have conventional meat, so its great for good quality food, but not for cheap meat. The employees are always very nice, and sometimes there are nuns selling fresh baked goods with delicious homemade meringues. And you can get herbs in whatever quantity you want, which is way cheaper than every other grocery store.", "rating": "4", "date": [2014, 1, 19]}, "32": {"description": "Horrid. What a cluster F***. Impossible to find what you need and they don't carry most regular products that you'd need. Wanted to try them out but left with more then half my list not done. Waste of time.Have to update my review. Cut open a red potato to find it ROTTEN in the middle. Totally black and disgusting. Open my shredded cheese today and it had MOLD in it. It said best by Jan 2014. I WILL NEVER GO TO THIS DISGUSTING PLACE AGAIN. I should get my money back!!!", "rating": "1", "date": [2013, 10, 16]}, "54": {"description": "A good place to buy fresh produce, nothing else. The produce is ridiculously cheap - way cheaper than Wal-Mart. They have more organic options than most places, but everything is not always super fresh.There is also a decent grocery selection (especially for cheese and bread). The deli counter food is okay, but nothing special (the fried plantains are pretty delicious). The non-produce items are comparatively pricey (but not for Hyde Park).", "rating": "4", "date": [2012, 3, 28]}, "48": {"description": "I don't quite get all the hype for this place.They are cheap and you definitely get a lot of bang for your buck, but it's moot when you have to throw your produce away 2 days after you bought it because it's rotten. They do have a large selection, and you can probably find almost anything here.If you have time to go there daily or every other day and buy just what you need for the next day or two, then this would be your haven. But don't plan on buying a week's worth of produce on Sunday and expect to be using it on Friday.On the flipside, their deli counter is fairly decent (try their fresh salsa) and they do have semi-cheap staples like milk and eggs (cheaper than neighboring CVS anyway). For that, they get an extra star.", "rating": "3", "date": [2012, 10, 11]}, "44": {"description": "I love this produce store it is inexpensive and they have a varitey of fruit and veggies!I would say to anyone these days I wouldn't buy a lot of fresh fruit and veggies these days because they don't last no matter where you get them from!At least when I get them here I know they are fresh and they taste great!The store is clean and the staff is friendly!", "rating": "4", "date": [2012, 11, 20]}, "24": {"description": "- Fantastic produce at good prices- Very pleasant shopping experience (store layout, size and presentation etc.)- Extremely friendly and helpful staff- Good deli and premade selection- Pricey and limited, but high qualilty dry goods selectionIf the prices of non-produce items were a bit cheaper I would definitely give this place 5 stars. So glad to have them in the neighborhood! Now we just need a Trader Joe's to balance it out.", "rating": "4", "date": [2014, 3, 26]}, "7": {"description": "Worst experience ever, don't come here for fresh fruits. We've brought a watermelon, thinking it's fresh and they go along with their slogan: \"fresh fruits and vegetable daily\"Total lie.We've cut up this particular watermelon, to come to find out it's rotten and totally disgusting. The cashier did not have us out receipt. I called and email customer service. The customer service didn't get back to us until 8 days later!!!She said she'll handled us herself but there was another manager on duty who wanted to take care of us. We got there, the manager was rude... Whatever. Anyhow they gave us a replacement watermelon which is great but the watermelon wasn't ready and the watermelon we've received was extremely small. The watermelon we're originally brought & paid for, was extremely huge! That's why we got it!Honesty tho, the store isn't a great customer service grocery store and they don't provide the consumer true to their slogan statement. They need to work on their timely manner and the rude customer service they have gave us. We're never coming here again. \"Fresh fruits and vegetable?\" What a lie.", "rating": "1", "date": [2014, 8, 30]}, "49": {"description": "Really convenient (for me at least), the staff is very friendly and always willing to help.  The produce is fresh and super affordable and they have a surprisingly good selection considering the space.  Much preferred to Treasure Island, this is the supermarket to frequent in Hyde Park.", "rating": "5", "date": [2012, 10, 8]}, "40": {"description": "This place is great! The produce is inexpensive and in good condition. The lines aren't long and the people who work there are helpful. I love that I can shop for produce in my neighborhood now.", "rating": "4", "date": [2013, 2, 24]}, "53": {"description": "hyde parks saving grace. cheapest produce in the area, fantastic service, overal fantastic establishment.", "rating": "5", "date": [2012, 6, 5]}, "30": {"description": "The employees are always helpful and friendly. They shop is clean, and the selection is good for a place it's size (medium). However, their selection is limited in a lot of major ways, especially with more generic items. Also, it's pricey to shop there. The location is good, especially when there's not much in the neighborhood, near restaurants and a cvs. Overall, good place to shop, but could be better and more affordable.", "rating": "3", "date": [2013, 12, 14]}, "46": {"description": "Great fresh vegetables and fruits, good cheap prices. It smells heavenly. I wish I still lived down the street from it. They have cheap cut-up watermelon in the summer. : )", "rating": "5", "date": [2012, 11, 19]}, "1": {"description": "Fresh produce at a decent price. Friendly cashiers. Cheese selection is astounding!Not good for packaged foods, unfortunately it's better to go to Treasure Island for that.", "rating": "4", "date": [2015, 10, 27]}, "55": {"description": "Great variety of fresh produce!  I get all my fruits and vegetables here.  I love the wide variety of delicious fruits and vegetables.  They have great sales (organic strawberries for $1.99!).Also, the store is clean and well-light, and the staff is always friendly and helpful.  Total Hyde Park gem right here!", "rating": "4", "date": [2012, 3, 12]}, "9": {"description": "Yesssss I love hyde park produce!If you want a really unassuming, good sandwich, the deli is fresh and the staff is friendly. You also get a piece of fruit with your lunch!The produce is super cheap, but the packaged goods are really pricey. I always get my pita bread from here though--only like two bucks.THE TRAIL MIX IS JUST SO GOOD THOUGH. Seriously. I hate raisins but I love the raisins in this trail mix. I dream about these nuts and berries.", "rating": "4", "date": [2014, 8, 29]}, "26": {"description": "So cute.  The store is smallish, but it's spread out enough.  They're always sampling cheese, so that's a big plus.  Produce, bread, canned goods, dairy...everything, just great all around.  There is rarely a long wait, and the employees are friendly and helpful.", "rating": "5", "date": [2014, 2, 7]}, "25": {"description": "Convenient if you're just picking up a staple or something you forgot at the real grocery store. Prices seem high and they don't seem to have much outside the produce section, which is the largest part of the store. Hot bar is pretty good if you catch them early before the plantains dry out. Good service from the workers back there though. They always prompt me to try them first if they think they look a little dry. 1/3 times they were edible and delicious. Store is a navigational nightmare though.", "rating": "4", "date": [2014, 2, 7]}, "12": {"description": "I LOVE Hyde Park Produce!! This small, neighborhood produce market offers fresh quality produce and a decent size selection of health foods and international foods. The staff is friendly and approachable and the prices are JUST RIGHT. They also have a nice hot bar and cold bar. Each day they have fresh sushi provided by The SitDown (next door) so you can get your quick sushi fish and KNOW that its fresh and yummy. Hyde Park Produce may not be \"as good as it gets,\" but its pretty darn close!", "rating": "4", "date": [2014, 10, 15]}, "59": {"description": "69 CENT AVOCADOS?  That got me.  As the name suggests, this place is amazing for produce.  Eggs and milk are also great, but processed foods are pretty overpriced.", "rating": "4", "date": [2011, 11, 6]}, "21": {"description": "This place is ok I'd you're  like me and just need eggs, fruit etc. It's over priced I'd You're trying to feed a family of 5. The hot bar is good but would be better if the didn't serve the same sides and meat everyday. But I'm still a loyal customer if that means anything. Lol...", "rating": "3", "date": [2014, 6, 2]}, "17": {"description": "I love HPP! Great produce at great prices. And the staff is helpful and pleasant.", "rating": "5", "date": [2015, 1, 1]}, "10": {"description": "Huh, really surprised by the good reviews. Overall impression from shopping here all the time (due to proximity) is that while the produce section might be cheaper than the other closest grocery store in the area (Treasure Island), the quality is lacking. Fruits (esp. apples) often appear to have gone through some rough times in transport as a lot of them are bruised and scarred. Vegetables noticeably age a lot faster than produce from Treasure Island (esp. herbs). The one thing I really like is that they have Valentina Sauce, my absolute favorite Mexican salsa picante. Almost tempted to up one star, but will refrain from biased reviews.", "rating": "2", "date": [2015, 8, 30]}, "5": {"description": "Decently priced store in the neighborhood especially for fresh produce. The selection for chips and other grocery staples is average. They have a good variety of organic foods if that is what you are looking for. Dairy and cheese selection is impressive.", "rating": "4", "date": [2015, 8, 29]}, "3": {"description": "I shop here because of convenience and nothing more. Produce quality is inconsistent and grocery items are incredibly overpriced. I'm sure the owners feel they can charge for such convenience and having such a captive audience. One of the things that bothers me the most is that many of the cashiers wear rubber food service gloves while handling money. The gloves look dirty, many have holes in them, so they are not changed out (magic gloves, if you will). Then they are handling my produce, groceries, bags etc. I get it, money is gross...but CHANGE YOUR GLOVES. Dirty gloves do not help anyone I adore supporting local businesses, but for my grocery needs, I am counting the days until Whole Foods opens down the street. Better product, more variety and definitely more helpful and customer focused staff. Also, salad bar.I will be sorry to see a local neighborhood grocery store go out of business when a large corporate vendor moves in down the street, but I feel you brought it on yourself.", "rating": "3", "date": [2015, 8, 9]}, "35": {"description": "Good prices but the quality is bad....not better than Jewel or Dominicks at all. The store is decently clean, small is size and it's hard to do a full shop there...None of the produce or products are organic so that's a downer. The store deserves a 1 star just based on the service, quality and standards. There are much better options...The rating it has here is unjust for sure. It makes me think it's fabricated.", "rating": "1", "date": [2013, 7, 23]}, "19": {"description": "Horrid. What a cluster F***. Impossible to find what you need and they don't carry most regular products that you'd need. Wanted to try them out but left with more then half my list not done. Waste of time.Have to update my review. Cut open a red potato to find it ROTTEN in the middle. Totally black and disgusting. Open my shredded cheese today and it had MOLD in it. It said best by Jan 2014. I WILL NEVER GO TO THIS DISGUSTING PLACE AGAIN. I should get my money back!!!", "rating": "1", "date": [2013, 10, 16]}, "28": {"description": "This place is fantastic. The produce is vast and expansive. The prices for the produce are really very decent. You can get some deals on perishable items but you can also break the bank on others. Check out the bagels: they are 3 bucks for six huge and delicious bagels. They also cary the Middle Easter pitta bread I love, which is also under 3 bucks. If you hit this place at the right time of the day, they have a table of samples such as meat, cheese, crackers, and cookies. I may or may not have made a mini meal out of the samples here. The employees are so very kind and although it is usually very busy, the check out process is generally quick. Living in HP, one will know HPP and Treasure Island are the only grocery markets (which will change after the Whole Foods is built next year). With that said, I would recommend HPP for produce and take the 6 up to Roosevelt Road's Jewel or Trader Joes for other products and name brands.", "rating": "4", "date": [2014, 1, 11]}, "45": {"description": "They're the best! They have great deals on your regular apples and bananas, etc. They also have things you would never expect throughout the store - banana flowers, the world's best almond cookies, incredible salami, and more. Recommended!", "rating": "5", "date": [2012, 11, 19]}, "33": {"description": "They have a LARGE, fresh variety of produce but a limited specialty grocery. Mostly international products. I'm adding a star bc they carry \"Calypso Lemonade\" : my favorite drink.", "rating": "4", "date": [2013, 10, 1]}, "43": {"description": "Lots of fresh stuff at cheap prices! I love it here. I opted for cheaper produce today, but I got lots to last me the week! Entire bunches of fresh herbs for cheap. It's like organic shopping without the ridiculous markups. This is the way grocery shopping should be.", "rating": "5", "date": [2013, 1, 6]}, "2": {"description": "The food is fairly priced and the staff is always friendly! After several bad experiences with Treasure Island, I'm more than glad to make the switch.  Bonus: supporting local business!", "rating": "5", "date": [2016, 3, 4]}, "18": {"description": "Love this place! I zip through and get everything I need at great prices, pay the total bill plus  $3 and voila! My groceries are delivered to my top-storey walk-up!", "rating": "5", "date": [2014, 9, 19]}, "41": {"description": "I love this place. My dad used to take me here every weekend. Try their salsa and guacamole. They make it fresh whenever it runs out(happens a lot on the weekends). I also love the french nuns that visit every weekend(I think it's every Sunday or Saturday), they have freshly baked pastries, I love their lemon tarts.", "rating": "5", "date": [2013, 2, 21]}, "52": {"description": "I was in a hurry and was just in and out because I needed a loaf of bread, and because the Farmer's Market I had meant to go to now has a construction site in its place. Well, the bread bit was disappointing because--I'll be honest--I am cheap when it comes to buying bread and they charge regular prices for it.I scooted around picking up the produce that I came in for, and in the process I noticed something exciting--this store carries products from local farms and producers! I saw LocalFolks mustard and salsa, from a family farm in Sheridan Indiana, as well as Sassy Cow Ice Cream from a Wisconsin creamery. I picked up the ice cream, and I need you to know that this green tea ice cream has FIVE ingredients in it! When have you ever had ice cream with only five ingredients? Well hurry and go get some; it tastes like cream and sweet tea and nothing else, and it's so smooth you almost don't even have to swallow it.I'l be returning when I have more time just to look for more local treats like this. Oh yeah, and their reasonably priced, plentiful fruits and veggies,", "rating": "5", "date": [2012, 6, 22]}, "50": {"description": "This place has always been my favorite place for fruits, vegetables, and cheese.  Truly the most inexpensive place in Hyde Park, I dont exceed $10-15 for everything on my list: tomatoes, mushrooms, romaine, watermelon, bananas, grapes, avocado, corn, peppers, jalapenos, cucumber, spinach, nectarines, garlic, ginger, honey, tomato bread, and freshly shredded cheddar. A nice French port may set you back a few bucks, as will the fresh salmon fillets, but you really do pay for quality, not quantity and can actually taste the difference. Not a big red meat eater anymore but the steaks are good but kind of pricey. Guacamole and salsa are made fresh among other items in the deli, but I usually go after those two first. learning to make my own would probably be alot less expensive.  Overall my go-to spot for fresh produce.", "rating": "4", "date": [2012, 8, 7]}, "4": {"description": "Great cheap produce. I come here once a week to pick up a week's worth of produce, and usually walk out paying under $20 (try doing that at treasure island..). The fruit here is great. Sure it may not be like 10000% organic, but whatever, it is good. Mangoes here sometimes go for like 2 for $1, which is when I stock up on them and let them ripen. The asian pears are also delicious and cheaper than anywhere else I've seen. The potatoes here tend to sprout pretty quickly (within 10 days), but just eat them quickly.They DO have an organic section (I get the carrots, swiss chard and kale) if you want some of that.If you want to buy produce, I highly recommend coming here (and also eating at Cedar's next door)!.", "rating": "4", "date": [2015, 5, 6]}, "6": {"description": "Pros: -Large variety of produce, including carambolas (seasonal), heirloom tomatoes, dragonfruit on occasion, etc.-Most of the produce is pretty cheap, and certainly much cheaper than the chain groceries in Chicago-They have all of the basics. If you're cooking a meal from scratch, you'll likely be able to find every ingredient. -They carry some high end specialty products (e.g., non-wheat flours, stone ground matcha green tea powder, vanilla beans, gluten free cookies)-There are a few things that are better priced here than chain stores. For example, kerrygold reserve cheddar cheese is 4.29 here, but runs 5.00-8.50 at other grocery stores. Organic milk and free range omega 3 eggs are also cheaper than what you'd expect at a chain.-The staff is ALWAYS nice-They carry bread from Medici, a local bakery/restaurantCons:-It's a neighborhood market, and they don't carry a lot of national brands. If you're trying to get Cheerios and Coca Cola, you'll have to head next door to CVS-Sometimes the produce available is ready to be eaten THAT day. Just make sure you look at what you're getting and feel it for its consistency-It's a little bit small and can get crowded on weekends or after work. I avoid peak hours-There are a few products that seem more expensive here than elsewhere, such as rice. It could also be that they're selling a different quality of rice, but I'm usually just looking for cheap when it comes to rice-I once saw a block of cheese in the deli specialty cheese section that was expired. If it's a food that doesn't see a lot of turnover, check the expiration date-Meat is expensive. Then again, this has helped me keep my meat consumption down.Overall, this is my favorite place to shop in Hyde Park. For the few items that they don't carry, I can usually get them at CVS right next door.", "rating": "4", "date": [2014, 9, 17]}, "22": {"description": "This place rocks! good produce, nice deli and nice selection of grocery dairy frozen items also Amish chicken.  Great independent business", "rating": "5", "date": [2014, 5, 7]}, "15": {"description": "This place has the tiniest selection of goods I have ever seen. You want a bag of chips, here is one brand that makes  4 different varieties. Same with the selection of cereal, dairy products, etc.  It is really only good for the necessities like eggs and milk.  Plus it is always crowded since the store is small and it is hard to find what you are looking for.", "rating": "2", "date": [2015, 3, 24]}, "57": {"description": "Found this place about 10 years ago when I lived in Hyde Park.  This was a wonderful place for fresh vegetables and fruit.", "rating": "4", "date": [2012, 1, 15]}, "20": {"description": "Love this little store, it's a small store with a big heart. They have everything including an organic section, deli, hot food and fresh squeezed juice. I go there once or twice a week. The staff is over the top friendly, if you're visiting hyde park I highly recommend shopping there for your needs.", "rating": "5", "date": [2014, 6, 4]}, "36": {"description": "I love HPP! The fresh fruits and vegetables are surprisingly cheap. They also have a deli counter and cheese bar. The desserts are quite fantastic too, and I like how you can find many obscure packaged foods from different countries as well as local bread. The only downside is that the lines are pretty long, but they do move fast.", "rating": "4", "date": [2013, 7, 5]}, "14": {"description": "So you probably shouldn't shop in the aisles Here because they obviously make their money by gouging you on grocery items. BUT! The produce is great here! And affordable! Found great deals on items that are hard to find: Serrano peppers, fennel, honeycrisp apples, and fresh herbs. Will definitely be back!", "rating": "4", "date": [2015, 1, 6]}}, "neighborhoods": ["Hyde Park"], "latitude": 41.7998676162039, "longitude": -87.5954072695776, "rating": "4.5", "times": {"Mon": ["8:00 am", "8:00 pm"], "Thu": ["8:00 am", "8:00 pm"], "Sat": ["8:00 am", "8:00 pm"], "Wed": ["8:00 am", "8:00 pm"], "Tue": ["8:00 am", "8:00 pm"], "Sun": ["8:00 am", "6:00 pm"], "Fri": ["8:00 am", "8:00 pm"]}, "price": "$", "categories": [["Fruits & Veggies", "markets"], ["Grocery", "grocery"]], "address": ["1226 E 53rd St"], "attributes": {"Parking": "Street, Private Lot", "Wheelchair Accessible": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "189"}, "maxwell-street-grill-chicago": {"comments": {"3": {"description": "Thursday, December 18, 2014 as I approached the counter and placed my order, one of the foreign employees told his co-worker \"the nigger want a polish\".  We had some words afterwards.  I then called the police but left before they arrived.  I will be going to the appropriate police station to follow up.Jerome TaylorHammond, Indiana773.837.7287", "rating": "1", "date": [2014, 12, 18]}, "1": {"description": "This place is horrible after telling the guy 5 times I wanted a hotdog with melted cheese and raw onion and a cup of cheese for the fries - I went back to my vehicle to eat. I got a hotdog with a slice of cheese not even melted with a half of onion on it. I then took it up to the window and told they guy I wanted the melted cheese on the hot dog he then argues with me that's how I ordered it with the slice cheese and That's how they always make them I was like I want the melted cheese he repeats that's not how they make them- smh You have the cheese how about making it  how I WANT!! I told the guy so what I have to pay extra for the cups of cheese and add it to the hotdog myself he said Yes so I said hold on while I get My $ A Man in line said that's ok heres a $ so I told the guy I wanted the 2 cups of cheese  he then tells Me off and refused to serve Me. So a few of the customers said that was bulls$$t and left also . So while then eating My hotdog I got begged for change then I seen a fight at the bus stop right in front of the place!! I WILL NEVER GO TO THIS PLACE AGAIN AND IT REALLY GIVES MAXWELL ST PLACES A BAD NAME!!!", "rating": "1", "date": [2015, 11, 4]}, "2": {"description": "Do NOT eat here. Under new management, which BLOWS! Let me tell you why.1. The menu is inaccurate. Prices are sloppily taped over old ones, and even those are inaccurate; be prepared to pay whatever the guy inside wants to charge.2. There used to be both a walk up window and an indoor carry out window; now there's only a walk up. They give no shits about customers' safety or comfort.3. The service, if you want to call it that, is hellish at best. The guy working the window literally said \"I don't care, never come back\" to my face when I called him on the price differences. The previous management was much nicer and more honest. This place under the new people is a piece of shit, compared to other Maxwell-style grills, and that's saying something. The bulletproof glass has holes in it for a reason. Roll on by.", "rating": "1", "date": [2014, 8, 14]}, "5": {"description": "They had the absolute best gyros on the southside, everyone i took there agreed, but this business is now closed.", "rating": "4", "date": [2010, 6, 22]}, "0": {"description": "One of the only places that is 24 hours. After hours you have to wait outside which is why they have only 4 stars. I only tried the polish here and it was different to say the least. It has 50 different flavors once you bite into the polish. I LOVE the fresh fries that they have here. Really great place to stop by for a bite after a night out", "rating": "4", "date": [2015, 8, 31]}, "4": {"description": "Your standard Maxwell Street Depot, but as opposed to other locations they have fresh cut fries, which puts them a cut above. This being on 79th, the counter is well protected with an airlock for your food set in a thick bulletproof glass window, with the hilarious side effect that the cooks, already disadvantaged in comprehending your order for other reasons, must engage you in a clumsy shouting exchange to confirm it.Stop by, get a polish and fries, smile!", "rating": "4", "date": [2009, 12, 5]}}, "latitude": 41.7513275146484, "neighborhoods": ["South Chicago"], "categories": [["American (Traditional)", "tradamerican"]], "address": ["7901 S South Chicago Avenue"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "No", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Takes Reservations": "No"}, "longitude": -87.5849380493164, "category": "Restaurants", "rating": "2.5", "price": "$", "number_of_reviews": "6"}, "la-fruteria-chicago": {"comments": {"3": {"description": "This place is AWESOME!!  I got here for all of my Caribbean needs.  They carry African, Dominican and Puerto Rican fare.  Jamaican items are here as well.  Every time I need dough for empanadas or turkey necks for fried cabbage, I go there.  It is reasonably priced and the workers are very helpful and friendly.", "rating": "5", "date": [2009, 8, 29]}, "1": {"description": "I visit this place as often as I can! The staff is always so kind and friendly, from the butchers to the cashiers! I can always find exotic things to cook and flavor my food with. I love this place!", "rating": "5", "date": [2016, 1, 31]}, "2": {"description": "I enjoy coming here because I can always find something in here from different areas of the world. You can always find yummy plantains and coconuts and other island foods...try it out", "rating": "4", "date": [2012, 1, 23]}, "0": {"description": "A real neighborhood gem. This Mexican Caribbean/ African  storefront market has Is as diverse as this Southside neighborhood . They have fresh produce, a meat counter, and groceries ranging from African palm oil and stockfish to goat and fish flavor bouillon cubes. Occupying two storefronts ( with the wall knocked out in between) La Fruteria is a clean  and friendly glorified corner store . Staff is friendly and helpful .", "rating": "5", "date": [2016, 1, 17]}}, "latitude": 41.7333717346191, "neighborhoods": ["South Chicago"], "categories": [["Grocery", "grocery"]], "address": ["8909 S Commercial Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.5509338378906, "category": "Food", "rating": "5.0", "price": "$$", "number_of_reviews": "4"}, "attock-submarine-chicago": {"comments": {"3": {"description": "Dirty inside and sometime shady looking fools are hanging inside. Good chopped steak sandwich but watch the guy because he will get your order wrong.", "rating": "3", "date": [2008, 3, 24]}, "1": {"description": "I love this place ! It might not look all that great but I really like the food and that is the ONLY place I will get cheese sticks .", "rating": "3", "date": [2015, 2, 19]}, "2": {"description": "Awesome food..Quick...but there are always people hanging in the establishment...makes you feel a bit uncomfortable....", "rating": "4", "date": [2011, 5, 15]}, "0": {"description": "Good cheap and greasy...they every thing u can think of beefs, chicken, subs, and a large variety of beverages (non alcoholic)", "rating": "4", "date": [2014, 1, 17]}}, "latitude": 41.7282910645008, "neighborhoods": ["South Chicago"], "categories": [["Restaurants", "restaurants"]], "address": ["3006 E 92nd St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "No"}, "longitude": -87.550762295723, "rating": "3.5", "price": "$", "number_of_reviews": "4"}, "loncars-liquors-chicago": {"comments": {"3": {"description": "My dad been taking me to there with my family since when I was little kid. Owner know my dad since 1980's. Loncar's french fries, chicken, colesaw and hot sauce is so fucking good! When we going to Calumet Park beach, my dad always stop at Loncar's to take out for picnic. its part of my childhood memories, I will visit it again someday! :)", "rating": "5", "date": [2011, 7, 8]}, "1": {"description": "Great \"Workingmans Lunch Counter\"/ Bar in the \"Land that time forgot\"!!  Food is good, prices are dirt cheap, patrons are shady and the service is just fine.. NO WINDOWS!!! Ha ha- Get dat did", "rating": "4", "date": [2015, 1, 15]}, "2": {"description": "This place was ok....nothing special.  I only went there to try the fried chicken that I'd heard about.  The atmosphere was that of a bar.  The customers were into the Bear's game and were cool.  As for the chicken, it was better than KFC, but that's about it.  I hear it sucks since the new owners took over.", "rating": "2", "date": [2013, 1, 27]}, "5": {"description": "I don't like given reviews less then 3 stars, but I have to keep it real and true to my fan base.  I do have fans, don't I ;pAnyways, after exposing my good friend Dean to the other local fried chicken joint, I decided it was time we gave Loncar's a try.I haven't eaten Loncar's chicken in a long while, and they are under new management now, but I now know why we mostly ate from the other place.First of all, my chicken wing had a feather on it.  No big deal.  I don't freak out about that kind of stuff, but still.  It's the principle of the matter.  Secondly, the flavoring of the chicken was just lacking.  It seemed like the chicken was just breaded, no seasoning added or anything.Thirdly, the cuts of chicken had too many fatty pockets and other excess fat that could have/should have been removed.Finally, the bread rolls didn't seem fresh.  They were dry and hard.I guess growing up on chicken from the other place has set my standards high.  I will say that the fries were tasty.As always, I will try anything twice.... So I will go back and update this review.  My sister married the nephew of the owners.  So I'm sure they'll hear about my review.  I hope they don't take it the wrong way.I will also like to comment, that the bar area did look 'shady' as someone else mentioned, but it's a cool looking 'dive' like atmosphere. The craziest thing is that you can buy liquor from the refrigerator section or from the bar tender.  Kinda neat if you ask me.  Plus I'm told this is one of the only places you can find a drink koozie for a 40. ;p", "rating": "2", "date": [2009, 3, 11]}, "6": {"description": "This is one of those scary bars that doesn't have windows. It took a while for me to get the up the courage to actually go in. It's not that bad.Cheap beer and drinks. Interesting locals. Jukebox. I recently \"confessed\" to a co-worker that I hadn't had fried chicken since high school. She was appalled and the next week we were eating fried chicken and fries at Loncar's. Not great, not bad but it got the job done. Fact: I was hit on here by a guy with 3 fingers. He also serenaded me with \"Beth\" by Kiss. Jealous?", "rating": "3", "date": [2008, 5, 7]}, "7": {"description": "Why is this named Loncar Liquors?  Yes it does have a small package store at the front, but otherwise it is a classic Chicago tavern.  Inexpensive drinks and selection of deep fried food.  The proximity to the end of a Metra line as well as being a popular spot with local residents means a diverse customer base.Anyone can walk in to Loncars sit down and blend right in.", "rating": "4", "date": [2008, 12, 12]}, "8": {"description": "Have been going here for about 25 years to drink and eat.  Not sure about the chicken with the feather in it claim cause they bread their chicken daily and it rocks. They also have fish, shrimp, burgers, dogs, polish, appetizers, and pork chop sandwiches too (pretty tasty!).On Mondays they have hot wings (25 ct. each eat in, 35 ct. each take out).  And on Wed. they make crispy tacos for $1.50 ea. which are not as good as mommas but worth a try.I usually come in 2 - 4 times a month for some beers and food.", "rating": "4", "date": [2009, 12, 3]}, "9": {"description": "good place sad to say there was a fire there last night", "rating": "5", "date": [2010, 2, 20]}, "0": {"description": "The service is great they have a really nice lady I think her name was Chris super nice and made the dive bar seem a little better! The food is decent Location is good right off the train It's definitely a whole in the wall though a little scary but worth it", "rating": "4", "date": [2014, 8, 12]}, "4": {"description": "Been wanting to be in the area again to have the biggest and tastiest basket of large shrimp....Loncar Liquors has been in the neighborhood for many years now.....they are known for their fried chicken but yours truly loves the shrimp here !!!! Chon the bartender hooked it up...I felt as if I was dining in a five star restaurant with his attention to detail...Butch and Teresa the owner's should be proud that his people are doing a great job when they are not there.....soooo remember when your  in the neighborhood stop by and enjoy one of Chicago's best  !!!", "rating": "5", "date": [2012, 6, 5]}}, "latitude": 41.72802, "neighborhoods": ["South Chicago"], "categories": [["Bars", "bars"], ["Restaurants", "restaurants"]], "address": ["3201 E 92nd St"], "attributes": {"Best Nights": "Fri, Sat", "Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Happy Hour": "No", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Delivery": "No", "Wheelchair Accessible": "Yes", "Coat Check": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Good For Dancing": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Noise Level": "Average", "Good for Kids": "No"}, "longitude": -87.54666, "category": "Nightlife", "rating": "4.0", "price": "$", "number_of_reviews": "10"}, "sweetthangs-bakery-chicago-2": {"comments": {"1": {"description": "Marzee.  Absolutely delicious.  Sean is an artist with a cupcake.  With all of the gourmet cupcakes out there, I would rate these with the best", "rating": "5", "date": [2014, 2, 8]}, "0": {"description": "Myself and strawberry cheesecake have a very weird addiction to each other. Needless to say of all he deserts and goodies that I have had in my life somehow the decadence of the cheesecake is alluring and in my opinion if done right can easily argue to be in the top 5 deserts of all time. I have tried cheesecakes from top 5 star fine dining all the way down to your mom and pops so its easy to say I have a very trained pallet for cheesecake. Sweetthangs Bakery by far EXCEEDED my expectations in a cheesecake. Lets be honest you don't get cheesecake because its healthy for you. This is the criteria in which I judge my cheesecake: decadence, richness, creaminess,sweetness and most of all important the crust. They hit the nail on the head satisfying all of my tastebuds and sending them into a frenzy at the same dam time. and I loved it!!!! The ordering was easy I placed my order the turnaround time was a day, I paid and had my cheesecake. Simple. The have exceptionally stellar customer service. Its a in house bakery and all the orders are custom.  The minute these guys get into a retail facility they will be a extreme force to be reckoned with within the baking community. If I could I would give these guys 20 stars. The holidays are around the corner. I urge you guys to check them out for all of your baking needs.", "rating": "5", "date": [2013, 11, 19]}}, "neighborhoods": ["South Chicago"], "latitude": 41.7463608, "longitude": -87.5718689, "rating": "5.0", "times": {"Mon": ["8:00 am", "5:00 pm"], "Thu": ["8:00 am", "5:00 pm"], "Sat": ["12:00 pm", "5:00 pm"], "Wed": ["8:00 am", "5:00 pm"], "Tue": ["8:00 am", "5:00 pm"], "Sun": [], "Fri": ["8:00 am", "5:00 pm"]}, "price": "$$", "categories": [["Bakeries", "bakeries"]], "address": ["8155 S Merrill"], "attributes": {"Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "2"}, "steel-city-furniture-chicago-2": {"comments": {"0": {"description": "My daughters were looking for a couch and a loveseat.  They wanted something affordable, but also something that would last a long time.  They found huge selection here at the right price.  Sales people were very accommodating and they are thrilled with their purchase!!", "rating": "5", "date": [2014, 3, 24]}}, "latitude": 41.7290599, "neighborhoods": ["South Chicago"], "categories": [["Furniture Stores", "furniture"]], "address": ["9133 S Commercial Ave"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.5508399, "rating": "5.0", "price": "$$", "number_of_reviews": "1"}, "the-new-look-restaurant-chicago": {"comments": {"3": {"description": "Let me begin with a positive. The food is absolutely phenomenal. I honestly don't have any complaints regarding the quality of food. The only complaint I have is the service. The waitress (which works the bar) is EXTREMELY slow. It literally took us 40 mins to get some fried chicken and a couple of sides. The chicken is fried to order which is a good think because it's fresh but Good Lord, they are slow. We were never checked on again, asked if we needed a refill, napkins, anything. I asked for my check once our meal came because we had been sitting so long. I had to ask for my check 3 times during the course of our dining. Eventually once we were done, I walked to the register to pay because our check was never brought to our table. Go for the food and not the service but be prepared to wait a while so take a good back and a semi full belly", "rating": "4", "date": [2014, 11, 17]}, "1": {"description": "So when I came here the atmosphere is homely like visiting a relative kind of. The waitress came to my table not long after I had been there. She was nice nothing special. The food took very long to come though. Once it did it was pretty good. Not amazing but good. It looked okay tasted better. I love that it's a black owned business but I can't say it would ever be a \"go to\" for me.", "rating": "3", "date": [2015, 12, 7]}, "2": {"description": "I really enjoy being a patron of Black owned businesses, but I am sad to say the food here was not appetizing. The waitress took forever to get to my sister and I; when she did, she brought us menus where they didn't have most of the items on there. We decided to go there because it was down the street from our church and the reviews seem to be pretty good. I guess reviews don't always matter especially in this case. I will not be returning and if I had an option, they wouldn't receive any stars. I guess the one star would be for how welcoming the people were and that's it.", "rating": "1", "date": [2015, 8, 16]}, "5": {"description": "The food is outstanding. Great homemade taste. Love the candied sweer potatoes and the cabbage. I'm blessed to know the cook personally and I know this food is all made from scratch. The portions are good and filling. I thought I wouldnt  finish the meatloaf bit I ate the whole piece. Very old school atmosphere. Staff is pleasant.", "rating": "5", "date": [2014, 3, 15]}, "6": {"description": "I've never had anything I didn't like here. The cook is focused and serious about pleasing your stomach!", "rating": "5", "date": [2014, 3, 5]}, "7": {"description": "OK this little place is my lil heaven on earth when it comes to soul food! One of those joints that is hidden laid back grown folk atmosphere and hell of some good cookin' The travel is worth it if your not a south siderI go here to relax and have d best soul food ive tasted in chicago hands down and when I dine in i love it they have some serious old school tunes on the jukebox!", "rating": "5", "date": [2010, 8, 31]}, "8": {"description": "I just love this place!!!  The food is so good!!! Try the beef short ribs...they are fall off the bone tender and seasoned to perfection!!!", "rating": "5", "date": [2011, 5, 16]}, "9": {"description": "Ordered the pot roast, string beans, rice, gravy and greens.  The green beans were tasty even though they were canned, the pot roast was tender but had no seasoning,  Rice is rice but the gravy was made from  a mix.  The greens and corn muffin were very good.  Be consistent, New Look.  Maybe the made to order chicken or catfish is better.", "rating": "2", "date": [2011, 6, 22]}, "0": {"description": "The almond battered fried chicken was finger liking good...I bought a Groupon trying this restaurant and to my surprise,  the food was great, I had collard greens and candied yams with corn bread...I need someone to carry me out of here and take me home and put me to bed. .Lololol,  I highly recommend The New Look Restaurant for soul food and good soul music...", "rating": "5", "date": [2016, 3, 5]}, "4": {"description": "Love this place. The fish is amazing, red beans and rice are delicious, staff makes you feel like you're at home.", "rating": "5", "date": [2015, 6, 13]}}, "neighborhoods": ["South Chicago"], "latitude": 41.74476, "longitude": -87.56187, "rating": "4.0", "times": {"Mon": ["11:00 am", "2:00 am"], "Thu": ["11:00 am", "2:00 am"], "Sat": ["11:00 am", "2:00 am"], "Wed": ["11:00 am", "2:00 am"], "Tue": ["11:00 am", "2:00 am"], "Sun": ["11:00 am", "2:00 am"], "Fri": ["11:00 am", "2:00 am"]}, "price": "$", "categories": [["Soul Food", "soulfood"]], "address": ["2544 E 83rd St"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "10"}, "quake-collectibles-chicago": {"comments": {"29": {"description": "Where do you go when your five-year-old must have an R2D2 or for that matter a Punky Brewster action figure? Rather than keep the WONDER-filled eighties to ourselves my husband and I can safely watch any 70s or 80s show on YouTube (Luddites we have no converter box) without fearing we will not be able to provide our children the stuffed and [sic] plastiicized versions of TV characters we enjoyed. Quake has them. All of them, every last one....even ones I had forgotten like those knockoff Care Bears whose name escapes me now. Ten bucks get you the TV tray. For three dollars you can buy an R2D2 and  quiet a begging child with - that's the best bargain I have ever found!PSOn top of everything the owner threw-in a figure said five-year-old begged for. Right off the L too!", "rating": "5", "date": [2009, 6, 22]}, "42": {"description": "This place , I can really sink my teeth into. I am an uber toy freak , and am a hardcore child of all toys from the 80's. They have a tre' bitchin selection of older and newer Star Wars stuff , older and newer Transformers stuff , GI Joe and He Man stuff. If I had some more discretionary income , I would probably contribute greatly to the owners kids college fund. Sadly , I can't fathom spending a ton of cash on any 1 toy. They do have some cool bargain bins where if you are not too uptight about condition or missing parts and pieces, you can find some cool stuff. If you do have a need for a rare figure , and have a little cash to spend , you have a pretty good shot here.", "rating": "4", "date": [2007, 6, 5]}, "23": {"description": "I don't even like action figures and I love this store!  I really don't even think YOU have to like action figures either to appreciate this place.  This store must contain every action figure ever made and then some...an action figure hoarders dream!  I may never buy anything from this store, but I just can't help going in there every once in a while...makes me smile.", "rating": "5", "date": [2010, 1, 5]}, "47": {"description": "I found this shop on my way to the Davis Theatre years ago.  They sell toys and collectibles, both new and used.  A lot of rare and vintage items make you feel nostalgic while you look around, a lot of items from 60's and 70's tv shows and movies can do that to you!", "rating": "4", "date": [2005, 8, 5]}, "8": {"description": "LOVE LOVE LOVE Quake!  Whenever I'm in Lincoln Square I always have to stop here even if I have no intention of buying anything.  My kids appreciate retro toys from my childhood and I always find cool things here that I wish or did have as a kid.  I haven't checked out their Schaumburg location yet but I'm in the West Suburbs so I will def make a trip there at some point.", "rating": "4", "date": [2013, 10, 17]}, "31": {"description": "The first time I went into this store I was on sensory overload. trying to take in every action figure crammed onto the shelves behind the register. A great selection of GI Joe and star wars figures. Don't be afraid to describe a toy you remember as a child to the dude there, he can usually point you in the right direction. For me it was starcom  miniature figures with magnetic feet that I was denied as a child.", "rating": "4", "date": [2009, 1, 12]}, "34": {"description": "Who doesn't love toys!!!  Especially if they bring back found memories before all of this pressure and responsibility of being an adult (ha!). I swear I get giddy when I walk in here and I'm like look at this and this and THIS!!! Then my friends are like shut up....and check out this and this.Quake has almost every single toy from the 80's & 90's for boys and girls. I want to by them all up but then I know that I would just be stuck with them in a box somewhere which is probably why my mean mommy threw them out to begin with. He-man, Thunder Cats, Transformers,  all of the ACTION FIGURES (not dolls) a boy or girl could want. Jem, Poppels, Rainbow Brite, all of the dolls a girl or... um boy could want. Every time I saw my Nana she always gave me a Poppel when I was little...I don't know why. But my G.I.Joe's would rip them open to get inside to keep warm like Luke Skywalker did and then they use to jump out as a surprise when Cobra was around......sorry sorry flashback. At least I didn't go into how my mother made me dress like Andy for Halloween one year from Raggedy Ann and Andy.So everything is really cheap here and owner is a very cool guy. Stop on by and have a blast from the past.", "rating": "5", "date": [2008, 6, 5]}, "16": {"description": "Amongst the many vices I collect, toys are pretty high on the list. I'm pretty eclectic in what I enjoy, but lately I've been having problems with a certain subsect of toy collecting - MIB/MIC - that's Mint In Box or Mint On Card.See, when I was growing up, my favorite shows were Batman The Animated Series and the original run of the Ninja Turtles. While there are tons of toys I'm more than happy to remove from their cards so that they can breath freely and move about on my shelves, action figures from those two shows tend to stay on the card if I can find them in such a condition - that is to say I have a hard time finding them in that shape at all.Enter Quake. Dave, the proprietor and sole guy on hand during shop hours goes out of his ways to accommodate requests (The Lady has a thing for mint on card figures from horror films - she requested The Somnambulist from The Cabinet of Doctor Caligari - Dave had somehow acquired it within two weeks and swiftly let us know it was in his possession and could soon be in her's). the Harley Quinn figure from B:TAS - the harder to find one - found it here. one of the Neutrinos from TMNT - here too.Dave keeps an exhaustive but well organized and well curated selection of toys and figures in his relatively small space - and he uses it well! The store is packed from literally floor to ceiling with mostly still on card or in box wares and for the more adventurous and less picky, he has large bins of used figures with scuffs and scratches for a couple bucks a piece.What I really appreciate though is Dave's particular attention to what each person who walks into his store is looking for. In my case, he knows my sweet tooth for anything from B:TAS as well as figures from the mid 80's Kenner produced DC Super Powers line (the holy grail of super hero toy lines!) and has made a point to set figures aside for me until I've been able to come in and pick them up.With service that personalized and selection that solid, how on earth can you go wrong? Besides being the only store of its kind and depth in Chicago (no other toy stores focus on vintage and out of production toy lines - just current stuff), it's just flat out a treasure to the city. Give this guy your business!", "rating": "5", "date": [2010, 6, 26]}, "13": {"description": "This place has everything. Action figures, games, collectible cards, all at reasonable prices (often better than eBay). The items are in great condition and new things come in all the time. It's easy to walkout of here with a toy or action figure you haven't seen since you were a child.", "rating": "5", "date": [2013, 2, 23]}, "11": {"description": "awesome is all I can say right now. Just go in and you'll see what I mean.  They guy who runs it even reminds me of the comic book guy in a way from the simpsons, you'll find all the old toys you remember as a kid and the owner should be the one on toy hunter,he's extremely knowledgeable", "rating": "5", "date": [2012, 10, 24]}, "39": {"description": "This is the greatest action figure and collectible store that i have ever encountered and i like action figures and collectibles so that is good. It is so stacked with magic that it is more or less a museum of good times and star wars figures. It also don't hurt that its in Lincoln Square and Lincoln Square kicks human butt. Take the time to dig through the loose action figure bins (4 for $10.00), for they can be a secret gold mine for overlooked toys of supreme importance to the world - i grabbed a Rocky III figure of the Fabulous Thunder Lips and an Over the Top stallone figure out of those bins and those figures are special and awesome and i like this store.", "rating": "5", "date": [2008, 1, 12]}, "37": {"description": "a time machine disguised as a collectibles store. every memory from your youth is stored here, ready to be reclaimed to replace what your mom sold at the garage sale or pitched to clear up space. but you're a big boy now, and if she never bought you that transformers lunchbox you wanted because brown bagging it was just as good, you can find it here and finally claim it as your own.", "rating": "5", "date": [2008, 4, 4]}, "0": {"description": "So many options for any budget. Huge variety. Spent well over an hour reliving my childhood and having a lot of fun picking out fun toys for my new desk. Will definitely be visiting here again and again!", "rating": "5", "date": [2015, 11, 29]}, "38": {"description": "I love this place. I cant go in without spending tons of money (thier prices are generallly reasonable compared to ebay and elsewhere). First time I walked in a Mazinga Shogun Warrior came home with me. I have a wall devoted to old toys at my house so this place is a haven. The guys that work there are real stand-up dudes, especially for a place where you would expect a snarky holier-than-thou comic book guy type. Just a little out of the way for me. Must plan a day to go and nerd out.", "rating": "5", "date": [2008, 2, 14]}, "27": {"description": "An eclectic kid-friendly toy and collectible store has something for everyone. Reasonable prices ensure that you will not only leave with something you like but something you can afford.The owner is nice to everyone who walks through the door and willing to let you touch and reminisce.Did I mention every inch of the store is covered in vintage and some modern toys? Check it out!", "rating": "5", "date": [2009, 8, 11]}, "32": {"description": "A lot of great stuff here. I love looking at the classic transformers. Sometimes overpriced but he gives you a good deal on a lot of things as well.", "rating": "4", "date": [2008, 8, 28]}, "48": {"description": "A fun stop.  As someone else mentioned, it's a little place, but it's packed to the rafters with action figures, dolls, lunch boxes, weird board games.... you name it.  Rainbow Bright, Welcome Back Kotter, Battlestar Galactica, M.U.S.C.L.E. Men.  I'm not a collector, so I don't know how it stacks up in that world, but I do know it's a fun place to duck into, have some nostalgic laughs and maybe buy something you used to have when you were a kid.", "rating": "5", "date": [2005, 7, 30]}, "44": {"description": "Great toy store. they have almost anything your looking for from old to new. I have known the owner of quake for years 10yrs almost and he by far has the best in toys in chicago.", "rating": "4", "date": [2007, 2, 6]}, "24": {"description": "What a fun shop!  I had a blast digging through the bins full of old, wonderful toys and seeing all the eclectic and silly things inside.  Definitely a wide variety of collectibles, but I was much more interested in the one-of-a-kind oddities.  The gentleman at the counter (the owner, I would imagine) was fun and polite and very cool.A lovely place - I'm glad to have stopped in on a whim. ^.^", "rating": "5", "date": [2009, 10, 23]}, "7": {"description": "LOVE THIS PLACE! I was working on a project which required a lot of toy guns and Dave (the owner) came through. Great guy. Great shop. A truly honest business. Lincoln Square's finest.", "rating": "5", "date": [2014, 4, 16]}, "49": {"description": "This store is one of a kind.  They have all kinds of stuff that most of us around 20-35 played with as kids, from GI Joes, to Star Trek to Star Wars action figures.  The store is fairly small, but it is well laid out to fit all kinds of toys and t-shirts inside.", "rating": "4", "date": [2005, 7, 28]}, "40": {"description": "Thanks quake for letting me buy-back the toys i blew-up all those years ago.  Jesus, I love this place.  I have to disagree with some reviews saying that the inventory never changes.  It always changes...people bring new items all the time, and take others away.  Thats why trips to this place are always different, always some old memory waiting.  I promise Quake, I will really try this time not to blow my toys up.  Too much.", "rating": "5", "date": [2007, 8, 30]}, "30": {"description": "went in and if I still blindly spent money on toys I would have been in heaven.  They had everything you could possibly want and not want from the 70's to today.  But it was really hard to find stuff in such a squashed location.  Cool store, but I don't if a trip out to Lincoln from Rogers Park would ever be worth it.", "rating": "3", "date": [2009, 5, 29]}, "46": {"description": "Quake Collectibles is the absolute embodiment of vintage. Nothing ever changes in this place from the proprietor's appearance, the selection of mostly old toys, the lunch boxes that line the highest shelves and even the one guy always sitting in the corner behind the counter surfing eBay. Always the same scene at Quake. I can't find it in myself to actually buy stuff here, I just browse and reminisce. They have all the classic GI Joe action figures as well as a surprisingly comprehensive Star Wars selection ranging from the old 80's Hasbro line all the way to the newer Power of the Force releases.   Another fun section is what I've dubbed The Island of Misfit Toys, basically a bin or two of action figures that have lost their way. Some are missing their limbs or head, others just a head without a body. If you ask nicely enough, the owner might just let you take a piece for free to complete that art school assignment of yours.", "rating": "3", "date": [2006, 8, 6]}, "1": {"description": "So what Matt W wrote nearly 10 years ago(wow it was that long ago), is accurate even today. Just one of those places I always forget about reviewing, but finally am now.I'm not a toy collector by any means, but it's fun to browse here just for the nostalgia factor of remembering toys from years ago. The prices seem oriented towards the toy collector's market, so I'm not sure if I'll buy a lot of things here if ever, despite that a few things tempted me if only I had more money. Owner is friendly, and they do sell random toy parts for whatever reason. I've never seen any other used/new/collector toy stores do that! Heck, I even saw vintage lunchboxes from the 70s-90s.I think Quake could use a slightly bigger storefront and maybe could expand into the storefront next door via knocking out the drywall between the neighboring storefronts, were the one next door ever becomes vacant? IMO, the aisles are a little tight to maneuver and felt a little cramped, due to the insane amount of toys I saw here. Otherwise, I enjoyed this store when I revisited, and dunno why I don't drop into here more often. That'll change, though. I'd also like to eventually visit their Evanston store(if not also Schaumburg, since that's more of a trek away for me), to see how it compares.", "rating": "4", "date": [2016, 1, 25]}, "9": {"description": "Don't go here when you're broke because you can get a lot of good, random stuff. The store is literally packed with old toys and collectibles. The good thing about this place was that everything was reasonably priced. Another bonus to the store is the great location. You're within walking distance of lots of cool stuff in Ravenswood.", "rating": "4", "date": [2013, 1, 7]}, "26": {"description": "This place is terrific..Its like being on a treasure hunt. If you take your time you'll fid something very cool at a great price. It is a little disorganized..but so much so that it adds to the charm. Go check it out!!", "rating": "4", "date": [2009, 8, 26]}, "25": {"description": "Where was this place when i was a kid?    It makes me angry that all the figures that i used to have are all here.  Plus, the ones that i wanted for so long were here!!!   Anyhow, I dig their selection of super-hero figures and their G.I. Joes.  The guy who was working there (is he the owner) was a very cool guy.  Tried to help me find some G.I. joes (Hahaha.. hey, there were a big part of my childhood), but his place was full of a lot of other stuff, that they were scattered around.   No matter, i had fun looking through my past figure by figure.   I am definitely coming back here again", "rating": "4", "date": [2009, 10, 11]}, "12": {"description": "Even if you're like me & you're not into collectible stuff, this is still a fun shop to pop into & look around. There was a case near the register that was piled with Star Wars action figures.", "rating": "4", "date": [2013, 3, 11]}, "21": {"description": "Amongst the many vices I collect, toys are pretty high on the list. I'm pretty eclectic in what I enjoy, but lately I've been having problems with a certain subsect of toy collecting - MIB/MIC - that's Mint In Box or Mint On Card.See, when I was growing up, my favorite shows were Batman The Animated Series and the original run of the Ninja Turtles. While there are tons of toys I'm more than happy to remove from their cards so that they can breath freely and move about on my shelves, action figures from those two shows tend to stay on the card if I can find them in such a condition - that is to say I have a hard time finding them in that shape at all.Enter Quake. Dave, the proprietor and sole guy on hand during shop hours goes out of his ways to accommodate requests (The Lady has a thing for mint on card figures from horror films - she requested The Somnambulist from The Cabinet of Doctor Caligari - Dave had somehow acquired it within two weeks and swiftly let us know it was in his possession and could soon be in her's). the Harley Quinn figure from B:TAS - the harder to find one - found it here. one of the Neutrinos from TMNT - here too.Dave keeps an exhaustive but well organized and well curated selection of toys and figures in his relatively small space - and he uses it well! The store is packed from literally floor to ceiling with mostly still on card or in box wares and for the more adventurous and less picky, he has large bins of used figures with scuffs and scratches for a couple bucks a piece.What I really appreciate though is Dave's particular attention to what each person who walks into his store is looking for. In my case, he knows my sweet tooth for anything from B:TAS as well as figures from the mid 80's Kenner produced DC Super Powers line (the holy grail of super hero toy lines!) and has made a point to set figures aside for me until I've been able to come in and pick them up.With service that personalized and selection that solid, how on earth can you go wrong? Besides being the only store of its kind and depth in Chicago (no other toy stores focus on vintage and out of production toy lines - just current stuff), it's just flat out a treasure to the city. Give this guy your business!", "rating": "5", "date": [2010, 6, 26]}, "17": {"description": "Probably my favorite store in the world. Dave the owner is friendly, funny, and very knowledgeable on all things from Star Wars to Strawberry Shortcake.   Quake is a store full of everything you had as a kid, and lost, sold or blew up as a teenager, with tons of vintage toys both loose and carded.", "rating": "5", "date": [2012, 12, 9]}, "10": {"description": "The store is packed from top to bottom with action figures.  I enjoyed looking around but I was really hoping to find more in the way of pez dispensers, lunch boxes and some stuff from 60's.", "rating": "3", "date": [2012, 11, 19]}, "5": {"description": "Seriously, the most awesome store ever!  I read a lot about this place and finally made the journey up there (I live in Pilsen).  My 3 1/2 year old son is starting to get into Star Wars (the original trilogy).  We picked him up a few figures before, but I wanted to find a vehicle for  the guys to go in.  I walked in the store and was blown away.  This place has everything you can imagine.  I told the owner what I was looking for and he pulled out an X wing fighter, with all of the parts, just like the one that I had when I was a kid.  He gave me a great deal, and gave me some Star Wars cards for my son.My son gets home tomorrow (he and his mother are visiting his grandparents in Portland, OR) and he is going to totally freak out!  Thanks Dave.  We will be back soon!", "rating": "5", "date": [2014, 5, 17]}, "3": {"description": "If you had a lot of toys in the 1980's or the 1990's then this place will be very awesome to you.  I had no idea that they still had toy stores around.  A friend told me about this place so I came in here one day to check it out.  As soon as I walked in I was amazed at how many toys they had from so many different years.  They had a vast selection from all the different toy lines.  Some of the action figures were in bins but a lot of them were hanging on the wall the way they were when they first hit the shelves.  Not only did they have a vast selection but they had some good prices.  The person behind the counter was also very helpful & knowledgeable about the poducts.  This store is also located in a convenient area.  Since I have visited this store I have also checked out a few others & none really compared to this one.  So between the good selection & the friendly service this is a great place to visit.", "rating": "5", "date": [2014, 8, 8]}, "35": {"description": "My Boyfriend dragged me in here. He loves this cluttered 80's toy haven.  All the toys he ever had/wanted/Mom wouldn't buy him from 20 years ago CHEAP! like 50 cents a pop cheap. I was making fun of him. Like laughing-at-you-fun-of-him, BUT THEN *lights, camera, action* I saw my childhood hero: Jem! Yes, Jem of the Holograms and 80's cartoons- Shut up- Jem largely influenced my total obsession for clothes (Preferably, new ones for each episode... I mean... day...) and cheesy \"truly outrageous\" storylines. I couldn't help myself. She went home with me along with some quirky Farrah Fawcett and 60's kitsch Batgirl refrigerator magnets. I outspent my boyfriend... again... and he made fun of me. Looks like Jem is gonna beatdown G.I. Joe, Mr, T and Luke Skywalker tonight! (Not He-Man though, he's going to help Jem decide what accessories to wear!) Showtime!", "rating": "4", "date": [2008, 5, 13]}, "19": {"description": "Propietor David Gutterman is one of the nicest people you will ever meet. He runs Quake with an obvious labor of love. He is always there. In fact, I've never seen anybody except David working in the store.And, all important: the inventory of superhero, movie, TV sitcom, comic book and action hero memorabilia, ROCKS. I am never here without finding something noteworthy, fun, and fun for big kids, too.Quake will bring your childhood back in a big memory rush.", "rating": "5", "date": [2009, 7, 5]}, "28": {"description": "Propietor David Gutterman is one of the nicest people you will ever meet. He runs Quake with an obvious labor of love. He is always there. In fact, I've never seen anybody except David working in the store.And, all important: the inventory of superhero, movie, TV sitcom, comic book and action hero memorabilia, ROCKS. I am never here without finding something noteworthy, fun, and fun for big kids, too.Quake will bring your childhood back in a big memory rush.", "rating": "5", "date": [2009, 7, 5]}, "45": {"description": "Matt W summed it up best for me. I love walking into Quake, but can't seem to find anything I must have. Everything makes me remember my younger self and GI Joe play dates at Albert Finn's house. I never liked actually playing with the GI Joe's - just setting them up in massive battle scenes and staring at the scene from different angles. But that's a different story.Quake has an immense amount, a crushing amount of toy goodness going on. It's not your standard toy store where the toy in the front of the rack is the same as all those behind it. If you're drawn to a place like Quake, then you'll have to physically peek behind each one to discover new things.", "rating": "4", "date": [2006, 9, 17]}, "33": {"description": "If I could marry a store, it'd be this one.", "rating": "5", "date": [2008, 8, 14]}, "43": {"description": "Took my boys here today after Spidey3 @ the Davis.Walked out with like 7 mostly complete transformers for them and a handful of very weird and cool patches I just had to have since they cracked me up. About 18 bucks total, SCORE!!!!!Loved seeing the stacks and stacks of craptastic pop culture.Owner is friendly.B.K. (before kids) I was too embarassed to shop here. . .not dignified enough, ya dig? Wow am I glad I got over that uptight attitude today. Thank you Quake! We'll be back for the dollar comics.", "rating": "5", "date": [2007, 5, 19]}, "2": {"description": "I had a great experience working with David to sell my GI Joe collection. He made it simple and fair. He definitely knows his stuff, and the store is chock full of about everything you can think of.", "rating": "5", "date": [2015, 9, 5]}, "18": {"description": "The owner should almost rename this place \"Memory Lane\". Almost every customer that came during my visit spat out every variation of \"I remember that!!!\" This man has toys, figures, dolls, cars, playsets, etc. from the last 40 years. Although you'd see mostly the popular lines from the 80's and 90's, there are some new toys in here too.For me, I felt like Ali Baba in the cave of treasures! The way one treasure was always right behind the next...just WOW! I had to pick up some of my childhood gems that were amazingly in mint condition.Gen X/Yers, run, don't walk to this treasure store.", "rating": "5", "date": [2010, 8, 28]}, "41": {"description": "Ah, my childhood. There you are! Everything in this place that isn't in its original packaging I swear I played with 20 years ago or more. A great trip down memory lane. I drop in from time to time to see if they've acquired any \"new\" Atari video game cartridges that aren't \"E.T.\"", "rating": "3", "date": [2007, 6, 14]}, "4": {"description": "I found Quake by accident, but it was a great accident. Ive recently started collecting toys and this place is like heaven! Even toys I had forgot about I found here. Plus a certain figure I had been on a hunt for online, I found here in great condition with accessories and at a very low price (online prices were ridiculous). This place is definitely a Chicago treasure", "rating": "5", "date": [2014, 2, 10]}, "6": {"description": "sorry i knocked down everything in your store i was on drugs", "rating": "5", "date": [2015, 1, 6]}, "22": {"description": "I recommend entering Quake with an open mind and no expectations, because that's truly the best way to enjoy all the surprises it has in store. If you are looking for something specific, you might not find it, but you can still leave with an E.T. glass that was sold at Burger King or a Boba Fett statue that makes noises. Everything is well-priced, and the owner is clearly trying to showcase these forgotten treasures, rather than trying to turn a profit. Bring your childhood friends and reminisce about the toys you used to share.", "rating": "5", "date": [2010, 2, 24]}, "15": {"description": "Great place to go and relive your childhood and yes....get giddy from seeing all those toys you might've played and longed for and now you have money to buy them!!!! Hahaha...love it and enjoy my sons' eyes brighten with excitement over the same toys!!! Cheap prices on some toys and some are just worth the splurge!!!", "rating": "4", "date": [2012, 10, 21]}, "20": {"description": "The owner should almost rename this place \"Memory Lane\". Almost every customer that came during my visit spat out every variation of \"I remember that!!!\" This man has toys, figures, dolls, cars, playsets, etc. from the last 40 years. Although you'd see mostly the popular lines from the 80's and 90's, there are some new toys in here too.For me, I felt like Ali Baba in the cave of treasures! The way one treasure was always right behind the next...just WOW! I had to pick up some of my childhood gems that were amazingly in mint condition.Gen X/Yers, run, don't walk to this treasure store.", "rating": "5", "date": [2010, 8, 28]}, "36": {"description": "I wish I had not gotten rid of all my Star Wars, Gi Joe, He-Man and every other toys I had when I was a kid.Luckily Quake has kept them all for me to come and visit. I like to come here and reminisce. And once in a while buy something. If I had more money and space, I would just buy back all my old stuff.It's like the museum of my life, and probably for many other kids my age.", "rating": "5", "date": [2008, 4, 15]}, "14": {"description": "Fantastic I came form Phoenix just to see this place. GReat owner spent at least an hour just talking. GREAT PRICES I will return many many more times.", "rating": "5", "date": [2012, 10, 7]}}, "neighborhoods": ["Ravenswood", "Lincoln Square"], "latitude": 41.9655673205853, "longitude": -87.686612829566, "rating": "4.5", "times": {"Mon": ["1:00 pm", "6:00 pm"], "Thu": ["1:00 pm", "6:00 pm"], "Sat": ["12:00 pm", "6:00 pm"], "Wed": ["1:00 pm", "6:00 pm"], "Tue": [], "Sun": ["12:00 pm", "5:00 pm"], "Fri": ["1:00 pm", "6:00 pm"]}, "price": "$$", "categories": [["Toy Stores", "toys"]], "address": ["4628 N Lincoln Ave"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "50"}}