{
"bergsteins-ny-delicatessen-hyde-park-chicago": {
	"rating": "4.0", 
	"neighborhoods": ["Hyde Park"], 
	"price": "$", 
	"comments": {
		"11": {
			"date": [2015, 12, 11], 
			"rating": "5", 
			"description": "Good ingredients, fast, and lots of options. So far, I've tried the chicken philly (like a Philly cheesesteak but with chicken) and the Berger (two party burger with pastrami and 1000 island dressing). Both were solid, filling, and they have a great list of sides to choose from. Service is also good, and interior design is clean and comfortable. Will definitely be coming back."}, 
		"10": {
			"date": [2016, 2, 10], 
			"rating": "4", 
			"description": "I ordered soup from Bergstein's from my sister in the hospital in Chicago.  She was craving matzo balls and we're from a different state so I had to order it online for her to be delivered in Chicago.  I had to take a leap of faith and order from a restaurant we knew nothing about.  The staff who took my order was so accomodating.  They even strained the soup of all the veggies for her so she was able to eat it according to her diet in the hospital.  My sister was so happy to receive the soup and it was \"very tasty\".  If there was one criticism it would be add more matzo balls.  She sent a picture and there were only 2 balls to a quart of broth.  I'm sure it would have gone further if there were veggies but I would have gladly paid for some extra balls for her :)Would definitely recommend!!"}, 
		"13": {
			"date": [2016, 1, 13], 
			"rating": "5", 
			"description": "Absolutely LOVE this place!  I've tried pretty much everything on the menu and I've never been disappointed.  Plus, it's become my go-to for catering orders whenever we bring lunch into the office."}, "12": {"date": [2015, 10, 12], "rating": "5", "description": "Bergstein's is among my favorite restaurants in Hyde Park.  The Reuben eggrolls are amazing and I haven't seen them anywhere else.I always bring the squad with me and the wait is never too long, and always worth the wait.  The all-day breakfast menu is killer, and would recommend the Big Egg.  Also they have a 10% student discount that runs all year, so definitely a plus."}, "06": {"date": [2015, 10, 6], "rating": "4", "description": "AmazingI had their chopped liver and it tasted just like my Grandma Sarah's!!I consider myself an expert on chopped liverAnd their whitefish salad is excellent."}, 
		"07": {
			"date": [2015, 7, 7], 
			"rating": "3", 
			"description": "Bergstein's is a perfectly acceptable option near the UChicago campus on Hyde Park. It's more of a hike than one expects, coming from the Booth building on 58th, but so long as it's not iced over, the walk is safe and brisk.I've gotten the bagel and lox a couple times. Contrasting it to my preferred city bagel at NYC Deli, Bergstein's is a little saltier and definitely skimpier on the smoked salmon. It'll set you back a Hamilton (soon to be Tubman?), which is not cheap, but hey, it's Chicago."}, "17": {"date": [2015, 2, 17], "rating": "4", "description": "The sandwiches are very good and the service is friendly and quick. All of the sandwich elements are excellent. The meat is high quality and the breads are fresh and delicious. I had the potato salad as a side. It was good but didn't blow my mind and I would have liked a little larger portion. The pickle spear served with each sandwich is really good. I could probably eat a jar full no problem. Overall a really good experience that is way better than most of what Hyde Park has to offer."}, "16": {"date": [2015, 7, 16], "rating": "3", "description": "Ordered the Benson burst that's corned beef,pastrami Swiss on rye an a side of onion rings it was great"}, "19": {"date": [2015, 4, 19], "rating": "5", "description": "Loved my lunch! I got the second city sandwich, cold with lettuce, tomato, mustard and mayo. It was so good. You can have your sandwich hot or cold and it comes with a pickle and one side. Everything was very fresh and customer service was great. The person who helped us was nice and energetic. This place is good for grabbing a quick bite or eating out with friends."}, "18": {"date": [2014, 10, 18], "rating": "5", "description": "Oh. Em. Jee. This place totally hits the spot. Amazing grilled cheese sandwich with potato salad and pickle for $5. Add a cup of matzoh ball soup for $4.50, and you have in every happy, totally stuffed customer. Plus the hubs loved his whitefish salad and bagel - better than NY delis, he says. Decor is basic fast food but big window views of Augustana Lutheran Church and gorgeous fall leaves make up for it. Highly, highly recommend."}, "05": {"date": [2015, 10, 5], "rating": "5", "description": "Love the options and the staff are great. Antonio is the best."}, "29": {"date": [2014, 11, 29], "rating": "5", "description": "My husband and I like this place a lot.  Our service here has always been pretty good.  I like that it doesn't do that artisanal sandwich crap.  A sandwich should be a sandwich- it doesn't have to be fancy.Lou's Second City is our favorite.  Nice and simple.Also, junior is 4oz or New Yorker is 8oz.  This refers only to the amount of meat you get and not the size of the bread.  The bread is the same size.  This is something I found interesting because that doesn't always seem to be the case when you can get sandwiches of different sizes."}, "09": {"date": [2015, 8, 9], "rating": "5", "description": "I'm basically a regular... I always leave full, happy, and very satisfied :)  Big, heaping portions (I can only manage the Junior sizes) with lots of customizeable options.  And the playlist rocks!  Good vibes and good food."}, "30": {"date": [2014, 12, 30], "rating": "5", "description": "Strongly recommend the Big Egg Sandwich.. Great place for breakfast, lunch, or dinner.. Price was very reasonable and food was delicious.."}, "20": {"date": [2015, 8, 20], "rating": "3", "description": "A nice alternative to the chain restaurants taking over Hyde Park. Went because I thought it's find a NY type bagel selection, but it was slim picking for morning. Only 2 cream cheese flavors (what does Chicago have against flavored cream cheese anyway?), which was disappointing. Guys behind the counter were nice, quick and fist bumped with my toddler, so that was cute. Over all a nice place for lunch or a quick snack."}}, 
	"times": {
		"Wed": ["10:00 am", "7:00 pm"], 
		"Sun": ["9:00 am", "3:00 pm"], 
		"Fri": ["10:00 am", "7:00 pm"], 
		"Tue": ["10:00 am", "7:00 pm"], 
		"Mon": ["10:00 am", "7:00 pm"], 
		"Thu": ["10:00 am", "7:00 pm"], 
		"Sat": ["9:00 am", "7:00 pm"]}, 
	"number_of_reviews": "55", 
	"longitude": -87.5970567122823, 
	"address": ["1164 E 55th St"], 
	"latitude": 41.7951741615851, 
	"attributes": {
		"Take-out": "Yes", 
		"Wi-Fi": "Free", 
		"Alcohol": "No", 
		"Caters": "Yes", 
		"Noise Level": "Average", 
		"Outdoor Seating": "Yes", 
		"Parking": "Street", 
		"Dogs Allowed": "No", 
		"Accepts Bitcoin": "No", 
		"Delivery": "Yes", 
		"Ambience": "Casual", 
		"Bike Parking": "Yes", 
		"Has TV": "No", 
		"Good For": "Lunch", 
		"Takes Reservations": "No", 
		"Attire": "Casual", 
		"Waiter Service": "No", 
		"Accepts Credit Cards": "Yes", 
		"Good for Kids": "Yes", 
		"Good for Groups": "Yes", 
		"Wheelchair Accessible": "Yes"}, 
	"categories": [["Delis", "delis"], ["Bagels", "bagels"], ["Sandwiches", "sandwiches"]]
}, 
"valley-of-jordan-chicago": {
	"rating": "3.5", 
	"neighborhoods": ["Hyde Park"], 
	"price": "$", 
	"comments": {"24": {"date": [2014, 1, 24], "rating": "4", "description": "It's kind of janky, isolated, and different, but I definitely appreciate this place. Try the chicken shawarma which is decent. Make sure they don't overcharge you. The man/owner won't--he's great. But that grumpy old woman who works there will ALWAYS overcharge you and unfortunately you can't even understand her when she speaks if you want to contest it. I generally try to avoid her at all costs. Even still, if you're craving a different sandwich, try it out. Support independent immigrant businesses."}, "10": {"date": [2011, 5, 10], "rating": "5", "description": "Love this place.  Small minimart, but the real gem is the sandwich counter.  Very cheap, very good sandwiches.  Nice selection of halal lunch meat.  The owner is a really nice guy.  A bunch of us rented a storefront in the building for a weekend event in Hyde Park, and we were in and out all day when he was open.  As a thank you, he brought us an enormous tray of hummus and pita.  Good place to drop in and get ice cream or a parfait.  I hope we can come back next year!"}, "26": {"date": [2013, 1, 26], "rating": "4", "description": "Best falafel in the neighborhood.  It's freshly fried to order and served with good hummus in a pita."}, "12": {"date": [2012, 11, 12], "rating": "5", "description": "I'm so excited to have a halal meat store in Hyde park! Great service!"}, "06": {"date": [2011, 1, 6], "rating": "4", "description": "Great store for halal meat and wonderful Middle Eastern and Mediterranean food. Gotta love canned stuffed grape leaves.My one problem with Valley Of Jordan is that it's not a one stop shop. The produce selection (at least right now when it has just opened) would be generously described as minimal, and most of the foods are standard convenience store and CVS items. Eggs and milk are from factory farms, and the spice selection is pretty bare. I still have to go to Hyde Park Produce for the stuff I need. VoJ right now is really only good for a handful of thongs I want."}, "21": {"date": [2015, 8, 21], "rating": "5", "description": "Best food in the neighborhoo. I love everything on the menu.  Gong down one item at a time."}, "04": {"date": [2012, 6, 4], "rating": "5", "description": "I've been stopping by Valley of Jordan since they opened for hummus, baba ghanoush, dolma, and various convenience items. They are super friendly and the salads are great. I tried a deli sandwich for the first time tonight for a quick dinner before an evening class. Incredible! Best sandwich I've had in the neighborhood. Do yourself a favor and stop by to get a sandwich sometime."}, "03": {"date": [2015, 1, 3], "rating": "2", "description": "Good selection of halal meats and very reasonably priced. Fresh. But customer service? Ms Mary? Ugh. Worst attitude and rudest human being on the face of the planet, and she's as old as my grandma so she should know better but frankly she enjoys being nasty mean and rude and shame on the owners for allowing her to continue that for so many years."}, "19": {"date": [2012, 11, 19], "rating": "3", "description": "I was in the neighborhood sometime ago and dropped by this store, thinking it was just a convenience mart. I was pleasantly surprised to see they have middle eastern food so I made a point to drop back by later on. I went by today for lunch and overall was disappointed. They didn't have any lamb schwarma available, which may have made a huge difference in my experience. (I love lamb) Instead I had the chicken schwarma, which wasn't nearly as savory as the ones from Nile on 55th. If I'm ever by there and have a chance to try the lamb I might change my mind, but in general I don't see myself making a plan to go back."}, "02": {"date": [2012, 11, 2], "rating": "5", "description": "AMAZING SHAWARMA!!! This place is like a little corner store meets deli ... it's a gem. Discovered it a few weeks ago and have gone there a few times since then. Very clean and the owner is very friendly."}, "29": {"date": [2014, 8, 29], "rating": "4", "description": "I initially had a negative experience with the cashier other reviewers mentioned, which I presume is the old woman who co-owns the place. She was quite grumpy at first, which scared me off of this place for a few months. But she definitely warms up to you. After I lived in the area for two years she would chat me up and ask me what I was cooking with what I was buying, etc. Also, by that time they'd let me haggle for bulk purchases, helped spot me bags and quarters when I was desperate, etc.This is a pretty good place to buy certain items. If you catch them while they have fresh meat coming in (which is every couple of days) it's probably the cheapest in the area. Treasure Island can be a little cheaper sometimes I guess, but that's a fair distance to walk from 53rd and Ellis and it's not that much cheaper.They have pretty good prices on basics like oil, flour, sugar, cleaners, and so on. They don't have much produce, though they have some basics like potatoes and onions. I've never ordered a sandwich from the deli so I can't comment on that. They also sell some prepared food under the counter. The spinach pie is okay--I prefer Hyde Park Produce's, but sometimes you don't have the motivation to walk that far. The hummus is great, although they don't always have pita bread that  isn't frozen. Do try their imported candy bars!Overall, it's a quirky small shop and as long as you can accept its quirks it can work out pretty well for you."}, "27": {"date": [2015, 3, 27], "rating": "5", "description": "An absolutely great store they do amazing sandwiches and lunch meat to go. Great owner he is very friendly. And the cashier miss Mary is very nice as well."}, "14": {"date": [2013, 2, 14], "rating": "5", "description": "I've been living in hyde park most of my life and down the street from this place since for the last 15 years. This has been the only business I see that will last. They have a large selection of  spices and just random things you would think you would see in a small store but usually when i need something they have it. The owner is awesome. Keep being awesome."}}, 
	"number_of_reviews": "21", 
	"longitude": -87.6009786128998, 
	"address": ["1009 E 53rd St"], 
	"latitude": 41.7993608862162, 
	"attributes": {"Take-out": "Yes", "Wi-Fi": "No", "Alcohol": "No", "Noise Level": "Quiet", "Takes Reservations": "No", "Delivery": "No", "Bike Parking": "Yes", "Has TV": "Yes", "Outdoor Seating": "No", "Parking": "Street", "Attire": "Casual", "Waiter Service": "No", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes", "Good for Groups": "Yes"}, "categories": [["Ethnic Food", "ethnicmarkets"], ["Middle Eastern", "mideastern"]]}, "cafe-53-chicago": {"rating": "4.0", "neighborhoods": ["Hyde Park"], "price": "$", "comments": {"11": {"date": [2016, 2, 11], "rating": "1", "description": "Lack of respect for diners. Ordered sandwiches thru an app, went there to pick up after 20 mins.  Owners/staffs told me my order needed to be changed because they ran out of turkey meat. Fine. Waited 20 mins inside and asked them to just give me without grilling. What they said was still additional 15 mins needed to make two sandwiches because they had a catering order placed before me. What is wrong with them? They were supposed to tell me 40 mins ago. They were rude and not sorry.For 40 mins since order placed and 20 mins while I was at the shop, they never told me my order would take unusually longer time. Zero respect for diners."}, "10": {"date": [2015, 5, 10], "rating": "5", "description": "I cannot sing enough praises for Cafe 53!Perhaps it's the collegiate nostalgia, but really it's a coffee shop with some great sandwiches and gelato and an incredibly kind owner.With plenty of tables and a patio out in the back, it's easily a go-to for many Hyde Parkers and UChicagoans to head to for some casual studying. I've had a few of their sandwiches (I believe a Roast Beef, Sumac Chicken, and Garlic Chicken) and nothing has disappointed. I would definitely recommend getting your sandwich with the Crunch bread (I'm forgetting the exact name of it) but it's delightful! If you're hard-pressed to make a decision among the vast choices (many veggie and vegan options, too!), the owner will happily give his recommendations.Out of all the development Hyde Park has been going through in the past few years, Cafe 53 is one of only three places that I believe is worth repeatedly visiting.Go there. Now. Seriously."}, "26": {"date": [2014, 12, 26], "rating": "5", "description": "We stumbled along this joint as we were looking at houses. We thought we were just gonna grab a quick coffee but we couldn't resist the awesome menu.... Vegan too! The food was phenomenal. By far the best sandwich I've ever had. I would highly recommend stopping by for a quick bite. We will be back!"}, "12": {"date": [2015, 2, 12], "rating": "4", "description": "I was told that this café was one of the biggest ones in Hyde Park and that surprised me because it seem kinda of small to me but it wasn't a problem.I came here just for a meeting so I didn't really have any food but I did have a Tea Latte' which I had never had before it was okay and it was reasonable in price.  There was a steady stream of people that came through the door and many of them the man behind the counter seemed to know.It had such a welcoming feel and even as my Pastor and I prayed after our meeting as we sat at the table no one in the Café seemed put off or as if they were surprised in fact they were smiling.  That was the Cherry on the top of this visit.I will be coming back to taste some of their food and pastries.I will update my review when I do.Enjoy!"}, "20": {"date": [2014, 12, 20], "rating": "5", "description": "Awesum began sandwiches.... Great service.. Great food... Great prices...Had a vegan avocado artichoke sandwich - real niceVegan Buffalo chicken sandwich - not badBegan marshmallow brownie - heavenly...See u again... Soon....."}, "07": {"date": [2015, 7, 7], "rating": "4", "description": "Tons of great vegan options for sandwiches that can be tricky in other places where you'd just walk away with lots of lettuce, tomatoes and maybe a cucumber with some dressing slathered on - this place gives you OPTIONS for goodness! I recommend eating there so you can get it delivered to you fresh after preparation as (especially the vegetarian/vegan ones) some of the sandwiches get a bit sloppy quickly with the dressings and such soaking into the bread. I, personally, love their eggplant sandwiches. They are quite large and very filling. No real options for sides for those who want some fries or something with their order, but you can get some chips. If you're in the mood for gelato... oh man! They have some great, original flavor options. I tried a scoop of basil with a scoop of ricotta - which had a great cheesecake taste to it when combined. The server just kept providing me sample after sample with various combos to see what I might like. So many yummy options - I could hardly decide."}, "17": {"date": [2015, 9, 17], "rating": "4", "description": "Ok so the ambience needs a little work, but this place has turned into one of my favorite spots. It's part coffee shop, part gelateria, and part restaurant that delivers! They do everything.. And for the most part they do it well.  The food options vary from the boring (grilled chicken salad) to unique international (I had some middle eastern chicken sandwich that was AMAZING). The gelato is pretty good as well. So..if you need a place to chill AND eat something on 53rd that's not deep fried, smothered, or just plain unhealthy....this is a good option."}, "03": {"date": [2015, 8, 3], "rating": "5", "description": "Most underrated cafe in Hyde Park. Got a ton of food through the Yelp deal and was psyched about all of them: amazing sandwiches in taste and size and a sweet apple crumble. I'll be back as soon as possible."}, "08": {"date": [2015, 10, 8], "rating": "4", "description": "So many tea options!! The food menu looks pretty solid."}, "05": {"date": [2015, 12, 5], "rating": "2", "description": "The food was fresh but nothing spectacular. I would have given a higher rating if they could have managed to deliver the food that I actually ordered. They got the delivery order wrong not once, but twice! How does that happen? They did comp the last order but it was wrong too! Part of the order was correct. I ate the salad but all of the mix-ups was exasperating. I'll move on to other places to order as trying to get a correct order took up way too much of my time."}, "28": {"date": [2015, 7, 28], "rating": "4", "description": "Smelled a little funky, but the girl working there was so nice, the iced coffee was great and the blueberry muffin was delicious as well. Sat in one of the soft chairs and sank two inches, and judging from the reviews I should have tried a sandwich, but the vibes here were really great and I give it two very enthusiastic thumbs up - fine holiday fun."}, "27": {"date": [2015, 4, 27], "rating": "4", "description": "A bright cute place. It's always low-key here, most people are working and minding their own. A great place to meet with a friend. Pleasant atmosphere. The backyard porch is a beautiful, more intimate setting. But, don't tell anyone because we have to keep it that way.  It was also a setting in one episode of the reality show Chicagoland (on Netflix). The front seats offer a nice perspective of the cafe and passerby's on the sidewalk.Only drawback - I order drinks with soy milk because of a lactose intolerance and on several occasions I've gotten cow milk.Some of the best vegan sandwiches ever. Fast delivery. The soy-based cream sauce is THE shit."}, "01": {"date": [2015, 4, 1], "rating": "4", "description": "Did I not write a review for this place?  Shame on me!  It's a bit of a whole in the wall with chipped paint and tile and some worn, wobbly tables and chairs.  But oh my sweet Baby Jesus is the food here good.  The sumac chicken sandwich on Dutch crunch bread is my new habit.  Good thing I have many reasons to get to Hyde Park all the way from Lakeview!And the owner/manage?  Dude couldn't be more friendly or helpful.  Even though he wasn't going to make as much money from my desired order, he convinced me not to get the hummus plate along with the sandwich, saying it was too big.  \"I'll make it for you if you want.  But it'll be too much food.  I want you to be happy.\"  I took his advice and he was so right.  The sandwich, at $6.00, was as big as my head.  I ate at 11:30 and had to force myself to think about what to make for dinner at 5pm.Meet your new crack!"}, "09": {"date": [2015, 2, 9], "rating": "5", "description": "The owner, who is almost always there, is very personable, and will knock himself out to make you happy. The coffee is way better than Starbucks and way way better than DD. Recently, the menu was expanded. Meat lovers, as well as veggies will be happy. I like the Eggplant Meatball, as well as their \"Café 53 Sandwich\" - which is a simple bagel with egg whites, covered in delicious Turkish olive oil, and sprinkled with mint. One note for those used to going to Starbucks... Café 53 does not have sugar-free syrup and a few other fancy things like that. Finally, the WiFi is reliable and extremely fast!"}}, "times": {"Wed": ["8:00 am", "9:00 pm"], "Sun": ["8:00 am", "9:00 pm"], "Fri": ["8:00 am", "9:00 pm"], "Tue": ["8:00 am", "9:00 pm"], "Mon": ["8:00 am", "9:00 pm"], "Thu": ["8:00 am", "9:00 pm"], "Sat": ["8:00 am", "9:00 pm"]}, "number_of_reviews": "86", "longitude": -87.5923947061704, "address": ["1369 E 53rd St"], "latitude": 41.7993585664382, "attributes": {"Take-out": "Yes", "Wi-Fi": "Free", "Alcohol": "No", "Caters": "Yes", "Noise Level": "Average", "Outdoor Seating": "Yes", "Takes Reservations": "No", "Dogs Allowed": "No", "Delivery": "Yes", "Ambience": "Casual", "Bike Parking": "Yes", "Has TV": "No", "Good For": "Lunch", "Parking": "Street", "Attire": "Casual", "Waiter Service": "No", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes", "Good for Groups": "No", "Wheelchair Accessible": "Yes"}, "categories": [["Sandwiches", "sandwiches"], ["Gelato", "gelato"], ["Halal", "halal"]]}, "hyde-park-produce-chicago": {"rating": "4.5", "neighborhoods": ["Hyde Park"], "price": "$", "comments": {"02": {"date": [2014, 4, 2], "rating": "3", "description": "This is a really nice store and I enjoy the variety that is there however, the produce is not too consistent sometimes good and sometimes it's bad. When it comes to the other items in the grocery store they are kind of pricey...but I understand it's a small neighborhood store and I want to give back to small businesses. Customer service is nice. Overall they try to keep the store clean."}, "10": {"date": [2013, 11, 10], "rating": "3", "description": "This place is in a convenient area, and the inside looks a lot nicer than the outside leads you to believe. Produce section is actually pretty good and some of the prices in the veggie aisle are not too bad. The prices on the raw meat on the other hand? Atrocious. Place is pretty expensive for most things but there isn't much to choose from in the area with the lack of super markets and grocery stores. All in all, if you are too lazy to drive further or you don't mind spending a bit more coin, then this place is acceptable."}, "27": {"date": [2015, 10, 27], "rating": "4", "description": "Fresh produce at a decent price. Friendly cashiers. Cheese selection is astounding!Not good for packaged foods, unfortunately it's better to go to Treasure Island for that."}, "06": {"date": [2015, 1, 6], "rating": "4", "description": "So you probably shouldn't shop in the aisles Here because they obviously make their money by gouging you on grocery items. BUT! The produce is great here! And affordable! Found great deals on items that are hard to find: Serrano peppers, fennel, honeycrisp apples, and fresh herbs. Will definitely be back!"}, "14": {"date": [2014, 7, 14], "rating": "5", "description": "This place made my weekend! Having only been shopping on 55th's Treasure Island  and Open Produce, I really wanted to check out what Hyde Park Produce offers. Initially, I didn't even go in with a basket. I thought to myself I am just going to browse. However, as soon as I got in, I saw the $2.99/ lb Rainier cherries and the $1.49 for a 16oz. fresh organic strawberries. I had to read and re-read the signs to make sure I was reading correctly. I even waived down a customer service person to help me read the signs. So yes, things are cheap here. I quickly grabbed a basket thinking that I may only walk away with a few things.As I continued down the aisles, I found that the one drink that I have been looking for all summer last year in Maryland. The blueberry soda. OMG! This place carries it. I grabbed the last bottle and heard that they will stock it up again soon. So excited! So, yes this place offers really unique things. Another product that I got was the pink lady apple juice. I love pink lady apples, so we'll see how I like this drink.The deli/ cheese section is also very good. They have a good nice selection. The servers behind the counter are also very helpful and nice.I love, love this place!"}, "17": {"date": [2014, 9, 17], "rating": "4", "description": "Pros: -Large variety of produce, including carambolas (seasonal), heirloom tomatoes, dragonfruit on occasion, etc.-Most of the produce is pretty cheap, and certainly much cheaper than the chain groceries in Chicago-They have all of the basics. If you're cooking a meal from scratch, you'll likely be able to find every ingredient. -They carry some high end specialty products (e.g., non-wheat flours, stone ground matcha green tea powder, vanilla beans, gluten free cookies)-There are a few things that are better priced here than chain stores. For example, kerrygold reserve cheddar cheese is 4.29 here, but runs 5.00-8.50 at other grocery stores. Organic milk and free range omega 3 eggs are also cheaper than what you'd expect at a chain.-The staff is ALWAYS nice-They carry bread from Medici, a local bakery/restaurantCons:-It's a neighborhood market, and they don't carry a lot of national brands. If you're trying to get Cheerios and Coca Cola, you'll have to head next door to CVS-Sometimes the produce available is ready to be eaten THAT day. Just make sure you look at what you're getting and feel it for its consistency-It's a little bit small and can get crowded on weekends or after work. I avoid peak hours-There are a few products that seem more expensive here than elsewhere, such as rice. It could also be that they're selling a different quality of rice, but I'm usually just looking for cheap when it comes to rice-I once saw a block of cheese in the deli specialty cheese section that was expired. If it's a food that doesn't see a lot of turnover, check the expiration date-Meat is expensive. Then again, this has helped me keep my meat consumption down.Overall, this is my favorite place to shop in Hyde Park. For the few items that they don't carry, I can usually get them at CVS right next door."}, "16": {"date": [2013, 10, 16], "rating": "1", "description": "Horrid. What a cluster F***. Impossible to find what you need and they don't carry most regular products that you'd need. Wanted to try them out but left with more then half my list not done. Waste of time.Have to update my review. Cut open a red potato to find it ROTTEN in the middle. Totally black and disgusting. Open my shredded cheese today and it had MOLD in it. It said best by Jan 2014. I WILL NEVER GO TO THIS DISGUSTING PLACE AGAIN. I should get my money back!!!"}, "24": {"date": [2015, 3, 24], "rating": "2", "description": "This place has the tiniest selection of goods I have ever seen. You want a bag of chips, here is one brand that makes  4 different varieties. Same with the selection of cereal, dairy products, etc.  It is really only good for the necessities like eggs and milk.  Plus it is always crowded since the store is small and it is hard to find what you are looking for."}, "09": {"date": [2015, 8, 9], "rating": "3", "description": "I shop here because of convenience and nothing more. Produce quality is inconsistent and grocery items are incredibly overpriced. I'm sure the owners feel they can charge for such convenience and having such a captive audience. One of the things that bothers me the most is that many of the cashiers wear rubber food service gloves while handling money. The gloves look dirty, many have holes in them, so they are not changed out (magic gloves, if you will). Then they are handling my produce, groceries, bags etc. I get it, money is gross...but CHANGE YOUR GLOVES. Dirty gloves do not help anyone I adore supporting local businesses, but for my grocery needs, I am counting the days until Whole Foods opens down the street. Better product, more variety and definitely more helpful and customer focused staff. Also, salad bar.I will be sorry to see a local neighborhood grocery store go out of business when a large corporate vendor moves in down the street, but I feel you brought it on yourself."}, "29": {"date": [2014, 8, 29], "rating": "4", "description": "Yesssss I love hyde park produce!If you want a really unassuming, good sandwich, the deli is fresh and the staff is friendly. You also get a piece of fruit with your lunch!The produce is super cheap, but the packaged goods are really pricey. I always get my pita bread from here though--only like two bucks.THE TRAIL MIX IS JUST SO GOOD THOUGH. Seriously. I hate raisins but I love the raisins in this trail mix. I dream about these nuts and berries."}, "19": {"date": [2014, 9, 19], "rating": "5", "description": "Love this place! I zip through and get everything I need at great prices, pay the total bill plus  $3 and voila! My groceries are delivered to my top-storey walk-up!"}, "01": {"date": [2015, 1, 1], "rating": "5", "description": "I love HPP! Great produce at great prices. And the staff is helpful and pleasant."}, "30": {"date": [2015, 8, 30], "rating": "2", "description": "Huh, really surprised by the good reviews. Overall impression from shopping here all the time (due to proximity) is that while the produce section might be cheaper than the other closest grocery store in the area (Treasure Island), the quality is lacking. Fruits (esp. apples) often appear to have gone through some rough times in transport as a lot of them are bruised and scarred. Vegetables noticeably age a lot faster than produce from Treasure Island (esp. herbs). The one thing I really like is that they have Valentina Sauce, my absolute favorite Mexican salsa picante. Almost tempted to up one star, but will refrain from biased reviews."}, "15": {"date": [2014, 10, 15], "rating": "4", "description": "I LOVE Hyde Park Produce!! This small, neighborhood produce market offers fresh quality produce and a decent size selection of health foods and international foods. The staff is friendly and approachable and the prices are JUST RIGHT. They also have a nice hot bar and cold bar. Each day they have fresh sushi provided by The SitDown (next door) so you can get your quick sushi fish and KNOW that its fresh and yummy. Hyde Park Produce may not be \"as good as it gets,\" but its pretty darn close!"}, "07": {"date": [2014, 2, 7], "rating": "4", "description": "Convenient if you're just picking up a staple or something you forgot at the real grocery store. Prices seem high and they don't seem to have much outside the produce section, which is the largest part of the store. Hot bar is pretty good if you catch them early before the plantains dry out. Good service from the workers back there though. They always prompt me to try them first if they think they look a little dry. 1/3 times they were edible and delicious. Store is a navigational nightmare though."}}, "times": {"Wed": ["8:00 am", "8:00 pm"], "Sun": ["8:00 am", "6:00 pm"], "Fri": ["8:00 am", "8:00 pm"], "Tue": ["8:00 am", "8:00 pm"], "Mon": ["8:00 am", "8:00 pm"], "Thu": ["8:00 am", "8:00 pm"], "Sat": ["8:00 am", "8:00 pm"]}, "number_of_reviews": "188", "longitude": -87.5954072695776, "address": ["1226 E 53rd St"], "latitude": 41.7998676162039, "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Wheelchair Accessible": "Yes", "Parking": "Street, Private Lot"}, "categories": [["Fruits & Veggies", "markets"], ["Grocery", "grocery"]]}, "grounds-of-being-the-divinity-school-coffee-shop-chicago": {"rating": "4.5", "neighborhoods": ["Hyde Park"], "price": "$", "comments": {"11": {"date": [2015, 11, 11], "rating": "5", "description": "They serve Colectivo coffee, and the small is only one dollar. That is all you need to know."}, "10": {"date": [2013, 11, 10], "rating": "5", "description": "Coffee: Very goodFood: Fine. The pizza is overpriced. Cheaper pizza would be nice. Service: That girl Kylie is pretty nice I guess. Staff Competence: Very competentDecor: The decor would be much improved with the addition of some Sei Smith artwork. Check him out! Downsides: Cash only.Upsides: You might see Wendy Doniger."}, "13": {"date": [2012, 2, 13], "rating": "4", "description": "wide variety of choicesgreat hangout place. not so tainted by hipster culture"}, "01": {"date": [2012, 4, 1], "rating": "5", "description": "Please, please don't ever go here... because you'll probably ruin it.  This hard to find dungeon within the bowels of a historic religious iconic structure on the campus of the UofCHi can get hot around the lunch hours.  The smells of espresso, local indian/thai food, chai tea and college angst billow from their corridor.  Delicious, cheap, hip, friendly, convenient, smart...  Like I said, don't go here, you'll probably just ruin it"}, "15": {"date": [2012, 8, 15], "rating": "4", "description": "Why go to Grounds of Being for coffee?Alterra quad latte on the UChicago quad for under quad dollars.Quad stars, qu(a)d erat demonstrandum."}, "14": {"date": [2015, 3, 14], "rating": "4", "description": "They are vegan-vegetarian friendly which is super nice. They definitely have the best and cheapest coffee on campus! This is definitely the best cafe on the UChicago cafe. One downside though is that they only take cash. THEY DO NOT ACCEPT CREDIT CARDS. Besides that, they are great. They are located in the basement of the divinity school which gives it a very cool atmosphere! The workers there are such sweethearts and so amazing. One last note, their coffee is only a dollar... Perfect!"}, "17": {"date": [2013, 7, 17], "rating": "5", "description": "I don't know what all these haters are on about, saying it has fallen off in the past years.  The divinity school has THE BEST Iced Coffee in Hyde Park.  Large Iced Coffee with minimal ice (more if you ask), 2.25.I drink iced coffee at least 5 times a week winter and summer; it does not matter.  I have been to 57th street, zh, medici, all the ones on campus, that place on 62nd that I cannot recall, etc.  Each cafe's iced coffee paled in comparison to that of Grounds of Being.  Not only is it delicious, flavorful, but it is brewed strong.When I say strong I mean *strong.*  I once drank half of it in the first 15 minutes of a Dr. Schweiker lecture on Christian Theological Ethics (ugh) and I was tunnel-vision in the zone--best notes I have ever taken.  I was never a regular coffee drinker (read: I never \"needed\" coffee to to work etc), but damn, this stuff works.To those complaining about the Div School food, it is delivered daily in the morning from local restaurants similar to other cafes on campus.  The chicken tandoori sandwich rocks, but the falafel sandwich tends to be dry in my opinion.You can't knock the div cafe from supplying the same local food as other campus cafes."}, "23": {"date": [2014, 5, 23], "rating": "4", "description": "For sure the best coffee shop on campus. Service is pretty decent, and there is nothing like walking downstairs into the nice warm basement on a cold dark morning before class. The food is more or less the same selection as Cobb and Harper, the only difference being that here you have to pay in cash. I give this place four out of five stars because if I could use my credit card (I only ever carry cash when I make up my mind in advance to come to the div school) I would be down there every day grabbing a cortado. Oh yeah, speaking of which. These student baristas ARE THE BEST because they actually know how to make drinks!!! It's awesome not to have to explain the difference between a macchiato and a cortado or a latte and cappuccino. It's great."}, "19": {"date": [2014, 3, 19], "rating": "5", "description": "My favorite coffee shop on campus. I cannot say enough good things about the Div Shop -- a hidden gem on campus with affordable coffee. I like the hail mary a lot and the staff is always nice and patient despite the long line.There's a reason why it's called \"Where God Drinks Coffee.\""}, "18": {"date": [2012, 8, 18], "rating": "5", "description": "my favorite coffee supply in campus, very flavorful. Nice coffee cups, toogood price. You can also bring your mug/cup for a refill for only $1.a good combination of food. from home made pastry, sandwiches, Asian style box lunch to fruit and yogurt.just remember they are cash only!"}, "30": {"date": [2011, 8, 30], "rating": "5", "description": "YUUMMMMMM FRESH BOXED LUNCHESSSGotta get them fast while they're still fresh (~10:30-11am), because the good ones disappear in a flash."}, "28": {"date": [2014, 6, 28], "rating": "5", "description": "Best coffee I had in Chicago! Got a vanilla breve (a cappuccino made with half & half) and it was DELICIOUS! The staff is friendly and accommodating and the coffee is very affordable! This coffee shop made me want to go to U Chicago. Love it!"}, "29": {"date": [2012, 12, 29], "rating": "4", "description": "Div School coffee is easily the best on campus, both because it IS fundamentally good and also because there isn't much competition. I'm a regular (usually I come at least every other day), and I either order a medium cappuccino or regular coffee. The vibe is vibrant and cozy, the baristas are friendly, and there's generally good music playing. There are only a few tables in the actual cafe itself, but there's a separate next door full of tables that are usually entirely occupied at noon.I either come during the morning or the afternoon. Sometimes when I feel indulgent I get the rice pudding from Cedar's, which is only one item among the plethora of other premade appetizers, snacks, desserts, and entrees. Div School probably has the largest catering selection of any campus cafe. I've tried hot entrees on two occasions and haven't been disappointed.Two of my complaints would be that a) they close WAY too early, 4 PM! and b) they only take cash."}, "27": {"date": [2012, 5, 27], "rating": "4", "description": "You can get a small cup of coffee for a dollar, so this place is perfect for a little caffeine fix. And for a tiny basement coffee shop, they also have a pretty extensive selection of food from local places like Rajun Cajun, Cedar's, Siam Thai and Medici among others; though the food is kind of over-priced for the portion size in comparison to the actual restaurant. Also the hours are also kind of disappointing (only open until 4 on weekdays, except wednesdays open until 8). The overall atmosphere is pretty cool though, the employees are super nice and there are tons of study areas in vicinity. It is located in the basement of an arcane building on the south-west quad, thus the secludedness of its location gives this place a special charm."}, "21": {"date": [2012, 11, 21], "rating": "4", "description": "Excellent coffee, lattes. Friendly staff. Also good cheap take out from nearby restaurants. Cheap granola bars and drinks too. Did I mention the friendly staff? My regular coffee stop."}, "07": {"date": [2013, 1, 7], "rating": "5", "description": "There is nothing more comforting than a vanilla latte from the Div School on a cold UChicago day... Also adore their chai.  Occasionally they run out of soy milk, but I love their drinks so much that I just settle for nonfat.  Prices are inexpensive and the samosas (supplied by Rajun Cajun!) are amazing and if you get two of them, they can actually serve as a quick meal in between classes for those busy pre-finals days... I wish they still offered the bibimbap from the Korean restaurant in HP but they seemed to stop serving it during my final year of college.Pro-tip: Do not, ever, by any means, sit in the lounge close to the stairs. I did this as a first year and was immediately yelled at by a divinity school graduate student, who very seriously explained to me that it was reserved for graduate students.  One of the scariest moments of my undergraduate career."}}, "times": {"Wed": ["7:45 am", "4:00 pm"], "Sun": [], "Fri": ["7:45 am", "4:00 pm"], "Tue": ["7:45 am", "4:00 pm"], "Mon": ["7:45 am", "4:00 pm"], "Thu": ["7:45 am", "4:00 pm"], "Sat": []}, "number_of_reviews": "35", "longitude": -87.6001329930437, "address": ["1025 E 58th St"], "latitude": 41.7890248388694, "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Outdoor Seating": "No", "Good for Working": "Yes", "Accepts Credit Cards": "No", "Wheelchair Accessible": "No"}, "categories": [["Coffee & Tea", "coffee"], ["Bagels", "bagels"]]}, "harper-cafe-chicago": {"rating": "5.0", "neighborhoods": ["Hyde Park"], "price": "$", "comments": {"13": {"date": [2015, 3, 13], "rating": "5", "description": "Harper cafe is such a hipster cafe. They have a fridge full of food from different hyde park restaurants like the Nile, and B'Gabs Goodies. Their coffee is meh but after 12, they give it out for free. They also have some pretty tasty desserts; they have a giant Oreo... It's great. I absolutely love the atmosphere and the music they play! All of their employees are super super nice. In addition to all that, their tea selection is on point!"}, "20": {"date": [2015, 3, 20], "rating": "5", "description": "Harper library is right next door, so Harper Cafe is automatically awesome by its proximity alone. I must echo the previous comment in that this cafe gives off the epitome of a hipster vibe; being a hipster seems like a requirement to work here. I won't hold it against them though (it is a college library cafe after all, and it really just creates a sense of whimsicalness).The tea is pretty great, made from tea leaves, not tea bags. There are big comfy chairs (though they're always occupied in the daytime). They have a good option of prepared foods in their fridge (from Rajun Cajun, Siam Thai, The Nile, etc.) and a wide selection of baked goods. All reasonably priced. Basically a very well-stocked library cafe, making it really easy to literally hibernate 24/7 at Harper library when you're studying. Harper Cafe makes leaving the building unnecessary ."}}, "times": {"Wed": ["9:00 am", "12:00 am"], "Sun": ["12:00 pm", "12:00 am"], "Fri": ["9:00 am", "5:00 pm"], "Tue": ["9:00 am", "12:00 am"], "Mon": ["9:00 am", "12:00 am"], "Thu": ["9:00 am", "12:00 am"], "Sat": []}, "number_of_reviews": "2", "longitude": -87.5987244, "address": ["1116 E 59th St.", "3rd Floor"], "latitude": 41.7879028, "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Wi-Fi": "Free", "Outdoor Seating": "No", "Good for Working": "Yes"}, "categories": [["Coffee & Tea", "coffee"]]}, "cobb-coffee-shop-chicago": {"rating": "3.5", "neighborhoods": ["Hyde Park"], "price": "$", "comments": {"02": {"date": [2010, 11, 2], "rating": "3", "description": "Cobb is a university staple. full of thai food, hipsters, and bottomless coffee for $1.25. i crave it. When cleaning out a barn in Pennsylvania with friend who used to work there, we came across a dead mouse. She promptly picked it up and threw it outside without a grimace, and only the comment of \"There are a lot at Cobb.\" That being said, the food is delivered in sealed plastic containers daily and has not deterred me."}, "03": {"date": [2011, 9, 3], "rating": "4", "description": "Well, I will say the coffee passes with a B+.  The food from all over the place allows for a selection second to practically nobody, A-.  Freshness of the food is standard, but you don't notice that because it's really tasty and at least made that day, I think.Bottom line:  Perfectly awkward atmosphere deep in the belly of one of the older buildings on the U of C campus.  Please allow time to people watch/stare at hipsters.  Bring your skinny pants if you can, otherwise just try to mumble some excuse when you pay and you may get a discount/not get poked in the eye.  They do take credit cards, and the music is usually good, and sometimes worthy of having your 'shazam' iphone ap at the ready, but just dont let anybody see you Shazaming or they'll know you didn't already have that album before they did.All I'm saying is, go here to get food and drink coffee or study or whatever, but if you try to change anything about this place you'll be stepping all over my soul with your big stinking ballet flats."}, "09": {"date": [2009, 12, 9], "rating": "3", "description": "Ah, Cobb coffee shop.  I spent many an afternoon holed up at one of the little round tables at this uchicago institution, huddled over my computer with a cup of mud - I mean coffee - to get me through the day.  Located in the basement of Cobb hall on the west side of the main quadrangle, this place is known to all students for its hipster ambience, bizarre (to be nice, we could call it eclectic) selection of music and the snarky attitude one gets from the staff - if one gets attention at all.  But when you are a poor, exhausted college student, all that matters is one thing - strong, cheap coffee.  And you get that here, I think its something around 1.25 for a 12 oz cup of coffee, 1.00 for a cup of tea.  Cheapest prices on the campus. They have mugs you can borrow - eesh - or if you bring your own, you get like a quarter off your coffee AND you can even stow it there.  The place is frequented by undergrads, some hospital staff and possibly a few of those rare Hyde parkers that are not uchicago affiliated. A good place to go if you're strapped for cash - if you can handle the music, and if you make it through the crowd of hipster generated smoke outside the entrance to the building."}, "15": {"date": [2013, 5, 15], "rating": "4", "description": "Staff Friendliness: Very friendly, open, and kind. Staff Competence: Moderately competent (Kareem is very helpful) Coffee: Very bad. Very. Bad. Lunch: Very  bad. (I like the tilapia plate though) Breakfast: Never tried. (Always go to Div School)Decor: Love the Melville posters. Interesting art by Sei Smith. Worth checking out!!Location: Basement."}, "14": {"date": [2014, 8, 14], "rating": "5", "description": "do you need something? they got itdo you want someone? they're theredo you have to run? you won't get fardo you hunger? nevermorethirsty? obviousNO CHURCH IN THE WILD"}, "17": {"date": [2013, 10, 17], "rating": "4", "description": "Upon entering the dreary entrance of Cobb Hall and taking the stairs you met with a cacophony of sounds. Walking into this UChicago staple you see the entire hipster population gathered around rickety tables, discussing Kant and Rousseau with cups of coffee and food from local restaurants. It's an interesting environment to say the least. Sometimes the line will be short and you can walk around in your department store clothes with constant. But when the line is long, you feel drastically out of place among the thrift shop aficionados as you hear the weird audiobook about ghosts playing over the soundsystem. The food is what draws me here; the environment, not so much. The idea that, without ever leaving the Quad, I can eat delicious Thai, Indian, or Mediterranean foods is wonderful. It makes the days I pack my lunch seem like prison meals. What I recommend: the options from Rajun Cajun. The heating lamps keep the curry warm and delicious."}, "05": {"date": [2014, 3, 5], "rating": "4", "description": "In terms of on campus dining this place has one of the larger and vegetarian friendly selections. Lines can be long, if you pay with cash you might get to line jump. Decent beverage selection and fair pricing. Large space, but often filled with students."}, "08": {"date": [2014, 9, 8], "rating": "1", "description": "I really want to love this student hangout under Cobb Hall. But the coffee is bad, the service poor, the counter staff seems to merely tolerate customers, and the music is too loud. Do yourself a favor if you want coffee make the 30 food trip to the Div. School just the next building over. Want interesting take-out food, go there too. Chocolate? Ditto. Friendly if perfunctory service? Div. School.Why go to Cobb?1) It's too cold to travel 30 feet.2) You really like music that is too loud3) You love \"late Soviet Department Store Cafe chic\" ambience."}, "22": {"date": [2015, 7, 22], "rating": "1", "description": "I just walked out of Cobb and am really taken aback by how incompetent the student worker there was. Since the description says it's open until 4:30, I thought I would stop in at about 3:30 to grab a coffee. There are no hours posted on the door. The lights were on, music blaring, doors open, so naturally I assumed they were open and went to the counter. No one was there, and I hung around for a couple minutes but the place seemed empty. As I walked back to the main entrance to leave I noticed a guy stretched out sleeping on the sofa. I said \"excuse me?\" and he stirred long enough to give me a salty look and say \"we're closed\" before rolling over and going back to sleep. I apologized and said it was an easy enough mistake to make since to all appearances the coffee shop was open, and he just ignored me. Despite this employee being insanely rude to me, this whole situation was ridiculous - I could have robbed this place blind while he was sleeping leaving the shop wide open. There are lots of other good coffee options on the U of C campus that are student-run without the childish irresponsibility and selfishness."}, "06": {"date": [2014, 10, 6], "rating": "5", "description": "RJ still needs to turn down his music."}, "21": {"date": [2010, 5, 21], "rating": "4", "description": "The coffee is cheaper and better than the other student run shops (not saying much), and the Plum Cafés on campus (Classics, BSLC, Harris...). The food is cheap. The hipster-watching is fun."}}, "times": {"Wed": ["7:30 am", "4:30 pm"], "Sun": [], "Fri": ["7:30 am", "4:30 pm"], "Tue": ["7:30 am", "4:30 pm"], "Mon": ["7:30 am", "4:30 pm"], "Thu": ["7:30 am", "4:30 pm"], "Sat": []}, "number_of_reviews": "12", "longitude": -87.601059, "address": ["5811 S Ellis", "Basement"], "latitude": 41.7900581, "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Wi-Fi": "Free", "Outdoor Seating": "No"}, "categories": [["Coffee & Tea", "coffee"]]}, "robust-coffee-lounge-chicago": {"rating": "4.0", "neighborhoods": ["Woodlawn"], "price": "$", "comments": {"24": {"date": [2015, 11, 24], "rating": "3", "description": "Nice place! Had the BBQ Betty. It was suppose to be on a pretzel bun, they were out of them so I was offered an onion roll. I must say it was tasty but every bite I wished I had that pretzel bun.  Also Got a piece of Carmel cake that was huge, tasted average and was $5, ugh. Seems like a great place to escape and get some work done, or  study. Nothing else really around it in walking distance."}, "10": {"date": [2015, 11, 10], "rating": "4", "description": "The staff is personable and they gladly accommodate my culinary eccentricities such as the everything bagel with a hard fried egg, lettuce, onion and tomato with light basil cream cheese.  The \"half-priced-after 5,\" freshly-made smoothies are a delight.  As they expand their offerings and space, they have assured me that they shall even better accommodate vegetarians.  We shall see.  In the meantime, I shall order my usual."}, "23": {"date": [2015, 3, 23], "rating": "5", "description": "I've been an avid fan of Robust for years now. The drinks are cheap (or at least cheaper than Starbucks) and I've never had a problem with my order. The sandwiches are great - my go to's are the sausage biscuit and the BBQ Betty. They run a variety of promotions ($5 sandwiches after a certain time, half price coffee at certain times) so check their fb page before you drop by."}, "15": {"date": [2015, 3, 15], "rating": "4", "description": "Quirky, independent local establishment that is great for coming with friends for unique breakfast combinations. Whenever I'm in Chicago my friends and I come here after Mass. Try the bacon waffles!"}, "14": {"date": [2015, 11, 14], "rating": "3", "description": "The Good:- the people behind the counter are fantastic and friendly. Love them all!- great brand of coffee. - cool atmosphere- good location- comfortable- non-dairy milks available- nice selection of baked goods from a local bakery- coffee by-the-pound that they will grind for you- nice selection of smoothies- homemade \"diablo\" syrup is a sweet and spicy coffee flavour they make in house for the Mocha Diablo. - usually quiet,  FREE WIFI! Great to get some work done.- Kid friendly, with a book shelf for reading in your down timeThe Bad:- non-dairy milks are all sweetened, which makes any fancy non-dairy latte TOO sweet after the flavouring is added.- a lot of the food is low quality pre-made mixes and packaged products (pancakes aren't fresh made batter, hummus is pre-packaged, the \"cheese\" is orange american style single slices,  breakfast condiments are just Smucker's jams and pancake syrupetc. Skip the food.)- blended cold drinks are made with a packet of pre-mixed artificially flavoured powders (YUCK. Just skip these entirely)- flavoured coffee syrups are cheap, teeth shatteringly sweet and give your latte a chemical taste. Avoid the flavored coffees (with the exception of the homemade Diablo syrup).I want to love Robust, but I can't give 5 stars because they are lacking in quality and attention to detail. I'll keep going back though, because small local business support is important, and they're still miles better than DD or Starbucks!"}, "17": {"date": [2016, 1, 17], "rating": "5", "description": "Hands down one of the best coffee shops in the city, right up there with Dollop. The coffee is great, the food smells delicious, though I've yet to taste any of the cuisine. The atmosphere is very trendy, but manages to still feel very south side. There are plenty of outlets and seats, although the few times I went, the available seating was limited to the area by the door, because the lounge area was pretty packed.  When I was growing up down the street, I would never have imagined a place this cool and diverse venturing outside of the Hyde Park/ U of C area, but I'm glad they did."}, "16": {"date": [2015, 8, 16], "rating": "4", "description": "Despite having lived within walking distance to Robust for the past year, I never made the short trek there to try it out before now. What a mistake! This spot has delicious food, plenty of seating, and fantastic music playing to liven up the atmosphere. This is a very sunny spot that is perfect for grabbing lunch with a friend or for studying. They have a great selection of sandwiches for lunch- I had the roast beef, which came on an onion roll and was very tasty! I can't wait to come back here again and try out the many yummy-looking pastries and cakes they have on display!"}, "03": {"date": [2015, 10, 3], "rating": "5", "description": "Once, a long time ago and in a suburb far, far away, I accidentally put in about a teaspoon of honey in my newly-purchased dark roast coffee. I chalked this up to an \"oops\" and quickly grabbed the simple syrup bottle instead.So when Robust Coffee Lounge comes along and intentionally sells me a \"honey nut latte\", you've caught my attention. And I wasn't sure if it was in a good way, or a bad way.Short answer: in a good way. The honey and rich coffee work together really well, actually, with the flavors complementing each other and not conflicting. The \"nut\" part of the drink (probably almond syrup) was a nice touch, and I think that was what made the whole thing quite sweet. It's an excellent iced coffee, with a rich sweetness. And it was perfect for a post-run drink. It's a nice place to hang out in, to boot. Woodlawn has a fine coffee shop in its borders."}, "08": {"date": [2015, 9, 8], "rating": "3", "description": "Nice little coffee spot but I wasn't a fan of the London Fog. Honestly just tasted like warm milk and tea... Their sandwiches look really great though."}, "05": {"date": [2016, 2, 5], "rating": "5", "description": "I meet the owners when they were building this cafe. I knew then it would bring new life into a neighborhood with very few social spots to hand out. Robust is a great place to meet with friends and family or to do a quick meeting. They since than have opened a new lounge on 416 W Ontario St. They both are the perfect mix of great coffee, social atmosphere and goooood food. :)"}, "22": {"date": [2015, 7, 22], "rating": "1", "description": "Looks like it could be a nice place but I wasn't pleased with the service....or lack thereof. We walked in to get drinks and ice cream and when I saw the menu I told my kids maybe we'd come in one day for breakfast. We stood at the counter and there was a girl making a drink. Her hair was awesome but she glanced at us and said nothing. We stood around.  A guy came from the back and made eye contact, but said nothing. We stood around. The girl came over and stood there silently. No, \"hello, may I help you?\" Nothing. My son wants to know if they have ice cream. \"Floats.\" He asks again. I try to explain that from her response I assume they only have vanilla ice cream and some sort of flavors of soda. She remains silent. He asks if they have cookies and cream. She shakes her head. Ok, he'll take a cookie. I ask what the shaken lemonade is. It's lemonade with flavors. Ok. We order a lemonade.  I ask how much the boxed water is (because it's fancy and people like to charge ridiculous prices for fancy stuff) She doesn't answer. Ok. \"So you want a cookie, a lemonade and a boxed water?\" No, I wanted to know how much the water is. $2. No thanks. She fresh squeezed (awesome!) the lemonade for my daughter and hands it to me. We walk out and my daughter spits the lemonade out. It's bitter. Unsweetened. Why not mention that? We go back in for sugar.  Maybe I asked too many questions. Maybe I wanted more because I'd just run 3 miles or maybe it was because I kept seeing this place and saying I was going to stop in. Whatever it was, I wasn't pleased with the service.  I've had a bad week dealing with UPS and Comcast, I want a smile and a hello at the local coffee shop, I guess."}, "25": {"date": [2015, 9, 25], "rating": "5", "description": "Great place for studying. Lots of room and everyone is super nice. Their mocha is amazing. Plus, the breakfast sandwich I ordered was made fresh. It was so good! My friend didn't love the mocha because she said it was too sweet, but I think a little sweetness it deserved with chocolate. She did love the apple donut though! I can't wait to return!"}, "07": {"date": [2015, 5, 7], "rating": "4", "description": "Nice small place to get some coffee and baked goods. Their sandwiches aren't bad either! Definitely worth a try."}, "18": {"date": [2014, 5, 18], "rating": "5", "description": "For someone who studies so close, it's a shame that I hadn't visited Robust more often. This cafe is thankfully relatively not crowded and mostly devoid of students so it's a lovely escape from academia. It's a relatively small place but that adds to it's charm. Numerous tables near outlets and free wifi make this an excellent place to do work beyond the confines of a library. It's a lot quieter than a Starbucks, even with music playing, Their coffee is excellent and decently priced. But lemme tell you about their Rueben: A+. Just the right amount of corned need and cabbage. So delicious. I'm actually sad that I have been living so long without it. If you're in the area, come on by. You won't regret it."}, "21": {"date": [2015, 6, 21], "rating": "5", "description": "Great stop for quick coffee an sandwich I will be a frequent customer sandwich was fresh an coffee was good on top of all of that great setting"}}, "times": {"Wed": ["6:00 am", "8:00 pm"], "Sun": ["7:00 am", "7:00 pm"], "Fri": ["6:00 am", "8:00 pm"], "Tue": ["6:00 am", "8:00 pm"], "Mon": ["6:00 am", "8:00 pm"], "Thu": ["6:00 am", "8:00 pm"], "Sat": ["7:00 am", "7:00 pm"]}, "number_of_reviews": "116", "longitude": -87.5962316, "address": ["6300 S Woodlawn"], "latitude": 41.7805013, "attributes": {"Take-out": "Yes", "Wi-Fi": "Free", "Alcohol": "No", "Caters": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Takes Reservations": "No", "Delivery": "No", "Ambience": "Casual", "Bike Parking": "Yes", "Has TV": "No", "Good For": "Breakfast", "Parking": "Street", "Attire": "Casual", "Waiter Service": "No", "Good for Working": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes", "Good for Groups": "Yes", "Wheelchair Accessible": "Yes"}, "categories": [["Breakfast & Brunch", "breakfast_brunch"], ["Coffee & Tea", "coffee"], ["American (Traditional)", "tradamerican"]]}, "ex-libris-chicago": {"rating": "4.0", "neighborhoods": ["Hyde Park"], "price": "$", "comments": {"12": {"date": [2015, 3, 12], "rating": "4", "description": "Ex libris is a pretty nice little coffee shop inside of the reg! They have pretty good desserts and coffee. My favorite thing by far about this place is the number of vegan/vegetarian lunch options that they have. Their staff is also super nice and sweet. They are pretty speedy. They have a nice tea selection. I guess the one thing that I don't really like is the atmosphere of this place. There are barely any electric plugs and the table for the sugar and the cream is placed in such a weird awkward spot."}, "30": {"date": [2014, 8, 30], "rating": "4", "description": "I really love Ex Lib! Perfect place to study if you need background noise, really great baristas. Anyone who feeds my caffeine addiction is okay by me. They'll remember your order if you go often enough, and they don't pass judgment during finals week when you look your absolute worst (or at least, they don't show it)."}, "15": {"date": [2015, 1, 15], "rating": "5", "description": "Ex Libris is always a great place to hang out, drink coffee with friends, do homework, sleep, or chat. Basically a paradise for students when they have nothing better to do. Being a barista there also enhances this experience but that aside, I'm still a loyal customer at Ex Libris for the occasional snack during studying times. Many cheers to the baristas (my co-workers) and my managers for a job well done in always making Ex Libris functional =) Ya'll are like family to me!"}, "29": {"date": [2012, 12, 29], "rating": "4", "description": "This place is...okay. The coffee in and of itself is all right (nothing outstanding), but it beats a lot of the other not-student-run cafes on campus, like Classics. I think Ex Libris might be second only to Div School coffee, but Div School coffee still wins by a long shot.For one, it's menu isn't particularly substantial. Don't get me wrong, that's not an issue, but the quality of the drinks it DOES have are only okay. I've tried all the different brews of coffee, cappuccino, latte, cafe au lait, and mocha. My favorite has probably been the cappuccino, which, depending on your barista, can be hit or miss. For the most part, I've had luck with the cappuccino, and they take around 2-3 minutes to make it.Its proximity to the study areas in the Reg and Mansueto libraries is what makes Ex Libris a good place to get a cup of joe before a lengthy study session. Some people actually prefer to study in the cafe itself, which has a decent number of chairs and tables, and is always bustling, but usually not ever TOO noisy."}, "09": {"date": [2009, 12, 9], "rating": "4", "description": "How to get there: walk into the front doors of the intimidating Regenstein library on 57th street.  Hang a left rather than heading into the library itself, and you'll see a little sign above a door - Ex Libris.  Head down one flight of creepy stairs and enter coffee shop heaven.  This is my favorite campus coffee shop.  When my taste for coffee matured to the point that I no longer cared to tolerate the sludge served at Cobb, and didn't mind spending an extra 25 to 50 cents to get better coffee, I started spending long afternoons loitering here, amidst the other grad students, study groups and writing tutor meetings. Its not uncommon to hear folks chattering in poorly American accented Farsi or Italian.  (Funny thing is, I think they use the same coffee as Cobb - I guess the hipster bitterness at Cobb taints the coffee they serve).A well-lit, calm atmosphere.  The music played by the staff here is not boring in the yawn sense, but its also not boring in the drilling-a-hole-in-your-brain-due-to-pure-hipster-ridiculousness sense.  A selection of microwaveable lunches from various catering services as well as cookies, chips and other snacks await you, along with glorious hot coffee all day long.  And for you night owls, they're open till 11:30 PM Sunday through Thursday.  Ex Libris: making long afternoons and nights at the \"reg\" tolerable since the '70s.PS: I'm marking the wifi as \"paid\" because you need a uchicago login to access it - at the low rate of approximately 50K a year!"}}, "times": {"Wed": ["8:30 am", "11:30 pm"], "Sun": ["11:00 am", "11:30 pm"], "Fri": ["8:30 am", "5:00 pm"], "Tue": ["8:30 am", "11:30 pm"], "Mon": ["8:30 am", "11:30 pm"], "Thu": ["8:30 am", "11:30 pm"], "Sat": ["11:00 am", "5:00 pm"]}, "number_of_reviews": "5", "longitude": -87.5997925, "address": ["The Joseph Regenstein Library", "1100 E 57th St"], "latitude": 41.7915154, "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Wi-Fi": "Free", "Outdoor Seating": "No", "Parking": "Street"}, "categories": [["Coffee & Tea", "coffee"]]}, "pork-chop-truck-chicago": {"rating": "3.0", "neighborhoods": ["Hyde Park"], "price": "$", "comments": {"18": {"date": [2014, 10, 18], "rating": "4", "description": "Another restaurant whose food truck is sufficiently better than the restaurant experience that it deserves it's own entry.  And once again the category is barbeque.  Maybe that's a good working rule, because barbeque keeps relatively well under truck conditions, and is relatively flavorful even without much manipulation.  In any event, revealed preferences demonstrate high praise: this is the first Chicago food truck I've ever eaten at more than once."}, "30": {"date": [2014, 12, 30], "rating": "4", "description": "Had the grilled cheese with the pulled chicken.  Really balanced and juicy.  Excellent service.  Nicely done."}, "12": {"date": [2015, 3, 12], "rating": "1", "description": "This is for a review on 3/12/15 at Daley Plaza food truck fest. We stood in line for about 20 minutes to find out they were out of macaroni and cheese and chips. The menu was not corrected and no one from the truck uttered a word. I suggested they cross off items no longer in stock and the guy taking orders could've cared less. Keep in mind this event started at 11am and we were in line by 12, so in one hour the truck  began running out of menu items. I left and went to another truck. This line was longer but more courteous. They too began running out of menu items but they had the decency to tell people in line and were apologetic."}, "01": {"date": [2015, 5, 1], "rating": "4", "description": "Tried the grilled cheese with pulled pork on Texas toast, rib tips, macaroni and cheese, and cornbread from the truck at the Daley Plaza food truck fest today.  While the grilled cheese would be more accurately described as a pulled pork sandwich with a bit of cheese, I was impressed with all items.  The ribs were tender and flavorful, ditto the pork.  The Texas toast held up to the cheese and bbq sauce without disintegrating the way normal bread might. The macaroni and cheese had a distinctly meaty taste to it (in a good way) and the pasta was cooked to a perfect al dente.  The corn bread was a dense brick of moist, tasty goodness. Easily the best corn bread I've had in the loop.  I'll definitely keep an eye out for the Pork Chop Truck to return."}, "05": {"date": [2015, 6, 5], "rating": "1", "description": "Rude af. I don't get why some business owners see customers as an imposition, but I suppose that's how they must appear to (the person I assume to be ) the proprietor of this truck: No greeting, questions answered curtly & coldly, Styrofoam food boxes and chip bags  *literally* flung down on the pickup/order window sill with disdain. I don't think it was just me, either: I lurked around out of morbid curiosity, and it was the same surly routine with the group of people who were behind me in line. Perhaps this guy is just in a bad mood because he dreamed of working at the DMV, but got stuck being his own boss and owning his own business instead. I dunno, whatever.    Anyhow, the signature item, the pulled pork and grilled cheese sandwich is aight. Just aight. Comes on Texas toast, super greasy. Potato chips available as a side, along with cans of warm soda pop. Probably a 2.5 star sandwich, but the unpleasantness of the interaction knocks it down to a 1-star experience. I rarely give those out, but this place sure earned it."}}, "number_of_reviews": "5", "longitude": -87.5910263568095, "address": ["Hyde Park"], "latitude": 41.7941679923491, "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "categories": [["Food Trucks", "foodtrucks"]]}, "zberry-chicago": {"rating": "4.0", "neighborhoods": ["Hyde Park"], "price": "$", "comments": {"24": {"date": [2014, 10, 24], "rating": "4", "description": "I've got 3 flavors for you sea-salt caramel, cake batter and.watermelon. The staff is always friendly and helpful. No U turns on this street if you are trying to beat closing time, because you might get a ticket. I'm just saying....thanks officer I promise I won't do it again..."}, "10": {"date": [2015, 8, 10], "rating": "4", "description": "Today, I HAD to grab some frozen yogurt b/4 picking up my grandma (for a grocery shopping trip).  I go out my way to visit this place as often as possible. The price is pretty reasonable in comparison to other yogurt shops. It would be nice to have more than four or five flavors and switch it up. However, no big deal. I'll continue to visit two to three times a week.. Good eats!"}, "13": {"date": [2015, 11, 13], "rating": "1", "description": "Nothing fancy, too small, everyone crowding in a tiny corner for yogurt.  Tables outside were never clean, Basic flavors, toppings aren't that fresh- bees & gnats constantly around the syrups & fruit,  blueberries look almost rotten, their belly on the iPad is never working, just a waste of time in bourgeois Hyde Park. There are better fro yo places with real cake batter froyo."}, "12": {"date": [2014, 6, 12], "rating": "5", "description": "With the addition of multiple new froyo places to Hyde Park, I really hope that ZBerry will stay! Locally owned (don't be surprised if you run into the owner herself in the shop), this froyo shop is a great place to hang out when it's hot. Ask to get a loyalty card when you're here.The peanut butter flavor is delicious. They have a huge variety of toppings, including mochi, gummy bears, chocolate chips, and fresh fruit.The lever in the middle is always a swirl/mix of the two flavors on either side. Also, ask the front desk for free sample cups if you're stuck between a few flavors!"}, "15": {"date": [2015, 7, 15], "rating": "3", "description": "The tart flavor was extremely watery and disappointing. The watermelon and cake batter flavors were, however, pretty good."}, "14": {"date": [2014, 9, 14], "rating": "4", "description": "Cheaper than most self-serve frozen yogurt places I have frequented and they have a rewards program. I like that it is a minority-owned business or at least the majority of people working there are people of Color.  The young staff (probably students) were very polite, friendly, and answered all of my questions with satisfaction.   The pink lemonade, peach, pomegranate, and white chocolate are my favorites so far.  I just wish they would rotate their flavors more frequently and get some lower calorie flavors (like the Greek plain tart that Red Mango carries)."}, "04": {"date": [2015, 4, 4], "rating": "4", "description": "This place is good. It has lots of flavored and toppings. The only down side to this place is the customer service; the people at the register often seem annoyed. Also the general seating area is very small, so if you do want yogurt I would recommend taking it to go."}, "23": {"date": [2015, 8, 23], "rating": "5", "description": "Staff is friendly and never annoyed when you ask for samples. Happy this place is around and lucky to have it in Hyde Park!"}, "18": {"date": [2012, 3, 18], "rating": "4", "description": "I'm in love. This is a 4.5 star review. I'd give it 5, but I would love even more to have more flavors of yogurt available.The cake batter mixed with coconut is to die for. The raspberry chocolate is also delicious. I love the big chunks of oreos in the toppings bar. Like others say, the price is a bit high. However, I am grateful we have a fro-yo place in Hyde Park for when I am craving it. Too bad I now crave it all the time since going to Zberry!"}, "31": {"date": [2014, 5, 31], "rating": "4", "description": "The yogurt was great! I'm pretty sure it's a family-run business and I'm happy to support them. The woman at the register is friendly and helpful. The only downside about this place is that there aren't a lot of froyo flavors, but it's still pretty good."}, "09": {"date": [2014, 8, 9], "rating": "2", "description": "I wanted to really love this place because, whoa, finally a frozen yogurt place in Hyde Park! I'm a huge froyo junkie, so obviously I had to stop by ZBerry to give it a whirl.The flavors are nothing special and the toppings aren't particularly fresh or bountiful. I was unimpressed by my froyo and wilting raspberries, which cost more than I expected. When in a lunch and craving froyo, I would return, but ZBerry leaves much to be desired. The space of the storefront is small and cramped. It's difficult to maneuver around the awkwardly positioned froyo machines in the back when there are multiple people. Lots of accidental elbowing of people in front of us dispensing sweet treats. Put another way, I'm happy Hyde Park has froyo, but I'm not impressed."}, "29": {"date": [2015, 8, 29], "rating": "4", "description": "Great staff! Great prices! I love the personal and attentive service and will patronize this location in the future."}, "01": {"date": [2014, 3, 1], "rating": "4", "description": "The place is small but definitely stylish. They have a variety of flavors and switch them up often. I wish you could check online to see the flavors they have for the day or week.  The fro-yo station can get messy. The person behind the counter should check it regularly. And it's self serve so it's a little understandable. But other than that it's pretty cool. They have a few chairs around so you can relax and enjoy your treats. It's definitely a great addition to Hyde park. The fro yo is good I haven't had a flavor I didn't like."}, "26": {"date": [2014, 6, 26], "rating": "5", "description": "I absolutely love Zberry! Great yogurt selections that change frequently, awesome toppings bar, friendly staff, and late hours in the summer!"}, "05": {"date": [2013, 7, 5], "rating": "4", "description": "I love that this is in Hyde Park especially during the hot Chicago summers! It's so conveniently located on 53rd street. There's not a lot of variety --- 6 or so and it doesn't change that often but the owner really cares a lot about her customers. It's not absolutely the BEST froyo I've had but it satisfies my sweet tooth at a good price :) The cake batter is my favorite."}}, "times": {"Wed": ["11:00 am", "9:00 pm"], "Sun": ["11:00 am", "9:00 pm"], "Fri": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "9:00 pm"], "Mon": ["11:00 am", "9:00 pm"], "Thu": ["11:00 am", "9:00 pm"], "Sat": ["11:00 am", "10:00 pm"]}, "number_of_reviews": "70", "longitude": -87.5923412293196, "address": ["1368 1/2 E 53rd St"], "latitude": 41.7995379120111, "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Wi-Fi": "Free", "Parking": "Street"}, "categories": [["Ice Cream & Frozen Yogurt", "icecream"], ["Do-It-Yourself Food", "diyfood"]]}, "sip-and-savor-chicago": {"rating": "4.0", "neighborhoods": ["Hyde Park"], "price": "$", "comments": {"11": {"date": [2015, 11, 11], "rating": "5", "description": "I've frequent this coffee shop often because I work less than two blocks away. The customer service is simply wonderful! I've had there coffee, frappuccino, pastry, and breakfast sandwiches. My favorite drink is the kiwi pear tea and the cheese danish! It so delicious! Great place to have a bite to eat and grab a drink with a friend!"}, "03": {"date": [2015, 11, 3], "rating": "3", "description": "This place advertises that they have food, but when I entered I found there really wasn't any food to be found other than your standard run-of-the-mill coffee shop muffins and scones and such. The baked goods looked alright and were pretty substantially sized so I decided to order a café au lait with some extra expresso. The reason they get three stars is 1. The food thing. Why is it advertised as being this place for food when there really isn't any? Maybe it was just because it was late in the day? and 2. My coffee was COLD. Like not ice cold, but just under the temperature you'd prefer to be drinking your coffee drink at. Like someone had made a pot and just let it sit around for a few hours. By the time I finished my short four minute walk to Shoreland, my coffee was almost too cold to drink without being super gross.Their drink menu is clever and the descriptions sound tasty, but I wasn't impressed."}, "13": {"date": [2015, 10, 13], "rating": "5", "description": "Really enjoyed the turkey breakfast sandwich & the banana mocha is delicious. Little heavy on the mocha, but who's complaining about too much chocolate?! Much better than your major chain coffee shop & a plus to know you're supporting small/local owned business. I will say they could have more than one barista to open just because some people were in a rush with their commutes. In the same vein don't come in there expecting drive through speed.. Doesn't work like that. Also, lot of space for sitting w friends or studying solo. And the music was great!"}, "09": {"date": [2015, 6, 9], "rating": "2", "description": "What in the world... whoever this girl is that worked here on June 9th 2015 at 3 pm... I ordered a mocha, paid, took a seat... and she also took a seat behind the counter and looked at her phone for damn near 10 minutes before I had to go up to her AGAIN and ask here where my drink was. Why did she not immediately start making my drink? I was the only one who ordered anything, everyone else (like 4 other people) were sitting down...I understand having poor memory sometimes, but this was.... ridiculous...She gave me a medium tho, from a small..."}, "06": {"date": [2015, 8, 6], "rating": "5", "description": "Hey Kate L from San Francisco: You Sure Sound Like You're From San FranciscoAnyways, I had a latte for a little over $4 (with almond milk (for those who are lactose intolerant (and allergic to soy (really, it's not my fault))) and that was good. I took off the lid to put in sugar, I put in sugar, and then I put the lid back on the sugar shaker. I couldn't find napkins to wipe off the sugar shaker. Where are the napkins? Then I unwrapped a stir stick to stir my latte. I threw away the stick by accident so I had to unwrap another. Later I bought a scone for a little under $3.If you've been keeping score, that means a latte and a scone cost $7. It was a strong (and good) latte so I guess that's okay and the scone was pretty big. Not one of those Scam Scones from Starbucks which are at least $1.50 and the size of a quarter (I am exaggerating). Anyways, cafe's costs are prohibitive from going daily - but what cafe isn't  and this cafe is a nice one.As a last comment, the music was actually good and picked well. Maybe this is the only cafe I'll go to for the rest of my life. Every other cafe either has:1. An insufferable mix of whiny indie folk2. Something that somehow, manages to be worse, yet, still has catchy hooks.Catchy hooks and whiny indie folk aren't good for work, which is what 90% of people who sit in a chair at a cafe do.The music here was some sort of lounge-y downtempo (buzzword). Arguably it might have been generic, but who cares? It fits the atmosphere and it doesn't get in the way and it fits the cool moderately dark ambiance. I can't speak for its music otherwise, but that's the case for when I went."}, "07": {"date": [2015, 2, 7], "rating": "3", "description": "So it's my first time here and the chick that took my order was so rude! Obviously she wasn't friendly but she wasn't welcoming at all. She was slamming everything and gave me attitude when I asked for the banana walnut bread. She was upset or annoyed because I didn't say muffin. Didn't say thank you or come again, just handed my receipt as she was already being rude to the customer behind me. The customer service is half the experience. I had the banana caramel latte and it was so good :) the muffin was even better. I will probably come back but they need to hire people that will appreciate their jobs and act like it"}, "22": {"date": [2015, 12, 22], "rating": "4", "description": "I chose the Sip for a morning meeting because I thought it would be quiet enough at 9 a.m. It was busy, but we could hear each other. The coffee was great. My associate said his pastry was delicious!"}, "16": {"date": [2016, 1, 16], "rating": "3", "description": "Good for a basic coffee shop, butFeels a little sterile and no real specialty. Fine if you need a cup of coffee"}, "23": {"date": [2015, 9, 23], "rating": "4", "description": "I stumbled upon this place on my walk home from work. Amazing drinks! I got the dirty chai which is a chai tea latte with a shot of espresso. They can make pretty much any drink you want which is way better than a Starbucks will do. I did sample their blueberry scone. It was a little too dry for me. I'm going to stick with the drinks! Can't wait to come back."}, "08": {"date": [2015, 11, 8], "rating": "5", "description": "The Sip and Savor just made my coffee so fast. Sunday morning slow for the one barista and one customer, until I came in with 5 minutes until the bus. Poor girl! I had my coffee in plenty of time, and had time to chat about the beautiful interior design of the place with a manager(?). Cheers!"}, "30": {"date": [2016, 1, 30], "rating": "3", "description": "this place has a lot of potential, in a perfect location. If you just want a coffee, that's ok, but for something more, choose another cafe. Sometimes the staff are rude."}, "29": {"date": [2015, 11, 29], "rating": "5", "description": "I just heard about this place & thought I'd try something different than the franchised coffee shops. Nice ambiance, available parking & my banana caramel latte was DELICIOUS!"}, "15": {"date": [2015, 9, 15], "rating": "5", "description": "Great latte and the atmosphere is very relaxing and the food is good."}, "25": {"date": [2014, 8, 25], "rating": "4", "description": "This cute place has a stay a while and chat vibe. While the two young ladies behind the counter were carrying on what seemed like a not so work friendly conversation they quickly broke it up to make my drink. I was happy Almond Milk was among the choices given and while my latte was just as pricey as always it was made quickly and accurately. The place had a cute coffee bar, small tables and some face to face seating near the TV. While it isn't quite spacious enough for the all day coffee and study bindge it is a great mid up spot if your group is 2-3 people"}, "24": {"date": [2015, 10, 24], "rating": "5", "description": "I loved this place! The seating was good cuz they had some comfy chairs and couches plus tables. They have lots of unique flavored lattes and what I got was amazing. The service was good too"}, "20": {"date": [2015, 10, 20], "rating": "1", "description": "Wanted so badly to loved this place because of reviews from family and friends, and because it is black owned... I really hate to give bad reviews but I have to on this café in hopes the service will get better. I walked in and noticed the quiet relaxing atmosphere and was in love, so I thought. I walked to the counter and no one greeted me. Strike one... I wanted to try the Banana nut shake but I'd given the wrong name and boy did they let me know. I was told there was no such shake and nothing even close to a banana nut shake. I saw a new on the counter, apologized for giving the wrong name then asked for a caramel nut shake only to be told, they didn't have any ice cream and couldn't make the shake (it was @12pm on the Tuesday). No one offered an alternate or another type of beverage, nor was I told when they'd have the ingredients to make said drinks. This place is similar to Starbucks so I wouldn't expect they'd not have ingredients to beverages considering that's pretty much all they sell and their specialty (supposingly). If shakes are a seasonal item, I can accept and understand that even after reviewing the menu online and traveling about 15 miles to become a customer. I didn't have the great experience the other reviews had but I am willing to give them another shot and change my review, ONLY if I'm in the area."}, "05": {"date": [2015, 4, 5], "rating": "2", "description": "I live around the corner and often take the 6 bus dowtown, which stops right outside their door. Still, I rarely go in. The coffee is undelicious, the decor is uninspiring, and the food...meh. Wish it were better."}, "04": {"date": [2015, 12, 4], "rating": "5", "description": "Great coffee, free wifi, comfy seats, and friendly people...awesome place!"}}, "times": {"Wed": ["6:00 am", "7:00 pm"], "Sun": ["7:00 am", "6:00 pm"], "Fri": ["6:00 am", "7:00 pm"], "Tue": ["6:00 am", "7:00 pm"], "Mon": ["6:00 am", "7:00 pm"], "Thu": ["6:00 am", "7:00 pm"], "Sat": ["7:00 am", "6:00 pm"]}, "number_of_reviews": "73", "longitude": -87.5838654833576, "address": ["5301 S Hyde Park Blvd"], "latitude": 41.7995707246542, "attributes": {"Accepts Apple Pay": "Yes", "Take-out": "Yes", "Wi-Fi": "Free", "Good for Working": "Yes", "Bike Parking": "Yes", "Outdoor Seating": "Yes", "Parking": "Street", "Accepts Credit Cards": "Yes", "Wheelchair Accessible": "Yes"}, "categories": [["Coffee & Tea", "coffee"]]}, "greenline-coffee-chicago": {"rating": "4.5", "neighborhoods": ["Woodlawn"], "price": "$", "comments": {"11": {"date": [2014, 8, 11], "rating": "5", "description": "The atmosphere at Greenline Coffee is wonderful. On nice days it opens up to the street, and there's a lot of wood and brick, giving it a super comforting feel. More importantly, the fare is fantastic! I had a lemon bar and a fresh-brewed iced tea, both of which were delicious, and I stole a bite of their signature waffles from a friend. They were AMAZING. The waffles are super doughy and fresh-off-the-iron warm, and I've never had anything so melt-in-your-mouth before. Over all, highly recommend the place.A total plus: I had a chat with the owners, and they make a point of hiring local kids from the Woodlawn area, as well as supporting local entrepreneurship. Love it. A++"}, "03": {"date": [2015, 1, 3], "rating": "5", "description": "Clean, spacious, excellent seating, delicious hot chocolate and a breakfast sandwich on a croissant. I'm going to be camping out here very often."}, "26": {"date": [2015, 10, 26], "rating": "4", "description": "Atmosphere - 5 Stars: The atmosphere in the cafe is great. A lot of creative people and entrepreneurs. Felt like I was at home. Food - 5 Stars: I had the chicken and steak tacos and they were delicious. The ingredients used were  extremely fresh and everything tasted homemade.Staff - 5 Stars: The staff were really nice and pleasant. Service - 3 Stars: The service was SLOW, beyond slow. My friend and I didn't mind since we were having a great time with our conversation, but a \"quick bite\" turned into our entire afternoon. It was almost two hours all together. But I guess if everything is homemade and it tastes that good it is worth the wait!We will definitely be back."}, "27": {"date": [2016, 1, 27], "rating": "5", "description": "A nice and quiet spot on the south side. Went there and ordered a turkey sandwich. Not a lot of restaurants can make a good authentic one, as easy as it should be. Plus it's a good place to network seeing as though there's a business networking center next door. Good thing I'm not too far this place."}, "20": {"date": [2014, 11, 20], "rating": "5", "description": "The waffles are so good! I also got the soup, which was delicious. The staff seemed genuinely interested in our opinions (the soup was new on the menu) and super nice. Gorgeous cafe. Warm, inviting, neither too loud nor too quiet. I'll definitely be back!"}, "07": {"date": [2015, 10, 7], "rating": "5", "description": "This is a fantastic spot. Cinnamon nut coffee cake is sinfully good, and the chai latte is nice and spicy.  They even have  caramel sauce for your coffee in case you're wanting that extra little sweetness in your coffee to get you going on a monday morning! (Or any day).  The music is a tiny bit loud, but nice jazz/soul/RB. Service is super friendly. And atmosphere is great for relaxing or even for reading (if you can do this with music). Ample street parking.The south side deserves this gem. I will definitely be a regular, even though it is out of my way to work and home!"}, "22": {"date": [2014, 8, 22], "rating": "5", "description": "A picture is a worth a thousand words and I posted about six of them. Great place to study, great place to get a quality coffee drink without paying \"Sixbucks\", long hours, free parking, sandwiches, smoothies and waffles to keep the brain cells working and free wifi. What more you could ask for? Oh wait. There's more!The sugar waffles are to die for. The batter is imported from Belgium and if you've ever tried to recreate true Belgium street waffles you know they are NOTHING like the spongy mess you get at American pancake houses. And they include nearly impossible to find in the US ingredients like pearl sugar. Why are you still reading this? Come enjoy this gem of a neighborhood owned cafe!"}, "16": {"date": [2015, 9, 16], "rating": "5", "description": "Amazing sugar waffles! Great atmosphere, with free WiFi and solid customer service. Highly recommended."}, "18": {"date": [2016, 2, 18], "rating": "4", "description": "Great space, lovely staff, delicious coffee"}, "08": {"date": [2014, 12, 8], "rating": "5", "description": "This is a great coffee shop.  They have good drinks, good food, great staff, a clean and comfortable space, free wi-fi, and a small meeting room with dry erase wall.  What more could you want?I had a great hot chocolate, delicious sandwich, and delicious waffle. I would happily get all three again.  The sandwich is $6.25 and comes with salt & vinegar chips.  It is a good deal.  The waffle is great, and apparently the batter comes from Belgium.  The large hot chocolate is huge and comes with a good amount of whipped cream on top.The staff is so friendly and helpful.  They genuinely seem happy to be there, and happy to have their customers.  I like that the sandwiches come on real plates, and that they have real silverware to go with it.  There was a group selling spa products in the meeting space, and it really highlighted what a great space it was.  They were able to put notes about the company and prices on the dry erase wall.  They had plenty of space to set up, but they were separated enough from the main seating that it was not intrusive.  It's really nice to have a space like this!I will definitely be back!"}, "30": {"date": [2015, 5, 30], "rating": "2", "description": "Came here three time already and this is my review.Drinks all come out well enough.Food always takes too long to be prepared. Every time I go, they always are out of they're famous waffles. I was disappointed with their sandwiches."}, "28": {"date": [2015, 2, 28], "rating": "4", "description": "Most definitely a fan. It's a great coffee shop with a charming, modern vibe. Great Belgian waffles -- not too sweet and perfectly crispy. I came here with a large group, and it took an hour to get my waffles. It had just opened, and they weren't expecting dozens of UChicago students to come in, so it's understandable."}, "21": {"date": [2014, 11, 21], "rating": "5", "description": "They get 5 stars for offering me a ceramic mug for tea since I was dining in. Class! Also, this place is very affordable and offers a wide selection of breakfasty food options. It looks like a great place for informal group meetings. Only worry is as a University of Chicago student carrying laptop around, since there have been a rash of robberies in the neighborhood lately I worry about tramping around off-campus. It's right down the street from where I stay in the Cottage Grove/Green Line area, but I do not feel completely safe walking to it. I am saddened by the desperation of the impoverished people in this area that creates this dangerous atmosphere. Anyway, I highly recommend this coffee shop. Maybe just take the bus to it if you have your laptop with you?"}, "10": {"date": [2014, 11, 10], "rating": "4", "description": "The best about this place? The staff. Always charming, engaging and polite. I love live the decor. Simple CHICAGO. The windows open to the outdoors, which is great for spring and summers. Mist places miss this touch.I tried to replicate the White Cloud steamer from Currency Exchange Cafe (my go-to cafe). It didn't make the cut. On a second visit I had chocolate w/a pump of pumpkin spice. It's Fall. ;). Yum! Soon I'll return to try the food and will update my review. This is a simple, no frills place with a lot of everything you want - space, WiFi, sandwiches, waffles and COFFEE!"}, "24": {"date": [2015, 3, 24], "rating": "3", "description": "I am stopping at this shop as much as I can.  I want it to thrive!  The service is a bit slow and at times it seems disorganized.  I will continue to visit and hope I'm just hitting it at bad times."}, "06": {"date": [2014, 9, 6], "rating": "5", "description": "Sugar WAFFLES, the PERFECT compliment to quality, Chicago roasted Bridgeport coffee.  These Sugar waffles, ( I did have dark chocolate drizzle atop them), but I could tell that alone, these sugar waffles were tasty all by themselves. Think of those yummy funnel cakes at Six Flags. Well, this is like a yummy funnel cake, but classier and tastier!  Airy space, perfect for chatting or studying. Much needed in the area.  Forget Ihop, get your waffles and coffee here!"}, "23": {"date": [2015, 7, 23], "rating": "4", "description": "I'm a huge fan of Greenline Coffee..the only recommendation is the slow service.  The staff has no sense of urgency. When you're dealing with corporate and business people coming in to get in/get out...it shouldn't take 15 minutes after you ordered to get an ice latte and sandwich with no one waiting with you.Overall I love the place and don't want to second guess if I have time to wait...just want to get in and get out :)"}, "04": {"date": [2015, 9, 4], "rating": "5", "description": "Great food and great service. Even just when you walk in you can smell the deliciousness from the waffles and the coffee. I came in on a hot day and ordered a mango smoothie. Highly worth it. Others in my group ordered iced coffee and the green tea frappe, as well as some treats in the case. Everyone was happy. I will definitely come back."}}, "times": {"Wed": ["7:00 am", "8:00 pm"], "Sun": [], "Fri": ["7:00 am", "8:00 pm"], "Tue": ["7:00 am", "8:00 pm"], "Mon": ["7:00 am", "8:00 pm"], "Thu": ["7:00 am", "8:00 pm"], "Sat": ["7:00 am", "8:00 pm"]}, "number_of_reviews": "31", "longitude": -87.6130551, "address": ["501 E 61st St"], "latitude": 41.783744, "attributes": {"Wi-Fi": "Free", "Good for Working": "Yes", "Bike Parking": "Yes", "Outdoor Seating": "Yes", "Parking": "Street, Private Lot", "Accepts Credit Cards": "Yes", "Wheelchair Accessible": "Yes"}, "categories": [["Coffee & Tea", "coffee"]]}}