{"target-chicago-18": {"comments": {"44": {"description": "Pretty good Target location as its near the old Cabrini-Green area.They have everything the other locations have except alcohol. According to one of the cashiers, they will sell alcohol after Jan 1 2014.Parking lot isn't as annoying as the Elston location, but of course it gets packed during the Holiday season.", "rating": "4", "date": [2013, 12, 26]}, "29": {"description": "I have been here many times since it opened, and the employees are always very nice and friendly.  I try to frequent this one because of the employees.", "rating": "5", "date": [2014, 5, 31]}, "42": {"description": "This is my new favorite Target. I had been waiting and waiting for it to open, and they did not disappoint. As a native Minnesotan, I am not only partial to Target for shopping, but I also consider myself a Target aficionado. This one has seriously raised the bar and my esteem of Chicago's stores. I love the layout - it actually reminds me of the store in downtown Minneapolis, except better. There is free covered parking under the building, and when you go inside, you can take the stairs, an elevator, or an escalator upstairs to the shopping floor. At the top of your ascent is Starbucks and their little fast food joint (pretty smart on their part; who wouldn't want to grab a drink while they shop?) and a plethora of carts and baskets. The employees are actually pleasant and helpful and the store is bright and easy to maneuver.", "rating": "5", "date": [2014, 1, 7]}, "23": {"description": "This is the first time in this target and I enjoy the layout of this one a lot. My problem is that the store is SO MESSY. I saw about six employees doing nothing but talking while I was there. I understand having healthy relationships with coworkers but the store is a wreck. I finally found the curtains I wanted at this location, which was a huge plus. Just please hire new employees because half of them seem super stoned and incredibly uninviting.", "rating": "3", "date": [2014, 9, 18]}, "47": {"description": "Ugh.  Zero stars?  Shopping here is worse that shopping at Marshalls.  The staff is barely literate and not at all knowledgeable about anything (including, most importantly, the store itself and its registries).  Wish they had built something else in the old Cabrini Green spot ...", "rating": "1", "date": [2013, 11, 14]}, "31": {"description": "I love this location. I've been in Chicago a little over a year and was very excited to learn a Target was being built near me. Don't have to drive to Elston any longer(but I still do since there is a PetsMart directly across the street..and a Dollar store) I like the covered parking! I like that, a lot. I moved here from Georgia, which is Wal-Mart land. Upon moving to this city, I realized I would have to quickly become a Target shopper, or drive to another city.I am hooked. In my opinion, this location has THE BEST clothing clearance of all in the city. Easy to find( back, right corner, by dressing rooms). Dresses for $7.56, coats for sale..just lovely! The Glade candle selection is awesome, and a $1.30 cheaper than if purchased at CVS. I've read many reviews about not selling booze...well they do now! I recently purchased a bottle of Grey Goose in preparation for Memorial Weekends festivities. I would recommend this location to anyone living in the Near North Side area. Feels safe, open late, if lines get long..management quickly opens other checkout lanes to keep the flow moving, awesome sales.", "rating": "5", "date": [2014, 5, 21]}, "34": {"description": "Store reviewAmple parking, good deals, wow this is a great target. I was suprised given the other Chicago locations. There is a large parking lot but be careful of crazy drivers. The store is well stock and clean. I was surprised that the easter candy hit 70% off and 90% off with other easter items. There was also winter salt for 70% off. There was significant amount of everything left over which is unheard of at a city target. Pros- great selection, large storeCons- Crazy drivers in the parking lotHidden deals- Discount items abound. Target mobile coupon and cartwheel for additional savings. Target credit card for 5% back.", "rating": "5", "date": [2014, 5, 2]}, "16": {"description": "Even with a store this big, and the fact that it was crowded with Holiday shoppers, this Target is well laid out. Easy to find what you're looking for, and all the staff was courteous and willing to help if you could not find what you were looking for. The people at the pharmacy are very professional and knowledgeable. The food court is decent if you're going on that marathon shopping spree and need to refuel. IT is my Target of Choice!", "rating": "3", "date": [2014, 12, 14]}, "8": {"description": "Bought a bag of chips here. After finished half bag, we found it's passed the recommended consumption date for 3 months. Though it's not an expiration date,  we are still not feeling comfortable. And we realized the taste and quality have gone bad already. Wondering such a big shop can sell product like this. Will never buy food from there any more.", "rating": "1", "date": [2015, 4, 6]}, "11": {"description": "Target Clinic ReviewThis is a decidedly mixed review.  I went for a flu shot.  The nurse administering the shot was excellent.  It was done professionally, the facility was spotless and I was in and out quickly.However, prior to going there I compared prices and found Target Clinic to be very competitive at $31.99.  What they DIDN'T tell you was they charged you $15.00 \"Administrative Fee\" just to process the claim through your insurance company.  Guess what, my insurance company only covered about $2 of their administrative fee, so I was stuck paying the remainder - three weeks after the shot when the bill came in the mail.  A nasty little surprise.", "rating": "2", "date": [2015, 9, 26]}, "26": {"description": "I went to the target clinic yesterday because I needed to see a doctor for a bad cough. I got in to see the doctor in less than five minutes. The registration was quick and easy. If you need an immediate care doctor for sure check out target. The pharmacy was a little bit slower but still plenty fast.", "rating": "4", "date": [2014, 8, 27]}, "39": {"description": "Ok that's it. This place truly is awful. Went in there to simply find frozen chicken breasts and a box brown rice and they absolutely had neither at 8PM on a Saturday night. Their shelves were as bare as a soviet bloc nation.Too bad that this location is so close to me but I absolutely refuse to return.", "rating": "1", "date": [2014, 2, 3]}, "37": {"description": "Bad enough that Target allowed my personal information to be stolen, but I can't think of anything worse then what they are doing now... trying to sell me credit services under the guise of protecting my credit from further thefts. Target is no better than mob enforcers who cause damage just to sell their protection services.Beware Target shoppers, and shame on you Target. Writing me that you're sorry my credit information was stolen and that you're offering free credit protection, then sending me to Experian's web site that charges me for a credit score - A FREE SERVICE BY LAW FROM THE SAME COMPANY. Besides cutting up my Target card and promising never to shop there again, I will do my best to alert the public to your scam. I plan to share this experience with every one who reads my blogs, visits my web sites, follows me through social media and anywhere else I can find to post this information.", "rating": "1", "date": [2014, 2, 17]}, "0": {"description": "It's Target....what is there to say? My life comes from Target, haha! Great store, professional and helpful employees. I love Target.", "rating": "5", "date": [2016, 1, 18]}, "38": {"description": "Beware pricing at this Target.  On a recent shopping trip, I found at least 6 items I purchased had a different price at the register (some higher, some lower) than what was posted on the shelf.  The cashier handled each one to my favor.  One discrepancy I would accept, but there is clearly a trend here. I want to TRUST the place I am shopping.  Given this and the credit card breech, I think I will go elsewhere to buy my household basics.  BTW, I tried to discuss with store manager but he never came to customer service where I waited for ten minutes.", "rating": "1", "date": [2014, 2, 12]}, "51": {"description": "ON TARGETThis is the new target that is located on the Cabrini Green property. There was much controversy over the last few weeks about the opening. The news covered only the people displaced and not the fact that a new retailer was building in the area. I just felt sorry for Target because it just seemed like bad press. Target promised to employee 75 former residents who were displaced by the new store. Unfortunately none of those jobs would be in management because Target said it wouldn't be fair to its current employees. Hopefully some of those new employees shine and move up the ranks. So enough about the politics and lets talk Target!  Am I happy about this new store? I guess I am because it is the closest Target to me. I could walk here if I wanted to. But honestly there are so many Targets around me and I feel surrounded. Target has our city covered. This location has a parking lot below with plenty of parking and the store is located above. It is everything you would expect from a Target. It's the same from store to store. If you have never been in one, then have you been hiding under a rock?So if you live in the area then this is your Target. The Gold Coast is only about 10 blocks away from here and with all the Dominick's going away this Target may be exactly what the neighborhood needs.", "rating": "4", "date": [2013, 10, 21]}, "22": {"description": "I love Target and this is the location I shop at most because it's in my neighborhood. But this location has a serious problem with items often being mispriced.", "rating": "3", "date": [2014, 11, 16]}, "32": {"description": "Open till 11:00, which is rates high with me since I like to avoid crowded stores. However, even if it's not prime shopping time they only had three cashiers, and the lines were long. Twenty-five check-out lanes, I wonder if they ever have them all working, or is it just an illusion.Lucky for me the Target on Roosevelt is the one that I usually go to, and it's also open till 11. I think part of the problem with the long lines is that stores like this are now selling groceries instead of sundries only. I had about six items in my cart, while everyone else had full carts of groceries and assorted items. The location on Roosevelt has food, however with so many other grocery stores close by people in the area don't rely on this one for groceries as much.I don't really like to shop as an activity, I tend to frequent stores that are smaller and more focused. I was just fine without groceries at Target, it was quicker. Consumerism in America, I have to wonder how much of the stuff in the full carts was really necessary? Or, were the purchases a result of wandering through the store?", "rating": "3", "date": [2014, 5, 11]}, "54": {"description": "This is a shiny brand new Target. It looks bigger than it is because it is built above the parking lot, which is great if it's raining, snowing, or even scorching. There are many bike racks in the garage also!There are stairs, an escalator, and an elevator to get up to the store. Immediately there is a Pizza Hut, Starbucks, and customer service. Beyond that, the layout is just like any other Super Target with a department store and grocery area.It's a jolt of suburban sprawl in the urban condensed soup that's both disconcerting and refreshing. I've grown accustomed to the nuisance of doing the shopping at four different stores since all of them are so tiny and incapable of possessing the inventory to satisfy the persnickety tastes of M. Besides, these minutia places (even the pharmacies) carry mini items: my mouthwash and M's Tapatio both come in near-travel sizes and are carried by different stores.So you can understand why the vast isles seem morbidly obese and the very number of items carried by Target is overwhelming. Suddenly I am flooded with options in a ONE-STOP-SHOP. And not only that, now I can get items like socks and lamps - things that were incomprehensible before.But there's something communal about supporting smaller stores like Potash and new-comer Plum Market. Perhaps it's the child-size locovore in me that cried out when I noticed that this new Target carried bags of apples for my lunch and berries for M's breakfast. I am chagrined to admit that this produce seemed fresher than my regular grocery stores.There are some things that I will note that will probably pass away. These are qualities that I'm sure are attributed to Target simply because it is brand spankin' new. The store was PRISTINE and the employee to shopper ratio tipped greatly on the side of the employee. Employees were obsessively facing items on the shelves and sizing clothing on racks. I had only to pass by and they would ask if I needed assistance. I'm confident that the sort of detail oriented presentation and heightened customer service is going to erode within a month or two.", "rating": "4", "date": [2013, 10, 16]}, "48": {"description": "Yep. This will be my new go-to Target. Nuff said.", "rating": "5", "date": [2013, 11, 4]}, "13": {"description": "This is a shiny brand new Target. It looks bigger than it is because it is built above the parking lot, which is great if it's raining, snowing, or even scorching. There are many bike racks in the garage also!There are stairs, an escalator, and an elevator to get up to the store. Immediately there is a Pizza Hut, Starbucks, and customer service. Beyond that, the layout is just like any other Super Target with a department store and grocery area.It's a jolt of suburban sprawl in the urban condensed soup that's both disconcerting and refreshing. I've grown accustomed to the nuisance of doing the shopping at four different stores since all of them are so tiny and incapable of possessing the inventory to satisfy the persnickety tastes of M. Besides, these minutia places (even the pharmacies) carry mini items: my mouthwash and M's Tapatio both come in near-travel sizes and are carried by different stores.So you can understand why the vast isles seem morbidly obese and the very number of items carried by Target is overwhelming. Suddenly I am flooded with options in a ONE-STOP-SHOP. And not only that, now I can get items like socks and lamps - things that were incomprehensible before.But there's something communal about supporting smaller stores like Potash and new-comer Plum Market. Perhaps it's the child-size locovore in me that cried out when I noticed that this new Target carried bags of apples for my lunch and berries for M's breakfast. I am chagrined to admit that this produce seemed fresher than my regular grocery stores.There are some things that I will note that will probably pass away. These are qualities that I'm sure are attributed to Target simply because it is brand spankin' new. The store was PRISTINE and the employee to shopper ratio tipped greatly on the side of the employee. Employees were obsessively facing items on the shelves and sizing clothing on racks. I had only to pass by and they would ask if I needed assistance. I'm confident that the sort of detail oriented presentation and heightened customer service is going to erode within a month or two.", "rating": "4", "date": [2013, 10, 16]}, "24": {"description": "This is an amazing Target! I love this Target! The place is awesome! The covered parking, the elevators, and the really nice staff. I love coming here!", "rating": "5", "date": [2014, 9, 8]}, "7": {"description": "I generally avoid big box stores because I like making quick trips where I get a few basics and I'm done, plus I can't handle lots of people or long lines. This Target has never been an issue for me though. There's plenty of parking, the area around the store is not a total cluster f on Saturdays (yet), the store never seems packed (unlike the one off Diversey near Logan Square- total nightmare) and my trips are relatively short, yet I'm able to stock up on items that I may not be able to find at a local Walgreens/CVS. Example: Packs of La Croix in Mure Pepino flavor! Keep it coming Target.", "rating": "4", "date": [2015, 11, 3]}, "27": {"description": "This target is really out of the way for me, but they do in store pick up, which was convenient. The location is about a 10 minute walk from the CTA red line, and directly next to a Division bus stop. There is also a covered parking garage.The store was very clean and well stocked. Guest services very friendly and the line moved really quickly. I was in and out in less than 15 minutes!", "rating": "4", "date": [2014, 8, 19]}, "49": {"description": "Perhaps my new, favorite Target. Or at least a close second to the one on State st. This one definitely has better views of the city. And it has a Starbucks, Pizza Hut Express, and a nice area to chill out. It's pretty convenient to get to, yet seems tucked just outside the hustle and bustle of the city. I like that. I don't like running errands in chaos. There seems to be an exorbitant amount of parking garage and a very tiny entrance (literally one set of doors) that leads you into a massive (dare I say, waste of space) entryway. It's odd. Odd enough I walked around to confirm that was indeed the main entrance. You can take the escalator or elevator up to the main floor (the entire bottom floor is parking garage). And you are conveniently deposited smack dab in front of Starbucks....nice placement Target :) Why yes, I do need a coffee to cruise Target. As far as the store itself goes, it's got all the essential Target goods and grocery. If for no other reason, I will most likely hit this one because of the amazing floor to ceiling windows in the food area overlooking the city skyline. Nice place to get my essentials, grab a coffee and chill for a moment.", "rating": "4", "date": [2013, 11, 3]}, "53": {"description": "If you're used to the split level City Targets (State St, Roosevelt, Wilson), nothing can prepare you for the imported suburban hellscape that is this new location. I love Target so I was excited to have one closer to home since I live in Gold Coast. Things started off awful from the get-go. Rather than a nice pedestrian friendly entrance you enter through the parking garage and have to walk around the exit escalator to go up (HUH?). The store is obnoxiously oversized yet it feels claustrophobic and there isn't a window in sight. The shelves are fully stocked but they're missing many SKU's. I looked for 3 different personal items like mouthwash, deodorant and razors and they either had odd sizes or didn't carry the brand at all. With the other locations, I tend to linger and spend more than I anticipated. Everything about this location screams \"Get your crap and get out!\" I'll definitely continue going to other locations even though they're out of the way so I can avoid the soulless experience I had at this one.", "rating": "1", "date": [2013, 10, 18]}, "30": {"description": "Love target. But the attitude & poor customer Svc & all the security drama w/credit cards !  Went in the other night & customer Svc rep had no brain.  She could not think. Maybe because it was late.  Just had a very bad attitude. Ill drive the distance & go to one if the other ones.", "rating": "1", "date": [2014, 5, 25]}, "46": {"description": "Definitely missed the Target on this one. Sorry, couldn't help it.I was so excited when a Target popped up just a few minutes from my work. I thought the days of running errands on the weekend were gone! Lunch break, here I come!Not only are most of the employees here rude, they are totally clueless. They have no idea where anything in the store is and have no idea how to perform basic register tasks, like ringing in a coupon. I understand that there is a learning curve when opening a new store, but common sense should kick in a some point. Like when I asked an employee where something was and she said she didn't work in that department. Funny, I'm sure that walkie talkie you have on your hip works. No wonder this place was empty two days before Thanksgiving.Avoid at all costs.", "rating": "1", "date": [2013, 11, 26]}, "1": {"description": "The employees don't check id's when someone spends over $800 with a skimmed card at this location. And the management gives 0 cares that a criminal walked away with that much worth of merchandise while a mom with a 6month old now have a completely wiped out bank account. \"We'll let security know\" Without taking ANY of my information....I can only assume this target is full of low life criminals and employees that can't do their jobs.", "rating": "1", "date": [2016, 2, 2]}, "9": {"description": "This review is about the Target Clinic; specifically about MELISSA, the nurse/doc they have on staff.I went in on Memorial Day for a cough that just would NOT go away. Now before you put me in that category of one of \"those\" people who don't have a regular doctor, the deal is, I do have one, but it was a holiday weekend and her office is way up in the suburbs. Since I moved, I just hadn't gotten around to finding a new physician. Melissa happened to be at the desk and handed me an iPad with the usual preliminary paperwork. Here's the insane part. I actually get a rush from checking off the \"NO\" box to all of the various conditions and diseases, as if I'm some example of what \"healthy\" looks like. Never mind it's been a year since I've stepped foot in the gym, or that my gravelly cough sounded like I should have been in the TB ward. There I sat, grandly checking NO to the various death sentences. Heart disease? NO Cancer? NO Lyme Disease? NO Insanity? NO....Now it was time for the exam. Melissa did the usual \"listen to my lungs, chest, blah, blah\" but then actually ASKED QUESTIONS and really drilled down on what was making me so miserable. She actually spent TIME with me, and correctly diagnosed my cough cough cough as an allergy. I know, not so dramatic, but given my daughter had recently dropped off her cat, announcing Chaz would be taking up residency with me, I just had not put the two together. Melissa told me what to take to relieve the symptoms and (reluctantly) even wrote me a prescription for an antibiotic that she said I didn't need but would anyway. She was even kind enough to give me physician referrals. Now this is where the unbelievable part comes in: Melissa even went out of the clinic to personally choose the OTC meds I needed. Here's the update: After taking what she prescribed, I am 100% improved. So THANK YOU MELISSA. So here's my advice: If you want awesome, thorough care with a kind, intelligent nurse/doc, go to this Target and request Melissa. She's the best!", "rating": "5", "date": [2015, 5, 29]}, "40": {"description": "The staff is friendly, the location is great. But the milk in the fridge was expired and the produce always go bad really quickly. It's a good store if you want to shop for anything that isn't perishable.", "rating": "2", "date": [2014, 1, 10]}, "25": {"description": "The ladies at the customer service desk are miracle workers somebody buy them lunch.  They made my day.", "rating": "5", "date": [2014, 9, 6]}, "12": {"description": "ON TARGETThis is the new target that is located on the Cabrini Green property. There was much controversy over the last few weeks about the opening. The news covered only the people displaced and not the fact that a new retailer was building in the area. I just felt sorry for Target because it just seemed like bad press. Target promised to employee 75 former residents who were displaced by the new store. Unfortunately none of those jobs would be in management because Target said it wouldn't be fair to its current employees. Hopefully some of those new employees shine and move up the ranks. So enough about the politics and lets talk Target!  Am I happy about this new store? I guess I am because it is the closest Target to me. I could walk here if I wanted to. But honestly there are so many Targets around me and I feel surrounded. Target has our city covered. This location has a parking lot below with plenty of parking and the store is located above. It is everything you would expect from a Target. It's the same from store to store. If you have never been in one, then have you been hiding under a rock?So if you live in the area then this is your Target. The Gold Coast is only about 10 blocks away from here and with all the Dominick's going away this Target may be exactly what the neighborhood needs.", "rating": "4", "date": [2013, 10, 21]}, "21": {"description": "Typical target. Some clutter here and there but well  stocked. It can be a bit busy at times but that's to be expected. Starbucks and cafe are a nice and the view from the cafe is pretty great. I recommend going for a few or fifty items, grab a coffee or treat and peak at the sky line.", "rating": "4", "date": [2014, 11, 21]}, "17": {"description": "Typical target. Some clutter here and there but well  stocked. It can be a bit busy at times but that's to be expected. Starbucks and cafe are a nice and the view from the cafe is pretty great. I recommend going for a few or fifty items, grab a coffee or treat and peak at the sky line.", "rating": "4", "date": [2014, 11, 21]}, "10": {"description": "This target is really out of the way for me, but they do in store pick up, which was convenient. The location is about a 10 minute walk from the CTA red line, and directly next to a Division bus stop. There is also a covered parking garage.The store was very clean and well stocked. Guest services very friendly and the line moved really quickly. I was in and out in less than 15 minutes!", "rating": "4", "date": [2014, 8, 19]}, "5": {"description": "Tons of garage parking with makes it nice in the winter to easily get in and out of the store. The store is always pretty clean and stocked with the items I am looking for. The staff have always been helpful, the grocery section in particular has always had great staff that will ask me if I'm finding things ok. Other grocery stores you have to pace up and down the aisles for 20 minutes looking  for things.I don't write a lot of reviews but this is a good store with nice staff. Shopping there is simple & easy, and that's really all I'm looking for in a target.", "rating": "5", "date": [2015, 7, 27]}, "35": {"description": "So it's Target.  It's relatively new so it's still relatively clean.  I just happened to be driving by on a weekday and popped in.  They seemed to have enough cashiers.  Things were pretty orderly.  I mean it's target, not Nordstroms.  Nothing special, but nothing to complain about either.", "rating": "3", "date": [2014, 4, 9]}, "19": {"description": "This is a really nice and clean Target to shop in. It isn't much different from most Targets, being that they are generally all very similar. It is fun for someone like me that like different design models, though.The store is actually above its own parking garage on the second floor. You can take either an elevator or escalator to get to the store and has a fun escalator when coming down with your buggy. Overall, the cashiers are pretty friendly. One complaint though. This seems to be an issue with most Targets, but I've had this happen here. You mention that you have the Cartwheel app and the cashier wants to wait until the end to scan your phone. Now, they could simply scan it then so they won't forget, but they would rather wait, which is fine; but too many times, they forget and I also forget until the transaction is completed and you say, \"Oh, I had the cartwheel...\" and they just say, \"Oops, sorry.\" It's not like I'm saving THAT much with most of the stuff using the app, but the store should definitely attempt to have cashiers scan it first, then the rest in order for better customer satisfaction. That's pretty much all of the negative feedback that I have though.", "rating": "4", "date": [2015, 1, 4]}, "28": {"description": "The people here are very helpful! We came in to print photos after hours and the team members on hand worked hard to try and help us even though the photo printer wasn't working. Cheryl worked hard to try and fix the problem for half an hour and then gave us coupons for our future return. Very convenient city location and great staff!", "rating": "5", "date": [2014, 6, 6]}, "3": {"description": "I waited in line on a Monday evening for 15 mins only to have their eft machine stop working. So they moved me to a different register, unpacked my bags and re-rang every item - all of this (I understand it happens) but the cashier didn't give me all of my bags. So I had to pay $15 for an uber back to the store to pick up $30 worth of items I had already paid for. The offered me a 20% off coupon - which could've been clipped out of their weekly ads, and never placed the coupon in my bag. I had to argue to speak with a manager and at the end of it, the person talking to me put the phone down thinking I couldn't hear what she was saying and I heard her just talking shit about how I'm crazy. Terrible experience.", "rating": "2", "date": [2015, 12, 7]}, "33": {"description": "I really love this location. It's super convenient for me and they often have everything I need, especially now that they started selling booze. I have even gone to the clinic and I will definitely get an eye exam there when I need one.The staff I think is obviously very new. Checking out can be a process even though there usually isn't much of a line. Last night there were 3 people ahead of me with very few items each and it took like 10 minutes. I wanted to move but I had a ton of stuff already on the conveyor belt and I'm lazy. I had liquor and my checker wasn't 21, so she very calmly kind of looked around to see if she could spot a manager, then eventually turned on her light. She really just stood there looking bored like someone was going to magically appear. I wanted her to be a bit more aggressive about finding someone to ring my liquor...someone finally did come, and this won't keep me out of the Target but hopefully in another few months the staff will be fully trained.", "rating": "4", "date": [2014, 5, 6]}, "43": {"description": "Wow what a target! The beauty area is awesome! Everything is so well lit up and fully stocked!", "rating": "5", "date": [2013, 12, 29]}, "2": {"description": "As a Target shopper, I'm pretty loyal to one location in the city I find easy to navigate. After a peds appointment nearby, I decided to baby wear my infant and check this one out.Most, if not all Targets, are the same in layout and design: dollar section up front, women's clothes next to it while walking around the loop of the store. I really liked this Target because the Starbucks/cafe are right at the entrance starting the loop. It's probably genius marketing, but it makes sense to me especially since it's all one floor. I generally hate the one floor layout Targets in the city because they're so overwhelming. I'm looking at you Target on Elston. Instead, this Target felt easy to navigate and shop, not overwhelming at all.I like this Target for its easy to shop layout and great parking underneath the store. The straightforward design of the store and close proximity to our peds makes doing return trips to the area desirable after checkups.", "rating": "4", "date": [2015, 8, 4]}, "45": {"description": "Dr Paik and her team, Katrena, have been so helpful in assisting me with my glasses purchase this evening. They are knowledgable and very nice. Earlier this year I went to America's Best and they were so rude. I don't feel confident in the prescription they gave me there either.  I'd suggest Target Optical over them!", "rating": "5", "date": [2013, 12, 16]}, "18": {"description": "Store reviewAmple parking, good deals, wow this is a great target. I was suprised given the other Chicago locations. There is a large parking lot but be careful of crazy drivers. The store is well stock and clean. I was surprised that the easter candy hit 70% off and 90% off with other easter items. There was also winter salt for 70% off. There was significant amount of everything left over which is unheard of at a city target. Pros- great selection, large storeCons- Crazy drivers in the parking lotHidden deals- Discount items abound. Target mobile coupon and cartwheel for additional savings. Target credit card for 5% back.", "rating": "5", "date": [2014, 5, 2]}, "41": {"description": "Missed the Target. Bah dum dum. Reviewing a Target store location kind of goes against my grain. It's the type of place that EVERYONE is already familiar with. If you've ever been to a Target, they're all pretty much the same, right? Right. I mean, come on, do you ever Yelp the corner Walgreen's before you head on over to make sure it's a \"good Walgreen's\" or do you just go because it's the one in your neighborhood? Exactly. However, in this case I have some interesting information that you might find useful if you've been at all curious about this new, monstrous Target that has sprung up on what used to be Cabrini Green land.From gangbanger territory to sanctified shopping ground, this Target shines like a gentrification beacon on the not-too-distant skyline horizon. There isn't much else around save for the Dominick's shopping center at Division and Clybourn, so I'll be keeping my eyes peeled to see if this helps to further enterprise this area of the city.However, I likely won't be back. Remember those interesting facts I mentioned about this locale? Well, here they are... 1. This Target does not sell alcohol. At least not yet. Supposedly it's coming soon, but for now, no beer no booze no wine. That does not a fun supermarket section make! 2. It is not nearly as big as they want you to think it is. From the outside, it looks TREMENDOUS. But it's so very false. The parking lot is a multi-level, enclosed structure that is designed to look seamless from the outside. They did a good job of that, but half of what you think is the store is just where you put your car. This store is actually much smaller than the Elston location I like to frequent. 3. Escalators. In addition to the misleading size, the actual \"store\" part of the store is all located on a second level. You must go up the escalator to enter or exit. And, if you happen to visit on a day when one is shut down, as I did, you'll be pretty disappointed at the Plan B. 4. Plan B is everyone smushes into an elevator with their carts and bags and kids and smells. No, thanks. See you at Elston.", "rating": "3", "date": [2014, 1, 8]}, "52": {"description": "I'm pretty excited to have a Target store in this area! I have found the store to be very clean, easily accessible, well stocked and had excellent customer service. It's truly a one-stop shopping experience. I can park for free, get some groceries, clothing, shampoo, prescriptions, an eye exam and even visit the clinic for my flu shot all in one place!! Keep up the good work Target", "rating": "5", "date": [2013, 10, 21]}, "50": {"description": "The nicest Target I have ever been too.  Everyone was gorgeous and way TOO helpful.  At every corner there was an attractive Target employee who asked if I needed help finding something.  It got a little annoying after awhile to tell you the truth, but I did buy a super cute coat there and they had my size. :)", "rating": "4", "date": [2013, 10, 30]}, "4": {"description": "I ordered an item online, and the item was only available for store pick-up at this Target location. This is a full-sized Target location, and relatively new. This location has a Target cafe and a Starbucks. There are  even cart lifts/escalators like the City Target location on State Street. However, the employees at this store are less than helpful. I was the only customer in line and I had to wait over ten minutes for my online order. I hate to say this, but even Kmart gets me my orders in single digit times! The employees in the electronics department must have been wiped out from Black Friday because even today, they couldn't even point me to where the micro usb cables were located. If you're OK with self-help/navigation and poor customer service, then this location should be your Target location of choice. I find the busy State Street location and Kmart to be far superior. However, this location is well-stocked, so if you're keen to pick up an order in-store, you're most likely to find it here or in South Loop.", "rating": "2", "date": [2014, 12, 2]}, "6": {"description": "Like most people I love Target but i cringe when I come to this one. Every time I am here there seems to be weird things around me happening.....one instance... an employee was yelling at her boss/supervisor/shift leader in front of the changing rooms in the back corner. The boss proceeds to walk away then then employee starts verbally bashing her in front of all the customers. It was incredibly rude. I was very uncomfortable. I've also found that people \"hang out\" here later at night on the weekends and the employees seem to have an apathetic attitude towards their work ethic.", "rating": "2", "date": [2015, 3, 14]}, "15": {"description": "I enjoy shopping at this Target because of its spacious parking garage and well-organized layout.  There is a Starbucks & cafe right by the entrance on the second floor.  They have a fairly good selection of items including groceries, a pharmacy and the other typical things you find in a Target.", "rating": "3", "date": [2015, 8, 21]}, "20": {"description": "I ordered an item online, and the item was only available for store pick-up at this Target location. This is a full-sized Target location, and relatively new. This location has a Target cafe and a Starbucks. There are  even cart lifts/escalators like the City Target location on State Street. However, the employees at this store are less than helpful. I was the only customer in line and I had to wait over ten minutes for my online order. I hate to say this, but even Kmart gets me my orders in single digit times! The employees in the electronics department must have been wiped out from Black Friday because even today, they couldn't even point me to where the micro usb cables were located. If you're OK with self-help/navigation and poor customer service, then this location should be your Target location of choice. I find the busy State Street location and Kmart to be far superior. However, this location is well-stocked, so if you're keen to pick up an order in-store, you're most likely to find it here or in South Loop.", "rating": "2", "date": [2014, 12, 2]}, "36": {"description": "I'm used to upscaled Target stores in LA, and this is just as good. I visited yesterday before I read the reviews, and I found the staff to be very helpful. I asked 3 different employees to find certain things, and they pointed me to the right direction accurately, with a smile. I'm surpnised that they're even friendlier than the LA employees I've encountered. I don't understand the rantings of a few reviewers. If you're looking for an obscure food item- go to Jewel Osco or Mariano's. Target is a place to get higher-end stuff for a low price. It is not Wal-Mart. It is not Costco, either..The best thing about this place is the covered parking, the Starbucks, and the friendly service. Keep up the good work, Target. Not everyone hates you.", "rating": "5", "date": [2014, 3, 25]}, "14": {"description": "This Target is really big and has an extensive grocery section.  Very good for all your household needs.", "rating": "3", "date": [2015, 2, 15]}}, "neighborhoods": ["Near North Side", "Cabrini-Green"], "latitude": 41.9037001, "longitude": -87.6433793, "rating": "3.5", "times": {"Mon": ["8:00 am", "11:00 pm"], "Thu": ["8:00 am", "11:00 pm"], "Sat": ["8:00 am", "11:00 pm"], "Wed": ["8:00 am", "11:00 pm"], "Tue": ["8:00 am", "11:00 pm"], "Sun": ["8:00 am", "10:00 pm"], "Fri": ["8:00 am", "11:00 pm"]}, "price": "$$", "categories": [["Department Stores", "deptstores"], ["Drugstores", "drugstores"]], "address": ["1200 N Larrabee St"], "attributes": {"Parking": "Garage", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "55"}}