{"pepes-mexican-restaurant-chicago-3": {"comments": {"1": {"description": "Hard shell beef tacos are crispy and beef is seasoned. Chicken flautas are crispy and the chicken is good also. Customer service is good, staff is nice and will take custom orders. If you like French fries with your food, they have crispy shoestring potatoes and they give you a healthy portion. If you are on the southeast side stop by you won't be disappointed.", "rating": "4", "date": [2014, 7, 12]}, "0": {"description": "I've been eating at this Pepes for over 15 years. Since getting new owners over the last 3/4 years the food has only improved. The staff changed and so did the taste. It's now an authentic Mexican restaurant. They were always good now they are great.", "rating": "5", "date": [2015, 6, 9]}}, "latitude": 41.7371836, "neighborhoods": ["Calumet Heights"], "categories": [["Mexican", "mexican"]], "address": ["2014 E 87th St"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Has TV": "No", "Accepts Credit Cards": "Yes", "Good for Groups": "Yes", "Delivery": "No", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.5754076, "category": "Restaurants", "rating": "4.5", "price": "$", "number_of_reviews": "2"}, "dollar-tree-chicago-3": {"comments": {"1": {"description": "I think this is a good one as dollar stores go. It's one of the larger ones in this part of town and they have a very good selection of items. The quality of items sold here runs the gamut of course, but all in all you can find basic household items (and even some better trusted brands) for a basic price. They even have a (relatively extensive )seasonal section, party goods section and in the back, a frozen goods case. The only tough thing about this dollar store is the location; it's on the east side of a very busy intersection with a median, so you'll have to turn in to the lot from 88th st. if you're on the opposite side of the street.", "rating": "4", "date": [2010, 12, 14]}, "0": {"description": "This is definitely one of the better Dollar Trees on the south side, both because of the size of the store and the selection of items. I am a middle school teacher, and I get almost everything I need for my classroom here, as well as toys/trinkets/candy to reward my students with. The store has a large variety of items and everything isn't cramped or thrown around like a lot of other Dollar Tree stores. It really feels like the staff here stay on top of keeping things organized and easy to find.", "rating": "4", "date": [2011, 10, 27]}}, "neighborhoods": ["Calumet Heights"], "latitude": 41.7362518310547, "longitude": -87.5845947265625, "rating": "4.0", "times": {"Mon": ["8:00 am", "9:00 pm"], "Thu": ["8:00 am", "9:00 pm"], "Sat": ["8:00 am", "9:00 pm"], "Wed": ["8:00 am", "9:00 pm"], "Tue": ["8:00 am", "9:00 pm"], "Sun": ["8:00 am", "9:00 pm"], "Fri": ["8:00 am", "9:00 pm"]}, "price": "$", "categories": [["Discount Store", "discountstore"]], "address": ["8721 S Stony Island Ave"], "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "2"}, "family-den-chicago": {"comments": {"3": {"description": "I had a great and fun time(friday).  For those that is looking for an evening of drinking, dancing and socializing on the southeast side of town, this is THE place.  Music is good, drinks is def affordable and strong. The womens bathroom is not only clean but is red-carpet styled. Rose pedals is even on the carpet. Nice touch:)  Thanks attendant you are the best!", "rating": "4", "date": [2013, 3, 30]}, "1": {"description": "Okay,  if you're a house head, then this is the place to be! Straight Chicago old school house. And it's for us grown folk folks!", "rating": "4", "date": [2015, 5, 1]}, "2": {"description": "If you are lookin to STEP or LEARN, you should hit the Family Den. There are 2 rooms and a LARGE bar.. Kinda resembles club ambrosia or the bottom line in the old New Orleans. It is not a fancy spot, just someplace where you can really have a good time and listen to some GREAT house music. They were serving food, but I was busy watching the steppers on the floor.", "rating": "4", "date": [2014, 6, 19]}, "5": {"description": "\"Never judge a book by it's cover\" certainly applies here to Family Den. Why am I all the way on 89th and Stony on a Wednesday? Because of a girl of course. Family Den is a medium sized, dark, smoke filled bar. The clientele is mainly middle aged, blue collar workers. They have a kitchen in the back where they serve food, and according to the sign you can order a huge bowl of greens for only $5.00. I did not see a menu but I saw people eating mostly soul food (fried chicken, greens, potatos).I was a little intimidated being the only white dude in there but everyone was nice and we had a blast. The bartenders were very attentive as well, but did make me pay once my 1st tab got around $100. I gladly paid up and countinued my quest of intoxication. There is an electronic dart board, pictures of musicians and Mohamed Ali sporadically placed around the walls, and even a dance floor. I particularly enjoyed looking at the Janet Jackson picture placed by the bathroom. It's the one where she is almost puling off her jeans. What a nice image to have right before you use the restroom.Here was the kicker. I'm sitting with my friend having drinks and all of the sudden I notice 5 guys all in suits arriving with band equipment. They set up and played some of the sweetest jazz I have heard in a long time. Who would have guessed this joint could attract that kind of talent. The band was certainly say, Green Mill quality. They do accept credit cards which is good because my bill was quite high. Yea, I drank a lot but even still it was surprising to have such a big tab(s).Will I go back?? Depends if I am out that way again because it is far from my hood in the west loop. I would however recommend to anyone who is indeed around those parts. It's almost been 24 hours since I was there last night and I am still hung over from my time at the Family Den.", "rating": "4", "date": [2007, 11, 8]}, "0": {"description": "Went out with my life time lover we not been out in a while and went driving saw this place said stop in people's where old school like use nice music we was in love all over again like in the 80s. Yes we would go back no bs in this place", "rating": "5", "date": [2016, 2, 20]}, "4": {"description": "Live Jazz,  free live Jazz that is.Every other Sunday the Crosswinds Latin Jazz band does an open set,  may I say they are tight. If you are uncomfortable being the ivory in the ebony,  head North,  wait in the long ass line at The Green Mill and pay to get in.The music in the laid back lounge is on par with any other Jazz club I have been to,  the big difference for me is the soul food.  I was bellied up to the bar during the bands first intermission,  a young lady approaches me and asks if I would like to eat.  I asked for a menu, and suddenly I am in the scene from the Blues brothers where Aretha Franklin is trying to take the Brothers order,  it went like this,Me:  Sure have you got a menu?Girl:  We got soul food.Me: Cool,  what you got?Girl  Tipping head down,  Soul food.Me:  Do I get a choice?Girl:  You want something to eat?Me sitting back in my chair:  Yes I do.My plate of fried chicken,  collards.  corn,  biscuit and sweet potatoes came right before the band jumped into a great version of Manteca,  my head bobbed as I slurped porky bits of collards between peppery fried chicken,  I looked across the bar and an amazonian woman with a cigar between her lips eyeballed me,  the biscuit was buttery with a little crumb,  just the way i like.  I threw back a Miller,  mixed my sweet potatoes into my collards and wondered why i moved up North to this bitter cold.  A woman sat next to me,  she had streaky graying hair,  a smoky perfume, and everyone knew her,  everyone but me.The band leader came over after his second set,  introduced himself as Greg,  he introduced me to the lady,  a local Blues singer who would later join him on stage.  I soaked it all in,  the real Chicago,  the real makers of music,  people living their lives as they want to.  Well at least that is how it seemed to me.  I realized then and there,  Chicago is my home again.", "rating": "5", "date": [2010, 1, 26]}}, "latitude": 41.7317417263985, "neighborhoods": ["Calumet Heights"], "categories": [["Bars", "bars"], ["American (New)", "newamerican"]], "address": ["8942 S Stony Island Ave"], "attributes": {"Attire": "Dressy", "Take-out": "No", "Accepts Credit Cards": "Yes", "Good for Groups": "No", "Outdoor Seating": "No", "Delivery": "No", "Good for Kids": "No", "Takes Reservations": "No"}, "longitude": -87.5855867564678, "category": "Restaurants", "rating": "4.5", "price": "$", "number_of_reviews": "6"}, "checkers-chicago-5": {"comments": {"3": {"description": "They have horrible customer service. From the managers on down. Too ghetto. Ruined my experience", "rating": "1", "date": [2015, 4, 4]}, "1": {"description": "This place sucks. Terrible service, bad attitudes from employees, terrible tasting food and long waits. Their corporate office needs to do some mystery shops on this location to see firsthand the service nitemare at this location.", "rating": "1", "date": [2016, 1, 30]}, "2": {"description": "Although hood is an understatement for this location but if you want a great fish sandwich that actually has some flavor (sorry Wendy your flavor sucks) then this is the place for you! That deep sea double fish sandwich comes with cheese etc. if you get the meal I always opt for the Cajun fries because they are delicious, move out the way McDonald's this place got you beat!!! They did get 5 starts just because of the customer service that they offer. Every time I have went there,they are just unprofessional but nice... Anyway I keep coming back so they must be doing something right.", "rating": "4", "date": [2015, 4, 16]}, "5": {"description": "So, I physically walked into Checkers. It's a Monday at lunchtime so I expected a crowd. I got just what I expected. Not only was traffic backed up along 87th street in both directions, but on northbound Stony as well.  Other than the Checkers on Garfield, I haven't patronized them in years. While fully staffed, I felt rushed. I wasn't given enough time to review the menu before the cashiers were pressing me to for my order. The order board inside has small writing and I didn't find any of the combinations familiar. I felt rushed and placed my order reluctantly. Although I counted 13 workers preparing and bagging orders placed, I had to wait 17 minutes for my simple burger order with a 5 piece wing on the side. The burger wasn't like the past however it did come close. The wings (garlic-parmesan) were exceptional but greasy. And not just bag soaking greasy, I'm talking, I can recycle the excess and fry a new batch greasy.Satisfying.... YesValue Worthy... Kinda", "rating": "3", "date": [2011, 12, 5]}, "6": {"description": "My partner are I love Checkers, and this is a 5 star review primarily because 1) this is, for once, an actual Indoor location, complete with tables and chairs, booths, and plenty of space, 2) it's at a very convienient and easy to get to location, and 3) out of the few times I've been here, I just haven't had any negative experiences in terms of food or service.  The cashiers were actually nice and attentive.  I'd fully endorse this one (and even the outdoor south suburban Dixmoor location) over the other one in the city (55th).", "rating": "5", "date": [2012, 8, 30]}, "7": {"description": "I would have loved to give this checkers a 5 star... I mean I was so excited to get me a checkers burger and get back that taste of a fresh fast food burger.  Well I took a couple of bites and put the burger back in the box.  While sitting there eating my food I heard several people say they wouldn't come back for the burger but they would come back for the fully loaded potatoes...they were good but a bit to salty for my taste, but I have to say they came out pipping hot and oozing with cheese and bacon my friend truly appreciated that and said she would most definetely come back for them.  Since I wasn't feeling the burger I also got a 5 pc medium buffalo wings and they were great, I mean if you like a little kick but not to spicy these wings were delicious.  I do wish they gave you one complimentary ranch or blue cheese but hey that's just me.  I mean don't get me wrong they are only .39 cent a cup.  My friend also got the apple pie and she said it was really good she just wished she had ordered closer to us leaving because she could tell it tasted better hot.  The staff was great I mean they even gave me a menu because I couldn't really see until I stepped up to the register.  I mean all and all I would go back I just wouldn't go back for the burger.", "rating": "3", "date": [2012, 1, 16]}, "0": {"description": "The staff is curt and kinda ghetto, but the food is always good, fresh and well put together.", "rating": "3", "date": [2016, 2, 20]}, "4": {"description": "Yay a new checkers!! Stars for my food being hot. Took off a star for explicitly stating I wanted two plain hot dogs and I got two with ketchup and mustard. Another star off for the manager arguing with a customer about her personal opinion. The last star I took off is for them having weak sodas at the fill station, if I want strawberry pop it needs to taste sugary and full of potential diabetes! With some work this location could be quite nice and there's plenty of room to eat in although it's not exactly inviting.", "rating": "3", "date": [2013, 4, 22]}}, "neighborhoods": ["Calumet Heights"], "latitude": 41.736774702532, "longitude": -87.5849214541055, "rating": "3.0", "times": {"Mon": ["10:00 am", "3:00 am"], "Thu": ["10:00 am", "3:00 am"], "Sat": ["10:00 am", "4:00 am"], "Wed": ["10:00 am", "3:00 am"], "Tue": ["10:00 am", "3:00 am"], "Sun": ["10:00 am", "3:00 am"], "Fri": ["10:00 am", "4:00 am"]}, "price": "$", "categories": [["American (Traditional)", "tradamerican"], ["Burgers", "burgers"], ["Fast Food", "hotdogs"]], "address": ["8705 S Stoney Island Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Delivery": "No", "Outdoor Seating": "No", "Caters": "No", "Takes Reservations": "No", "Attire": "Casual", "Has TV": "Yes", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "8"}, "thomas-restaurant-chicago": {"comments": {"3": {"description": "I love this place. Been going here for years. The breakfast food is excellent!!! Best hash browns in town !!", "rating": "5", "date": [2013, 12, 28]}, "1": {"description": "First time here. Loved it. They're friendly. The food was good. I had French toast, bacon, and orange juice.  The orange juice was real orange juice not that fake, tang stuff. It has a simple, homely feel. I'd go again.", "rating": "5", "date": [2014, 7, 1]}, "2": {"description": "Food is awful. I think people go because it's in the community & nostalgic.", "rating": "1", "date": [2014, 2, 14]}, "0": {"description": "This is a great neighborhood restaurant! Small cozy and friendly. They have reasonable prices and the food is great. I eat here at least biweekly. The staff are so kind and courteous! I really really do love this place.", "rating": "5", "date": [2015, 12, 27]}, "4": {"description": "Our favorite restaurant for breakfast for years- similar to old-fashioned breakfast diner--.  Open for breakfast and lunch.  There's a good variety of menu choices- generous servings- fast, courteous service.", "rating": "4", "date": [2011, 8, 27]}}, "latitude": 41.7366943359375, "neighborhoods": ["Calumet Heights"], "categories": [["Restaurants", "restaurants"]], "address": ["1657 E 87th Street"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "longitude": -87.5829467773438, "rating": "4.0", "price": "$", "number_of_reviews": "5"}, "petes-produce-chicago-2": {"comments": {"3": {"description": "This'll do in a pinch if you can't get to Hyde Park Produce as far as the produce itself goes. There is a butcher shop in the back of the store with good prices, but the quality is hit or miss. The store is also small and not well laid-out, so it can get crowded fast.If you bring your own reusable grocery bags, be prepared to explain to the bagger--several times--how to use them. They will continue to try to package your stuff in the plastic bags. One bagger even demanded, \"What, you don't want the plastic bags?!\" in a very aggressive tone, as if I had offended him. Then he walked away, a new bagger came, and I had to explain it to him all over again. Twice.", "rating": "2", "date": [2013, 1, 11]}, "1": {"description": "So far, every time I have used the Yelp app, it has taken me right to the sight I am looking for. Thank you.", "rating": "3", "date": [2015, 12, 16]}, "2": {"description": "I frequent this store because it's close to home and quick. I go here when I need food fast and don't want to go to a large grocery store such as Jewel.  The produce is almost always fresh and the advertised sale items are usually available (unlike Jewel). Just don't go on the busy weekends.  My biggest complaints are that some of the chicken, (especially the \"party wings\") looks like they were raised or produced in horrible conditions. They have many broken bones and bruises.  I wonder what farm they get their chicken from.  It needs to be inspected.  Also the so-called butchers are idiots and I find it extremely hard to believe that any of them actually went to school to learn the art of butchery.  For instance; I once requested a steak or roast \"well marbled\" and the butcher didn't know what I was talking about, so I had to explain it.", "rating": "3", "date": [2015, 3, 7]}, "0": {"description": "This is the lace I used to go with my grandma as a kid! It brought back so many memories and reminded me of the grocers in Japan in a way. All of the pears were individually wrapped in paper and looked like swaddled babies. I took my wife but she didn't go in because it was a rainy blustery kind of day. We went to get watermelon to cure a hangover and got some grapes for extra measure. My grandma died in the 90's and I felt her spirit today. This place also sells butchered meats and other non produce items but it can be a little pricey. They sell really good products and most of the staff are bilingual. I recommend this over the larger grocer chains for a few reasons. One the quality is superior. Two, it's smaller and easier to navigate, and it's NOT a chain! It always feels better to support the independent guy.", "rating": "4", "date": [2015, 11, 27]}, "4": {"description": "So sick of this store. Went in Sunday an stood in the meat line for damn near  30 mins for a special on Chicken Leg Quarters at  .49¢ per pound. Got it home only to realize that the damn meat was spoiled! Not the first time that I have purchased bad meat here.  Forgive my language but its very annoying when trying to prepare dinner for your family only to realize the meat is bad. This is not the first time that I have purchased spoiled meat here. Have also purchased meat here that looks all beat and bruised  as though the Chickens were in a fight before being slaughtered. Petes Produce is making a fortune in our Community! The least they could do is provide FRESH MEAT!!!", "rating": "1", "date": [2012, 10, 25]}}, "latitude": 41.7367651, "neighborhoods": ["Calumet Heights"], "categories": [["Fruits & Veggies", "markets"]], "address": ["1543 E 87th St"], "attributes": {"Parking": "Private Lot", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.586522, "rating": "2.5", "price": "$$", "number_of_reviews": "5"}, "bjs-market-and-bakery-chicago": {"comments": {"29": {"description": "Much better!!  Ate here a few years ago and was not impressed. Haven't been back until yesterday.So yesterday I had a taste for some good ole' fried pork chops.  Now normally i don't believe in going to soul food restaurants because I'm a pretty good cook myself.  But yesterday was the exception! I didn't have time nor energy to cook so i decided to just give in.  I was very pleasantly surprised.  The food was very good. I had pork chops with mac n cheese, green beans, dinner roll and peach cobbler.  Everything was very delectable and the service was quick.", "rating": "3", "date": [2010, 6, 16]}, "42": {"description": "\"I have heard enough!\" declared Shatangi. \"Did you just say buffet?\" \"Oh Heeeeeallllllzzzz naw!!\".  They made me go anyway.I was less than impressed with the nearly empty parking lot and entered to find the decor reminiscent of the cafeteria in the mall when I was a little kid, End of story? Hardly!My group made its way to the front of the line and was seated in an area normally closed for the night (thank you). The staff was extraordinarily friendly and accommodating which I took as another sign that I would regret the meal. WRONG!!The buffet was by far the best meal I had experienced in the windy city. Both the roasted and the fried chicken were perfectly spiced. The candied yams were better than any Thanksgiving I can remember. The greens!! I had to stop myself after my second full plate. I will not return to Chicago without a revisit to my new favorite Soul Food joint.Shatangi told you...", "rating": "5", "date": [2007, 7, 18]}, "23": {"description": "Both locations are clean and friendly, food is above average for a buffet.", "rating": "4", "date": [2012, 5, 1]}, "8": {"description": "On Sunday (06/28/15) I visited the BJ's Market location on south Stoney Island.  Anyone who knows me know I'm a stickler for excellent customer service and will go out of my way to get it!  We here is how my BJ's Market experience went:* I ordered the BJ's Combo.  One of the meat options was fried chicken wing, which I order with my meal.  The cashier stated \"you can't get that! I don't know why they even put that on there\"!  WHAT?!  What's the purpose displaying this option if I can't order it?  So I got the turkey sausage patties instead. * I order my eggs scrambled hard with cheese.  The cashier asked if I wanted \"cheddar or American\", I said American.  (remember this point)* It was difficult to find a place to sit because so many of the tables were dirty; it was evident that people had been sitting there.  The booths seats were broken, dirty or falling apart (torn fabric, etc).  Plus the tables were leaning.  How do you expect a customer to eat on an uneven table?   The front windows are gross and the floors haven't been mopped! Overall the place looks dirty, worn down and needs updating.* I do enjoy a good cup of coffee and the coffee was HORRIBLE!  Not to mention I had to make my cup of coffee myself and the counter was discussing.  The counter was covered with sugar and coffee stains......GROSS!  Why do I need to ask for a cloth to wipe \"YOUR\" counter down.....you don't see this mess?!* I complained to the manager and he looked at me like I had three heads.  Not to mention he wasn't wearing an apron or a hair net.* Now I notice a young lady wiping down tables with her head wrap on (the head wrap you sleep in) and no hair net.  After about 10 minutes she puts a net on top of her head wrap.  I'm so amazed at the unprofessionalism in the African American business, it's a shame!* Now it's time for my food.  The young lady delivers our food to another table.  Why was our food delivered to another table?  Well that's because the cashier didn't give us a number to indicate to the server which table to deliver the correct order.   So it was a few minutes before the young lady realized the food belonged to us.* I'm really concerned because my food is being delivered by the same young lady who was wiping down tables.  Did she wash her hands before she started handling food?* Now I received my food.  Remember I order scrambled eggs hard with American cheese.  I received medium scrambled eggs and NO cheese.......I HATE mushy/slimy eggs!  Once again I complained to the manager and all he could say is \"she didn't charge you for cheese\".  I don't give a hoot what she did or didn't charge me for I didn't get what I ordered!* My pancakes were heavy.  They had a great flavor but they weighed a ton!  Whatever happened to light fluffy pancakes?* We weren't offered any water, should I ask for this too?* Oh and now I have some random person going from table to table begging for money.....really?I eat out 2-3 times a week and I know good service.  It's sad that African American businesses continue to provide lousy service but expect you to patronize their establishment.  I proudly spend my money where I receive exceptional services!Signed, a very unhappy customer!", "rating": "1", "date": [2015, 6, 29]}, "31": {"description": "For days I was passing B.J. Market and seeing their advertisement for turkey rib tips.  Today I decided to try them out.  They taste fine but the meat was too tough to swallow (literally).  The take out service was also poor but I decide to let it pass because I was just happy to have my turkey rib tips.  When I got them home I was so disappointed.  I called them and told them about the TOUGH turkey rib tips and all they could say was \"thanks for letting us know\".  It's a shame too because I didn't write them off until the manager showed me she didn't care.", "rating": "1", "date": [2010, 2, 26]}, "34": {"description": "BJ's has had better days.  The food was phenomenal when it first opened but now the quality has faded a bit.  For whatever reason the food was better at the 95th street location before they closed.  Stopped going to the one on 87th as of late.   Food?   Greens, mac & cheese are good, peach cobbler is a bit sloppy.   The place is clean and maintained well, except the restooms.  Parking is a challenge.  In short, this is comfort food for the soul.", "rating": "3", "date": [2009, 6, 22]}, "16": {"description": "Much better!!  Ate here a few years ago and was not impressed. Haven't been back until yesterday.So yesterday I had a taste for some good ole' fried pork chops.  Now normally i don't believe in going to soul food restaurants because I'm a pretty good cook myself.  But yesterday was the exception! I didn't have time nor energy to cook so i decided to just give in.  I was very pleasantly surprised.  The food was very good. I had pork chops with mac n cheese, green beans, dinner roll and peach cobbler.  Everything was very delectable and the service was quick.", "rating": "3", "date": [2010, 6, 16]}, "13": {"description": "I love it here.  I've worked in the neighborhood for 5 years, and this place is a staple for everyone at work.  I can't believe that I haven't reviewed this place before!Unlike most reviews, this review is for the actual brick and mortar restaurant, NOT the taste.Let me start off by saying that the staff here is incredible.  Everyone is so incredibly friendly and sweet.  Awesome.  Always smiling.  They know great customer service.  It's very apparent that they all work together as a team, as the general flow of the restaurant is very low-key and super efficient.  Everything that I've had here is down right tasty.  Greens, turkey tips, rib tips, chicken, chicken fingers and my all time favorite, the breaded shrimp.  It's down right smack-yo-mamma soul food that you can't go without for a whole summer (trust me...on summer break I make a trip here at least once a month!).I highly recommend coming to BJ's for some tasty soul food!", "rating": "5", "date": [2012, 8, 30]}, "11": {"description": "Good soul food. Nice atmosphere. Recommend if in the area. Get the smothered chicken.", "rating": "4", "date": [2014, 4, 19]}, "39": {"description": "Some of the best soul food in Chicago.  The mustard-fried catfish is an outstanding highlight.  Almost all of the sides are awesome, but some are just okay.  The cornbread is to die for.  The rice and beans are great.  The creamed corn is really, really, good.There is, however, something inconsistent and weird I will note about the customer service at BJ's:When you enter, the entire staff will greet you in a really friendly way-- like, they've ALL been trained to stop what they're doing and say \"Hi, welcome to BJ's\" in a really bright, cheerful way the moment they see you.  BUT THEN, when the server brings your food, she will have the empty stare of a soul-sucked zombie, and not even look at you.  She will announce that she is your server quickly, in forced intonations that make it sound like a cold, empty mantra.I guess I'm saying it's weird and inconsistent.Top-notch food, though.", "rating": "4", "date": [2008, 8, 18]}, "37": {"description": "This is the total soul food experience. I have been here a couple times now, and every time I eat their mustard fried catfish, I just want more and more. This is such a great South side treasure, and I wish they would put one on the north side, but I\"m sure it would lose its validity if that were to happen. I think the great part about this restaurant is that it serves all the standard soul food dishes (cat fish, chicken, macaroni, greens, sweet potatoes etc.) but does it so much better than everyone else (to date...). Do yourself a favor and eat here. Get out of your overpriced north side neighborhood and go have some amazing soul food down on 87th and Stony.. you won't regret it. It has free parking, a very friendly staff (the servers are really nice and accommodating), the cooks are cool, and the atmosphere is very clean and comfortable. They are very welcoming to people of all races, as I have seen quite the diverse mixture of people in this restaurant. This is a clear indicator of an excellent restaurant, and no matter where it is located, people will come to eat their food. No go here!!! and get the catfish!!", "rating": "5", "date": [2009, 2, 15]}, "0": {"description": "Slept in on New Year's Day and when I did actually wake up I was extremely hunnnnnnnngrrrrrrryyyyyy, since I'm not from the area I yelped a few soul food places and Bj's had some pretty good reviews. The only reason I didn't give the place 5 stars is because they didn't have smothered pork chops so I settled for fried chicken. The food was fresh, seasoned really good and the mustard catfish was great seeing as though I don't even care for fish. I'd definitely eat here again if I'm in the area..", "rating": "4", "date": [2016, 1, 2]}, "38": {"description": "Yet another Southeast Side treasure!Like a lot of kids in my generation I am not a huge fan of \"soul food\" and I still don't eat it a lot.But BJ's Market prepares everything as it should be -- without a lot of the excessive salt, fat, sugar and general overcooking the plagued a lot of the soul food I grew up eating.The catfish, of course, should not be missed. The greens are outstanding, as are the sweet potatoes and macaroni and cheese. And it's not a trip to BJ's if I don't leave with some peach cobbler. I don't get there often enough, but when I do I always enjoy it.", "rating": "4", "date": [2009, 2, 4]}, "27": {"description": "My sister and I decided to take my Dad and the entire family out to dinner this evening but due to his health issues we weren't sure where to take him.  My sister finally suggested BJ's Market. I was hesitant because I dined at the restaurant before and was not impressed so I expected a less than mediocre experience.Well I'm glad to say that I was wrong and the money was well spent.  Everybody at our table was very satisfied with their choices. Even my 10 year picky eating daughter ate ALL of her food. I even liked the mac and cheese which is always a hit or miss in restaurants.  I especially recommend you try the barbequed turkey tips! Very tasty.  My only complaint is that the food was lukewarm when served. All in all it was a great food experience and I plan to go back again!", "rating": "4", "date": [2011, 5, 22]}, "32": {"description": "If you go here....please have the Catfish for me! I love catfish & this is some of the best I've had. The peach cobbler is good too !Basically if the food shows up in my dreams .....in color...... that means it's good & I will go and have some if I dream about it , just following the rules here", "rating": "4", "date": [2010, 2, 3]}, "44": {"description": "We checked this out after seeing the review on Check Please. Holy God is their food delicious! Some friends & I went a few Easter's ago.  It was nice to get out of the northside bubble. The buffet is full of so many delicious options. Since I've never really had soul food before, I tried mostly everything.  I can still taste the creamy, buttery sweet potatoes. My friend ate so much he yacked later that day.  It's just that good....", "rating": "5", "date": [2006, 9, 17]}, "24": {"description": "I finally made it to this place which was on my list of places to try.  I was there mid afternoon and the place was doing a moderate business. I had the New Orleans special which consisted of chicken and fish plus two sides. The chicken was tasty but a little dry. The fish, on the otherhand, was excellent. I don't know if was the infamous mustard catfish because it was flaky and didn't have that typical catfish aroma. My sides were the mac and cheese plus brussel sprouts. The mac and cheese seemed like it was just macaroni with some american cheese melted on top. I've had better. The  brussel sprouts were a nice accompaniment - fresh and not overcooked as people tend to do with brussel sprouts.Negatives: It seemed that they were breaking in new people - service, albeit pleasant, was a little clunky. Not all the sides are listed on the chalkboard so take a look to see whats available.I see they have a buffet on weekends. I will definitely be back for it.", "rating": "3", "date": [2012, 4, 26]}, "7": {"description": "We got here and they were trying to lock the door. So ny wife asks are you closed they responded no. So ny wife asked arr you still serving food they responded with yes. There was an attitude in the air from employees at the counter. I've been here years ago and the food was delicious. We wanted to eat here but after the way we were treated we got it to go.", "rating": "1", "date": [2015, 4, 4]}, "40": {"description": "I've been here a number of times... I really like their mustard catfish and bbq chicken strips.  they have a buffet some nights (not all though?) that's got everything on it... if  you don't want the buffet you can order everything a la carte at their counter and take it to go or eat there...Originally I think BJ's was trying to do healthier than regular soul food... Not sure that anything I ever order is all that healthy..It's clean... one of the more sanitary feeling places in the area.  The prices are decent, not that great, not bad.  (I'm told Soul Queen just two blocks away is cheaper and has food that's just as good... though not as clean.  the parking lot is always packed, though)Employees here are very nice.", "rating": "4", "date": [2007, 10, 12]}, "30": {"description": "OMG, I can't believe that people are saying this food is great. ARE YOU SERIOUS?! I totally agree with Evan. If you think this food is good, you would love a good soul food place. I ordered the catfish and mac and cheese with greens. The catfish tasted old, like it was sitting out too long. I got more juice in my greens than actual greens and the mac and cheese was thick as hell. (Don't know about you but I like my mac and cheese creamy, smooth and cheesy) I wish I didn't have to give this place a star.", "rating": "1", "date": [2010, 4, 22]}, "1": {"description": "I am very disheartened to write this review.  Why?  Because this is an establishment that when it opened in the late 90's was such a gem.  Great flavorful food, a wonderful buffet on Sunday and you would usually see the owner in the restaurant.  I had a great respect for this business because they employed young people there and they were always respectful and super friendly which I attributed to the business training them.  My church had an event in 1999 where I was the chairperson and happily ordered from their catering menu.  Food was great and it felt good to support our black businesses.The last couple of times I have gone here whether dine in or carry out, wasn't too good of an experience.  But, on 12/5/15, due to the experience that evening, I know I will never return.  After a long day of work, I just wanted to get carry out so I could eat and relax at home.  When I walked in, I looked at the short ribs and knew that's what I wanted until I looked at the menu.  The price for that was $14.49!  Do you know what ALL I can get for that price?  I can get jumbo fried shrimp dinner with fries and slaw for less than that!  Most of the menu prices have gotten too expensive to my disappointment.  I knew I couldn't afford the ribs so I ordered the $7.49 veggie plate of cabbage, sweet potatoes and mac & cheese.Now, the way the set-up in this establishment is, the food that's in the glass case is hot and ready to go.  I never understand why the wait is so long to get my food if I see it staring right in my face.  I waited and waited.  I waited so long that the person I was riding with came in the restaurant wanting to know what was taking so long.When I finally got my food, I left.  About 5 minutes later, I checked the bag and was so angry at what I saw.  The food is in a sectioned styrofoam container.  A roll/corn bread comes with the meal wrapped in a tissue sheet and put loosely in the bag.  Napkins and plasticware are also loosely in the bag.  As you can see from the picture, alot of cabbage green juice leaked in the bag, causing my roll to be damp.  I had to use the napkins in the bag to soak up this juice.  Nasty!  This is simple to eliminate!!  Why isn't a slotted spoon used so no juice?  Why aren't the cabbage greens put in a separate container OR have a take out container that is sealed completely?  I waited all that time and this is what I get?  Unacceptable.  As you can also see, something is in my greens that are NOT greens!  Disgusting.Looking at other recent reviews, I notice that I'm not the only person that has realized that this establishment has lost it's sparkle and it's just sad.  By the way, no owner to be found that day like back in the day.  Well, no more of me being a customer after this incident.", "rating": "1", "date": [2015, 12, 15]}, "9": {"description": "Sure the food LOOKS good, but looking good and tasting good are two different things. The food looks like Heaven, but tastes like cleaning supplies.I was persuaded by my boyfriend to give this place a try, but based on the Yelp reviews my gut instinct told me otherwise. I listened to him anyways, and got the 1/2 dark chicken smothered style. My sides were mac and cheese and stuffing. I also couldn't resist getting a slice of peach cobbler.My boyfriend got the rib tips and the same sides as me.My portions were huge, but the mac and cheese was flavorless, the chicken tasted like gravy and pine sol, and the stuffing was entirely too salty making it inedible. The peach cobbler was OK but it was pretty dry. His rib tips were okay to him, but the portion was small considering you could get twice as much for the same price elsewhere.I spent $25 on food which was disgusting. I threw it out and went to Wendys across the street.", "rating": "2", "date": [2013, 4, 20]}, "26": {"description": "I enjoy soul food, so me and the family stop by for dinner. I have the half pound of shrimp and mash potato. Next time I'm going to get the pound of shrimp and catfish, plus all the side dishes and cornbread muffins. The the food and the service is great.", "rating": "4", "date": [2011, 8, 21]}, "25": {"description": "You lie!!! You lied to me again My fellow Yelpers!!!! I trusted you and I think that you need to get together and buy me a meal ;)  I'm not sure what type of soul food you all are used to but this place is NOT the business..NOPE...There were a couple of pros-The Yams were DELICIOUS and so was the dressing.Oh yea,the fruit punch was great too..That is all.We were a party of 4 and NONe of us liked our food.They use  BOXED MASHED POTATOES!!!! Nooo,Nooo,nooo! That's a NO NO..ANd my macoroni was made with cheez wiz or velvetta of some sort-EEEEW! My food was also half cold and the waitress seemed to be lost.Guess I'll stick to cooking at home..but,if you don't believe me and insist on going..PLEASE don't get those 'Mashed potatoes!\" They try to fool you with all of the gravy,but those are rehydrated dried potatoes.", "rating": "2", "date": [2012, 1, 8]}, "12": {"description": "I love me some BJ's!!!!!! I've been eating there since I was 12!!!!! Recently I frequent the place at least once a week. I love their mustard cat fish, turkey meat loaf, Mac and cheese, dressing, green beans, peach cobbler, candied yams, bread pudding, and caramel cake!!!! I always smash there!!!!!", "rating": "5", "date": [2014, 3, 8]}, "21": {"description": "BJ's Market does soul food with a healthy twist. It's been around for years and still has some of the best smoked chicken I've had anywhere. I also love the mac & cheese and their cabbage has just the right amount of kick from banana peppers. For dessert, try the strawberry shortcake. The restaurant is managed well and service is always friendly and attentive. My only reason for not giving it 5 stars is that there are no napkins and condiments on the tables, you have to ask someone at the counter or a server for them.", "rating": "4", "date": [2012, 5, 19]}, "17": {"description": "BJ Market Nasty food ruin my Thanksgiving. The food made me sick and I threw up. I cannot believe I wasted a $100 on this terrible food. The owners should be ashamed of themselves for serving food like the one I received. How could you charge $49.99 for a cheap turkey that was raw on the inside? I am WARNING you people to avoid BJ Market at ALL cost.I will start by giving everything I bought a grade from 0-10.Turkey - 0Problem-                 -Not a Butterball, Purdue, or even Jennie0 turkey.- Taste cheap, very cheap.- Had a nasty, nasty taste.- Had the worst smell I ever smelled from a turkey.- Raw on the inside. - Made me throw up soon after eating it. Dressing- 1 Problem-  Very, very soggy and gummy like bubble gum- Taste like it was from a box.- Not real soul food.- It looked like a child made it.- I once bought boxed dressing that tasted better their dressing.Gravy- 0Problem- Very lumpy and awful.Corn muffin- 2 Problem- Terrible", "rating": "1", "date": [2012, 11, 23]}, "10": {"description": "great food. the salmon fillet was freshly prepared and well seasoned. pricing is very reasonable and the customer service is good. i highly recommend this restaurant", "rating": "5", "date": [2014, 11, 10]}, "5": {"description": "Gave them 1 star because I couldn't give them zero! Was in the mood for some soul food so I was in the neighborhood and decided to try them out. I ordered a whole chicken, half fried and half rotisserie. First off there was no seasoning and to top it off, the chicken was RAW not a little pink, but bloody. after waiting over thirty minutes and getting home, I just didn't feel like going back up there to cause a scene. Never again. food was not good at all!", "rating": "1", "date": [2015, 9, 21]}, "35": {"description": "It would get 5 stars if it was more convinently located.  I was working with my manager one fine day when we got hungry for some lunch.  We couldn't find anywhere we recgonized for lunch, so we deicded to stop in at BJ's.  The place blew me away... it blew us both away. It's very casual.  I mean, seriously, wear anything. Everyone was friendly and helpful.You just walk up to the counter and place your order, and then you take your number and place it on the table you pick... They bring your food around to you.  And then you indulge.  The helpings are huge.  The food is FANTASTIC!  I never ever would have thought to go into this place.  It was absolutely wonderful.  I was totally surprised!  Mac and cheese... oh dear Lord.  It made my eyes light up. I also had jumbo fried shrimp and cornbread.  These people know how to make a meal.  They really do.  Some of the best cornbread I've had. The prices are totally low.  I mean, low low low.  Which is a good thing for those of us trying to pinch a penny or two. Unfortunately after that completly satisfying meal I instantly went into a food coma and working was tough.", "rating": "4", "date": [2009, 3, 31]}, "19": {"description": "This Restaurant is FANTASTIC.  My husband wanted to try authentic Soul Food and we searched for a place to try online.  We were not disappointed.  He had the Mustard Catfish and one side, sweet potatoes,  It was amazing.  He let me share a bit, and the fish was crisp, seasoned and perfectly cooked.  The sweet potatoes were without question, the best I have ever had and I grew up eating soul food.  I had the weekly special of chicken wings and fries and again, it was terrific, seasoned and fried to perfection.  The service, which I'm pretty picky about was excellent.  We had our meal within minutes and the waitress checked back with us to see that we had every thing we need.  Note...You order and pay for your meal at a counter, then find a seat.  They bring your meal to you using the table number you place on your table after paying for your meal a the counter....We did leave a tip as the waitress was both helpful and friendly.  As we left, we complimented the staff on the food and service and noted all the wonderful items we still want to try.  We totally enjoyed our meal and will return again when we visit the Chicago area.", "rating": "5", "date": [2014, 2, 13]}, "28": {"description": "Actually would like to give this spot 2.5 stars just because of the one girl that works there that was super friendly. I just couldn't bring myself to click the extra star though to make 3.  I. . . just. . . . couldn't. . . . do . . . . it. ( -_-)Back when I could still eat fried food, I would get the taste portion of BJ's mustard fried catfish at the Taste of Chicago whenever I went. I had always meant to actually go eat a meal at the restaurant, but never got around to it. Well, last Sunday I and a couple of other Yelpers made the trek out to Bj's for their buffet. My experience is what I write next. OKAY, I saw on their website they had buffet on Sunday starting at 11am. I called two weeks in advance to double-check that info and it was confirmed \"solid\" by a young lady over the phone. We get there a little past 11am and I don't see anything out on the buffet. I inquire and am told the buffet won't be til 1pm. Whaaaaaaaaaaat?!?!?, was actually my response. So, we had to just order plates of food. You order an entree (lrg or x-lrg) which comes with two sides. You can add a drink & a dessert for a little extra. I got the pork rib tips w/sides mixed greens and mac & cheese. I chose cornbread for the bread. I got the drink and peach cobbler as a dessert. It all came out to $11.89 which bugged me since buffet, which is what we came for, was only about $4 more. Our food was brought out to our table shortly after ordering and I'm ready to dig in. Can you say complete and utter disappointment!  I couldn't. . . . . *pause* So, let the record show that all soul food is not created equally, as with any other cuisine, before I continue with this review. My own soul food is what I have take from different members of my family that were raised in the backwoods of Alabama and have tweaked to perfection. I rate against a high standard *unpause*. . . . . understand why so much on my plate was not hot and not at least tasty. -My rib tips: Were almost cold, the meat was tough, some bones had nothing on them but fat, there wasn't much sauce and what sauce there was wasn't all that flavorful. This is an epic fail!-My mixed greens: Were dry for the most part. I didn't have to worry about any of the \"pot-liquor\" running in my other food as I usually do cause there wasn't any. Seriously, I mean. . . c'mon, son!-My mac &cheese: Velveeta/American cheese-ish. Noooooo! In the words of Martin Lawerence, \"Don't nobody put pasteurized cheesein macaroni and cheese. You got to use cheddar. Cheddar's what you use. My mama taught me that. ...\"-My cornbread muffin: Was absolutely delicious. :-/-My peach cobbler: Was soupy and I hate soupy peach cobbler. The peach cobbler was flooded while the greens were in a drought. As with too many people who cook soul food, basic cooking principles aren't used when making this dessert. Cooking the peaches briefly before you assemble the cobbler. Simple as that. The peaches weren't tender, still on the crisper side. I was thoroughly not pleased. -Caramel cake I got to-go: That frosting was just not right. The cake was way too dense to be a layer cake and tasted terribly buttery. That's just the food. The cushions in the bench seats were coming apart from the frame. There was't much lighting in there, even on a bright sunny day which gave such a dank atmosphere. Only one, I say one, of the people working there was friendly, helpful and welcoming. The rest just seemed unconcerned about anything that wasn't their direct task. C'mon, son! As the saying goes on Yelp, I wanted to like this place. But I sincerely did not.", "rating": "2", "date": [2010, 7, 19]}, "3": {"description": "I was pleasantly surprised with this place for food (definitely not service.. they are SLOW in here!) and most everything is prepared that we ordered. Maybe it was an off night. Didn't taint my view of the food though.. one word YUMMY! I had the half chicken, cabbage, and greens.. and these veggies (and the chicken), but those veggies truly didn't disappoint. I feel like that was the most heavenly plate of cabbage I've had in a sec. I'd go back in a heartbeat. What was oddly fascinating was I guess they do karaoke in there from time to time. Quite strange, but entertaining nonetheless. I definitely appreciate BJs adding a non-fast food element in the area.", "rating": "4", "date": [2015, 3, 18]}, "33": {"description": "c'mon people, there are way better places for southern/soul food then BJ'sI lived in South Shore for 2 years, and if you want really good food on the South Side, its true there is a dearth of modern, well run establishments, but if you look ye shall find and this is not one of them.Their Mac and cheese is junky, and the catfish and chicken I've had there mediocre, and veggies done so well they might as well be liquified. The staff at BJ is extremely friendly and nice, if thats all you want in a restaurant.As Barack Obama stated on Check Please several years ago, please please, we need more solid restaurateurs on the South Side. You will be supported.", "rating": "1", "date": [2009, 11, 25]}, "43": {"description": "I love BJ's Market. You know usually I am really leary of going to buffets but a number of years back my mom wanted to try this place out and it was amazing. It's kind of funny...it's like they have a swat team manning the buffet. Their staff walks around with headsets watching the buffet and when something runs low they are radioing back for more. I forget what they were out of at the beverage station...maybe straws and my husband asked one of the team members for them and it was like a major emergency. LOL It was cute tho. They also keep the buffet area very tidy which I really appreciate. Okay, on to the food....excellent! The fried catfish, mac and cheese all yum and omg the banana pudding with the vanilla wafer on top.....so good!! Basically everything on the buffet was tasty but I was downing the catfish and mac and cheese mostly. If you like yummy southern cooking give this place a try...even if you don't live in the area...do it!", "rating": "5", "date": [2007, 2, 28]}, "2": {"description": "Didn't get the cornbread til the end of my meal. BJ's Market: You suck! I need cornbread WITH my soul food. More like faux soul food, smh.Mustard catfish : Crust waaay too thick and lacking flavor.Blackeye peas: Needed salt. Meh.Greens: Needed hot sauce. Mediocre.Cornbread: It was soft and warm. Lacking flavor, though.I definitely won't be back.", "rating": "1", "date": [2015, 6, 14]}, "18": {"description": "Actually would like to give this spot 2.5 stars just because of the one girl that works there that was super friendly. I just couldn't bring myself to click the extra star though to make 3.  I. . . just. . . . couldn't. . . . do . . . . it. ( -_-)Back when I could still eat fried food, I would get the taste portion of BJ's mustard fried catfish at the Taste of Chicago whenever I went. I had always meant to actually go eat a meal at the restaurant, but never got around to it. Well, last Sunday I and a couple of other Yelpers made the trek out to Bj's for their buffet. My experience is what I write next. OKAY, I saw on their website they had buffet on Sunday starting at 11am. I called two weeks in advance to double-check that info and it was confirmed \"solid\" by a young lady over the phone. We get there a little past 11am and I don't see anything out on the buffet. I inquire and am told the buffet won't be til 1pm. Whaaaaaaaaaaat?!?!?, was actually my response. So, we had to just order plates of food. You order an entree (lrg or x-lrg) which comes with two sides. You can add a drink & a dessert for a little extra. I got the pork rib tips w/sides mixed greens and mac & cheese. I chose cornbread for the bread. I got the drink and peach cobbler as a dessert. It all came out to $11.89 which bugged me since buffet, which is what we came for, was only about $4 more. Our food was brought out to our table shortly after ordering and I'm ready to dig in. Can you say complete and utter disappointment!  I couldn't. . . . . *pause* So, let the record show that all soul food is not created equally, as with any other cuisine, before I continue with this review. My own soul food is what I have take from different members of my family that were raised in the backwoods of Alabama and have tweaked to perfection. I rate against a high standard *unpause*. . . . . understand why so much on my plate was not hot and not at least tasty. -My rib tips: Were almost cold, the meat was tough, some bones had nothing on them but fat, there wasn't much sauce and what sauce there was wasn't all that flavorful. This is an epic fail!-My mixed greens: Were dry for the most part. I didn't have to worry about any of the \"pot-liquor\" running in my other food as I usually do cause there wasn't any. Seriously, I mean. . . c'mon, son!-My mac &cheese: Velveeta/American cheese-ish. Noooooo! In the words of Martin Lawerence, \"Don't nobody put pasteurized cheesein macaroni and cheese. You got to use cheddar. Cheddar's what you use. My mama taught me that. ...\"-My cornbread muffin: Was absolutely delicious. :-/-My peach cobbler: Was soupy and I hate soupy peach cobbler. The peach cobbler was flooded while the greens were in a drought. As with too many people who cook soul food, basic cooking principles aren't used when making this dessert. Cooking the peaches briefly before you assemble the cobbler. Simple as that. The peaches weren't tender, still on the crisper side. I was thoroughly not pleased. -Caramel cake I got to-go: That frosting was just not right. The cake was way too dense to be a layer cake and tasted terribly buttery. That's just the food. The cushions in the bench seats were coming apart from the frame. There was't much lighting in there, even on a bright sunny day which gave such a dank atmosphere. Only one, I say one, of the people working there was friendly, helpful and welcoming. The rest just seemed unconcerned about anything that wasn't their direct task. C'mon, son! As the saying goes on Yelp, I wanted to like this place. But I sincerely did not.", "rating": "2", "date": [2010, 7, 19]}, "41": {"description": "BJ\"s is great. I've been here numerous times and the food is always great and the staff is extremely competent and friendly. Whoever manages knows how to train their employees for customer service.Love love love the stuffing (dressing, whatever you want to call it), love the chicken wings, turkey wings, beef ribs (yum yum yum!), mac and cheese, potato salad, and pretty much everything I've had on the menu (never tried any pork stuff or greens).I just wish they'd put more vanilla wafers in the banana pudding, but other thank Scrumdillyumptious!", "rating": "4", "date": [2007, 8, 28]}, "4": {"description": "Today I stopped in to grab some food before work.  I noticed that they had a new menu item \" Turkey Burger\"  and the burger was very tasty. But I will complain that the meal was offered with fries or  onion rings. I opted for the onions and only 4 small onion rings came with the meal.  Considering I paid $8.99 for the meal it should have came with more.", "rating": "2", "date": [2015, 8, 5]}, "6": {"description": "Slowest service EVER! Waited for 40 minutes for a To-go order for a piece of fried catfish. Somehow my order was overlooked by the cooks... On a rather moderate business day...? Eventually got a refund and left. BTW, my refund won't return for 7-10 business days. Lol absurdity.", "rating": "1", "date": [2015, 8, 29]}, "22": {"description": "In the area and stopped in for breakfast. Nice staff, very clean, good portions, fair prices & great food.  Looking forward to trying it later in the day too.", "rating": "4", "date": [2012, 5, 15]}, "15": {"description": "I finally made it to this place which was on my list of places to try.  I was there mid afternoon and the place was doing a moderate business. I had the New Orleans special which consisted of chicken and fish plus two sides. The chicken was tasty but a little dry. The fish, on the otherhand, was excellent. I don't know if was the infamous mustard catfish because it was flaky and didn't have that typical catfish aroma. My sides were the mac and cheese plus brussel sprouts. The mac and cheese seemed like it was just macaroni with some american cheese melted on top. I've had better. The  brussel sprouts were a nice accompaniment - fresh and not overcooked as people tend to do with brussel sprouts.Negatives: It seemed that they were breaking in new people - service, albeit pleasant, was a little clunky. Not all the sides are listed on the chalkboard so take a look to see whats available.I see they have a buffet on weekends. I will definitely be back for it.", "rating": "3", "date": [2012, 4, 26]}, "20": {"description": "We tried the mustard-fried catfish at the Taste. SO TASTY. and the sauces!!! Big fans. Will have to try the actual restaurant sometime :)", "rating": "4", "date": [2012, 7, 16]}, "36": {"description": "Went here on a Sunday in the early afternoon, and luckily just beat the post-church crowd.  At the time we went, all that was available was the buffet, but there was a great spread to choose from: different kinds of catfish, chicken, mac and cheese, greens, pork chops, loads of desserts, and more.  I was a huge fan of the mustard catfish, pork chops, mac and cheese, and peach cobbler (great!) but wasn't blown away by the other offerings.  The only major gripe I had was the price - $17+ for a lunch buffet seems to be a bit high.I think a big part of the issue was that we came in right before they refreshed the buffet, so the food we ate was cold and had sat out a bit.  Judging by the stellar reviews everyone else has given BJs, I'm pretty certain I missed out, and intend to head back on a non-buffet occasion when I can eat something cooked-to-order.  I have a feeling my rating will go up after that!Aside from the food, the location was huge and very nice; loads of parking as well.  For those of you thinking of heading here on a Sunday, try to hit up around 11:30-12 to make sure you beat the rush (it was slammed by the time we left ~1).", "rating": "3", "date": [2009, 2, 26]}, "14": {"description": "We tried the mustard-fried catfish at the Taste. SO TASTY. and the sauces!!! Big fans. Will have to try the actual restaurant sometime :)", "rating": "4", "date": [2012, 7, 16]}}, "neighborhoods": ["Calumet Heights"], "latitude": 41.73561, "longitude": -87.586, "rating": "3.0", "times": {"Mon": ["7:00 am", "9:00 pm"], "Thu": ["7:00 am", "9:00 pm"], "Sat": ["7:00 am", "10:00 pm"], "Wed": ["7:00 am", "9:00 pm"], "Tue": ["7:00 am", "9:00 pm"], "Sun": ["7:00 am", "8:00 pm"], "Fri": ["7:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Soul Food", "soulfood"], ["Southern", "southern"]], "address": ["8734 S Stony Island Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Casual", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch, Dinner"}, "category": "Restaurants", "number_of_reviews": "45"}, "soul-gourmet-chicago": {"comments": {"1": {"description": "3 Fridays in a row now I have had their food for lunch, and have liked everything. That never happens with me.Definitely a fan.", "rating": "4", "date": [2011, 3, 18]}, "0": {"description": "This locally assembled vegan fast food can be found in the refrigerated to-go sections of places like Whole Foods and Treasure Island. It is definitely worth the price tag, my only complaint is the super high fat content in most dishes. Why make a kale salad with 40 grams of fat? Why?But at least they are honest on the nutrition labels. And the stuff tastes good.", "rating": "4", "date": [2010, 11, 30]}}, "attributes": null, "neighborhoods": ["Calumet Heights"], "categories": [["Specialty Food", "gourmet"]], "address": ["1700 E 87th St"], "latitude": 41.737217, "longitude": -87.582588, "category": "Food", "rating": "4.0", "price": "$$", "number_of_reviews": "2"}, "leonas-pizza-and-italian-restaurant-chicago-3": {"comments": {"28": {"description": "The stars are for the food, NOT the service.  For the area this place is a gem. Prices are cheap, food was close to great.  Looks fancy but don't be discouraged if you are dressed down.", "rating": "4", "date": [2010, 11, 7]}, "1": {"description": "Dough suddenly seems way too pre-made, not daily in house.  Perfectly circular, holes perforating the bottom. Unsatisfying.  Asked for extra thin, extra crispy and well done and the crust was a uniform, not particularly thin and barely browned - not even slightly crisp.Overall lack of flavor, despite the quantity of toppings.  Nicely browned cheese had no mozzarella flavor, not the slightest hint of onion or mushroom detectable.  I'm better off making it from scratch at home so if it's subpar I'm out a lot less money and have nobody to blame but myself.  Chocolate cake super pricey, but at this point the best thing on the menu.  Meat lasagna, which has always been a win, dried out and lacking extra sauce to compensate.  Not sure what the hell happened.", "rating": "1", "date": [2016, 1, 23]}, "9": {"description": "OMG! This restaurant should be on the television program for horrible restaurants, called restaurant rescue! The food is microwaved! It is made the day before, put in the microwave and serve it! The chef makes the plate very hot to mask the frozen center of the Lasagna! Needless to say we returned three plates of frozen in the center lasagna. And demand that it was taken off of our bill. When we complained, the chef came into the restaurant, I guess to intimidate us?! Wow this Leona's is laughable! I see why it is empty on a Friday night! I have never been in a Leona's restaurant anywhere else in the city and it is this empty! Lastly as we were leaving out of the restaurant, the chef was outside taking a smoke by the dumpster! While inside food was still being served up. I guess they just microwaved it!My recommendation, save your time and your money, go to another Leona's restaurant. This restaurant give Leona's a very bad name!", "rating": "1", "date": [2014, 8, 31]}, "29": {"description": "The first few experiences with this location have not been so good in 2008-2009 but now I'm in love with this place. I love there big fat vegan burger with avocado and grilled onions with there vegetable minestrone soup. I always order delivery and the food always come on time or sooner than expected. The only thing for me is that the delivery added can be a bit on the expensive side for a struggling college student (around $20 for one meal) but i treat myself to this place every now and then.", "rating": "4", "date": [2010, 7, 6]}, "23": {"description": "Dining in may be fine, but delivery is THE WORST!!! I am 3-minute drive from the restaurant, and ordered a breakfast skillet...that's all....a skillet...on a Sunday morning. After an hour, the restaurant called to inform me that the delivery driver would be arriving in 15 minutes. I live in a courtyard bldg, so I went downstairs to meet him. After waiting for half an hour, I went back upstairs. 45 minutes AFTER THAT, the driver called and said he was downstairs. I met him downstairs and presented him with a $20 bill for my $10 dollar order, and he informed me that he did not have change because I was his first delivery order. I was so angry, I just turned on my heels, walked away, and called the store manager. The manager initially tried to argue with me, telling me that the delivery time is an hour, and that I should expect delays, because the driver has a lot of orders on the weekends. I had to walk him through the timeline from order to delivery to show him that it had been, in fact, about 2 1/2 hours, not one...and that the driver arrived an hour after HE promised 15 minutes. When I brought up the issue of him not having change, he said it was probably because I was the first delivery order of the day.So, let me get this straight:The driver was an hour and a half late with a breakfast skillet because he had a lot of orders before me, but he didn't have change because I was his first order of the day...do I have that right?I called the restaurant back to get names (and I got them all: delivery driver, shift manager, etc.) and informed them that I was calling the corporate office to complain.35 minutes later, while I was in church, the delivery driver calls my cell phone and asks me to call him because he wants to give me my change. (!!!!!!!!!!!!!!!!!!) (mind you: this is now 4 hours after the fact) 5 minutes later, the manager calls. I received about 10 voicemail messages in total.I will NEVER order ANYTHING from this restaurant again, I don't care if it's free. The delivery service was bad enough, but to be insulted when clearly the mistake was YOURS???? Apparently, you don't need my business, so let me relieve you of the burden of my cash.", "rating": "1", "date": [2012, 5, 5]}, "5": {"description": "Have you ever seen a restaurant go downhill as fast as Leona's on Stony Island?? Called there Wednesday night to place an order and was on hold THREE MINUTES!! When I went to pick up the order after 35 minutes (food was supposed to be ready in 30)I drove the three blocks back to the house-the lasagna was cool, a salad was missing and the burger wasn't cooked to order. When I called the mgr to complain she wanted to play 50 questions to see if she could determine if I was wrong about something Well, she lost that game and a customer for life!!", "rating": "1", "date": [2015, 1, 14]}, "31": {"description": "The first and only time I went here...it was pretty good for the $10.98 I paid. I ordered the pasta with a side of chicken from their lunch menu. They took too long for the food, considering that it wasn't a lot of people there. I didn't like the salad. The \"breadboard\" bread was way to hard! I don't like hard bread! When the food finally came, it was delicious. The pasta was smooth, creamy and tasty. Besides the salad and bread, I would definitely give this restaurant another try.", "rating": "3", "date": [2010, 4, 5]}, "25": {"description": "I frequent this Leona's as it is near my home.. The service is usually above par... As of late, my favorite server is Renata, she's excellent, attentive and eager to provide superb customer service.. Juan is also awesome!! He will definitely try to straighten any issues.ALSO, they now have brunch on Saturdays and Sundays.. It is DELICIOUS!!!!", "rating": "5", "date": [2011, 10, 6]}, "12": {"description": "This use to be one of my favorite neighborhood spots!!!I don't know what has happened, they changed the bread that they use to serve!The food wasn't as good and flavorful!!!The cheese sticks and wings were still great but the main course was anything but exciting! The staff was great but the food was mediocre and for that reason I won't be coming back any time soon!", "rating": "2", "date": [2012, 10, 15]}, "37": {"description": "Come down here and yelp this Leona's, North Siders!Not a bad choice for lunch on the South Side. It was hardly crowded when we went. I'm not sure if all Leonas have downsized their menus or just this one but it was missing items like the albacore tuna wrap and ravioli. Our server, Omar, was friendly and didn't seem like he hated his job. He also held his own with 4 females \"hassling\" him. Portions are humongous. Italian beef--not so good. No peppers but it did come with au jus. Psychedelic salad is also humongous. It's like a fricken' garden on your plate.They were playing some very dated music videos during our visit. I only remember Billy Ocean and Bruce Hornsby. Entertaining.PS- They can give you to-go cups for lemonade.", "rating": "3", "date": [2008, 10, 7]}, "21": {"description": "We went to Leona's on a very busy day.   A local school was celebrating graduations.  I had a party of 15 and was alos celebrating a graduation.  CARLOS, the manager that day, did everything he could to make sure my party seated in a timely manner, our food was served in a timely manner and our memory was made wonderful for everyone involved!It turned out GREAT!  We all enjoyed ourselves, the food and the service.  The restaurant was PACKED that day and yet and we still managed to feel at home.  It was the BEST!  Thanks to CARLOS and his STAFF.  Thank you all for such a wonderful experience.5 stars all the way.  I would recommend this place to anyone looking for a top notch meal, excellent service and south side convenience.  Loved it.", "rating": "5", "date": [2012, 6, 12]}, "16": {"description": "This is the worst Leona's in the city, which is probably why its always empty, but I keep torturing myself cuz its right around the corner from my house. The blackened catfish I had was terrible. Its obvious they used not just frozen, but frozen and thawed and refrozen and thawed catfish.  I am always satisfied when I go to all the other Leonas, but this one seems to lack the same quality. I am really surprised they're still in business because it is always virtually empty.", "rating": "1", "date": [2014, 6, 9]}, "17": {"description": "I love this place!!!  Chicago's Southside is my second home & every time I'm in town, I have to stop at Leona's.  I always create my own pizza!  They do a great thin crust w/ alfredo sauce to start w/ & I build my own w/ everything from chicken to sundried tomatoes.  While I wait, the bar tender makes a great vodka tonic (drinking responsibly of course).  I recommend Leona's to everyone who visit's Chicago, their 91st & Stony location more especially!!!", "rating": "5", "date": [2014, 1, 1]}, "10": {"description": "I have order here few times in the past and I must admit the food is decent but today is my last time. I ordered a small pizza and I was told that it was going to take 30 minutes which is crazy since it was a weekday and when I got there it was dead. It took mote than 30 minutes and the pizza was cold. Manager tried to apologize but I took the pizza and walked away. Seriously people check the reviews before placing online orders.", "rating": "2", "date": [2015, 4, 14]}, "11": {"description": "Me and a bunch of my friends met here for my friend Yolanda's birthday. We entered the restaurant at approximately 6:30 pm. We ordered our food at 7:00pm. We received our food around 8:45, and I can't even count the mistakes, missing items, and what did come was COLD. I don't ever remember this Leona's having such poor service. Leona's on Stoney Island, step your game up...", "rating": "1", "date": [2015, 3, 6]}, "26": {"description": "The blackened catfish was great My sides, steam broccoli and macaroni and cheese was served just lukewarm, but were still good.  The mac and cheese was a little bit too cheesy for my liking, but it was edible.  My server Ronnelle was also great!  She was attentive, but not overbearing and very friendly.  The music videos that were playing were also very nice. I had been on a few occasions when they had live music and  I had hoped they had live music, but they didn't on this particular night.  I would definitely recommend this place", "rating": "4", "date": [2011, 8, 17]}, "27": {"description": "Even after I talked to the manager and got everything okay, I am still being harassed from Leon Toia because of the review I had because of the mistake they made. Has anyone else had to deal with him because of a bad review? Just wondering because he claims he is the owner of Leona's and he is acting like that? lol", "rating": "2", "date": [2011, 2, 7]}, "35": {"description": "I wanted to visit this particular location, since I live close by.  My first impression  was that this place is quite large, and decorated nicely. The 40s era pictures on the wall added a nice ambiance to the place.   It was not too crowded.  The food tasted good (ordered the meat lovers ravioli the first time, and  a veggie pasta dish the second) - I'd say its on par  with the other locations I've eaten at (112th Western,  Rogers Park,  Oak Park, and Hyde Park).  Service was good both times.   I also learned that there is live music on certain nights, which is neat also.   Outside of the Soul Vegetarian place (review forth-coming)... there isn't a whole lot of variety to choose from, as far as sit down places in the area;  Leona's is a welcome sight. South siders, check it out!", "rating": "4", "date": [2009, 7, 1]}, "8": {"description": "It's been a while since eating at this restaurant.My favorite was the Spinach Lasagna when visited it in Hyde Park.....magnificent!!!There's no more Spinach Lasagna......bummer!!!!However, when we (my Sweetie & I) arrived Saturday evening, I couldn't understand why it was so empty. Then after ordering our appetizer, Fried Calamari.....I looked at it and said \"What in the world is THAT?!!\" Now I'm beginning to understand the vacant tables...I should've taken a picture....there was batter fried green beans, lemons & limes and other things which I had no clue, all clumped together!! There was only a hands full of the actual Calamari....called the manager, she replaced it with the actual food. OMG....when I actually grabbed one to eat...it was rubbery!!!!! Needless to say....didn't eat it!!!My entree was the Shrimp Ravioli and my Sweetie had the Veal Ravioli.....his was excellent while mine was hard and it didn't taste like shrimp was in it!!!!!I complained once again to the manager.....and she gave us a 20% discount!!!!I should've read the reviews first!!!!!DEFINITELY LOST OUR BUSINESS!!!!!!", "rating": "1", "date": [2014, 10, 12]}, "0": {"description": "Not sure why the reviews are so negative. I eat here quite a bit and don't have any issues, but I usually pick up. They give you a 15% discount if you order online in advance. Yeah it's not the best lasagna or sandwich in town, but it's pretty good and it's only eight dollars! No complaints here.Service can be slow if you eat in and they do take a long time to deliver, but if you pick up this is a good choice.", "rating": "4", "date": [2015, 8, 13]}, "38": {"description": "I used to get delivery from here... it was always pretty mediocre.  At best.  We'd always order 2 things and no matter what it would be a gazillion dollars.Their wings were terrible.  Those aweful breaded things that aren't \"clipped\" like normal buffalo wings would be.  And zero spice to them.The sicilian pizza was like eating cheesebread. All bread no nothing else.  I do like their thin crust pizza.  The delivery driver took advantage of our innebriated state once and made us feel like we were cheap by tipping only $4 (when delivery was already $5), so we ended up giving him a $10 tip?  Then when he left we realized he had screwed us over on purpose.  And they're dumb, they can't even read house numbers, they always get lost.  How do you get lost on a grid street system?  I don't get it.The restaurant itself looks OK.. they always have stupid religious sayings on their sign.", "rating": "3", "date": [2007, 8, 16]}, "20": {"description": "so when church was over the grands were like let's go to leona's and i was like ok i thought we were going to the one in my hood but we came here which was good cause i know the hyde park location would be packed and this one was pretty empty so we were seated right away. i was in a group of six and we did take forever to decide what we wanted but the place was really empty so whatever. so we ginally ordered and like 15-20 mins into the wait the waitress comes back and tell us they have no salmon, how you not gonna have salmon wtf so she brings two menus back so we can change our order, my son gets an instant tude he's like ma now we all gonna have to wait longer to get our food i guess he was hungry lol! i went with the filet mignon sliders, it was not like butta  as they advertised, they were tough and kinda dry, the blue cheese was all over the place making that one really sloppy. my soup was sooo good but the soup always is. everyone else was happy with their food  i forcefully ate something different, next time i will stick to what i know", "rating": "3", "date": [2012, 6, 17]}, "19": {"description": "We went to Leona's on a very busy day.   A local school was celebrating graduations.  I had a party of 15 and was alos celebrating a graduation.  CARLOS, the manager that day, did everything he could to make sure my party seated in a timely manner, our food was served in a timely manner and our memory was made wonderful for everyone involved!It turned out GREAT!  We all enjoyed ourselves, the food and the service.  The restaurant was PACKED that day and yet and we still managed to feel at home.  It was the BEST!  Thanks to CARLOS and his STAFF.  Thank you all for such a wonderful experience.5 stars all the way.  I would recommend this place to anyone looking for a top notch meal, excellent service and south side convenience.  Loved it.", "rating": "5", "date": [2012, 6, 12]}, "33": {"description": "I visited this Leona's this past weekend with my daughter and a friend.  In this neighborhood, there is not much too choose from as far as sit down restaurants go.  We started at BJ' Market and then realized that we had had enough of soul food.  When we walked into Leona's it wasn't very busy but there was still a nice atomosphere.  We were seated immediately.  It wasn't long before our waitress Sydney stopped to see if we had questions which we did.  She happily answered them and then gave us a few more minutes.  Our salads came quick and they were so fresh and good.  The manager even stopped by to make sure we were okay.  Towards the end of the meal I realized that Sydney forgot to bring out something I ordered.  Actually I had forgotten too because she had stopped by a few time to see if we needed anything and each time we told her we wer fine.   When I brought it to her attention she quickly corrected the oversight.  Our bill was about $50 bucks for an appetizer, 3 meals, and 3 drinks.  I thought that was pretty good deal.  On the way out I had to tell the manager what  pleasant experience it had been and to let him know I'd be back.  He was very gracious and nice young man.  He thanked us for the feedback and asked that we return soon.  I think this Leona's is definitely worth a visit especially for those who live in the area.  Right off expressway, plenty of free parking, small but adequate bar, carry out, party room, good food, great atmosphere, and good service.  I'll return for sure.", "rating": "5", "date": [2009, 11, 30]}, "2": {"description": "If I could give this joint zero stars I would. Just ordered a simple delivery for myself and the wife online- site said an hour wait for the delivery. Fine, it's a Sunday night, I understand they're likely busy.About an hour and 45 minutes later, my order hadn't arrived so I call the restaurant to inquire and the guy who answers the phone tells me that my delivery had already been delivered. I say it wasn't, he tells me he checked their system and it said \"delivered\". I explained to him that I wouldn't be calling asking about an order that was already delivered if it was delivered, he puts me on hold for 5 minutes, comes back and says that there was a mix up with the drivers and my order would arrive with the next 10 minutes.Now granted, the food did arrive about ten minutes later but it was missing three items. No blue cheese on my burger I ordered, no steamed veggies for my son, and instead of shoestring French fries they gave me potato wedges. Smh. Come on son! After all that, y'all could have at least gotten the order right! And my burger had grown cold!! I've dined in at this joint a few times too and the service was just as bad. Hardly anyone in the joint, but it still took an eternity for the food to come and some of the food NEVER came! It's like they keep inventing ways to disappoint. Why would you tell a customer inquiring about their late order that it was delivered already TWICE???!!!Tear this place down and make it a Culvers.", "rating": "1", "date": [2015, 11, 8]}, "34": {"description": "This is not my favorite Leona's. That honor still goes to the one on Taylor St. But I'm glad this location is now a viable dining option for my old neighborhood.It's in an outstanding space -- the spacious, old Tropical Hut restaurant, which sat there unused for years. But my experience is that Stony Island has yet to match the culinary quality of the other locations. My dad and I had lunch here earlier this week and we were very impressed with the space itself and the attentive service; and sadly, underwhelmed by the food. His minestrone soup was so globbed up and chunky he couldn't finish it.. My tomato cream linguine was dry and the sauce lacked the richness and seasoning I've come to expect from the other locations. It could have been more aptly labeled \"tomato with a splash of cream and a lot of salt.\" Even our signature psychadelic salads were lifeless and lacking. Again, I'm glad to see that Leona's took a chance on this great South Side location and that the restaurant is thriving. But I hope management at this location works harder to ensure that the quality of the food meets or exceeds that of other Leona's locations. Southeast Side residents and visitors deserve that much. I'm certainly willing to give it another shot the next time I'm out that way.", "rating": "3", "date": [2009, 7, 3]}, "32": {"description": "A co-worker and I went there for lunch today, not a good experience. When we sat down the server stated that they were changing menus so we could look at the old menu but a lot of the items were different. So he brought us out the menu and then he says it needs to something easy like a burger or salad because they could not make everything because they don't have the new menu. He told us that we came at a bad time 12:30 in the afternoon for lunch should not be a bad time at a restaurant. So after we asked about a couple of food selections and they were not available we just left the restaurant. It looked like the manager was sitting over at the bar, but he should have at least have compiled a list of what items they were going to serve today or just closed up.", "rating": "1", "date": [2010, 2, 24]}, "18": {"description": "the good thing about leona's is that it's a wysiwyg place: cheap \"italian\" food and decent service. this particular day i should have paid more attention to what i saw.walking in the door it was evident that they were understaffed, even for the modest crowd that was in the restaurant, as it took more than five minutes to get seated by the surly manager. more than ten minutes later, our order was taken and almost ten minutes after that we got our drinks. when our burgers arrived, 30 minutes after they were ordered, they were at least fairly decent (save the generous portion of grilled onion peel on mine).45 minutes for a burger? next time i'll head over to the beverly location instead.", "rating": "1", "date": [2014, 1, 16]}, "13": {"description": "Great place to eat! The place is super clean, the waitresses are very nice and the wait for your food is quick. We ate the Veal and portobello mushroom ravioli, it was delicious. The portion size was big that we had enough to bring home for a second meal. They not only have good italian food, but you can get good seafood there too, we had the shrimp scampi, delicious! Cant go wrong with the price or the food.", "rating": "5", "date": [2014, 9, 12]}, "4": {"description": "Used grubhub to order. Placed order at 6:30 and have not received order as of 8:44. I received no call letting me know what the problem may be and when I called, I was simply informed that the driver had left and food should arrive shortly. I'm patient and rarely complain but this is unacceptable. I don't want a refund or free food, but a simple heads up would've been nice. Update food came and of course they were missing a part of my order. I'm done. They will not be receiving anymore of my business.", "rating": "1", "date": [2015, 2, 8]}, "24": {"description": "The last time I went to thi location was on 12/10/2011 and as always when I visit back home.....it was great! I've been a Leona's fan for many years and have gone to several locations including the one in Little Italy off of Taylor and the one in Oak Park off Madison near Harlem, but Stony Island has always been my favorite and I make it a point to always go to this location. I try getting something different each visit and this time I ate the catfish wrap with my regular mac-n-cheese and of course my Lena cake. The wrap was 2 huge helpings, nicely seasoned and very filling. The waitress was awesome-very attentive and on point with the drink refills, extra napkins and follow ups on the food. She knew the menu without looking and gave good recommendations (my guy, oddly enough after living around the corner for over 15 yrs, never been there so he needed guidance :-) ). The music was nice-a mix of new music and older '70s songs (which I can appreciate) that wasn't blaring where table conversation is hard. My last visit about 10 months prior, they played the live taping of John Legend and it was HOT! The restauramt was like a sleek, sexy , dimmed light club and you wanted to get in the middle and dance. This trip wasn't quite as grown and sexy, but definitely comfortable. Leona's also has trivia cards on the table for guests to play while waiting for your food, which I think is awesome as a diversion and as fun table topics, if you have ackward silence with your dining mates. I highly recommend Leona's, especially the spot on Stony!", "rating": "5", "date": [2012, 1, 20]}, "6": {"description": "In fairness, we did not eat here today.  I just couldn't do it.  This was the only halfway decent looking place north of Whiting, IN on the path I took up 41 and down 79th to Stony.  What a drive.   It looks nice enough inside and our waiter was polite.  There were only five tables with customers at 7:45pm and the pizza I saw on one of them looked average, at best.  My wife was quick to point out the mess of crumbs, etc on our table and the first thing I noticed was the greasy feeling of my wrinkled menu.  I looked at the table behind us and it was littered with food bits too, and yet it was set just like ours.  Now curious, I got up and walked around to look at many tables.  When I sat back down the waiter approached with 2 glasses of water and I asked him what they do after someone is done eating here.  \"We clean the tables\" was his answer.  I pointed to the table behind me and asked him if he saw the mess on that one.  He told me they just hadn't gotten to it yet.  So I called his attention back to our table and said \"what about this one?\"  His answer didn't matter.  I was done and had too many doubts about the cleanliness of the kitchen I couldn't see.  Watching him push crumbs towards the wall when he moved the condiments to wipe the table was just icing on the cake.  Is that really your best effort?  Picking them up to wipe under and around was that hard to do?FAIL", "rating": "2", "date": [2014, 6, 16]}, "22": {"description": "The food at this place was good but the problem I had is with the waitstaff. I understand that serving a party of 10 could be hectic but it we're your only table and the restaurant is not that crowded then theres a problem! the first issue is that the waitress took an EXTREMELY long time to do anything...requesting anything came with an extremely long waitime...even for water. When the food came out she left it on the tray and walked away, she was gone so long until we had to serve ourselves. The gratuity was automatically added and we were gracious enough not to complain but she neglected to bring my mothers money back after she paid...20 minutes went by and then finally we asked another waitress who went to kitchen came back with my moms money , gave it to her , and then rolled her eyes....NO THANKS...I'll stick with the Leona's on Taylor or on 95th in Oaklawn........", "rating": "2", "date": [2012, 5, 22]}, "15": {"description": "Terrible service.  The restaurant was extremely understaffed, and it was Valentine's day.  I won't be going back to this location for sure.", "rating": "1", "date": [2013, 2, 20]}, "7": {"description": "Since the food is not really that good, one would think the service would be up to par. Not! No matter how many people are in the restaurant, the service is slow. There is a tendency to deliver orders incorrectly and incompletely. Please don't take a group there as that is like asking for a bad time. Not sure what the deal is with this location but I haven't had issues at the other locations. Will definitely stay away from this one.", "rating": "1", "date": [2015, 12, 7]}, "36": {"description": "This is a solid selection when you're looking a quick bite to eat out south. The food is average. Nothing particularly exciting or disappointing so that's good. The decor is awesome. It's definitely on the newer side. The staff is always friendly which is great in my book and it has it's own parking lot which is almost unheard of in Chicago.", "rating": "3", "date": [2008, 10, 8]}, "30": {"description": "The avocado wrap is the bomb.", "rating": "3", "date": [2010, 7, 4]}, "3": {"description": "Ordered a Tuscany chicken sandwich for delivery and it was terrible. the bread was like it was dipped in juice.  super soggy. chicken breast taste old. never again. and that was $10.00.", "rating": "1", "date": [2015, 12, 14]}, "14": {"description": "Never disappointed!!  This place has the best pizza in town.  Great service and the waitress was very attentive.  The new menu is awesome my favorite is the shrimp.  Looking forward to going back!", "rating": "5", "date": [2014, 6, 3]}}, "neighborhoods": ["Calumet Heights"], "latitude": 41.7279399, "longitude": -87.58583, "rating": "2.5", "times": {"Mon": ["11:00 am", "11:00 pm"], "Thu": ["11:00 am", "11:00 pm"], "Sat": ["11:00 am", "12:00 am"], "Wed": ["11:00 am", "11:00 pm"], "Tue": ["11:00 am", "11:00 pm"], "Sun": ["12:00 pm", "11:00 pm"], "Fri": ["11:00 am", "12:00 am"]}, "price": "$$", "categories": [["Pizza", "pizza"], ["Italian", "italian"]], "address": ["9156 S Stony Island Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Delivery": "Yes", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Casual", "Has TV": "Yes", "Takes Reservations": "Yes", "Good for Groups": "Yes", "Good For": "Lunch, Dinner"}, "category": "Restaurants", "number_of_reviews": "39"}, "sizzor-trix-alsip": {"comments": {"1": {"description": "Had eyebrow threading service today. Great service by Nikki. Only \"complaint\" I have is this: Don't have a personal conversation in another language while servicing a client. It's kind of the equivalent of me taking a personal call while helping a client.I'll still be back because she gave me gorgeous eyebrows!!", "rating": "4", "date": [2015, 8, 28]}, "9": {"description": "I did like how my brows turned out, but she was a little unprofessional on today. She has a wonderful nail tech who persuaded me to wait while she was on the phone. For that very reason she got an extra star. The nail tech looked pretty legit too.", "rating": "4", "date": [2014, 9, 18]}, "23": {"description": "I decided to go here with a Groupon and was hesitant about someone \"new\" doing my eyebrows.  I looked Sizzor Trix up on Facebook and Yelp to see reviews and everyone kept on saying to get their eyebrows done by a \"Niki\".  Sure enough she was there (found out she works 7 days a week!) and did a fantastic job!  After 5 visits the 6th is free and it's normally only $8 unless you go on Mon - Tues ($5).  I now found my favorite eyebrow place!  I am also going to get a pedicure soon based on all the other reviews I have read!  If you want a great job done on your eyebrows, then Niki is the lady you want to see!", "rating": "5", "date": [2012, 6, 7]}, "5": {"description": "I am a very, very PICKY person when it comes to my eyebrows.  I check, double check and re- check when I get them done.  I found Nikki at the Orland Square Mall over 7 years ago.  I found out she left and tracked her down at Sizzor Trix.  I drive 25 minutes out of my way just to have her do my brows.  She is OUTSTANDING.  Again, I can be a pain in the a$$ as a customer because my brows are everything to me-with Nikki, I have a seat and relax.  She knows what I like and is very efficient.  She does not rush you even if 5 other girls are waiting.  She went on vacation for a month, no one touched my brows, hell I looked like a man but it was worth the wait...lol.               Go and see Nikki-she will transform you! Remember your brows are a frame for your face!", "rating": "5", "date": [2015, 6, 18]}, "25": {"description": "I came here initially because I purchased a Groupon Now deal for eyebrow threading.  I will continue to come back because I agree that Niki does an awesome job.  She pointed out that due to past threading done incorrectly, my eyebrows didn't match in my arch area.  As I looked closer, she was right.  Thankfully she was able to fix this issue and I have been getting a lot of compliments on my eyebrows.  I like this place better than the Chicago Ridge or Orland mall.  It's closer to my house, cheaper, and Niki offers a free threading after 5 visits.  If you are in the area, check it out!", "rating": "5", "date": [2012, 5, 20]}, "12": {"description": "Nikki is the best. I can't go to another threader or my eyebrows will look a hot mess. she does a great job.", "rating": "5", "date": [2014, 7, 19]}, "21": {"description": "I arrived there about 10:30am on a Monday. Only niki was there and when I asked for a haircut, she politely asked me to wait and she went out to the dollar store next door. A man came in, niki was still gone and he asked me if I wanted a haircut to which I said sure.I had showered and washed my hair before going there. He started cutting my hair and made a lot of comments to it: losing hair, dry scalp, whoever cut my hair last did a bad job. He also knocked off competitions like hair current and the brow bar at Chicago ridge. The convo was pretty awkward. And he charged me $15. I asked about the sign that said $8.99, he said that's for kids even tho I did not see \"kids\" anywhere on the sign. And I asked for an inch off and I think he cut more than that. But it's ok. I can work w it.I had the groupon for the $6 threading. The man left and niki came back. At first she told me to come back a week bc I had baby hairs. Then she offered to brush it up for me since I bought the groupon already. She did a good job w my brows, and it's painless compared to my experiences w other places.The Internet was out at the time and I didn't have cash so she and the man had to keep running to the store next door to charge. And as it turned out, the haircut should've been $10 not $15, bc the guy thought niki had washed my hair hence the extra $5 charged. But it evened out since there was some groupon complications and Internet complications that prevented me from paying any more for the brows.I would've given 3 for the haircut and the guy but niki was very nice and accommodating and fair so hence the extra star.$8 brows, $5 brows on mon and tues$10 adult haircut$15 adult haircut and wash$8.99 \"kids haircut\" I still don't know how much they charge for pedi's, mani's. There were signs w different prices so it was confusing and a bit frustrating.Anyway, just ask for niki and bring cash in case their internet is out again. And probably best to come in the afternoon and not morning since only one person is in the store.", "rating": "4", "date": [2012, 8, 7]}, "16": {"description": "I arrived there about 10:30am on a Monday. Only niki was there and when I asked for a haircut, she politely asked me to wait and she went out to the dollar store next door. A man came in, niki was still gone and he asked me if I wanted a haircut to which I said sure.I had showered and washed my hair before going there. He started cutting my hair and made a lot of comments to it: losing hair, dry scalp, whoever cut my hair last did a bad job. He also knocked off competitions like hair current and the brow bar at Chicago ridge. The convo was pretty awkward. And he charged me $15. I asked about the sign that said $8.99, he said that's for kids even tho I did not see \"kids\" anywhere on the sign. And I asked for an inch off and I think he cut more than that. But it's ok. I can work w it.I had the groupon for the $6 threading. The man left and niki came back. At first she told me to come back a week bc I had baby hairs. Then she offered to brush it up for me since I bought the groupon already. She did a good job w my brows, and it's painless compared to my experiences w other places.The Internet was out at the time and I didn't have cash so she and the man had to keep running to the store next door to charge. And as it turned out, the haircut should've been $10 not $15, bc the guy thought niki had washed my hair hence the extra $5 charged. But it evened out since there was some groupon complications and Internet complications that prevented me from paying any more for the brows.I would've given 3 for the haircut and the guy but niki was very nice and accommodating and fair so hence the extra star.$8 brows, $5 brows on mon and tues$10 adult haircut$15 adult haircut and wash$8.99 \"kids haircut\" I still don't know how much they charge for pedi's, mani's. There were signs w different prices so it was confusing and a bit frustrating.Anyway, just ask for niki and bring cash in case their internet is out again. And probably best to come in the afternoon and not morning since only one person is in the store.", "rating": "4", "date": [2012, 8, 7]}, "17": {"description": "I had the same experience with the male \"stylist\"! He asked who cut my hair before and knocked them, told me my hair was falling out, then 5 minutes later told me I had healthy hair. He also mentioned that he is a full time student, owns and manages the dollar store next door, and sells cars, all while he's a hair dresser?! I asked for a long bob, a very simple cut I imagine, and one side of my hair is a long bob with some layers, but the other side has some short and some long layers that go in a diagonal down the side of y head. Not a good look. So so disappointed. And they charged me $25 for my hair cut and wash, but he didn't ask if I wanted a blow dry so I couldn't tell how ridiculous I looked! I'm going to stick with Studio K, same price, excellent service, and great at what they do! And only a little over a mile away!", "rating": "1", "date": [2012, 8, 25]}, "10": {"description": "Had a bad wax with a salon so I grew my eyebrows for a few months and decided to go to Niki. She took her time with my eyebrows and explained the threading and tinting process really well. Will definitely be back!!!", "rating": "5", "date": [2013, 12, 17]}, "11": {"description": "I wanted to switch up where I usually get my brows done because they were getting too busy.This place very close to where I live and Yelpers gave it favorable reviews. Niki did a great job, and it wasn't overly painful. My eyebrows were evenly done (which has been difficult for some to accomplish since I have a permanent scar under one of them).Monday and Tuesday is $5 (cash only; they charge an extra dollar if you utilize plastic); $8 dollars the remainder of the week.I would recommend this place to anyone who needs a good eyebrow threading.", "rating": "4", "date": [2014, 1, 18]}, "26": {"description": "I go here for Threading the place is great It's warm & inviting from the moment you step inside Niki is the owner and will take care or your every threading need. She is a perfectionist and focuses on your every unwanted hair. I like to call her a eyebrow stylist. Her shop has a full service salon from mani / pedi, even hair stylist . She services every client.... Men& Women she is located right on the corner of 127th and Pulaski in Alsip. It's  better than any mall threading place. You can also have privacy while getting your needs met your not sitting in the middle of the mall for everyone to see. I suggest Sizzor Trix for your every need", "rating": "5", "date": [2012, 5, 16]}, "27": {"description": "I went here to use a Groupon I purchased for a mani/pedi. The place was great, so was the service! My hands and feet looked great and the girl that did my nails was really sweet! The only reason I didn't give a five-star review is because no nail clippers were used at all, especially on my toes, she just used a nail file.", "rating": "4", "date": [2012, 3, 24]}, "0": {"description": "Niki is a brow guru!I've been a customer of hers for about 3 years already. I heard of her from word-of-mouth. I'm so happy I found Niki! She's detailed and knows about shaping and cleaning up your eyebrows. Eyebrow threading is $5 on Monday and Tuesday (cash only), but I don't mind paying regular price of $8 when I have to see her on the weekend. She's the best.", "rating": "5", "date": [2014, 10, 27]}, "20": {"description": "I found out about Sizzor Trix by purchasing a Groupon Now deal for an eyebrow threading. Nikki did a FANTASTIC job! This was the first time getting my brows done via the threading method and I like it a lot better than the wax. I did have some slight irritation probably because this was a new method for me, but it went away after about 10 minutes. It only took about 10 minutes for her to thread both brows and I must say that I was very impressed by the outcome. I usually go up north to get my brows waxed and pay over $20, but I will definitely be coming back to Nikki. She has a customer for life.", "rating": "5", "date": [2012, 8, 16]}, "19": {"description": "I live in the vacinity of Sizzor Trix and passed the location on a daily basis, I used to go to another threading establishment but everytime I went I got a different person.  Nikki did my brows and i LOVE them, they are great and I have been back twice since my initial visit.  Would highly recommend Sizzor Trix.", "rating": "4", "date": [2013, 1, 22]}, "2": {"description": "I usually come to NIkki, but she's not there at opening or during 6:30 to closing time. There's another lady who works there; ive never gotten her name. She does an okay job. Even though your eyebrows aren't supposed to be twins theyre more like sisters. Mines aren't even close to being sisters. Her eyebrow tinting is weird? The lady went over my eyebrow and ontop of the skin. it was so thick. I'd come back just for Nikki.", "rating": "3", "date": [2016, 1, 21]}, "18": {"description": "My unibrow has been in need of some care for a while and I kept putting off going to get them done because I hadn't really been happy with the previous results from the many shops I had visited.  I was waiting to place a carry out order in a restaurant and noticed how great the eyebrows of the person taking orders looked.  When I placed my order, I also asked her where she got her eyebrows done, to which she replied, 'In Alsip, I get them threaded\".  I didn't want to hold up the other orders so I didn't ask for more specific information.  I check the internet for eyebrow threading in Alsip, IL.  and I came across one shop, Sizzor Trix!  The shop is conveniently located in a strip mall just west of Pulaski on 127th street.I read the reviews and was excited to go see Niki.  I was not disappointed...Niki quickly (less than 10 minutes) took care of my unibrow and quite beautifully.  I took one look in the mirror and realized I had found my new ebrow home!  My brows were beautifully arched and look very natural.  As stated in one of the other reviews, there was a tiny bit of discomfort, but well worth it (nothing like the discomfort I sometimes experienced the next day after getting my brows waxed...and let's not even discuss the pain of plucking)!  Go see Niki at Sizzor Trix in Alsip, IL  you won't be disappointed!", "rating": "5", "date": [2012, 9, 17]}, "13": {"description": "I went on a Friday and there was no wait. She was pretty quick and did a great job. My brows were last done with a razor which caused them to grow back funny. She did a great job shaping and helping them to look natural again. I'll definitely be back!", "rating": "4", "date": [2014, 5, 23]}, "4": {"description": "I visited the salon because of a Living Social deal and was quite impressed with the service that I received.  Nikki is great and she is indeed all of the good things that everyone on the site has raved about.  I am very picky about my eyebrows and she did an excellent job.  She's also friendly and personable!  If you're on the far southwest side of Chicago (Alsip) - she's definitely worth giving a try!", "rating": "5", "date": [2015, 8, 7]}, "24": {"description": "I used to go to Nikki for eyebrow threading when she worked at Orland Mall. It wasn't strange for there to be a long line of women just waiting for Nikki. I kid you not, this woman is TALENTED, and I have never, ever been disappointed in the work she has done on me. One day, I discovered she was no longer working at Orland Mall and had no idea where she went. I was offered $5 off on my first Groupon Now! purchase and noticed that I would only pay $1 to get my eyebrows threaded at Sizzor Trix. I obviously bought it, and who was the threading artist? NIKKI! I'm so glad I finally found her. She does Groupon Now!s pretty often I believe, and they are $6 as opposed to $8 (I think). I believe she has $5 deals on Mondays and Tuesdays, and Nikki also has a frequent customer card where you will get your fifth or sixth eyebrow threading free. Please, please go to her if you want beautiful eyebrows done inexpensively! You won't be disappointed!", "rating": "5", "date": [2012, 5, 31]}, "6": {"description": "Awesome! I've tried many other establishments that were not consistent with the work. This place rocks very friendly, and professional. On a scale 1 to 10 this place gets a big 10. BEST EYEBROW THREADING IN THE SOUTH SUBURBS EVER!!!", "rating": "5", "date": [2014, 10, 23]}, "22": {"description": "I desperately needed to get my eyebrows done and came across an offer for this place on Groupon.  I decided to give it a try and my experience was awesome!  The lady who did my eyebrows, Niki, was very professional and expedient.  My wait time was very short, the salon had an inviting ambiance, and everything was arranged nicely.  I don't live anywhere near this establishment as I stay in the city; however, it was truly worth the trip and will be returning.  Not only that, Niki gave me a demonstration on her  nails of how the \"crackled\" nail polish works - amazed I was, so I purchased a bottle for myself.  I highly recommend this place!!", "rating": "5", "date": [2012, 6, 25]}, "15": {"description": "I am so happy that I have found someplace to get my threading done!  It's on the way home and they have specials.  This is something I can keep up without traveling out my way.  The young lady Nikki that took care of me was very gentle and quick! This is my new hot spot!!!", "rating": "5", "date": [2014, 4, 3]}, "7": {"description": "My first time coming here and nikki was very pleasant and she did a really good job considering the fact I don't trust many people to do my eyebrows. I will be coming back!!!!", "rating": "5", "date": [2014, 10, 28]}, "8": {"description": "My wife asked me to post a review on this place.She loves it.  She goes here to get her eyebrows done.  They take a string and start rubbing it all over her forehead........I don't know.  Whatever they're doing, she thinks they're great.They have special prices on Mondays and Tuedays.", "rating": "5", "date": [2015, 1, 15]}, "3": {"description": "Went here based off of positive reviews...Not good at all. Eyebrows were crooked and over threaded. I had taken me eight weeks for my eyebrows grow in just to have them messed up.", "rating": "1", "date": [2016, 1, 12]}, "14": {"description": "I swear never going anywhere else. My eyebrows look amazing!", "rating": "5", "date": [2014, 6, 20]}}, "categories": [["Hair Removal", "hairremoval"]], "address": ["4020 W 127th St"], "attributes": {"Parking": "Private Lot", "By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "times": {"Mon": ["10:00 am", "8:00 pm"], "Thu": ["10:00 am", "8:00 pm"], "Sat": ["10:00 am", "8:00 pm"], "Wed": ["10:00 am", "8:00 pm"], "Tue": ["10:00 am", "8:00 pm"], "Sun": [], "Fri": ["10:00 am", "8:00 pm"]}, "rating": "4.5", "price": "$", "number_of_reviews": "28"}, "romas-village-bar-and-grill-chicago": {"comments": {"1": {"description": "This place is a cute little place. They have a bar next door. I definitely prefer this place to olive garden. The portions are huge. Its by my house so its convenient. Entrees are no more than $15.", "rating": "3", "date": [2009, 3, 2]}, "0": {"description": "I live in South Chicago and Roma's has been around for a long time. We recently went and had a good experience. I had the fettuccini Alfredo and the portion was massive. My mom had the lemon chicken and enjoyed it. Overall food was good and service was decent. The bar is connected to the restaurant and I could hear the Bears getting their ass kicked, besides being a Bears fan everything else was great.", "rating": "4", "date": [2015, 11, 29]}}, "latitude": 41.7272945, "neighborhoods": ["Calumet Heights", "South Chicago"], "categories": [["Italian", "italian"]], "address": ["9247 S Commercial Avenue"], "attributes": {"Attire": "Casual", "Waiter Service": "Yes", "Take-out": "Yes", "Has TV": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Good for Groups": "Yes", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Good for Kids": "Yes", "Takes Reservations": "Yes"}, "longitude": -87.5509739, "category": "Restaurants", "rating": "3.5", "price": "$$", "number_of_reviews": "2"}, "professional-building-pharmacy-chicago": {"comments": {"0": {"description": "cheapest price In Chicago,  counseled me in a very patient friendly and respectful manner,  faster service, they have expertise diabetic & HIV medication,  i would always prefer this location for medication.", "rating": "5", "date": [2013, 2, 11]}}, "latitude": 41.7261741310358, "neighborhoods": ["Calumet Heights"], "categories": [["Drugstores", "drugstores"]], "address": ["2315 E 93rd St"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.5675562769175, "category": "Shopping", "rating": "5.0", "price": "$", "number_of_reviews": "1"}, "popeyes-famous-fried-chicken-chicago-5": {"comments": {"1": {"description": "The big girl at the register was lost and didn't know how to ring up a coupon. Train them Popeyes.", "rating": "1", "date": [2012, 10, 29]}, "2": {"description": "Wish I can rate a negative star here", "rating": "1", "date": [2013, 8, 31]}, "0": {"description": "By the name of the restaurant, Popeyes Chicken, you'd think that chicken would be readily available.  Not so.  At 6pm on a (football) Sunday, I got in line at the drive thru with one car ahead of me at the order menu board and waited 8 minutes. The person before me was waiting to for them to be ready to take his order.  When it was my turn, I started to place my order only to be told, \"All chicken orders will be a 15 minute wait\". What?!?  I didn't ask for a specialty item off the menu, I asked for chicken from Popeyes Chicken.  The reason for the one star on this review is more for the person who designed the parking lot that allowed me to quickly get out of line and head to KFC on 95th/Stony where the service was friendly, my food was hot and fresh, and my order was right. Whoever does the inspections/evaluations at this Popeyes, new management is sorely needed.  It would serve you well to emulate your operations after a franchise that has a working model. If you can't deliver on your core competency, what good are you?", "rating": "1", "date": [2013, 10, 6]}}, "latitude": 41.73596, "neighborhoods": ["Calumet Heights"], "categories": [["Fast Food", "hotdogs"]], "address": ["8732 S Stony Island Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Loud", "Delivery": "No", "Caters": "No", "Wheelchair Accessible": "No", "Takes Reservations": "No", "Attire": "Casual", "Has TV": "No", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.58601, "category": "Restaurants", "rating": "1.0", "price": "$", "number_of_reviews": "3"}, "mcdonalds-chicago-191": {"comments": {"1": {"description": "They NEVER have ice cream!", "rating": "2", "date": [2011, 10, 12]}, "2": {"description": "Went here once. It's crowded around 2pm until. The bathrooms are so nasty. They put no money into them..everything was broken down.I went there months ago, and a friend told me it was the same way she went there. Besides that the food is okay. They get 1 star for the food. the other 4 are blank because every restaurant should have working bathrooms.", "rating": "1", "date": [2005, 12, 14]}, "0": {"description": "This location has undergone some work and it is clean - clearly improved since the earlier reviews were written.  We live nearby and this is the \"after-daycare-only-if-you-were-good\" treat location.  This location always seems to have fresh fries, a well-coordinated drive-thru (even though its only one lane) and friendly drive thru staff.  Keep up the great work!", "rating": "4", "date": [2013, 8, 17]}}, "latitude": 41.7366, "neighborhoods": ["Calumet Heights"], "categories": [["Burgers", "burgers"], ["Fast Food", "hotdogs"]], "address": ["1443 E 87th St"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Very Loud", "Good for Groups": "Yes", "Outdoor Seating": "No", "Delivery": "No", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.58886, "category": "Restaurants", "rating": "2.5", "price": "$", "number_of_reviews": "3"}, "dunkin-donuts-baskin-robbins-chicago-21": {"comments": {"3": {"description": "By far, the most disgusting coffee I've EVER had and Dunkin' Donuts coffee is my absolute fav! I'll get back to the coffee in a sec but let me start with the poor set-up of this location.  The store's drive-thru is so awkwardly designed that if more than 2 cars are in the drive-thru then the remaining cars are dangerously in a holding pattern on Stoney Island, one of the busiest streets in Chicago.  I was in the drive-thru line for almost 10 minutes and there were only 3 cars in front of me.  Back to the coffee...I ordered a medium hazelnut coffee extra, extra.  I order the same thing every time I got to DD and it always come out perfectly until today.  There was WAY too much hazelnut flavoring to the point where I couldn't even drink it.  It was entirely too sweet and I actually like my coffee sweet.  There was no number on the receipt or online anywhere to call about the issue.  If I wasn't on my way to work I would've turned right back around and had them remake it but that would've made me late.The only positive that I can speak on is the person taking my order was very polite.", "rating": "1", "date": [2014, 3, 7]}, "1": {"description": "Blasting the radio at any business is not good unless you a Night Club.  Some employees seem great, but others not so much. Sometimes it's a little messy.", "rating": "3", "date": [2014, 8, 10]}, "2": {"description": "There is always some form of entertainment standing outside of this establishment.  The donuts are smaller than most and the coffee isn't the greatest but the hood entertainment is the best,  the guy with the stick om his foot attached to the beach bottle and pill bottle morraccas is the best.....I never tip cash though, just good advice lmao", "rating": "3", "date": [2014, 3, 18]}, "0": {"description": "I came here to get a scoop of ice cream to go on top of a funnel cake from Checkers but when I saw that the kids cone was 2.09 I left.The place was the clean and the cashiers were nice and said they understood even if they didn't but I couldn't pay that price when I could get ice cream from McDonalds for .49 cent.Enjoy!", "rating": "3", "date": [2014, 6, 10]}, "4": {"description": "Nothing but location brings me to this place. What kind of coffee shop does not offer wifi? This one. I went to ask about it, and no employee knew how to access it. No one in the store. Other times, they were out of advertised products but, kept the signs up anyway, clearly to get people in the store. These little place are all over, I would suggest finding another or moving on to another brand.", "rating": "1", "date": [2013, 8, 18]}}, "latitude": 41.7356463521719, "neighborhoods": ["Calumet Heights"], "categories": [["Donuts", "donuts"], ["Ice Cream & Frozen Yogurt", "icecream"]], "address": ["8753 S Stony Island Ave"], "attributes": {"Wi-Fi": "Free", "Accepts Credit Cards": "Yes"}, "longitude": -87.5851207226515, "category": "Food", "rating": "2.0", "price": "$", "number_of_reviews": "5"}, "harolds-chicken-10-chicago": {"comments": {"1": {"description": "When I first went to this Harold's I praised it, told all my friends about it (well I still will but for a different reason) I even thought it was one of the best Harold's in town. If I could give this Harold's a minus 0 star I would and that would be generous after the experience I had last night!Back to the review...my feeling regarding this Harold's has all changed...why do you ask well let me tell you!  First when we got home my girlfriend was missing one piece of 6 piece chicken dinner.  Now I know that can happen but the customer service was horrid because the lady on the other end of the phone kept saying baby and she was more lax then she was business in my opinion. Now would that be a reason I tell you that I'm given this Harold's 1 star of course not it was the tasteless overcooked chicken and hard fries that tasted more like old grease.I got the 4 piece mix which includes the breast,wing, leg, and thigh.  I received a mini leg which I will be uploading the picture and trust me when I say this leg was smaller than a ball point pen...sheeesh!  The thigh which I didn't eat was hard like a rock, the breast was flavorless but the meat was juicy but by the time I got to the bone I was mortified to see red, so needless to say I threw the rest of it away!Now I don't know if Howard McGee still owns this place or if they have a new manager but what I do know is the food is not worth the overpriced chicken and the food is some of the most unsatisfying food I have ever tasted... I wouldn't even feed it to my dog!The green beans along with their red beans and rice are in the cooler which I assume they warm up in the microwave...how fresh is that I can't tell you, but what I can tell you is go at your own risk because if you go in hungry you will still be hungry because the food is less than desirable.I don't even believe it is worth going to get the one wing that is owed to us because we may just end up throwing it away!Hey Howard you truly need to either take your name off the business or start making sure the business with your name on it stands for quality service, quality food, and quality standards because right now it has not  met  any of those qualities and I won't be back nor will I recommend your establishment too friends or family!", "rating": "1", "date": [2013, 10, 20]}, "2": {"description": "If you have a choose in what Harolds you eat at do not choose this one. The young lady that works in the window and answering the phones has the worst attitude ever. We work near there and now everyone at our job refuses to go there now. It's suprising that the radio personality owns this place and lets a rude individual work there. And now it states that everything is being recorded that is said in the lobby, I wonder do they actually do that because they would hear how ignorant that worker is.", "rating": "1", "date": [2010, 2, 24]}, "0": {"description": "Classic Harolds.", "rating": "4", "date": [2010, 10, 30]}}, "latitude": 41.736698, "neighborhoods": ["Calumet Heights"], "categories": [["Chicken Wings", "chicken_wings"]], "address": ["1709 E 87th St"], "attributes": {"Take-out": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Loud", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "longitude": -87.582298, "category": "Restaurants", "rating": "2.0", "price": "$", "number_of_reviews": "3"}, "diva-tude-chicago": {"comments": {"1": {"description": "Mr.  Twist is absolutely awesome. He is passionate about his craft and a consummate professional.", "rating": "5", "date": [2014, 8, 16]}, "0": {"description": "The review is well past due. I just finished with an awesome mani and pedi \"extended stay\". This is my second visit and I repeat the \"extended stay\" is definitely an experience! Don't slip on Mr. Twist, you won't be disappointed! Check him out!", "rating": "5", "date": [2015, 8, 24]}}, "neighborhoods": ["Calumet Heights"], "latitude": 41.7370153633694, "longitude": -87.5782656669617, "rating": "5.0", "times": {"Mon": ["9:00 am", "8:00 pm"], "Thu": ["9:00 am", "8:00 pm"], "Sat": ["9:00 am", "6:00 pm"], "Wed": ["9:00 am", "8:00 pm"], "Tue": ["9:00 am", "8:00 pm"], "Sun": [], "Fri": ["9:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Day Spas", "spas"], ["Nail Salons", "othersalons"]], "address": ["1859 E 87th St"], "attributes": {"By Appointment Only": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "2"}, "harolds-chicken-chicago-21": {"comments": {"3": {"description": "This used to be a decent spot, but they've gone down considerably over time. The chicken is bland , the food is less, and the prices have gone up. Most recently, I ordered a half white. I'm expecting 2 WHOLE wings to be included. These jokers cut the drumettes off of both wings and threw it in there like that was okay. The way they ever so neatly packed it, you wouldn't have known that they were decapitated until you got home unless you ripped the whole thing open. If you end up here, hop on the e-way and go to the one on 87th & state street, or go north to 73rd & Stony for a better version of Harold's.", "rating": "1", "date": [2015, 8, 8]}, "1": {"description": "Terrible customer service. Food not as good as Dan Ryan. Don't go here. Waste of time and money.", "rating": "1", "date": [2015, 12, 22]}, "2": {"description": "They suck from food to service. I have tried several times to support them, but every experience has been worse and worse. I'll just take the trip to 86th and the Dan Ryan from now on.", "rating": "1", "date": [2015, 12, 27]}, "5": {"description": "[SHORT VERSION] Never again. Even when I love a product, I never give business to an establishment that cannot show basic respect and courtesy to it's customers.  If someone places an order, asks how long it will take and you say 20 minutes, that means 20 minutes. IT DOES NOT MEAN 1 HOUR AND 20 MINUTES. It does not mean deceive a customer multiple times about how long the wait will be without an apology and refusing to issue a refund; i.e. so the order can be cancelled.Stop advertising express pick up and learn basic customer service.  #CrazyHowardsHaroldsChicken @CrazyHowardMcGe[LONG VERSION] I called in my order and was told 20 minutes. I got to the location 25-30 minutes later and my food wasn't ready. I waited another 30-35 minutes before complaining. [Me] \"Excuse me, when will my food be ready?\"[Cashier] \"They are wrapping it up now.\"(I wait another 10-15 minutes and ask about my food again. The cashier could tell I was annoyed, so she immediately had the manager come to speak with me.)[Me] \"When is my food going to be ready?\"[Manager] \"They are fixing it now.\"[Me] \"I want a refund.\"[Manager] \"We don't do refunds.\"[Me] \"Okay, I've been told twice the food was ready. Someone is waiting for me and needs to run an errand, I just need to know how long it will take.\"[Manager] \"It's ready now.'[Me] \"You just said they were still fixing it. Is it ready or is it still cooking?\"[Manager] \"It will be out in a moment.\"[Me] \"I need a timeframe. How long will it actually take?\"[Manager] \"Two minutes.\"TEN minutes later, I start to walk up to the counter again to complain and they FINALLY call me for my food. As annoying as the wait was, I can understand them being busy. If they had told me an hour's wait  to begin with, I would have understood and come to pickup my food an hour later. Instead, I was misled multiple times with no respect nor regard for my time. On top of everything, at no point did I get an apology. Nothing at all.   Never again.", "rating": "1", "date": [2015, 3, 22]}, "6": {"description": "This is a good Harold's. The chicken was tasty and cooked to order. The prices were a little high to me but chicken has increased. You can call ahead or order through email. I will try this next time. It's clean and they have a parking lot in back. I'll return. The staff was courteous.", "rating": "4", "date": [2014, 8, 23]}, "0": {"description": "There pretty expensive. But the overall service is pretty good. Also a Tip! They don't take debit for delivery...", "rating": "3", "date": [2016, 1, 24]}, "4": {"description": "You can find a better harold's than this one that's for sure, their prices are very high compared to other facilities and if the service was great I wouldn't mind but it isn't. I called in an order and waited 40 additional minutes than the 20 i waited at home to go pick up my order. I called in to order another time and they told me they were out of french fries, what kind of chicken place doesn't have enough french fries? Go to another location if you get the chance.", "rating": "2", "date": [2015, 6, 4]}}, "latitude": 41.7342758178711, "neighborhoods": ["Calumet Heights"], "categories": [["Chicken Wings", "chicken_wings"], ["Fast Food", "hotdogs"]], "address": ["8827 S. Stony Island"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Accepts Credit Cards": "Yes", "Good for Groups": "Yes", "Delivery": "Yes", "Outdoor Seating": "No", "Drive-Thru": "No", "Good for Kids": "No", "Takes Reservations": "No"}, "longitude": -87.5847930908203, "category": "Restaurants", "rating": "2.0", "price": "$$", "number_of_reviews": "7"}, "angelicas-bakery-chicago": {"comments": {"3": {"description": "Great Carmel Cake!!Perfection!", "rating": "5", "date": [2014, 6, 6]}, "1": {"description": "My last few treks (3 total) to the S-side to purchase baked goods have been disappointing.The butter cookies and 7-up based pound cake tasted odd. It seems as though all of the pound cakes are 7-up based, if I'm not mistaken, which is UGH!Cookies/Cake were thrown in the garbage, and for me to throw baked goods in the garbage, you better believe it was because my taste buds weren't feeling it :/I've had to return sweet potato pies in the past, because \"something\" just wasn't right :/I'm moving on, as there must be new amateur/unseasoned/unsupervised baker(s) in the kitchen that doesn't know what he/she is doing :/#QUALITYoverQUANTITY!", "rating": "2", "date": [2015, 9, 15]}, "2": {"description": "I'm at Angelica's on 87th, called yesterday and the lady told me it would be simple, just come in the same day and I could have caramel put on a pound cake. I just got here and I'm the only customer. I asked to have caramel put on a pound cake and the lady said I would have to leave this store and go to their Hazelcrest store. I told her the lady yesterday said I could have it done simply here. Well they charged me $28.98 and $5.00 extra for the caramel. That's ludicrous and I will never come here again. I will go to the north side where they make sense. This is ridiculous! I'm at 87th in Chicago and I am the ONLY CUSTOMER right nowand when I ask for caramel to be put on a pound cake I'm told to go to the Hazelcrest store. Folks get full of themselves when they get success and these people are ridiculous and wanted to argue with me.", "rating": "1", "date": [2015, 12, 29]}, "5": {"description": "It was just okay for me. I had banana pudding, a slice of cream cheese cake, and a double chocolate cupcake. The cupcake was dry and the frosting tasted like it came out of a can. Lots of variety here, though. They have  a lot of cake flavors as well as cookies, pies, and muffins. The prices are very reasonable and the staff was nice as well.", "rating": "2", "date": [2011, 10, 23]}, "6": {"description": "a Christan-based bakery?! With a caramel cake THIS GOOD?! Sign me up for Bible study, baby!! Angelica's Bakery isn't your average frou-frou bakery! They baked goods that taste like your Mom could have made it in her kitchen. No fancy french pastries or designer cupcakes! Just good ol' sheet cakes, slices of cake, peach cobbler, and assorted pies and cupcakes! Sounds plain but that's what make it's so special! They focus on ONE thing do right by it!Their caramel cake is IT!! A perfect balance of fluffy AND moist cake, with the most decadent caramel flavor frosting. Served up in thick slices that leave you wanting more!I think I'm gonna leave this review at that before it goes into \"soft-core porn\" category....lol...jk!Next time you're on the Southside, check this place out! Their staff is also super friendly!", "rating": "4", "date": [2010, 8, 24]}, "0": {"description": "I'm usually someone who eats cookies or donuts with their coffee in the morning, and I've never had a really bad sweet tooth. That is, until I was introduced to Angelica's!My goodness gracious, any time I am near this location or the one on 175th and Kedzie, I HAVE to buy something. The banana pudding is like Grandma's!", "rating": "5", "date": [2012, 6, 22]}, "4": {"description": "I hate going to a place and get ignored by one of the employees. I was the only one there. An older lady, maybe the owner, was busy w paper work and she finally acknowledged me. But the cashier was inattentive.  She didn't even say thanks for coming, but the owner did. Anyways...I ordered the oatmeal raisin and the pineapple coconut in a jar. The cookies were grainy as if it wasn't mixed well. The cake was ok. Nothing you couldn't get at ur local grocery store. I just wished it had more flavor. More chewiness to the cookies. More homemade flavor to the cake. It was an average place with subpar service.", "rating": "2", "date": [2014, 9, 26]}}, "neighborhoods": ["Calumet Heights"], "latitude": 41.736622, "longitude": -87.587227, "rating": "3.0", "times": {"Mon": ["7:30 am", "6:00 pm"], "Thu": ["7:30 am", "6:00 pm"], "Sat": ["9:00 am", "6:00 pm"], "Wed": ["7:30 am", "6:00 pm"], "Tue": ["7:30 am", "6:00 pm"], "Sun": [], "Fri": ["7:30 am", "6:00 pm"]}, "price": "$", "categories": [["Bakeries", "bakeries"]], "address": ["1517 E 87th St"], "attributes": {"Parking": "Private Lot", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "7"}, "the-dating-game-new-chicago": {"comments": {"3": {"description": "Poor Management & Service!", "rating": "1", "date": [2011, 9, 19]}, "1": {"description": "Female Manager is horrible and ruined my night. She takes credit cards to the back with your id (which I think is weird), I gave her my passport id card and she wouldnt accept it although it had my picture and name to match my credit card. We argued at the bar and she insisted I go to her ATM and withdrawal the cash for the 22 dollar tab. How unexperienced and unprofessional! Only pay cash! A family member said once before additional money was taken from her account after paying with a CC there.  Just be cautious. The guy bartender was AWESOME. Food....only if you are drunk!", "rating": "1", "date": [2014, 7, 7]}, "2": {"description": "Looking for an evening of drinking, dancing and socializing on the southeast side of town, this is a nice place. The Dating Game New is foot steps away from Family Den lounge, which is a bonus!  Music is good, bartender is nice. The security makes you feel welcomed/VIP!", "rating": "3", "date": [2013, 3, 30]}, "0": {"description": "This was a trendy mid-scale social lounge my co-worker took me to. It had great music. Crowded.I would go again and highly recommend it.O, no cover fee.", "rating": "4", "date": [2012, 10, 8]}, "4": {"description": "well the dating game is free and you can  wear whatever you like. i have been here on wednesday and sunday nights. wednesday they played some old school hip hop and house music, sundays its all about house. the dating game has never been the main event for my night just a place to fall through for a lil bit, they do have some good chicken, i have always come here tipsy so i cant really judge their drinks but i wanna say they are good priced, the crowd is @ least 25+ all types of people with a lot of seating", "rating": "3", "date": [2011, 5, 26]}}, "latitude": 41.73225, "neighborhoods": ["Calumet Heights"], "categories": [["Nightlife", "nightlife"]], "address": ["8926 S Stony Island Avenue"], "attributes": {"Best Nights": "Wed, Fri, Sun", "Parking": "Street", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Very Loud", "Alcohol": "Full Bar", "Outdoor Seating": "No", "Happy Hour": "Yes", "Has TV": "Yes", "Music": "DJ", "Smoking": "Outdoor Area/ Patio Only", "Good for Groups": "Yes", "Coat Check": "Yes", "Good For Dancing": "Yes"}, "longitude": -87.5859399, "rating": "2.5", "price": "$$", "number_of_reviews": "5"}, "gwon-lee-restaurant-chicago": {"comments": {"1": {"description": "Gwon Lee is another treasure of the Southeast Side, located just east of 87th Street and Stony Island Avenue.By now, we know that all Chinese is not the same -- and you and your stomach can distinguish that right away. I've eaten \"five star restaurant\" Chinese food and in takeout joints all over the world. Dish for dish, Gwon Lee is still the best Chinese I've ever eaten in my life. My family has been eating at this establishment, literally, for more than 30 years and it's as good now as when I was a child. This is traditional Chinese takeout at its finest. Fried rice browned to perfection and made with the freshest ingredients. Appetizers that are always good -- tender spareribs, crispy wontons, eggrolls and fried shrimp. After all these years I've tried everything on the menu and, truly, everything is good. But one of my favorites is this incredible fresh shrimp and egg with snap peas dish. To die for!Gwon Lee is old-school. Family owned, very small waiting area, cash only and they don't deliver. Incredibly reasonably priced. Best to call your order in ahead of time. If you live in the Calumet Heights/Burnside/South Chicago area, Gwon Lee is not to be missed, and for those who live outside of the community, it's worth the trip.", "rating": "5", "date": [2009, 2, 4]}, "2": {"description": "No. Just no. I wouldn't give them a star if I didn't have to. I ordered a large chicken fried rice, ONE piece of chicken in the entire container and it's dark meat. Never again.", "rating": "1", "date": [2011, 4, 5]}, "0": {"description": "Full disclosure: I was born and raised on the Southeast side and grew up eating this food.     The food here is made to be taken home and enjoyed. There are no tables here, and limited seating. The wood paneling on the East wall has been carved into so many times that your food will be ready before you have a chance to read it all. Most of the food here reheats very well and when I first bought my place, there were many times I bought large orders just so I'd have something quick to eat during the week.       That being said, the shrimp fried rice is my favorite fried rice on Earth up to this point.  The rice is well fried, maybe a little more than you're used to, but delicious.  They can even make it spicy. The egg foo young is delicious.  Be aware, this place specializes in basic Chinese food, so don't come here expecting that dish you saw them make on IRON CHEF.      In summary, Gwon Lee is not a fancy restaurant and will not provide you with a fine dining experience.  What Gwon Lee does is provide food that is inexpensive and delicious. Come here to grab a lunch special, or take a whole bunch home and eat it while you watch a movie. In a time where everything is so expensive, It's nice to have a place to go where you get good food, for a good price.", "rating": "5", "date": [2013, 6, 10]}}, "latitude": 41.7366828918457, "neighborhoods": ["Calumet Heights"], "categories": [["Restaurants", "restaurants"]], "address": ["1635 E 87th St"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Quiet", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "No", "Good for Kids": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch"}, "longitude": -87.5837631225586, "rating": "3.5", "price": "$", "number_of_reviews": "3"}, "cvs-pharmacy-chicago-90": {"comments": {"0": {"description": "This CVS is way bigger then all the others one that I have visited in the past. Its your typical CVS with the pharmacies and medicine etc. My only complaint is that they can use more workers, because I don't want to walk around the whole store looking for help, but on the flip side, when you do find a worker they are usually friendly, so that helps. Over all I guess I am a fan of this place but I actually never really come here. oh well maybe I will start.", "rating": "3", "date": [2015, 4, 19]}}, "latitude": 41.728699, "neighborhoods": ["Calumet Heights"], "categories": [["Drugstores", "drugstores"]], "address": ["9142 S S Chicago Ave"], "attributes": {}, "longitude": -87.554474, "category": "Shopping", "rating": "3.0", "price": "$$", "number_of_reviews": "1"}, "dunkin-donuts-chicago-75": {"comments": {"3": {"description": "Typical establishment on the south side as opposed to a reputable chain. A coffee shop without wi-fi. Only certain hours the door is open, yet it's set in the neighborhood where people can walk. Advertised products not available. Slow, very slow service, doesn't matter how many people are working. Sandwiches are microwaved and therefor the bread is over cooked in some areas. I had a texas toast breakfast sandwich and the toast was clearly over microwaved. Ugj! And, friendly service? From a couple, others act as if they are doing you the favor. Avoid at all costs.", "rating": "1", "date": [2013, 9, 18]}, "1": {"description": "Go to get ice cream and the lazy worker have the lobby closed 45 minutes before closing. This is just bad business lazy workers always kill good businesses.  I went to another Donkin Donuts on 87th and Vernon much better workers", "rating": "1", "date": [2015, 11, 16]}, "2": {"description": "I have been to this location a lot. I am a dunkin donuts regular. Getting breakfast or coffee from this location was a disappointment one too many times. My hash browns were cold several times, stale or not cooked all the way. My iced coffee wasn't made properly. There were times it was too sweet and not enough coffee or coffee with no creamer and not enough sweetener. I took my drink back one time and they gave me the exact same one I returned. I will not be back to this location again. I will go to Starbucks.", "rating": "1", "date": [2014, 12, 22]}, "0": {"description": "This location is suitable when you need to eat something and you're right there. Within the past year I've started ordering the same exact thing from this location to ensure I didn't have any extra problems when I was trying to get to work in the morning. A couple times in a row this was a fail. One time I was too tired and yes I should have been paying attention, but I was overcharged. The next day I went in and demanded my money back with several receipts to prove that I get the exact same thing every time. Most of the staff looked at me crazy, so even though I don't really like confrontation I openly pointed out who rang me up that day and the person who usually rings me up. I got my money back then.It seems like one guy was so distracted looking at me he wasn't paying attention to the order I got that day smh. After this I went back one more time. Order the same thing, this time I was upset because after eating my sandwich, my drink was cold and tasted horrible. I was already waaayyys away from this location to turn around. I swear it had to be the wrong drink all together. I knew they messed up because usually driving from that location, by the time I get around the Museum of Science and Industry my drink is still hot and ready. I decided to stop torturing myself. I now just make my own breakfast in a timely fashion, or load my Starbucks card and head there. Also, Subway around the corner is open 24 hours and has fresher and healthier breakfast options. :-)", "rating": "2", "date": [2014, 2, 7]}}, "latitude": 41.7356463521719, "neighborhoods": ["Calumet Heights"], "categories": [["Coffee & Tea", "coffee"], ["Donuts", "donuts"]], "address": ["8753 S Stony Island Ave"], "attributes": {"Take-out": "Yes", "Outdoor Seating": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.5851207226515, "category": "Food", "rating": "1.5", "price": "$", "number_of_reviews": "4"}, "lash-luxe-chicago-3": {"comments": {"3": {"description": "Professional, personable, and the best lashes! Yetta consistently does a fantastic job that will have you/your lashes looking gorgeous. I've gotten so many comments and compliments on my lashes. Parking is free, scheduling appointments is quick & easy, and she does a quick and phenomenal job.", "rating": "5", "date": [2014, 11, 5]}, "1": {"description": "Go to Yetta! She is the best, it was my first time getting legit  eyelash extensions, (not including the places you go to get glue and lashes on your skin!) and I couldn't be anymore pleased with my now 2 experiences here. Yetta made me feel comfortable and didn't pressure me into getting something I didn't want or need, her prices are definitely reasonable for the quality you're getting. I am the first person to complain when it comes to my eyes if something doesn't feel right and I was surprised how that was not an issue here from your appointment until it's time for a refill I haven't had any issues. The new location is easy to get to and didn't have any problems finding parking. I will definitely be a regular here!", "rating": "5", "date": [2016, 2, 9]}, "2": {"description": "Yetta is the gem - I've had lash extension in a number of places and this is one that I keep returning to. Although I've always loved the results, Yetta is one that I would recommend because her extension lasts better and does not destroy my eyelash (i.e. when the extension falls off, they don't bring my lashes with them!). Her prices are very reasonable, and is easy to book via styleseat.", "rating": "5", "date": [2015, 12, 11]}, "9": {"description": "\"Yetta is so friendly!!!! The bonus is she makes my eyelashes look fabulous!! So natural too! My closest friends can't tell what I've had done yet notice there's something different about me! LOL! When I do finally say what it is they can't believe those aren't my lashes. Yetta you are the best! So relaxing too! I always fall asleep while she's doing my lashes. \"", "rating": "5", "date": [2014, 7, 14]}, "10": {"description": "I came here right when it opened after going else where and received a terrible eye infection. I loved the way they looked for the first couple of hours that I decided maybe it was the place and not the actual eyelash extensions. When I met Yetta she had this vibe about her that makes you feel so loved in her presence and I love that she's in charge of everything and there's no talking to a bunch of people that all tell you different things! She sticks to her word and I am always more than pleased walking out of my appointment!", "rating": "5", "date": [2014, 11, 5]}, "4": {"description": "Love this place! If you want high quality professional grade lash extensions with the service to match, this is where you go. Yetta is always accommodating to the personal needs of her customers. I've been going here for almost a year and always walk out with an amazing customized set of lashes. I've tried out a couple of other places including Chicago lashes and they don't event come close to comparing. She takes great care to give you the look you want every time, customizing it to your standards. Try doing that at a salon and they'll just wedge you into the \"Kim k\" or \"natural\" look category. Nothing exciting about that! If you're reading these reviews and are trying to decide which lash salon to go to, you've found the answer at Lash Luxe!", "rating": "5", "date": [2015, 7, 24]}, "6": {"description": "Loved Yetta! So friendly and easy to talk too. Answers all your questions beforehand and even during. Super knowledgeable, you can tell she really loves what she does.  Will be back!", "rating": "5", "date": [2015, 7, 26]}, "12": {"description": "The place must be phenomenal, I'll say it plain and simple I think my better half is beautiful naturally, however I know when she's all smiles and giggles after one of her many \"errands\" it's generally because she is more than pleased by putting one over on me.I kept telling her how amazing she looked and she finally spilled it. She went on ranting and raving that she had never had better work done and she knows her stuff when it comes to beauty. I know she would have never told me about the lashes since she knows I am not a fan of anything that looks too artificial however since they look amazing and natural  I'm signing her up as a lifetime client. Thanks Lash Luxe , nothing like a woman beaming because she looks beautiful.", "rating": "5", "date": [2014, 7, 26]}, "5": {"description": "As a male, walking in a women's salon can be intimidating, but Yetta made me feel super welcomed and relaxed. She explained the process, and what would fit me better in order to no look  \"drag queen\" like. Lol! :) I laid face up, and the hour just flew by talking to Yetta non stop. She is so approachable, and personable. Trust me, you will walk out with not only anew lash stylist, if that is even a term used, but a new friend! :)", "rating": "5", "date": [2015, 2, 1]}, "13": {"description": "I agree with all of the compliments for Yetta.  She is professional, experienced, and pleasant.  Her prices are reasonable and she does quality work.  I visited her after having a poor quality job done elsewhere.", "rating": "5", "date": [2014, 9, 2]}, "11": {"description": "I really never make reviews , but here I go! I was soooooo happy with my lashes! She was very professional & takes her time setting the individual lashes. The outcome was so beautiful and I was extremely pleased! I had a bad experience elsewhere, thankfully the technician was able to remove the previous lashes, she even gave them a nice protein treatment! I came back a month after and she set some wonderful good quality lashes just in time for my birthday! Highly recommended! I will be coming back.", "rating": "5", "date": [2014, 6, 4]}, "8": {"description": "One word : Professional ! It's so hard to find a business owner that up holds that quality on top of excellent service. I'm beyond picky when it comes to sanitation , especially dealing with something as sensitive as my eyes . Cleanliness is everything, and this place is immaculate ! Not only did I feel comfortable , I actually felt that Yetta listened to what I wanted. I hate the strip lash bulky look, and I definitely didn't get that. All natural individual lashes  ! And I have gotten so many compliments from everyone . I will never go back to any lash salon/tech ever . It's all about that personal touch that I received , can't get that anywhere else .", "rating": "5", "date": [2014, 6, 4]}, "0": {"description": "I am so happy that I found LashLuxe and Yetta here on Yelp!A few weeks ago I was in Miami and treated myself to a full-set of lash extensions.Of course when I came back to Chicago I had to find a place that would do the full-ins.  I expected to have to go Downtown or Lincoln Park, but I found Lash Luxe in the Irving Park/Milwaukee area, also known as \"6 Corners.\" Yetta's reviews were great, and the location is so easy to get to, and there is lots of street/metered parking. All of the stars were in alignment, so I thought I'd give it a try!!I have my new lashes, Yetta is a doll and a real pro at eyelashes, and the shop is lovely!! Her area is very comfortable, and we chatted through the whole appointment as though we'd known each other forever!! And I have lashes!!I wake up, and I'm already made-up with these long, luxurious lashes in place.I made my next appointment before I left.Lashes, a nearby Starbucks, a few blocks from the Kennedy, a fun appointment, and easy parking???You can't go wrong!!", "rating": "5", "date": [2015, 12, 6]}, "7": {"description": "Yetta is awesome! I have gone to her a few times now and she is the best. She is very knowledgeable and answers all of your questions. Making you very comfortable with the process. She does a fantastic job with the application of the lashes, highly recommend!", "rating": "5", "date": [2015, 10, 29]}}, "neighborhoods": ["West Town", "River West", "Noble Square"], "latitude": 41.8963374315088, "longitude": -87.6492752611285, "rating": "5.0", "times": {"Mon": [], "Thu": ["11:00 am", "7:00 pm"], "Sat": ["11:00 am", "6:00 pm"], "Wed": ["11:00 am", "7:00 pm"], "Tue": ["11:00 am", "7:00 pm"], "Sun": [], "Fri": ["11:00 am", "7:00 pm"]}, "price": "$$", "categories": [["Eyelash Service", "eyelashservice"]], "address": ["833 West Chicago Ave", "Ste 404"], "attributes": {"Parking": "Street", "By Appointment Only": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Accepts Bitcoin": "No", "Wheelchair Accessible": "Yes"}, "category": "Beauty", "number_of_reviews": "14"}, "the-browtique-orland-park": {"comments": {"1": {"description": "I LOVE the Browtique ! very professional and friendly staff, plus my brows look amazing :)", "rating": "5", "date": [2015, 10, 20]}, "9": {"description": "Never would have thought an eyebrow waxing could be relaxing!! It was painless and actually enjoyable! My eyebrows needed some serious shaping after years of $10 wax jobs at nail salons etc. Stephanie did a phenomenal job! The only thing keeping me from giving all 5 stars is the price increase to $40 (worth it but def won't be able to come in as often as I'd like at that price) and having to book appointments so far in advance. Sometimes things come up and I find myself in need of a last minute wax....But overall you can't beat the quality! I will definitely be back.", "rating": "4", "date": [2015, 1, 28]}, "12": {"description": "Diana did an AMAZING job on my eyebrows. She is a perfectionist, she's very knowledgable and I will be coming back.", "rating": "5", "date": [2014, 2, 13]}, "21": {"description": "Diana is awesome at brows, I will go to her as long as she is in business. She is very accommodating to my awful schedule. Bottom line, have her sculpt your brows and you will be very happy with the results!", "rating": "5", "date": [2010, 9, 16]}, "16": {"description": "A trip to the Browtique will transform your appearance. This dynamic duo have a modern shop that is clean and elegant. Excellent service and painless brow wax. Highly recommend! Thank you, Diana and Stefanie.", "rating": "4", "date": [2013, 5, 2]}, "17": {"description": "I have been to both Diana and Stefanie they are amazing! My eyebrows have never looked so good. I will be a customer for a very long time!", "rating": "5", "date": [2014, 2, 15]}, "10": {"description": "I was referred to the Browtique by a friend and decided to try them out. Diana did an excellent job on my eyebrows and she really takes her time. I let my eyebrows grow out for about 3 weeks and Diana did a great job shaping them and added an arch. We had great conversation and she is very pleasant. The prices are higher than my usual threading place but you pay for the service and technique. I will definitely be going back.", "rating": "5", "date": [2014, 3, 9]}, "5": {"description": "Stephanie is excellent!! Cannot recommend this place enough! I am highly satisfied with my eyebrows. After years of getting them threaded, I was tired of the inconsistent results from different threaders. Stephanie is an expert. I will never trust anyone else with my eyebrows from now on! Highly recommend the Browtique. Worth every penny!", "rating": "5", "date": [2015, 1, 13]}, "11": {"description": "I just had my appointment today with Diana, and she did a great job! After growing them out for a couple weeks, I am in love with my brows. She waxed them, plucked some strays, and showed me how to fill them in. Thanksomuch!", "rating": "5", "date": [2014, 4, 23]}, "22": {"description": "Diana is amazing!  I had a horrible experience once with my eyebrows and vowed never to have them touched again.....until I found Diana!  I will never go anywhere else to get my brows done.  She does a fantastic job and she is very friendly.  The salon is really cute and the prices are very reasonable.Really, I can't say enough good things about The Browtique!  You won't be disappointed.", "rating": "5", "date": [2010, 5, 4]}, "0": {"description": "Love love this place,  yes it's hard to find next available appointment but that tells you how  good the girls are.  Yes it is a lot of money but worth every penny.  No preference as of which girl they both do outstanding job.", "rating": "5", "date": [2016, 2, 4]}, "20": {"description": "Love her. I foresee adding her to my monthly budget for a long time.", "rating": "5", "date": [2011, 2, 13]}, "19": {"description": "Diana, you rock!", "rating": "5", "date": [2012, 2, 10]}, "2": {"description": "Cute place and the estheticians there know what they are doing. My eyebrows came out great. I  took away a star due to price - way too expensive. I won't be going as often as I would like to get my eyebrows done. Also, it is difficult to get in for an appointment. I like using their online booking system, but there are only three girls that work there and the next available appointment is in a month.***This is an update. I have been here twice and like I mentioned early that it is difficult to get an appointment, and now it has gotten worse. It is October 25th and the next available appointment is December 31st! That is ridiculous. Unfortunately, I will need to find another place. My best friend, who goes there too, is looking for another place too.***", "rating": "4", "date": [2015, 9, 5]}, "18": {"description": "Diana is simply a magician. For years I kept hearing, you have to grow this in, your brows are too thin, blah blah.... Well thanks to Diana I now have two brows with arches.  You rock!!!", "rating": "5", "date": [2011, 11, 20]}, "13": {"description": "Hadn't had my eyebrows done in years. Wanted to give them some shape for my upcoming wedding. Stephanie did an excellent job! I was a little scared at first but my eyebrows have never looked better. She also suggested a tint which totally made them stand out. I also received the Essence facial afterwards. I am 46 years old and my skin has never looked better. She uses tried and true products with an excellent technique. I left with no make-up on and thought I looked great, my skin tone was even and glowing but not red. It was a wonderful experience and I will definitely be back. Thanks Stephanie!!!", "rating": "5", "date": [2014, 4, 4]}, "4": {"description": "Literally the best service by Stefanie ever! She's the most kind down to earth person and does an AMAZING job on the brows! I'd recommend her to anyone. Obsessed with this place!!!", "rating": "5", "date": [2015, 2, 18]}, "6": {"description": "I have been coming to The Browtique since 2012. Diana does an AMAZING job!!! I can't recommend this place enough!!! If you want perfection, this is definitely the place to go!!!", "rating": "5", "date": [2014, 7, 22]}, "15": {"description": "Diana is amazing!  I had a horrible experience once with my eyebrows and vowed never to have them touched again.....until I found Diana!  I will never go anywhere else to get my brows done.  She does a fantastic job and she is very friendly.  The salon is really cute and the prices are very reasonable.Really, I can't say enough good things about The Browtique!  You won't be disappointed.", "rating": "5", "date": [2010, 5, 4]}, "7": {"description": "AMAZING! You won't regret going to The Browtique. I love eyebrow day, because each time I go (about every 4-5 weeks) my eyebrows get better and better. Stefanie is such a down-to-earth person, very nice, professional, and she makes you feel very comfortable, like you're visiting a friend. She takes her time and is a perfectionist. And, I love the education she provides; how to shade, pencil, and highlight. My brows have never looked better!", "rating": "5", "date": [2015, 4, 21]}, "8": {"description": "Diana has been doing my eyebrows for almost a decade and there is a very good reason for that! She is the brow guru and I no longer trust anyone else with my eyebrows because she is such a perfectionist. She and her partner Stefanie are super friendly and professional. The shop is always clean and well-organized. You will NOT regret your visit to The Browtique!", "rating": "5", "date": [2015, 3, 20]}, "3": {"description": "I can't say enough good things about The Browtique. These girls are so professional, sweet, kind and TALENTED! The shop is beautifully decorated, clean, and inviting. The atmosphere is warm and welcoming. Diana and Stefanie, in my opinion, are brow guru's.  I will never allow anyone else to touch my brows again! If you want to walk away from your waxing appointment feeling wonderful EVERY.SINGLE.TIME this is where you need to go! You will not miss out!", "rating": "5", "date": [2015, 7, 18]}, "14": {"description": "I spent about 5 months growing out my eyebrows after I walked out of a salon with what seemed like 10 hairs left per brow.  I did a bunch of research before I decided to try The Browtique.  The Browtique located in the Sola Salon Studios.  It is basically a bunch of individual salon suites a number of beauty professionals use to run their own businesses. The first time I saw Diana she really took her time sculpting my brows.  I knew I still had some growing in to do, but Diana used a brow pencil to show me the brows I could eventually have if I was patient and let her deal with them.I went in for my second appointment a few days ago and I couldn't be happier with the results.  My whole face looks better.  I won't trust anyone else with my eyebrows from now on.Diana is professional, and promptly responds to phone calls and texts for appointments.  Her prices are more than reasonable.  Thanks Diana!", "rating": "5", "date": [2012, 3, 9]}}, "categories": [["Makeup Artists", "makeupartists"], ["Skin Care", "skincare"], ["Day Spas", "spas"]], "address": ["14600 S LaGrange Rd", "Ste 4"], "attributes": {"Parking": "Private Lot", "By Appointment Only": "Yes", "Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "rating": "5.0", "price": "$$", "number_of_reviews": "23"}, "giannas-pizza-chicago-2": {"comments": {"3": {"description": "I had thin crust pizza , crust was very dry like a cracker with no flavor . Other than that it's ok , I wouldn't drive a long way to get there for a pizza ..... I did go back yesterday and turkey sausage pizza was quite good and on line ordering helps.", "rating": "4", "date": [2015, 4, 17]}, "1": {"description": "Yes! Two stars only, the service was ok but the PIZZA...yuck! No flavor at all the crust fell apart and there was no herbs or anything that screams pizza! The sausage was flavorless and had chewy fat inside,  thick pasty nasty sauce the fresh mushrooms were good that's it! I will stick with the beef sandwich here which is worth a try...i don't see why anyone would like this tasteless pizza!", "rating": "2", "date": [2015, 8, 23]}, "2": {"description": "The food here is delicious, the rib tips are huge, please see the pic to believe. The fettuccine is amazing, there is a real chef in this kitchen, not a random person for sure. Please try them out you will not be disappointed. Food was delivered hot and fresh. I will definitely order again.", "rating": "4", "date": [2015, 4, 3]}, "5": {"description": "The pizza was very tasty and delicious to the taste buds! I had ordered a delicious large Supreme pizza that had sausage, thick cheese, fresh mushrooms, green peppers and light on the onions that was just right! It was quite filling!", "rating": "4", "date": [2013, 10, 17]}, "6": {"description": "Great pizza and the estimated pick up time is always accurate.  Thin crust is our favorite and it's cheesy and hot. Ask for fresh garlic on whatever pizza combination you get - it will change your world.", "rating": "4", "date": [2013, 8, 17]}, "7": {"description": "I have ordered from here 2-3 times in the last 12 to 18 months. We usually order pizzas; once, I ordered an Italian Beef and a Calzone. The pizzas are usually fair to good. Packed with toppings and overflowing with cheese. Could use less sauce because the toppings sometimes slide off or the crust is a little soggy. But not so much as it is a deal breaker. The calzone was ok; not a lot of flavor, too much dough. The Italian Beef was not your typical Chicago-style Beef. The meat and bread were too dry; there was not enough meat, they put the peppers on the side, and the cheese was processed. Overall it is an ok place, and hey, please remember not too many pizza places deliver on the Southside.", "rating": "2", "date": [2012, 5, 4]}, "8": {"description": "Good pizza but better when u get extra sauce. Its a bit dry without the extra.", "rating": "3", "date": [2010, 9, 15]}, "0": {"description": "The home made pizza puff is great!!! And you can pick your own toppings too!! Fires were ok. I'llBe calling to try more of there menu that's for sure!!", "rating": "4", "date": [2015, 9, 4]}, "4": {"description": "I order a small meaty thin crust pizza and a soft drink.  The pizza was good and hot, but customer service was lacking no greeting.", "rating": "3", "date": [2014, 7, 26]}}, "neighborhoods": ["Calumet Heights"], "latitude": 41.7367592, "longitude": -87.5873947, "rating": "3.5", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["11:00 am", "11:00 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["12:00 pm", "9:00 pm"], "Fri": ["11:00 am", "11:00 pm"]}, "price": "$$", "categories": [["Pizza", "pizza"]], "address": ["1519 E 87th St"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Takes Reservations": "No", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Casual", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "9"}, "sizzlin-grille-cafe-chicago": {"comments": {"3": {"description": "Restaurant is a diamond in the rough. The food is really good and the restaurant is clean.  I've had the chicken alfredo, southwestern chicken wrap, chicken on a croissant, and the blackened tilipia.  Each dish was flavorful and tasty. I live no where near this restaurant but I drive the distance to eat here.", "rating": "4", "date": [2015, 8, 28]}, "1": {"description": "I'll say a 3.5 star suites them well. Ok here's the deal it's on 87th and Stony Island keep your eyes open because the store sign is small and you will miss it. I ordered the chicken and shrimp Alfredo. It came with some garlic bread on the side. If your hungry get ready to eat, because the portion size was huge. I split it with my man and we still had more for later. Saucy, cheesy, and loaded with chicken and shrimp. But it didn't really taste like Alfredo pasta.. Idk.. It was still good but it didn't taste like traditional Alfredo sauce. But it was hot and ready within 10mins. I'll go back to try the blackened catfish and also the jambalaya.", "rating": "3", "date": [2015, 10, 6]}, "2": {"description": "I ordered the Chicken Fajita Salad. Great flavor, yet they could use a low sodium fajita seasoning and hold the cheddar cheese (ask if you want it). The fried tortilla strips were delicious.", "rating": "4", "date": [2015, 6, 17]}, "5": {"description": "Finally tried this restaurant and I enjoyed the food. Inside was very clean. Ordered Red potatoes, chicken shrimp fettuccine and Jambalaya. The jambalaya us spicy but very flavorful. Wished they cooked the veggies a little longer they were very crisp. Fettuccine had a great taste but was a little oily. Will try again in want to try the wraps not far from home.", "rating": "4", "date": [2015, 8, 23]}, "6": {"description": "This place is a gem for the neighborhood. Reasonable prices and good healthy food. There are new cooks so I believe the low star reviews have come because of them because when the owner use to be the only cook there were never any bad reviews.", "rating": "4", "date": [2014, 12, 31]}, "7": {"description": "I have been there for dessert only. I have been there twice and they haven't had caramal cake. One day I went in the evening and the next time was in the morning. I have also called midday and still no caramel cake. This makes me wonder if they actually serve it. I gave it two stars because the red velvet cake was good.", "rating": "2", "date": [2014, 8, 7]}, "0": {"description": "Tried sizzlin grille as I love to patron neighborhood businesses. Food was amazing, I ordered the jambalaya and the southwest chicken wrap. The jambalaya was spicy but full of flavor. The chicken wrap was really good, my boyfriend even liked it and wanted to take my food! Staff was nice and friendly. Please try them, this is a nice place in the community.", "rating": "4", "date": [2015, 9, 12]}, "4": {"description": "tried this place b/c I had a groupon and always looking for options near the office. Clean enviro. TV and jazz music battling it out to drown out the cashier. Service is terribly slow. Took 25 minutes at 1:30 on a Thursday afternoon to get a wrap and a fettuccine. Not exaggerating. Even worse, both dishes were over-seasoned with the same seasonings. Screwed up another customers order while I was waiting my 25 mins to get my food. I'm all about locally owned businesses, but I will NOT recommend this place. Really needs improvement if they are going to succeed.", "rating": "1", "date": [2014, 7, 18]}}, "neighborhoods": ["Calumet Heights"], "latitude": 41.736698, "longitude": -87.582199, "rating": "3.5", "times": {"Mon": ["10:30 am", "9:00 pm"], "Thu": ["10:30 am", "9:00 pm"], "Sat": ["10:30 am", "9:00 pm"], "Wed": ["10:30 am", "9:00 pm"], "Tue": ["10:30 am", "9:00 pm"], "Sun": [], "Fri": ["10:30 am", "9:00 pm"]}, "price": "$", "categories": [["Cafes", "cafes"]], "address": ["1711 E 87th St"], "attributes": {"Has TV": "Yes", "Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Delivery": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Wheelchair Accessible": "No", "Takes Reservations": "No", "Attire": "Casual", "Accepts Bitcoin": "No", "Waiter Service": "No", "Dogs Allowed": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "8"}, "cvs-pharmacy-chicago-13": {"comments": {"3": {"description": "This isn't the biggest CVS in town but I have found the staff to be amazing!I haven't stepped inside of this place once and not been greeted with a smile when I check out!If I'm not sure where something is I have been taken right to the aisle!  That doesn't mean I haven't encountered a pointer, you know the one that says yes right in aisle 4 and you still don't see the item.This is one of my favorite CVS stores and I will be back!SN: I love the after Halloween Candy Sale you always can find the best chocolates for more than 50% off!", "rating": "4", "date": [2012, 10, 31]}, "1": {"description": "This CVS is okay. I don't really have any complaints about it. They keep the store neat and clean. It's pretty much the same as any other CVS.", "rating": "4", "date": [2015, 3, 8]}, "2": {"description": "I HATE going into this CVS, however this time it could not be avoided. I uploaded some pictures to the CVS  website for pick up the following day- I was given the time of 11am. These pictures were to be viewed at my great aunt's memorial, these pictures were sentimental. well, i go there (close to 1pm), grab some powder (hey, it's hot!) and let the gentleman know I also have some pictures to pick up. He goes to look for the pictures and states \"She will help you, I can't find them\". Who \"she\" was, i didn't know. I find a seat, and I sit. I then get up, and ask \"does 'she' know I am waiting?\" he said she did. Well \"she\" finally comes to assist. Asks me when I sent my pictures to be printed, I said last night. she then goes to computer and nonchalantly says \"i am printing them for you right now\". WTF?! What is the point of doing this online, if you don't print them until I arrive?? The pictures come out of the printer... here are my issues:1. They were dark2. I uploaded 8 pictures, she only printed 63. The pictures were also blurry. \"Courtney\"- (that was her name). let me know that if they were from a phone they could come out blurry. They were from a camera, and did not look like that when they were uploaded. 4. She did not apologize or acknowledge that I had to sit and wait for some pictures that I sent to their website LAST NIGHT for pickup that were not ready. 5. I also mentioned to her that there were 8 pictures, and I only received 6. She said nothing. This CVS is THE WORST, there is always a line. The people behind the counter are so ghetto and awful. And there is almost always someone outside begging. Please avoid at all costs.", "rating": "1", "date": [2013, 6, 25]}, "0": {"description": "Who writes reviews on the neighborhood pharmacy?  Someone who is happy with the store, that's who.  I give this store 4 stars because thay always have the hair dye I want and they always take my coupons.  There is no limit on how many I can use here.  If it scans, they take it.  Love it.  Minus 1 star because there is always a line.  Even if there is not one when I walk in, there is a long one by the time I get ready to leave.  Every.  Single.  Time.", "rating": "4", "date": [2013, 5, 9]}, "4": {"description": "I'm rating CVS for exactly what they are....a pharmacy. For years now I have had to make serious use of a pharmacy. It wasn't until I started getting my prescriptions here that I felt comfortable. I finally found my one place that I can go to for my prescriptions. The pharmacy staff is great. They always answer any of my crazy questions I have about a medication or anything. They are always friendly! That's very important. I've dealt with them over the phone, in the store and in the drive-thru. Same great service all across the board. They also just helped me have hundreds on a recent medication. For that alone they have my loyalty!", "rating": "5", "date": [2014, 2, 2]}}, "latitude": 41.7363259, "neighborhoods": ["Calumet Heights"], "categories": [["Drugstores", "drugstores"]], "address": ["8712 S Stony Island Ave"], "attributes": {"Parking": "Private Lot", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.5857986, "category": "Shopping", "rating": "3.5", "price": "$", "number_of_reviews": "5"}, "wingz-it-iz-chicago": {"comments": {"3": {"description": "You want good food  and great customer service? 'Wingz It Is' is a terrific choice! Nice crunchy chicken  with a variety of flavors to choose from that will satisfy anyone's taste buds. Tilapia  is pretty good to. Not to mention the fries are the bomb . Very reasonable prices and very customer friendly. My family loves this place. I would recommend this place to anybody!!!! Uhmm mmmm good", "rating": "5", "date": [2015, 5, 5]}, "1": {"description": "Everything is made to order which is great but I was expecting something else. I was looking to get a fried wing smothered in some type of sauce like traditional buffalo or teriyaki wings. What I got was a fried wing with seasoning sprinkled on top of it. The mild sauce was a disgrace to Chicago's Mild sauce as it was just a spicy barbecue sauce. However now that I know what to expect I would visit again as the wings were fried to perfection, really crispy with a fluffiness to them.", "rating": "3", "date": [2015, 11, 24]}, "2": {"description": "Ok,Honestly I chose this place, because the pricing was cheap! I called in to place an order of 100 wings and I was honestly extremely undecided. The young man who answered the phone was sooooooooooooo patient I kept apologizing and he kept saying not needed. Finally I decided to do 25 garlic, 25 Mild and 75 Plain. These wings were GREAT! The Garlic wings are truly something special I just cant believe I just found this place. I am writing this review to say you don't have to be at a fancy location to get 5 star quality and service.", "rating": "5", "date": [2014, 11, 23]}, "5": {"description": "Honestly this was one of my favorite places to go. After today I would never step foot in this establishment again. I purchased to orders of wings.  After my 20 minute drive home I discover the wings are so little there's barely room for error in their preparation. Once I bit into them it was like chewing a potato chip. I then called to speak with the manager he wasn't there. So the person who answered asked how can I help. I began to explain he interrupted to say \"he knew so he told\" that's where I stopped him to explain let me finish. I explained I'm not looking for a refund and no I don't want any more food. So apparently I may have cursed in my explanation and he acted as if I cursed at him and began to get louder. Now I may have said a word or two I really don't recall but in no way did I direct this at him I was simply giving my discretion of the food. As well as letting him know I understand you can't pick the size of the wing and I realized they tried to put in more. But the cook should know better than to cook wings of that size the same amount of time as larger ones. When the meat on the outside is just as hard as the inside there's a problem.  So he began to talk as if I had completely cursed him out and speak I'll of him which at $18 for wings that were garbage maybe u should have been. I let him know ofcourse if i used a curse in my description and he was offended I'm sorry. But there was no need for him to say anything defensive my call was to inform them of my disappointment in what had been served. I for one held this place to a different standard than the average wing joint and this food was unacceptable and no need for an apology or offer of more food. After this phone call I won't be spending my money here again.", "rating": "1", "date": [2015, 4, 23]}, "6": {"description": "Garlic an Cajun", "rating": "4", "date": [2013, 2, 9]}, "7": {"description": "Fabulous", "rating": "5", "date": [2013, 11, 28]}, "0": {"description": "Great customer service. The garlic seasoned wings are my favorite.  I also like the wedges. Called my order in and it was ready when I got there.", "rating": "5", "date": [2015, 9, 20]}, "4": {"description": "I've been here about 5 times and I must say the wings here are fantastic! I always get the BBQ wings and have them put garlic in it too. Our orders have always been correct, hot, and delicious. The staff here is pretty friendly too, and I've never seen it crowded which is a plus. If you walk in and order expect to wait 15 minutes. Call in if you're in a rush or don't feel like waiting.Did I mention their banana pudding? It's AWESOME and it's only $2.50! Definitely worth a shot if you like banana pudding.", "rating": "5", "date": [2013, 6, 7]}}, "neighborhoods": ["Calumet Heights"], "latitude": 41.7292404174805, "longitude": -87.5858688354492, "rating": "4.0", "times": {"Mon": ["7:00 am", "10:00 pm"], "Thu": ["7:00 am", "10:00 pm"], "Sat": ["10:00 am", "12:00 am"], "Wed": ["7:00 am", "10:00 pm"], "Tue": ["7:00 am", "10:00 pm"], "Sun": ["7:00 am", "10:00 pm"], "Fri": ["10:00 am", "12:00 am"]}, "price": "$$", "categories": [["American (New)", "newamerican"]], "address": ["9106 S Stony Island Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Has TV": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "8"}, "pee-wees-place-chicago": {"comments": {"3": {"description": "Like most things. \"its not what it used to be\". At one point they had the best gyros and italian beef. Not anymore. The last time I was there. I got a peewee burger with heavy pickle. They charged me extra for the pickles. When I asked why, the guy said because of the cost related to high quality pickles. When I got the burger, the pickles were of the jewel brand jar pickles.  Haven't been back. The fries are horrible! I've never liked their fries.", "rating": "2", "date": [2013, 8, 7]}, "1": {"description": "This place is amazing! Favorite restaurant don't know where to start everything I've ordered from here is delicious. I would highly recommend this place if you never ate here before.", "rating": "5", "date": [2016, 2, 4]}, "2": {"description": "It was a great place a few years ago , the gyro was good I had today but the place has gone down the floor is messed up and menu is apparently paper taped over the old sign .", "rating": "3", "date": [2015, 5, 21]}, "0": {"description": "This is a neighborhood fast food spot that has been around for years and has transferred honorship several times. I mainly opt for the chicken on pita with fries, but I have also had the pizza puff. Both very standard fast food options, nothing spectacular. They close fairly early during the week - around 9pm.", "rating": "3", "date": [2015, 9, 9]}, "4": {"description": "Another dive that is not as bad as it seems... gyros are not bad", "rating": "2", "date": [2009, 10, 8]}}, "latitude": 41.73715, "neighborhoods": ["Calumet Heights"], "categories": [["Restaurants", "restaurants"]], "address": ["1538 E 87th Street"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "longitude": -87.58633, "rating": "3.0", "price": "$", "number_of_reviews": "5"}, "grand-chinese-kitchen-chicago-4": {"comments": {"1": {"description": "I went here due to a recommendation and wish I hadn't. I ordered chicken teriyaki and was given \"beef teriyaki\" which was more like beef and broccoli but it was GROSS. My boyfriend's beef fried rice was good, and he got chicken too that was still pink. I would not recommend this place to anyone.", "rating": "1", "date": [2013, 6, 21]}, "2": {"description": "If I could give it 0 stars I would. The food sucked, which is hard for me cause I can eat anything, but when you order chicken wings and it's raging pink inside? It's time to wrap up it. The only good about this place is the fact that you can play lotto besides that? It blows custard.", "rating": "1", "date": [2013, 8, 14]}, "0": {"description": "I always order the same thing it's great every time . Fast friendly staff ,cash only , you can call ahead for pickup", "rating": "5", "date": [2015, 4, 17]}}, "latitude": 41.7367551, "neighborhoods": ["Calumet Heights"], "categories": [["Chinese", "chinese"]], "address": ["1511 E 87th St"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Accepts Credit Cards": "No", "Delivery": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "No", "Good for Kids": "No"}, "longitude": -87.5878867, "category": "Restaurants", "rating": "2.5", "price": "$$", "number_of_reviews": "3"}, "romas-restaurant-and-lounge-chicago": {"comments": {"3": {"description": "This is the deep south, baby. The deep South Side, that is. Check out the address, which cracks me up: 9273 S. South Chicago Ave. South South Chicago Avenue, and it's not even redundant.We stopped into the bar to relax after we walked from Calumet Fisheries (see review by the same name).There was a FAT lady smoking a cigarette when we arrived. Blech. And when she left, a guy went to the slot machines two at a time, which was God-awful; imagine: two slot machines played simultaneously with Chuck E Cheeses musical motif.The Corona's were $3.50, so that was nice. The Mexican motel art was cheeseball, and we never did venture next door to see the restaurant. Just an any-port-in-the-storm joint for a beer before making our way through Customs and Immigration.", "rating": "3", "date": [2009, 8, 23]}, "1": {"description": "Very good food but the service here is horrible. They have 1 waitress and it took a long time for her to attend every table. She was very nice, not rude at all as some waitresses can be but I dont think ill be coming back unless they have more help.", "rating": "1", "date": [2014, 10, 31]}, "2": {"description": "Don't let the last review of this place scare you. The bar side if this joint is definitely Sketch Central. The restaurant, however, is a DIAMOND IN THE ROUGH!Clean. Friendly. And overall pretty good food for decent prices. Fresh two. Roma's prepares everything with only the best ingredients and produce. Their classic American diner food is super yummy. Think burgers with thick, juicy patties and steak fries. THE BEST GRILLED CHICKEN SANDWICH in SOUTH CHICAGO. And turkey club sandwiches that don't skimp on the turkey, tomato, lettuce, and mayo.Their Italian food also gets a B+ in my book. Minestrone is super hearty and filled with tons of different veggies. Try their lemon chicken pasta. Their calamari and bruschetta are also excellent.Daily soup specials! Thursday is the best day...where else can you find CREAM OF RED BELL PEPPER SOUP?! yummmm! Can't beat that with their fresh baked bread they give to EVERY customer, even take out customers! Family owned business! Mike, the owner, is an AWESOME guy and super funny. Make sure you check out the picture of him and Mayor Daley behind the register (YES, the mayor ate here!)Breakfast here is also delicious. Their pancakes give IHOP a run for thier money. Try the breakfast special for $4.99! You get two pancakes, two slices of bacon, eggs any way, and two sausage links! That's a million times better than a McDonald's breakfast!Careful, their hours change in the winter and they usually close around 5 or 6! Also, feel free to park in the Bank of America parking lot next door. Mike worked some kind of deal out with the bank so that his customers can park there! Yay!", "rating": "4", "date": [2010, 7, 21]}, "0": {"description": "Great tacos!!!!  Service is great they r friendly and the restaurant is clean!!!                                  Also try their garlic shrimp !!!!!!!!!", "rating": "4", "date": [2014, 10, 23]}, "4": {"description": "This place has great breakfast and a nice bar for those mornings you need something extra. notable items on the menu are the breakfast skillets and the pancakes. Don't get too fancy with your drinks, a simple rum & coke, beer, or vodka and lemonade is your best bet.Both the restaurant and bar are always clean, the waiters are friendly and very attentive.", "rating": "4", "date": [2010, 8, 23]}}, "latitude": 41.7266455292702, "neighborhoods": ["Calumet Heights"], "categories": [["Tex-Mex", "tex-mex"]], "address": ["9273 S South Chicago Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Delivery": "No", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "longitude": -87.5509326159954, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "5"}}