{"taqueria-jamay-chicago-2": {"comments": {"3": {"description": "Great tacos, Al Pastor on a spit.  Only 4 star hot sauce.", "rating": "4", "date": [2012, 1, 10]}, "1": {"description": "I started going to this place after my favorite Mexican restaurant jacked up their prices, I came to el Jamay a couple of times and purchased tacos de Chile relleno, each time they were ok, not the best, but at a ok price. The third time I purchased another taco de Chile relleno, I found some some small sharp object in the Chile breading, almost like a circular thing with thorns. Also, I went there at night one time to get an agua de horchata and I couldn't drink it it was disgusting, it was whatever was leftover for the night.", "rating": "1", "date": [2015, 12, 29]}, "2": {"description": "The best Mexican joint we've found!  Everything we've gotten from the menu has been top-notch, and we've tried just about everything!  I suggest the flautas, not on the menu, but delish, with a ton of salad too!", "rating": "5", "date": [2015, 4, 10]}, "0": {"description": "Great service. Great food. What more can you ask for?!Tried the chicken burrito, steak torta, chicken taco and everything was awesome. If I'm ever driving by again I will definitely stop by!", "rating": "5", "date": [2014, 8, 31]}}, "neighborhoods": ["New City", "Canaryville"], "latitude": 41.816336793688, "longitude": -87.6410327915153, "rating": "4.0", "times": {"Mon": ["9:00 am", "9:00 pm"], "Thu": ["9:00 am", "10:00 pm"], "Sat": ["9:00 am", "10:00 pm"], "Wed": ["9:00 am", "9:00 pm"], "Tue": ["9:00 am", "9:00 pm"], "Sun": [], "Fri": ["9:00 am", "10:00 pm"]}, "price": "$", "categories": [["Mexican", "mexican"]], "address": ["2500 W 51st St"], "attributes": {"Attire": "Casual", "Waiter Service": "Yes", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Good for Groups": "No", "Outdoor Seating": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "category": "Restaurants", "number_of_reviews": "4"}, "ts-paisans-chicago-2": {"comments": {"3": {"description": "They have great lunch specials. Good food for ridiculously cheap. Hot dog, fries and a 12 oz can of soda for $3. Their fries are fantastic and their hotdogs seem to be a good quality beef. Gonna try and order a pizza puff next time.", "rating": "5", "date": [2014, 6, 19]}, "1": {"description": "Ordered food here through GrubHub. It said they are 1.8 miles from my house and it is a straight shot down 47th. Not challenging to get here. The food took an hour and a half to get here and was soggy and cold. And the kicker...the driver called because he wanted me to come out to the street to pick up the order. No way! I order delivery and pay the $3 delivery charge and tip for the convenience of having my dinner come to me without having to lift a finger. He wasn't going to come up until I told him I couldn't leave because I have a infant and I'm not leaving him alone in the house. Oh, and one more thing, he called me honey. Sorry, but I'm not your honey.", "rating": "1", "date": [2015, 11, 5]}, "0": {"description": "Food  is amazing. And the customer  service is a 10. I have called in plenty of orders to  different  places  and i get attitude  which causes me to go elsewhere. I called this place and i got the most professional person to take my order. And all the food i ordered, the total was so so so cheap so i thought  the food would be gross. First off my steak tacos was the best I've ever had. The delivery guy still came on time even though  it was a tornado watch  going on. I just hate that they dont take credit card but it isnt a deal breaker. I will definitely  order here again and again", "rating": "5", "date": [2015, 9, 19]}, "2": {"description": "Ordered a 16\" pizza through they Yelp app for pickup. It filled up myself and two other co-workers, and was just what we needed for lunch on a Friday after a long work week. Very solid, quality pizza.", "rating": "5", "date": [2015, 10, 16]}, "5": {"description": "Have you ever had one of those days where you know you're not cooking all day? That's my day. So I figured I'd order some takeout that would last for lunch and dinner. I found this place on Grubhub and so glad I did. Super cheap. I ordered a gyro for lunch which comes with fries. Mozzarella sticks just to try them and a small pizza. No I'm not pregnant but as I started going I wanted to try EVERYTHING. It's perfect. That'll be lunch and maybe dinner tomorrow too ha! All of that only cost $20!! I tried a sliver or piece of everything for lunch and it was all delicious. Pizza crust was so soft and yummy. Great sauce very sweet. Gyro very tasty. It was delivered and quickly AND all still warm. I literally had a sliver of everything and am now full ha. I hope I'm not the only one who orders mass takeout to plan several meals. LAZY me ;)", "rating": "5", "date": [2013, 10, 18]}, "6": {"description": "I'm not from Chicago but I pulled in here. The pizza was good and the owner was very generous with samples and upgraded the size of our pizza for free. Warning: no deep dish though (that's what we were originally looking for but the sample was good enough that we ordered).", "rating": "4", "date": [2014, 7, 1]}, "7": {"description": "Great pizza! Really fresh, one of those kind of pizza's that \" just one more slice \" everytime. Super nice staff, fast delivery, and other items hit the spot as well.Crunchy fresh salads and sides. Want to try every item. Give them a shot!", "rating": "5", "date": [2013, 11, 3]}, "8": {"description": "I love this pizza place! The pizza is delicious. I always order my pizza to go or have it delivered. They are very prompt and courteous.I do not recommend it as a sit in place, but yes as a late night pizza place on Sat. nights.", "rating": "5", "date": [2010, 11, 19]}, "9": {"description": "Where else can you get fries on a late night in Back of the Yards?", "rating": "3", "date": [2011, 1, 5]}, "10": {"description": "I am not entirely sure this is the spot. But running an errand down 47th Street, I decided to drop by Los Soles, an area Mexican eatery for a taco that I had heard about on Yelp. Well, Yelp done me wrong. Los Soles is no more. Peering inside the locked corner storefront was one of those shells of a former business, with smashed windows, nearly no seats, floors ripped up, and all in disarray. Well, I was already off the bus, I thought. So I started to stroll down 47th, until I came to a most magical sign \"Pizza - One Slice $.92\". Or, one slice =  $1 after tax.  Ahhh, my detour was not in vain. The woman who served me, well, she brings this up from a three to a four star spot. She was friendly, sincere and curious, and prompt with my order. Two slices of pizza. And they were good, and I'd say of a better size than many of the other slice for a buck places I've been to. This is a quick spot for working class folks in the area from the warehouses or auto body shops. There's not much in the area, but if you find your stomach growling as you have to take the #47 bus, T's Paisans is all right.", "rating": "4", "date": [2008, 8, 12]}, "4": {"description": "Food is alway on point! I live two blocks away and eat here at least once or twice a week ! Prices are very good as well! Loovveeeee it!", "rating": "5", "date": [2014, 1, 28]}}, "neighborhoods": ["New City", "Canaryville"], "latitude": 41.8091583251953, "longitude": -87.6434326171875, "rating": "4.5", "times": {"Mon": ["10:00 am", "8:00 pm"], "Thu": ["10:00 am", "8:00 pm"], "Sat": ["10:00 am", "11:00 pm"], "Wed": ["10:00 am", "8:00 pm"], "Tue": ["10:00 am", "8:00 pm"], "Sun": [], "Fri": ["10:00 am", "11:00 pm"]}, "price": "$", "categories": [["Pizza", "pizza"]], "address": ["704 W 47th St"], "attributes": {"Good for Kids": "Yes", "Take-out": "Yes", "Has TV": "Yes", "Accepts Credit Cards": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Good For": "Lunch", "Attire": "Casual", "Waiter Service": "No", "Wheelchair Accessible": "Yes", "Good for Groups": "No", "Takes Reservations": "No"}, "category": "Restaurants", "number_of_reviews": "11"}, "inail-chicago": {"comments": {"3": {"description": "Since I've stopped going to that GHETTO nail shop on 51st (yep I left a review) I've been on a quest to find one in the area that I'm comfortable with. I knew from the minute I walked into this place my search would continue. The owner (Mai) isn't warm at all. She's cold with cut n dry comments. On my first visit it was 3 of us and we were told it would be 30 minutes. We decided to wait, as I looked around I noticed Mai is the ONLY nail tech. And there's 2 techs that does the pedicures. There's 4 nail stations and 3 pedicure stations. 3 hours later I was satisfied with my service. Not impressed but satisfied. They do have OPI and Essie but the colors are VERY limited. They have a verity of colors for the NO CHIP manicures (which is the in thing) tho. But that was ok by me because I've learned to bring my own polish. I decided to go back for my 2 week maintenance and figured out how Mai operates. Because the place is so small and tucked away she doesn't get a lot of business and she remembers her clients. Because on my first time we were new she didn't turn us away but as I sat there and observed her I noticed that if 2 or more ppl came in together she would tell them they're busy and they would need to make an appointment. But if you come in alone she would take you and give you a 20-30 minute wait time. On my second time again, I was satisfied but not impressed so I came back for a third time BAD MISTAKE. Because I've decided to go stiletto after 15 years of wearing natural nails and she's the ONLY nail tech she does my nails while another worker does my pedi. I like one person working on me per visit. Mai doesn't buff the nails enough so no matter what I have dull spots on them. And the pedicure ladies (yep I've had both of them service me) give rush jobs. The polish is sloppy (all over my skin). I had to ask them (all 3 times) to wash the pedi tub. They reuse the toe separators and the pedi shoes (I spoke up and made them open new materials for me). But you BETTER know as soon as you speak up for yourself they speak in their native tongue and all 3 look right in your direction. No shame or discretion at all. Because she turns people away and it's so small that it's quiet and if you like Metv (all throwback shows) then this can be a place for you but if you're a stickler for perfect service DON'T waste your time. And please believe the people raving about this place is more concerned about the $30 Mon-Thurs mani/pedi special. But if you're like me and know that you get what you pay for then again don't waste your time. Needless to say I'll be at another establishment in 2 weeks.", "rating": "1", "date": [2015, 6, 13]}, "1": {"description": "I drove past their \"$25 mani/pedi Tue-Thu\" sign for two years before it all worked out for me to get services done there. One time they had a crowd but I didn't have time to wait. This time I only had to wait for 5-10 minutes without an appointment. They were friendly and gentle. I had foot surgery eight years ago and often have to ask people to not be so rough. The owner was effective in working with my feet but gentle enough that I didn't have to say anything. It's a $25 mani/pedi so don't expect a high end Michigan Ave salon inside. It is obvious they try to create a nice environment for their clients. My pedicure is on week three and looks like I got it done this week. Also, I had minor facial waxing done. Happy with the results. I recommend iNails to my friends now.", "rating": "4", "date": [2015, 6, 20]}, "2": {"description": "Not a good experience at all.  Not friendly, don't make you feel comfortable or welcome.  I had a pedicure just before my mastectomy surgery, because I knew i wouldn't be able to go again for a while.  I'm not into the fancy polish thing -- just like my nails trimmed and calluses reduced.  Finally, when my doctor cleared me to get one I went back.  Of course, my feet weren't in very good shape.  They did the pedicure while telling me over and over again to \"not wait so long to come back.\"  Well, I didn't have a choice and I needed help.  After that I went to a some other places for a pedicure, but then I made the mistake of stopping in here again.  The woman took one look at me, made me sit down because she was talking to someone else.  Then she said \"no polish, right?\"  I said yes and she said they couldn't serve me because I had waited too long to come back.  She was very rude, not in the least apologetic or helpful.  I asked her if she thought she had the only pedicure shop in the world.  Then she said OK, they would serve me.  I declined.  Why on earth would I want someone like that touching my feet?  I'll NEVER go back there.", "rating": "1", "date": [2016, 1, 22]}, "5": {"description": "Ok so this isnt going to be the most ultimate mani+pedi you have ever had....but hell... for $25 for BOTH, you cant beat that price w/ a stick!!Some of the girls there can be a little moody, but just be friendly and dont be ignorant and you'll be ok.they also do waxing and i THINK eyebrows are like $8 or something like that... and also massages.i always call ahead of time. they never write names down so i dont know how they know who is coming. just FYI they DO get busy after 5pm so be prepared to wait or be turned away if you dont call.but if your looking for an inexpensive Mani+Pedi for only $25, i say go here!WOO HOO for pretty feet and hands!", "rating": "4", "date": [2008, 6, 26]}, "6": {"description": "I love this place. Their open on Sundays and the crowd is non existent. My boyfriend had his feet done.... there was so much dead skin... they made his feet feel do soft. Anyone who can accomplish that is good in my book. Not to mention my feet were on POINT! they did a good job and the price was lovely.", "rating": "5", "date": [2011, 2, 4]}, "7": {"description": "HORRIBLE! I heard a lot of good things about this place from my coworker, and decided to give it a try. My mom and husband received pedicures, and my mom does not take care of her feet. Her feet were (sorry for your imagination) full of dead skin. The Chinese lady doing her feet actually ADVISED her to not get rid of the dead skin \"because they come back anyway.\" WTF??? Her feet DID NOT look any different before and after. I ended up coming home and personally smoothed out her feet. It only took 10 minutes! If you are disgusted by a person's foot just say so, don't LIE!", "rating": "1", "date": [2010, 1, 19]}, "0": {"description": "Well, the secret's out!  This is one of my favorite little hidden treasures.Mani + Pedi = $25.  I'm a firm believer that you get what you pay for, but in this case it's a good thing.  I \"heart\" this place, even though all the chicks in here are named Amy with the excception of the owner, her name is May.  HA!I agree, they can be a little moody but I just turn the pedicure chair on vibrate and close my eyes.They have a wide selection of polish, including my favorite OPI and they do offer massages, facials and eyebrow services.  I've never indulged in those.Call ahead b/c they can get busy.  I usually try to go early Saturday or early during the week in the evening.  You'll be in and out in less than an hour.", "rating": "4", "date": [2008, 10, 7]}, "4": {"description": "Had a wonderful man-pedi here great flower design on my toes...eyebrows I'm not super happy with so I won't make that mistake again. The chairs look outdated but get the relaxing job done. I enjoyed my $25 mani-pedi and will be returning but eyebrows never again. I'd totally recommend this spot for a great mani-pedi!", "rating": "4", "date": [2013, 9, 19]}}, "latitude": 41.8161729723215, "neighborhoods": ["New City", "Canaryville"], "categories": [["Nail Salons", "othersalons"]], "address": ["711 W 43rd Street"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.6437658816576, "category": "Beauty", "rating": "3.0", "price": "$", "number_of_reviews": "8"}, "big-rays-grill-chicago": {"comments": {"1": {"description": "My 2nd visit was also awesome & tasty. Brought a friend... Warned her it was a dive/diner (not surrounded by decor or anything). She wanted to eat there/stay. We did. IT WAS DELICIOUS!!! He was friendly & we enjoyed every bit. He has a warm spirit & an honest energy about him... I was very happy with the meal (GREAT PRICES BTW). P.S. No flies were n the window, at all.", "rating": "4", "date": [2015, 5, 31]}, "2": {"description": "Dive that is located just across the street from Fairplay. Aaron S. and i stopped in today for a quick bite before shopping, because shopping on an empty tummy is no fun. It's tiny inside, there was only one man manning the grill.  No AC either, which meant our stay was uncomfortably warm. It was also kinda busy, but we still didn't have to wait long, the grill man was very quite good at being a grill man. He was also pretty friendly, saying to us right after we walked in and handing us paper menus. They also don't bring your food to you, so just be advised that if you are not sitting at the counter you'll have to get up and get your meal. The place really has no ambiance or anything. Its in a simple room with simple signs on the wall and simple booths that are the kind that sit on the wall. Just a dive. The food is also served on plastic plates. The food was decent though. I very much enjoyed my gyro. It wasn't overly greasy, and the grill man actually put the meat on the grill for a few minutes which made some of the meat kinda crispy, which was a nice touch. The fries were also very good. Shoestring style. Aaron S. got the double cheese burger. Prices are quite cheap. Lunch only was eleven bucks for the two of us. Portions were small After leaving Aaron pointed out something kinda gross to me. On the window sill on the inside were tons of dead flies. Gross! So I'm guessing the place really could stand to be a bit cleaner.", "rating": "2", "date": [2009, 8, 16]}, "0": {"description": "My girlfriend often asks me how I'm still alive - usually referring to the kinds of things I eat and my lack of attention to cleanliness and the danger zone and other such things.  (That's why she's in the food service industry and I industrially consume food that is served to me.)The fact is that I often don't care about those things, as long as the food is good.  Which is not to say that flavor and taste can make up for unsanitary conditions - but it gets me pretty far down that road and somehow I'm not dead yet.  So my stomach gets a lot of practice fighting off things I've ingested.Speaking of which - we wound up at Big Ray's Grill today while out shopping at Fairplay.  If it weren't for the fact that the grill and kitchen area is in plain view of the patrons, I'd swear this place would be on one of those Shock Video specials about chefs doing gross things to your food.  The guy who served us and took our order and cooked the food seemed to me like one of those guys who puts on a very nice face because he relies on customers to stay in business, but would just as soon turn around and do something to your food if you pissed him off in any way.  \"Surly\" seems like an apt word to describe him.If you look around, the decorations in this diner are two flavors: pictures of the deceased owner, Big Ray, and menus and specials on pieces of paper.  None of which are located in the menu, so you should really leave the menu alone and just stare at the walls for a while until you find something that tickles your fancy.We went with the Double-Cheeseburger and Fries for me and she went with the Gyro Sandwich Special with fries and a large drink.(Some of the specials randomly have small drinks, medium drinks and large drinks.  I have no clue why some come with large and some with small, but I guess a deal's a deal, right?)I looked around while she sat at the table waiting for the food.  (That was a mistake on my part, and I'll explain later.)  Our food was plated up and he gave us salt/pepper and a squeeze-bottle of ketchup for the fries.  I honestly have to give this guy credit for the burger.  The bun was not only lightly grilled on the bottom to provide a small layer of grease/fat to prevent meat juice and condiments from making the bun soggy, but he also grilled the TOP of the bun, adding flavor and warmth and just a bit more grease.  Aside from a gigantic pickle slice that was taller than the meat and I ate separately, it was a rather excellent burger.  If it were increased in size by about 30% and each patty were more than 1/4-pound or so, it might even make my list of favorite burgers (that I need to make soon).  I also enjoyed the fries, except for the fact that he added pepper as well as salt.  I'm not a fan of pepper, and it wasn't really enough to noticeably taste it, but it threw me for a loop.  Aside from that, the fries were tasty and nicely-fried.  Well-done would have been a better option, but not something you ask for on the first visit.  Gotta get a feel for the place.Unfortunately, I doubt we'll be back again.  I was put off by the lack of proper temperature control.  It was already hot and muggy outside, and the atmosphere inside was exactly the same, plus the steam from the grill and such.  And of course, the \"solution\" that these no-temp-control locations employ is the \"leave the door wide open\" tactic.  Which creates a minor breeze at best and of course lets in the flies.  They thankfully stayed away from my food while we were eating, but I counted three live flies while we were there.Why did I count the \"live flies\"?  Because there were DEAD flies.  During my walk-around, I considered moving us to a table by the window with chairs instead of the benches, and that's when I saw the fly graveyard.  Just tens of large dead flies, belly-up and sitting on the ledge by the window right by the table where people eat their food.And yes, I SAW this and still ATE my food a few minutes later.  And I waited until AFTER she ate and we left the restaurant to take her back to the outside of the window so she could look in and see what I saw.And again, I'm torn.  The service was friendly (that we saw).  The food was tasty (worth coming back for).  But the cleanliness and atmosphere?  Atrocious.  As I told her as we were walking away - maybe I'd consider coming back in the winter.  I doubt he'd have much heat control, so a seat on the stools by the grill would be warm, and the door would be closed so there'd be no flies.(Oh, and I should mention they're cash only and there's no ATM inside.)So I enjoyed the food and there's a chance we'll be back someday when the conditions are better.  And frankly, our stomachs are only stronger for what we've been through.  After all, the only way our bodies can become strong enough to fight off bacteria and infections is to give it lots of practice.  And that's why I'm still alive.(And if I die soon, someone can please posthumously update my review.)", "rating": "3", "date": [2009, 8, 16]}}, "neighborhoods": ["New City", "Canaryville"], "latitude": 41.8091174215078, "longitude": -87.6454858481884, "rating": "3.0", "times": {"Mon": ["7:00 am", "7:00 pm"], "Thu": ["7:00 am", "7:00 pm"], "Sat": ["7:00 am", "7:00 pm"], "Wed": ["7:00 am", "7:00 pm"], "Tue": ["7:00 am", "7:00 pm"], "Sun": ["9:00 am", "3:00 pm"], "Fri": ["7:00 am", "7:00 pm"]}, "price": "$", "categories": [["Burgers", "burgers"]], "address": ["4653 S Halsted St"], "attributes": {"Take-out": "Yes", "Wheelchair Accessible": "Yes", "Accepts Credit Cards": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "Yes", "Drive-Thru": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "3"}, "del-sur-bar-and-grill-chicago": {"comments": {"3": {"description": "Excellent, we had the grilled shrimp with green mole and the ropa vieja with homemade corn tortillas, both dishes were delicious.  We'll definitely be back.", "rating": "5", "date": [2016, 1, 23]}, "1": {"description": "Delicious! Excellent service.  The food is amazing! I meet the chef and he's delightful. I wish he'd add mofongo to the menu. I will be back and I'll bring friends. Until the liquor license come BYOB!", "rating": "5", "date": [2015, 12, 23]}, "2": {"description": "Great neighborhood restaurant. Our server was good. The tamale appetizer and our salad was delicious. Fish tacos were w little dry:/  BYOB. Definitely looking forward to going back.", "rating": "4", "date": [2016, 1, 16]}, "0": {"description": "Do not let the location deter you!   This place is pretty awesome. From the moment we walked in, we were greeted with smiling faces that were happy to have us.  From the small appetizer compliments of the house, the impeccable service, and the fact that it is byob, we will definitely be regulars here. Word of advice... Have the porkchop!  Stunningly beautiful cut of meat cooked beautifully.", "rating": "5", "date": [2015, 11, 19]}, "4": {"description": "The food was above average but not stellar. The service was mediocre. The coffee was atrocious.", "rating": "3", "date": [2015, 12, 9]}}, "neighborhoods": ["New City", "Canaryville"], "latitude": 41.8108160016809, "longitude": -87.6451901346445, "rating": "4.5", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["10:00 am", "10:00 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["10:00 am", "10:00 pm"], "Fri": ["11:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Latin American", "latin"]], "address": ["4559 S. Halsted St."], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Good for Groups": "Yes", "Alcohol": "No", "Delivery": "No", "Good for Kids": "No", "Takes Reservations": "Yes"}, "category": "Restaurants", "number_of_reviews": "5"}, "chicago-game-and-gourmet-chicago": {"comments": {"1": {"description": "Foodie heaven for all the delightful parts of specialty fowl and wild things: fantastic products, great price and honest, thoughtful service. I bought a pound and a half foie gras for a special dinner for my guy and it was gorgeous, neatly packed in ice and handed over with a smile for a price that I couldn't come close to finding anywhere else, even online. Goose, I'm sorry your overfed liver tastes so good but if you were going to end up in this shop, you know yours is among the fairest and prettiest in this city.", "rating": "5", "date": [2013, 6, 24]}, "2": {"description": "Great prices and products. Chicago game is open to the public and the place to go to find any miscellaneous items you may need for a foodie get together. Black rice, green curry paste, caper berries, champagne vinegar, whole pheasants or European butter are just a few hard to find items that Chicago Game keeps in stock. If you give them a call and let them know what you need, they will buzz you in and hook you up. Ohh yea, and they specialize in game as the name would suggest. So they carry alligator, buffalo & rattlesnake. Enjoy!", "rating": "5", "date": [2008, 12, 4]}, "0": {"description": "What  a find!The best purveyor of duck and game in the city. Great prices and excellent service.   The product from CG&G was far superior to my past duck purchases at Paulina Market or whole foods.  The Rogie (french brand) duck was gorgeous!  The package of equally sized legs was beautifully butchered with skin intact and 1/3 the price of anywhere else in the city.  Call ahead.  The guys in the office are great and will take care of all your question on product.", "rating": "5", "date": [2012, 10, 30]}}, "neighborhoods": ["New City", "Canaryville"], "latitude": 41.81923, "longitude": -87.64369, "rating": "5.0", "times": {"Mon": ["6:00 am", "4:00 pm"], "Thu": ["6:00 am", "4:00 pm"], "Sat": [], "Wed": ["6:00 am", "4:00 pm"], "Tue": ["6:00 am", "4:00 pm"], "Sun": [], "Fri": ["6:00 am", "3:00 pm"]}, "price": "$$", "categories": [["Specialty Food", "gourmet"]], "address": ["700 West Root St"], "attributes": {"Parking": "Street", "Accepts Credit Cards": "No"}, "category": "Food", "number_of_reviews": "3"}, "nickys-in-n-out-chicago": {"comments": {"3": {"description": "Never again. Funny smell to the place. Scary area. Food expensive for the area.  I hope I don't get food poisoning", "rating": "1", "date": [2015, 5, 3]}, "1": {"description": "Second time coming here I ordered a gyro this time gonna c how this turns out but they open till late like at mid night which is fine for meTrying the corn beef today gyro was on point n they used red onions never seen that", "rating": "4", "date": [2015, 3, 23]}, "0": {"description": "Nicky's is my go-to spot. I've never had an issue with service or the quality of my food. The tacos are so good! The lemonade is super sweet lol, I saw someone mentioned diluting it. It really sucks people come on here giving low ratings for the price of the food or for the area. Go to McDonald's if you want cheap fast food! And there's nothing scary about the area, I would dig deeper into that comment, but I know what she was referencing ha smh. Anyway, you want good, Chicagostyle food, this is your spot!", "rating": "4", "date": [2015, 7, 26]}, "2": {"description": "So.... Tonight I had spoiled chicken wings. It's my fault though for not getting out of the car when my son bought chicken in the car smelling weird.... I called & told the employee & all she had to say was \"we haven't had any complaints\" the chicken was NOT fresh, it was old. Why waste gas going all the way back? Sadly that was my last trip there. By the way, the \"steak\" tacos are philly cheese steak meat (yuck)", "rating": "1", "date": [2015, 11, 30]}, "5": {"description": "On Aug 15 2014 I places a order through grubhub. 8 Piece Chicken TendersSmall Fries$ 10.78Gyro PlateGyro Sauce$ 10.74Canned SodaSprite$ 1.98Slice of CakeLemon$ 3.49Slice of CakeDouble Chocolate$ 3.49Chili Cheese Fries$ 2.89 The chicken and the chili cheese fries were pretty good. The gyro plate never comes with enough for two. I received two sliced half tomatoes for two sandwiches.  And you are charged for adding extra sauce, when it should come with enough for two when ordering a plate. They didn't have the double chocolate cake and agreed to them sending me the next chocolate cake they had, both it and the slice of lemon cake where horrible. My ten year old son didn't like the cakes and that there speaks volumes.Delivery time is longer than any other place I have ever order from. When you go there, there is a sign that warns of the wait time, because everything is made to order.Frying frozen chicken tender and cutting the gyro meet shouldn't take any longer than other places that serve the exact same stuff.I was also charged $6 dollars for delivery, I'm not even a mile away.", "rating": "2", "date": [2014, 8, 21]}, "6": {"description": "I didn't eat here but I got the steak hoagie special for my sister. She said it was terrible and from what I say it DID look gross. It was like a slab of \"beef\", like that patty used for the Mcrib... she said it was the worst thing she ever ate. My mom had the three piece wing special, she said it was alright. Three whole wings with fries and a piece of garlic bread for three dollars is a good deal so it's worth a try.", "rating": "2", "date": [2014, 3, 4]}, "7": {"description": "Hands down my favorite fast food place in the entire city of Chicago! From the tacos, burritos, burgers, hoagies, gyros, Italian beef and my favorite of allllll time the Philly Mix, you just can't go wrong! They have desserts too and you have to try the butter cookies. I would avoid the flavored lemonade though because I had to dilute it several times. :-/ The food can do NO wrong !", "rating": "5", "date": [2014, 1, 11]}, "8": {"description": "The food quality is low, the cost is high, the delivery time is long, and only the worst of the worst do not realize that charging a customer after the order is placed for requesting a type of sauce in their order comments (GrubHub) will lose them that customer for life.  Ignorance abounds when a company's management doesn't understand their customer acquisition cost vs. the cost of a small cup of ranch dressing.  Will not be shocked to see this establishment out of business in a few months just like all the other sub-par short order delivery places in this city.  Another restaurant to put on the list of places to never order from again.", "rating": "1", "date": [2013, 10, 20]}, "9": {"description": "(8/8/2013) The food was delivered fast, (before scheduled time), and was good. We had beef and chicken tacos and the chicken burrito, (huge), which were excellent! The driver was courteous and friendly. I will patronize Nicky's again!", "rating": "5", "date": [2013, 8, 11]}, "10": {"description": "There was a fly in my burger wrapper. A dead, dried up fly. I threw away the rest of the food I ordered from there, around $25 worth. I've eaten from street carts around the world, but never have I ever encountered a fly in my food.", "rating": "1", "date": [2013, 5, 11]}, "4": {"description": "Nicky's driver came to the wrong house after midnight. He rang my doorbell smoking a cigarette. When I told him he had the wrong house, he wanted to argue. I told him he woke me and owed me an apology. Instead, he told me \"fuck you\" as he left. When I called Nicky's to complain, there was no manager and no one would take responsibility. I was told delivery was through a 3rd party. If I ever thought of eating there, I just changed my mind.", "rating": "1", "date": [2015, 6, 23]}}, "latitude": 41.817009, "neighborhoods": ["New City", "Canaryville"], "categories": [["Fast Food", "hotdogs"]], "address": ["4240 S Wentworth Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Drive-Thru": "No", "Good for Kids": "Yes"}, "longitude": -87.6315002, "category": "Restaurants", "rating": "2.5", "price": "$", "number_of_reviews": "11"}, "celines-nail-salon-chicago": {"comments": {"12": {"description": "Awesome place!  Kay gave me a mani-pedi, and she did a fantastic job!  She is very sweet and kind.  The other ladies that worked there seemed very nice as well.  It was great to see that all the ladies socialized with their customers as they worked on them.The salon very busy, which was great, considering it has been open only since August.  I'm very happy that it's in my neighborhood!  It's a friendly, neighborhood establishment that kind of reminded me of \"Cheers;\" the workers knew most of their customers by first name as they walked in.  I definitely plan on going back to Celine's Nail Salon.  I really enjoyed my experience there!", "rating": "5", "date": [2012, 11, 17]}, "7": {"description": "I have been searching for a nail salon that only accepts reservations and maybe a few walk-ins close to my neighborhood and found this salon through Yelp. I read the reviews and immediately called to book an appointment. When I arrived I was told I canceled my appointment however I did not. The front desk employee insisted that I called earlier that day and canceled. I again said no I did not. However, they were able to complete my manicure and pedicure and I was overly pleased with the results and also the feedback Celine provided me regarding my gel overlay. The salon was clean and welcoming (no loud conversations that should not occur in front of strangers like many nail shops) and calming music. I have definitely made this my permanent nail salon.", "rating": "5", "date": [2015, 4, 4]}, "3": {"description": "This place was AWFUL! My daughter, friend and myself went here for mani-pedi's. My daughter is only 6 however this isn't her first rodeo. She's been getting mani pedi's for years. They were so very nasty to her. They could have said they didn't take kids, I would have respected that. They were rude overall, especially to her and our nails looked like crap! Never again! I'll stick to Inail across the street where hey at least treat you human.", "rating": "1", "date": [2015, 11, 23]}, "1": {"description": "Manicure didn't last a day. Service is meh. They aren't the friendliest group. Not the nastiest but nothing in their service made me want to try again.", "rating": "1", "date": [2016, 1, 27]}, "2": {"description": "Me and my fiancée have come here twice and we must say the services are wonderful. They do an excellent job on pedicures and manicures plus they actually converse with you (unlike some places where they only speak to each other). My fiancée loves the way they do her nails and it really doesn't matter which nail tech. you get, they all do a wonderful job!Parking is plentiful so you don't have to worry about that. Just make sure you bring cash as they charge a little higher for the card fees and such. Also, bring something to read or listen to if you aren't in the mood to converse. Out of all the places we have been to, this one has to be our favorite and I will gladly give my money to Celine and her team for the work they do. Excellent job ladies! Keep up the good work!", "rating": "5", "date": [2015, 7, 13]}, "9": {"description": "Most excellent salon with extraordinary service. Celine and staff are awesome, professional and I highly recommend them! There is also a 5% discount when you pay with cash. Can't wait to plan my birthday celebration with them!", "rating": "5", "date": [2014, 8, 2]}, "10": {"description": "I wish I could give this place a - star rating only because its my hidden gem and want to keep it that way! I LOVE the service every time I come in, only once was I turned down but it was a Saturday and last minute.  They finally got in great new no-Chip colors and love that they don't' make you feel like you are bothering if you change your mind or like me can't seem to decide on your colors.:)Although it is a bit of a drive for me, I rather do the drive then to go to these upscale salons in the west loop area which I don't feel welcomed or have my nails barely covered in nail polish.", "rating": "5", "date": [2014, 6, 24]}, "13": {"description": "Its my first time in here everyone was really friendly, love fact that Celine and her girls seem to know most of her costumers by first name, also the girl who did my non-chip mani did a great job...Such a friendly place, you can be sure ill be back, also happy because is not that exepensive and is on my neiborhood.", "rating": "5", "date": [2012, 11, 30]}, "16": {"description": "Very high-end salon for the south side. They take appointments only, so they take their time doing your mani-pedi. The price is reasonable, $35.00. Considering booking the salon for my birthday party. They are helpful and really do an awesome job.", "rating": "5", "date": [2013, 2, 13]}, "17": {"description": "My appointment that I made based on the reviews above at Celine's was today. I agree that the salon is very nice. My services were to be a mani/pedi ...the service was nice, but I felt rushed. I must say that I did not feel very comfortable and frankly welcomed at this salon.    Just the feeling I had.", "rating": "2", "date": [2013, 5, 12]}, "15": {"description": "Great Spa chairs for the pedicures!! Gives a great massage. Very affordable and Celene and Joanne are both wonderful.", "rating": "5", "date": [2012, 9, 29]}, "0": {"description": "Celine's nail salon does amazing no-chip manicures!!  My last one lasted 3 weeks with no chips or peeling. They offer a huge variety of colors. They are appointment only so there is never a wait and if you pay cash you get a discount!", "rating": "5", "date": [2015, 10, 16]}, "5": {"description": "Best nail salon I've found on the south side for natural nails. The place was clean, they had tons of natural polish, and the service was great. You need an appointment, but I can deal with that. The fingernail polish has stayed on for a full day, which is a feat. It's my \"in a pinch\" place.", "rating": "4", "date": [2015, 4, 29]}, "11": {"description": "I visited Celine's on a Saturday. I was buzzed in and walked towards the nail polishes. I wasn't greeted until about 5 minutes later. I sat down and waited for my appointment time since I arrived a bit early.  I was called by the technician and sat down in the pedicure chair which was very comfortable. The water was white. So I figured it was some sort of soap for my feet. The pedicure was great. But I noticed that a few minutes later the water was clear. I figured it drained out the soap or something. The only thing I didn't enjoy about the pedicure was that the technician's hands were very cold. Also the lotion she put on my feet was freezing! Not very comforting. I guess this was because the salon was cold to begin with..... During my pedicure another technician started cleaning the station next to me. I noticed she sprayed Scrubbing Bubbles on the bowl and then she sprayed it on the pumice and the other utensil she used to smooth my feet!! She then scrubbed them both with a nail brush. I don't think this is the proper way to clean utensils at all! This lead me to believe that the white water was left over Scrubbing Bubbles.  Then I was moved to the other side of the salon for my manicure, which was even colder!!! The manicure was great but I couldn't enjoy it since it was so cold. And then add on the technicians cold hands and cold lotion. I actually had to ask the technician to stop for a minute while I put my jacket back on. I also found it rude that she was speaking to another technician across the room in their language. I would understand if they are next to each other but not across the room...... Once she finished I went back to the other side to dry my nails. I was acknowledged upon leaving. Which was nice.  But two days later my nails had already chipped. I don't think I'll be going back. I really wanted to like this place since it was so close to home.", "rating": "2", "date": [2014, 1, 30]}, "8": {"description": "I LOVE Celine's!  Celine herself was my nail girl for 10 plus years and I have followed her from place to place and now at her own shop.  Everyone in her shop is friendly and attentive.  I have always had a stellar experience here.  It's true you often need an appointment to get in, but I used to frequent a shop in which the owner NEVER turned ANYONE away.  What that really meant is the techs NEVER got any breaks.  12 hour days with no breaks, sometimes 6 or 7 days a week = slave labor.  \"Appointments only\" means the techs actually might get to take a lunch break, or run and get their kids from school in between appointments.  If I have trouble getting in to see someone, it's my own fault for waiting to get an appointment.Cheating on your nail girl is the same as cheating on your hairstylist.  You're never happy when you go someplace else.  That's why I always go to Celine's!", "rating": "5", "date": [2014, 9, 17]}, "4": {"description": "This place reminds me of one of my ex bfs. At first glance, it looks nice and clean with has a lot of room for potential but once you get down to it, you leave disappointed with the whole experience. Day before leaving on a trip, I had to cheat on my reg nail place and get my nails done during lunchtime. I checked yelp and Celine's had the highest ratings. I called about an hour before and they said I *must* have an appt. I scheduled one for that upcoming hour, even though it felt pointless. I arrive and the space is huge. There's rooms going into another room that has another room. A lot of pink walls and really intricate ceiling decor. The room I was taken to had a scaffold that I prayed didn't fall on me and looked like it was still undergoing construction. The girl that helped me was nice and not chatty which is perfect when I'm feeling antisocial. Lighting was pretty horrible in this room. I understand wanting to keep the electric bill down, but these girls rely mostly on the natural light which isn't smart when chicago gets bipolar and cloudy. They have tiny lamps for them to work with but when I picked my nail color, it was dim and I picked what looked like a light red. She began removing the current no-chip and placed my hands in weird warm gloves. She said it was to speed up the removal but it didn't do jack. The girl had to scrape my nails like you scrape baked grease off a pan. She began the routine mani steps and I noticed there was 0 water for my hands to be placed in. I hate hate hate these \"dry\" manis. She ends up yanking and cutting hard skin and the results are kinda ugly. Once she painted the nails and asked to put my hands in the UV thingy, the UV apparatus was crusty with previous dried up polish or god knows what. The whole time I prayed I wasn't catching an illness and washed my hands asap. I later walked into my office (with bright lights) and realized I had a freakin' peach colored mani. Peach! I was short on time and couldn't go back to correct it but I looked pretty odd for a couple weeks with peach nails against my crazy pale hands. The price was cheap but you get what you pay for. Like that ex bf, this place will not be seeing me again.", "rating": "2", "date": [2014, 9, 12]}, "14": {"description": "First time customer so I always walk in judging a new place :)First thing I noticed was how clean the store and the utensils used were. I have gone to many Northside and Southside nail salons and one thing that stood out at Celine's was how friendly everyone was and that everyone spoke English which made explaining what I wanted easier which was a plus. I would say it was one of the best No-Chip French Manicure I have had in a long time. But more importantly the nail artist did an amazing job with my nail design! She was so quick and precise it was literally nail art! I was very impressed by her and would go again.", "rating": "5", "date": [2013, 4, 15]}, "6": {"description": "Worst customer service and you think. They would have better hours since there are many option when choosing to get a mani pedi!!! Never again they should put signs saying what time they take their last client not what time they supposedly close.", "rating": "1", "date": [2015, 4, 19]}}, "neighborhoods": ["New City", "Canaryville"], "latitude": 41.8162413686514, "longitude": -87.644697278738, "rating": "4.0", "times": {"Mon": ["10:00 am", "8:00 pm"], "Thu": ["10:00 am", "8:00 pm"], "Sat": ["10:00 am", "6:00 pm"], "Wed": ["10:00 am", "8:00 pm"], "Tue": ["10:00 am", "8:00 pm"], "Sun": ["10:00 am", "6:00 pm"], "Fri": ["10:00 am", "8:00 pm"]}, "price": "$$", "categories": [["Nail Salons", "othersalons"]], "address": ["736 W 43rd St"], "attributes": {"Parking": "Street", "By Appointment Only": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "18"}, "no-1-china-express-chicago": {"comments": {"28": {"description": "Wow, I have to say the I'm more than pleasantly surprised! Not going to lie: a Chinese place in a plaza near a gas station raised red flags; but I was desperate. I had an impromptu gathering at my house, knew I didn't have time to cook, so decided order food. China Express had good reviews and is close to home, so decided to give it a try. The staff was super friendly (and funny) & helped me decide/order the appropriate amount of food for my mini-party.  Moreover, the food was tasty, hot & fresh. I'd originally given the disclaimer to my friends, \"I haven't tried this place before;\" but at the first bite, they said it was delicious. No.1's now my only place for neighborhood Chinese!", "rating": "5", "date": [2011, 12, 9]}, "1": {"description": "This is my go-to place for chinese delivery in the Bridgeport area.Why? because the food is decent and it comes relatively quick.  My go-to is the Kung Pao chicken dinner, they have it loaded with the perfect amount of chicken.  sometimes chinese delivery places don't put enough and you're left eating a bunch of veggies, but not here.Also with the dinner you get fried race and your choice of an eggroll or crab ragoon.  You get a ton of food for the price and it always gets delivered hot.  I did try the hot & sour soup though and wasn't a big fan.For the price and the amount of food you get, you can't beat it for delivery.", "rating": "4", "date": [2014, 7, 1]}, "9": {"description": "I had the small curry*brown* tofu, nice assortment of veggies, large portion for a small, came with white rice. It was good. Four stars instead of three because I really enjoyed spring rolls, they were perfect. I will definitely eat here again.", "rating": "4", "date": [2013, 10, 2]}, "29": {"description": "Ordered tonight for the first time and was pleasantly surprised to find a yelp coupon for a $20.00 certificate for $10.00. Delivery was quick and driver was professional and courteous. We had Crab Rangoon, Spring Rolls, Veggie Egg Foo Yung, Shrimp Fried Rice  and Mongolian Chicken.  Everything was good. Not like omg its the best I ever had good, but it was good none the less. I will definitely be ordering from them again for my Hyde Park Chinese food delivery needs.", "rating": "4", "date": [2011, 12, 3]}, "23": {"description": "So I read the great reviews on this place and decided to order some beef teriyaki sticks, buffalo spicy wings, and the onion pepper steak.  I was going to pick it up the. I decided on delivery and the girl said he should be here in a few minutes. Now mind you I called for delivery AFTER the food was ready and when she said soon a few minutes it was almost 30 min later I called and then she tells me their regular delivery is about 45 min and I'm like wait; I talked to you 25 min ago and you said he should be here shortly. Okaaay. So I finally get the food it's hot so I'm happy . The wings were big and a lot good for the price BUT very very soggy . The beef teriyaki sticks looked like the sauce was dehydrated and burnt into the meat( looked like the strips dogs play with ) and tasted the same. I can say the onion pepper steak was good BUT the shrimp fried rice tasted old and there were like 3 and a half shrimp.  Sorry but the best place hands down on Chinese food for me above this place AND Chinatown is on roosevelt and wabash!", "rating": "2", "date": [2012, 7, 28]}, "5": {"description": "Did a call in for my lunch ..House fried rice cooked with light soy sauce.. its was yummy", "rating": "4", "date": [2013, 12, 6]}, "31": {"description": "This is my go to place to Chinese. FORGET China Kitchen OR Royal Kitchen. I only do delivery though.I find this food the quintessential style of Chinese American food. The Spring Rolls are crispy and delicious with a veggie mix. The lo mein are perfect in the preparation and the mongolian spicy chicken has the perfect spice mixture.This tastes low in sodium as well :-)Delivery min is $10 and the delivery fee is $2.50", "rating": "5", "date": [2011, 9, 8]}, "25": {"description": "The low mein wasn't low mein just fat noodles and the gravy was watered down. The orange chicken wasn't good. And everything was over priced.the shrimp fried rice was plain.never  ordering there again.", "rating": "1", "date": [2012, 5, 5]}, "12": {"description": "Ordered delivery from here off of GrubHub. Not a huge chinese fan but really had a craving for crab rangoon and fried shrimp w/ rice lol. So weird but I had to have it. I feel like those are the signatures that should never be messed up. I've had them messed up plenty of times. They were absolutely delicious here. I wish I was more open to the rest of the items so I could try them. Maybe eventually but this I'm happy with :)", "rating": "5", "date": [2013, 12, 7]}, "21": {"description": "Not bad - This review is for a delivery order.*Crab Rangoon - ok, nothing special*Mongolian beef - good*Sesame chicken - pretty good, all meat but I could have gone for a few vegetables, definitely a value (in the future, I will plan to add a bag of steamed broccoli to it)*Wonton soup - pretty tasty, but I have definitely had better, although it was very good considering the priceFor 'small' sizes, the portions were extremely generous.  We got so much food for $25 (including delivery fee and tip). There were three of us, and we still had leftovers. I brought the food home, and my brother thought the sesame chicken was awesome.  The sesame chicken with white rice was my favorite.", "rating": "3", "date": [2012, 10, 30]}, "16": {"description": "Not bad - This review is for a delivery order.*Crab Rangoon - ok, nothing special*Mongolian beef - good*Sesame chicken - pretty good, all meat but I could have gone for a few vegetables, definitely a value (in the future, I will plan to add a bag of steamed broccoli to it)*Wonton soup - pretty tasty, but I have definitely had better, although it was very good considering the priceFor 'small' sizes, the portions were extremely generous.  We got so much food for $25 (including delivery fee and tip). There were three of us, and we still had leftovers. I brought the food home, and my brother thought the sesame chicken was awesome.  The sesame chicken with white rice was my favorite.", "rating": "3", "date": [2012, 10, 30]}, "17": {"description": "Chop Suey had a \"tinny\" taste, Broccoli from Beef & broccoli was way too soft & soggy.  Crab Rangoon was also soggy.  Never ordering from here again.  Took 1 hour for delivery.", "rating": "1", "date": [2013, 2, 26]}, "10": {"description": "On point! The beef sticks/crab rangoon and fried rice are delicious", "rating": "5", "date": [2015, 4, 17]}, "11": {"description": "The food isn't good, but for the price you ignore it. Greasy, soggy, and salty about sums it up.However,the one star is for the horrid service. I placed an order, an hour later it had not arrived. When I called to see what was going on, my order had been canceled since I apparently was supposed to meet the delivery driver downstairs. Uh, -15 degrees? Me thinks, 'Heck no!' So, they won't get be getting my business, and I will save my arteries from complete blockage.And...I'm still waiting for the refund. :/", "rating": "1", "date": [2014, 1, 6]}, "26": {"description": "Menu items I've tried:- Crab Rangoons (pretty good)- Teriyaki Beef Sticks (pretty good, although a little chewy)- Chicken Wings (not good, mainly they are huge, scary looking)- WONTON SOUP (OUT OF THIS WORLD, DELICIOUS), it has chinese cabbage, delicious wontons(shrimp and pork) and shredded BBQ pork in a tasty clear broth, you have to try.- Veggie Egg Foo Young (wouldn't order again)- Mongolian Shrimp (delicious, great sauce, not enough shrimp)- Orange Chicken (not better than Panda Express)- Chow Fun w/ Beef (delicious, generous with the meat)So basically, I would purposely go to this restaurant for the wonton soup, to me it's better than most Chinatown restaurants'.", "rating": "4", "date": [2012, 3, 26]}, "27": {"description": "Found them on grubhub. Delivery took 50mins.The food was warm and good. The delivery driver would not come to my apartment door. \"It's not safe to come to the door\": Really? I didn't read that policy on the info page.Why does your company offer delivery service at night? Luckily, I always pay the tip in cash and he didn't receive one. If I'm paying $3 for delivery and I'm going to give you another $3 dollars as a tip, do you really expect me to walk down the stairs for my food? No!!", "rating": "4", "date": [2012, 2, 8]}, "0": {"description": "The food and servings aren't bad. So far we have had a good experience. I like they offer a discount code for the 1st order and one for orders after that!", "rating": "5", "date": [2016, 1, 20]}, "20": {"description": "Best Chicken wings in the Area.My favorite dish is  the Fried Tofu in Lobster Sauce.For dessert, you have to try the Mango Mousse Cake.", "rating": "5", "date": [2012, 12, 9]}, "19": {"description": "It's a no-fuss chinese take-out. As \"don't want to cook today\" places go, this one was certainly passable. Their wonton soup was far too salty and I love wonton soup. I had to toss it out and anyone that knows me, will attest to how big a deal that is.The dumplings were salty too, but considering there was hardly any filling in it, it didn't bother too much. I'd go back to them in a pinch because their food isn't as greasy as my regular, but I wouldn't recommend this place.", "rating": "2", "date": [2012, 10, 11]}, "2": {"description": "I have had no issues with this restaurant  until today. I called to order  my usual order. This time it took 10 min for the person to get my order correct (or so i thought). Then my order gets here and the delivery guy  rings my doorbell constantly as if he is playing with it which i found very rude and inappropriate. He comes up and i noticed something was missing from my order. He came to my door with an awful attitude. So i called the restaurant  and spoke with Angel (The manager supposedly) and i told her that he had an awful attitude and her response was \"Oh he's  just frustrated  because he has to train another driver\". When dealing with people and running a business, customer service is everything. Any attitudes are to be left at the door before interacting with a customer. So i felt that her response  was very inappropriate. She then says \" well he'll  be back with the remainder of your order.So here's where it gets worse.This gentleman texts me from his phone  to mine and left me a very disturbing text message. (YES I KEPT IT FOR PROOF). He literally texted me and not only made a mockery of the situation but called me a bitch. I call the restaurant  back and let Angel know and she seems very unbothered almost as if she doesn't  know how to handle the situation. I don't  think she understands the severity  of the issue and how far this can go. But i fault her for telling  him what i said and making it clear that it was me as he could have come back and did anything to me. I mean he went as far as sent me a nasty text message.She did not offer to credit my account for the missing part of my order or anything. But i will be calling the police to report him and i will be contacting the Better Business Bureau and reporting this business.I will never eat here again. I've  ordered here waaaay too many times to get something like this happen to me..", "rating": "1", "date": [2015, 7, 25]}, "32": {"description": "Fast delivery with only a $10 delivery minimum. Combo specials are a great deal which includes shrimp fried rice and an egg roll. General Tso and sesame chicken are tasty. The  chicken wings are inexpensive and include French fries, too.One thing I didn't like was that the styrofoam delivery containers are stapled shut. That means they're hard to rip open but also there's the risk of swallowing a staple.Nonetheless, the price is right and the food is delicious. I would definitely order from them again.", "rating": "5", "date": [2011, 2, 10]}, "18": {"description": "We had had decent experiences at this restaurant for a while. Finally a non-disgusting chinese delivery place. That changed a couple of months ago. We had three consecutive horrible experiences. Either the management has changed or the chef, but it's officially inedible.", "rating": "1", "date": [2014, 5, 22]}, "13": {"description": "Best Chicken wings in the Area.My favorite dish is  the Fried Tofu in Lobster Sauce.For dessert, you have to try the Mango Mousse Cake.", "rating": "5", "date": [2012, 12, 9]}, "4": {"description": "If I could give zero I would. We ordered from here and it took almost 2 hours to get to me, we live 9 minutes from the restaurant. When the food arrived it was cold- which could be over looked because that seemed to be the delivery service issue. First the veggie egg roll was soggy, tasteless and gross.. You know things are bad when fried dough isn't even enjoyable.I've eaten cardboard with more flavor than the  Mao pao tofu. It was inedible. The shrimp lo mein ordered with extra veggies seemed to be made with grocery store brand spaghetti, and what was included did not resemble \"extra\" anything.The veggie fried rice was the only thing in the meal that had any sort of taste and that's the best I can say about it.", "rating": "1", "date": [2015, 5, 17]}, "24": {"description": "We wanted cheap Chinese takeout, and thanks to the Yelp deal we found this gem.We got the orange chicken, general tso chicken, veggie fried rice, crab rangoons, egg drop soup and a complimentary slice of cake.Everything was great. I didn't like the soup but I usually don't like egg drop anyway. The orange chicken was fantastic and just what I was craving. I don't know if they did this in purpose or accident, but we ordered a small serving of most things but we received a large order. Thanks, guys! We got SO much food for the money, and now 24 hours later we are still eating it. The guys at the counter were nice and accommodating, and thanks to their service we will be making the trip from Logan Square to the south side just for them.", "rating": "5", "date": [2012, 5, 23]}, "6": {"description": "This was my first time ordering! I order through the yelp app.. Delivery was a bit long or maybe it just felt that way bc I was totally hungover! The fried rice was perfect for my situation ! Actually very good! O and the won ton soup is good as well! Nothing too fancy about this but hey it's just fried rice ! I will def order from this again!", "rating": "4", "date": [2014, 12, 21]}, "22": {"description": "It's a no-fuss chinese take-out. As \"don't want to cook today\" places go, this one was certainly passable. Their wonton soup was far too salty and I love wonton soup. I had to toss it out and anyone that knows me, will attest to how big a deal that is.The dumplings were salty too, but considering there was hardly any filling in it, it didn't bother too much. I'd go back to them in a pinch because their food isn't as greasy as my regular, but I wouldn't recommend this place.", "rating": "2", "date": [2012, 10, 11]}, "15": {"description": "We wanted cheap Chinese takeout, and thanks to the Yelp deal we found this gem.We got the orange chicken, general tso chicken, veggie fried rice, crab rangoons, egg drop soup and a complimentary slice of cake.Everything was great. I didn't like the soup but I usually don't like egg drop anyway. The orange chicken was fantastic and just what I was craving. I don't know if they did this in purpose or accident, but we ordered a small serving of most things but we received a large order. Thanks, guys! We got SO much food for the money, and now 24 hours later we are still eating it. The guys at the counter were nice and accommodating, and thanks to their service we will be making the trip from Logan Square to the south side just for them.", "rating": "5", "date": [2012, 5, 23]}, "7": {"description": "I did not like it!  Ordered via Eat24... Mongolian beef - Edible....The pineapple chicken was not good at all, the beef fried rice was sub par as the beef that was very light in color and looked boiled, the fried shrimp omg disgusting... first of all where's the shrimp?!  Secondly, it was so soggy with grease that i cannot even begin to describe the flavor as i've never tasted anything like it.  It was awful, the egg rolls I didn't even give a chance, over all 33 dollars down the train :(", "rating": "1", "date": [2015, 6, 19]}, "8": {"description": "The food was great! I ordered here and had it delivered. I ordered on a Thursday around 9:30 on GrubHub. I didn't realize that they close at 10 and felt bad afterward. I received my food at about 10:20ish. I was just glad they didn't call and cancel my order! Everything tasted super fresh too! The egg rolls were great, shrimp fried rice amazing, and egg foo young was delicious too! I will definitely order from you guys again.. Thank you :)", "rating": "5", "date": [2014, 11, 23]}, "30": {"description": "After searching for some decent Chinese delivery in Hyde Park, we took a chance after a deal on Yelp. It was decent. It wasn't the best Chinese food I've ever had, far from the worst though. The crab ragoon and spring rolls were very yummy. We both got seasame chicken and it was pretty good. They don't give you a lot of rice though- so if you're like me and want more than a tablespoon of rice, make sure to order some extra. The delivery driver didn't have change for a $20, which I felt bad about because that meant he didn't get a tip, since I paid with the Yelp deal I bought. He was very nice and gracious about it. As my roommate declared, \"I'd order from here again.\" Not overwhelmingly amazing, but that's a seal of approval in this apartment.", "rating": "4", "date": [2011, 11, 6]}, "3": {"description": "I ordered around 4:00pm and the expected time was 45-60 but the business texted and told me they were going to be late and will be here at 5:23. The delivery man came before that but when he came I noticed something was missing, my smoothie. I expected them to check the receipt and get the WHOLE order. So then I told the delivery man to run and bring it back, and he said 10 minutes. I ordered orange chicken. It's ok but doesn't have all of the flavor of orange chicken . Also most meals come with fried rice but my came with white rice.", "rating": "3", "date": [2015, 11, 1]}, "14": {"description": "Fast delivery! I had the dinner combo sesame chicken, which was about 7.50 and a very generous portion size.  The sesame sauce was good and tasty although the chicken could have been crunchier. It comes with a huge side of shrimp fried rice or you can substitute chicken, beef, or just plain white rice. Also had my choice of yet another side; I picked the crab Rangoon  (excellent!) but could have gone with an egg roll or pop among other options.     I ordered a coconut-lemon smoothie which was not only delicious it did wonders for my hangover:))  A really nice touch is the thermal bag it comes in to keep it cold-love that!! Wish more places did this.....it really is the little things!   I can't speak on dining in quite yet, but it's tasty food and a good value:)", "rating": "3", "date": [2013, 10, 23]}}, "neighborhoods": ["New City", "Canaryville"], "latitude": 41.8169321, "longitude": -87.6313449, "rating": "3.5", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "10:00 pm"], "Sat": ["12:00 pm", "11:00 pm"], "Wed": ["11:00 am", "10:00 pm"], "Tue": ["11:00 am", "10:00 pm"], "Sun": ["12:00 pm", "9:00 pm"], "Fri": ["11:00 am", "11:00 pm"]}, "price": "$", "categories": [["Chinese", "chinese"], ["Chicken Wings", "chicken_wings"]], "address": ["4248 S Wentworth Ave"], "attributes": {"Has TV": "No", "Parking": "Street, Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Dogs Allowed": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "33"}, "pizza-nova-chicago-3": {"comments": {"28": {"description": "Pizza Nova is a staple in the Canaryville neighborhood. No matter what time of day or night you pass this place there will always be tons of kids with less than a promising future hanging out, people with a very limited budget, as well as police having dinner.The menu is limited, greasy, unhealthy, and not very good. You can get 2 hot dogs, fries, and a Pepsi for under $2.00. The pizza by the slice is available at $1.00 so they actually limit how many slices you can buy. I guess they are worried about a family of 10 coming in and feeding their whole family on slices. The service is ok, no wait staff just a counter where you can place your order. Nothing notable or difficult about ordering slices and dogs. The staff is mostly comprised of Hispanic people in red shirts. Washing your hands before you eat is not necessary as this place lacks the level of cleanliness you would expect from a food service establishment. Forget about using the bathroom unless you want to boot up, snort something, do a drug deal, hide a dead body, or roll a blunt. They do deliver until about 3:00am. If you are hanging out in Canaryville for the night you will notice the delivery cars racing around the streets as this place is actually very popular. Everyone in the neighborhood orders here.This place is not worth a special trip but if you do happen to be in the hood....never mind, do not go here. Your heart and waistline with thank you later on in life.----------------------------------------------------------------------------------------------I'm not going to comment too much on Canaryville as that would take a whole different review but it certainly deserves a small note. Every time I visit for either business or pleasure I am completely intrigued. One thing to comment on is that this part of the world is comprised of mostly white, Irish, White Sox loving born and bred Chicagoans. This is where real \"salt of the earth\" people live. You can actually see hard life on the faces of the people, even children and read them like a book. What is strange is that people that grow up in Canaryville seldom ever leave or move away. When you speak to a resident more times than not they will put down or degrade their own neighborhood, but on the other hand will fist fight or do murder to protect a strange feeling of pride they have. There are gangs here and although they remain in the shadows you may from time to time encounter tactical police officers performing a shakedown on a group of men all around a beat up car. Police scanners are very common place in homes and everyone knows everything about everybody. They do not like outsiders but will tolerate them. This includes black, Hispanic, even me as I am an Italian/English, east coast talking stranger. Driving around this part of the city you will certainly be noticed and accounted for. Kind of makes you feel as if you are a desperado walking down the main street of an old western town. \"These streets ain't big enough for the both of us\".", "rating": "2", "date": [2007, 12, 8]}, "1": {"description": "RUDE.RUDE.RUDE.This one star is not about the food it's about the low level of customer service. I wish I could've rated the food but they wouldn't give it to me AFTER being charged.  After calling Maurice the so-called \"manager\" he wouldn't even let me get a word out before cutting me off several times while THE CUSTOMER is expressing concern.We never got a refund, food or service! I wish I read the reviews 1st.  Whomever owns this place should seriously consider the people they hire.", "rating": "1", "date": [2016, 2, 2]}, "9": {"description": "Had to drop a star to post, Place is a dump! And the workers are uneducated dirty rude b******! Everything here is nasty place used to be good when they first opened and when it was Tagliers ? (Don't think I spelt that right) but since then it's went to sh*t! Horrible Service, I suggest save yourself the disappointment!", "rating": "1", "date": [2015, 3, 22]}, "23": {"description": "Good for an emergencyThe staff are very friendly. The pizza is so cheap but it doesn't taste good. The chicken is interesting because it is boiled & baked..can be tasty, but the combo is very unhealthy..no vegetables with it. The gyro was tasty, but got me sick afterwards.  I would still go if there was nothing opened and was very hungry because the people are so nice there.", "rating": "2", "date": [2010, 5, 22]}, "5": {"description": "Awesome gyros! Cheap tasty fast food. Pizza is the bomb! Love going here on a quicky!", "rating": "3", "date": [2015, 5, 15]}, "25": {"description": "Um, Gross.I moved here from Boston, so I guess it could be that I'm not used to Chicago pizza... but deep dish? It tasted like a cracker with too much sauce and a bit of cheese. Literally, maybe the worst pizza I've ever had. It was cheap (13$ for a medium), including delivery, so I got what I paid for, but NEVER again.Having said that, I didn't order anything other than the pizza, so maybe if I had ventured more into the menu, I would have been more pleased. But I'm not taking the risk.", "rating": "1", "date": [2009, 6, 14]}, "12": {"description": "Rude!", "rating": "1", "date": [2015, 5, 14]}, "21": {"description": "Deep dish pizza slices are $1.25 each. Their other food is also really really inexpensive. It's obviously not fantastic pizza but, considering I can eat very well there for 5 bucks, I leave happy.", "rating": "4", "date": [2010, 7, 23]}, "16": {"description": "Pizza nova still sucks.  Nasty dirty filled with gangbangers. Why would anyone eat here??", "rating": "1", "date": [2013, 6, 29]}, "17": {"description": "I ordered the gyro deluxe and it was not good.  The fries here are either baked or nuked resulting in a pasty mush in your mouth and it was not appetizing.  The pizza it self is on par with any other greasy pizza joint.", "rating": "2", "date": [2012, 5, 21]}, "10": {"description": "I am comparing this deep dish pizza to the only other I've eaten in Chicago and acclaimed to be the best, Giodarno's.The 10\" deep dish pepperoni from Pizza Nova was a nice change from Giodarno's. I loved and enjoyed it. Sometimes I am overwhelmed by the tomato sauce of Gio's and it can be extremely oily, but Pizza Nova's was great. The crust was extremely thick and chewy. There was a plethora of thick and gooey cheese. The amount of sauce was JUST right. The delivery was on-time; making the pizza the perfect temperature to consume. In all, it's a toss-up from Gio's. It just depends on what style of pizza you want to eat: more tomato sauce and definitely more oily or with Pizza Nova a more chewy and cleaner/lighter pizza. I am hooked. I will give them another go just to make sure they were not a one hit wonder.", "rating": "5", "date": [2013, 6, 10]}, "11": {"description": "Food was ready when I arrived, quick to order over the phone. Yet I prefer deep dish pizza and if not a quick pizza from a chain will do for me. Although the customer service was good.", "rating": "3", "date": [2015, 1, 30]}, "26": {"description": "Ick. the only thing keeping this place in business is the 8-16yr olds and the Chicago Police Dept. granted, it IS cheap...but its still nasty.if you want pizza in Canaryville area, order from Phils.", "rating": "1", "date": [2008, 6, 26]}, "27": {"description": "Hmm...I guess I should have read some of these reviews before ordering some 'za from this joint. The delivery was prompt, even though the guy had to call me because he couldn't find where I lived. The pizza was pretty ordinary, nothing to write home about, but not terrible either. I got it fast, cheap and with a free RC. I wasn't expecting anything gourmet. That's pretty much what I got.", "rating": "3", "date": [2008, 5, 4]}, "0": {"description": "Really cheap and pretty tasty, but it seems as if at least one of the staff is also insufferably rude. He was not too terrible to me, but he was dealing with an unruly and disgruntled potential customer on the phone and I heard him use a very demeaning tone and ultimately insult the customer's (likely sarcastic) interest in just ordering from some other restaurant. He said \"Well, you pay for quality. They get all their stuff in frozen and ours is fresh.\" He then hung up and was obviously very huffy in attending to my grungy hipster lookin self. I am used to it because I look kind of poor, but this guy should be used to it with the location of his workplace. This isn't Lincoln Park! I don't really know how much ground he has to stand on defending the quality of this food either. It was alright. I had a piece of deep dish sausage pizza and a slice of regular crust pepperoni. The pepperoni was a little greasy, as was to be expected. The deep dish seemed on par with some of the more upscale eateries that I've paid much more than $1.50 a slice for. This place is just around the corner from my home so I will likely return with an updated review.", "rating": "3", "date": [2015, 5, 9]}, "20": {"description": "On a cold winter night. I wanted some pizza. I head toward Pizza nova in Canaryville.  Its a classic delivery pizza. Its not expensive, easy to find parking theres a liquor store across the street and you are in and out in a few minutes. The staff is nice. I like this place because that seems like all they make here is pizza so your guarenteed its hot and fresh.  It will sooth a pizza craving if you live on the south side.", "rating": "4", "date": [2011, 1, 23]}, "19": {"description": "Good for an emergencyThe staff are very friendly. The pizza is so cheap but it doesn't taste good. The chicken is interesting because it is boiled & baked..can be tasty, but the combo is very unhealthy..no vegetables with it. The gyro was tasty, but got me sick afterwards.  I would still go if there was nothing opened and was very hungry because the people are so nice there.", "rating": "2", "date": [2010, 5, 22]}, "2": {"description": "Decently priced food! Food taste great too, try the chili cheese fries are the way to go. They are good to the police too! There don't seem to be as many good places on the south side for pizza like there is on the North side but whenever works brings you here..Very polite and courteous. Will go here again on my next cheat day!", "rating": "5", "date": [2015, 7, 30]}, "18": {"description": "go to the \"search for\" data entry field in your yelp webpage header and enter \"pizza\" then go to \"near\" and enter \"canaryville, chicago, il\"click \"search\"3 pizza places pop up. 1 of which i am not even sure really exists. Pizza Nova, according to Google Maps and confirmed by me, is 0.1 miles from my front doorstep and takes 54 seconds to get there by car or 2 minutes to walk, slightly less if i go out the back door.... and i get there in about 1 minute if i jaywalk and cross the street regardless if the light is green and crosswalk clear... they'd even deliver it to me even though i haven't breached that level of lethargy just yet... jussssstttt yeeeettttttt....and their menu is loaded with items including bbq chicken and ribs, broasted chicken, seafood, pasta, italian and american sandwiches (apparently a huge difference here.... and a hot dog and gyro are considered an american sandwiches), burgers, PIZZA, PIZZA PUFFS, and gravy bread?and last but not least, their MILKSHAKES.... the infamous milkshakes i have mentioned in Yelp Talk... that my boy brings back from the yard... i like these milkshakes better than roses... nothing else says \"baby i love you\" better than theseso i cannot testify to very much of this menu aside from the pizza by the slice (thin and pan), burger, grilled chicken sandwich, fries, and the glorious MILKSHAKES (strawberry and chocolate WINNERS). YES - to the grilled chicken, pizza, and milkshakes... SURE - to the rest but dont come with elitist expectations. for the chicken and burger they made it fresh... it wasn't sitting around under a heater all day so we had to wait a few mins for it to be ready. there's not much competition here and the restaurants in my neighborhood are pretty scattered ways a part. there's either alotta home cooking or the PIZZA NOVA alternative. and i know neighbors that go here thrice a week. they'll miss church but not their pizza nova outings.but the deals are pretty hard to beat: this month about $20 for two 14\"-inch thin crust pizzas one topping each and a 2-liter of pop... along with other eye-catching combo deals... 99% of the time we get a pizza by the slice for about $1.50... and a milkshake... only tip to remember is bring cash or you will have to by $10 worth of grub to charge...so yes if you are in this hood and starvin marvin stop here... i wouldnt go as far to say travel beyond your neck of the woods for it... but for whatever sparce reason you find to come to canaryville, come here and then bring me a milkshake... im only a yard away", "rating": "4", "date": [2012, 1, 12]}, "13": {"description": "I haven't ever been in here, but their delivery service is awesome.A few weeks ago, one of my students brought some of Pizza Nova's coupons to my attention: $13 for an extra large, one-topping pizza and a two-liter of pop, tax included.  I have 19 hungry high school students in my advisory who could totally get down with some $13 pizza and pop, so we decided to have a lunch time pizza party.For $65, we got five ENORMOUS pizzas and five two-liters of pop.  The restaurant was really great with our order (including my topping changes at least three times) and my specific pop requests.  They also let me pay in cash even though the order was big, which was nice.I was able to schedule delivery three hours in advance and our delivery guy was prompt.  He arrived, pizza and money were exchanged, and we were on our way to eating some pretty decent pizza.We all thought that $13 was too good to be true for pizza prices, but the pie wasn't that bad.  We all agreed the pizza was good and we've had much worse (especially at the school).  This pizza joint is great for groups and it's just what my students and I needed right before winter break.  We may make this a standing monthly party because we liked the pizza and the camaraderie so much.", "rating": "5", "date": [2011, 12, 29]}, "4": {"description": "Great price point, fast service and this very good food. The specials haven't done me wrong yet so I look forward to trying more of their menu.", "rating": "5", "date": [2015, 7, 13]}, "24": {"description": "When I first tried Pizza Nova I was shocked at how quickly they got a great pizza to my door. They always quote a 30-45 minute wait but they RARELY have me waiting past 30 minutes. I've gotten numerous pizzas with different toppings and they've all been excellent. This is a great neighborhood pizza joint with great pizza and great service. Give them a try, I think you'll enjoy them.", "rating": "5", "date": [2010, 2, 21]}, "6": {"description": "My boyfriend and I use to order pizza here but one day we order a pizza and went home. While we was eating I notice a slice  pizza my boyfriend was about to eat had a piece of blonde hair in it. It was hair throughout the  whole pizza. When we went to the restaurant the lady behind the counter said maybe it was my hair. First, my hair is black n not blonde they were extremely rude. We ask for a refund and they gave us our money back. They was just so rude about it. We will never ever go back there again.", "rating": "1", "date": [2015, 1, 17]}, "22": {"description": "Very cheap yet bad pizza.", "rating": "1", "date": [2010, 6, 3]}, "15": {"description": "Pizza nova did it again! Got a large icee for $1.99 and it wasn't even icy... Served it when it wasn't ready on a hot summer day. Haha! Call for disappointment...", "rating": "1", "date": [2012, 6, 12]}, "7": {"description": "Me and my friend ordered from this place and it was not as good as it smelled. The ribs was obviously not 1lbs it was a small amount. Secondly the fries was cold and nasty sauce was needed to fix this major mistake. Then the bread they provided us with was good but the hardest thing I have ever put my teeth into. I usually get a regular meal of pizza puff and mozzarella sticks ( I did have the mozzarella sticks and it was good ) but I advise you stick to the basics. Not seafood, soul food, nor the ribs.", "rating": "2", "date": [2014, 11, 24]}, "8": {"description": "Pizza was good, didn't like the rib tips and the broasted chicken didn't have a lot of meat on the bones", "rating": "2", "date": [2013, 1, 23]}, "3": {"description": "$7 for 3 slices and a large fries. Hot, tasty & ready right away. Can't complain!! People need to stop bitching about pizza that they're paying $1.50 a slice for, seriously.", "rating": "5", "date": [2014, 2, 27]}, "14": {"description": "I've had this menu in our drawer for over a year now, and on an evening when two other Pizzaria's were out of delivery range, I gave them a shot. I opted against the pizza because I hate wasting my money. I tried a few sandwiches for me and my family, a couple of Italian Beef's and a Gyros. According to my wife and son, the Italian beef's were good. The presentation was incredible, and the delivery was precise. As for my Gyros, on a scale from 1-10, it was a 7, but like another reviewer, I felt sick afterwards. Overall, not a bad choice, and great prices. Whoever answers the phones at that place is worthy of a well whooped a@$, maybe a little customer service training is in order.", "rating": "3", "date": [2014, 1, 12]}}, "neighborhoods": ["New City", "Canaryville"], "latitude": 41.81652, "longitude": -87.64068, "rating": "2.5", "times": {"Mon": ["9:00 am", "11:00 am"], "Thu": ["9:00 am", "11:00 am"], "Sat": ["9:00 am", "12:00 am"], "Wed": ["9:00 am", "11:00 am"], "Tue": ["9:00 am", "11:00 am"], "Sun": ["12:00 pm", "9:00 pm"], "Fri": ["9:00 am", "12:00 pm"]}, "price": "$", "categories": [["Pizza", "pizza"]], "address": ["558 W 43rd St"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Late Night"}, "category": "Restaurants", "number_of_reviews": "29"}, "kellys-tavern-chicago": {"comments": {"0": {"description": "For a tap so landlocked, the \"sailors\" sure are salty here.  By sailors, I mean, testosteroneous men in sweatshirts navigating their way through seas of cheap beer, and the women who tolerate them. The F word flies like seagulls across the sea (directed harmlessly, only at the television), and then \"HTFITP! HTFITP!\" one guy shouts at a television screen. \"Hit the f%*!$^ in the p%##&,\" he explains. Got it. This bright, fluorescent-lit place has a somewhat southern feel- Skynyrd on the juke, Louisville football on the tube, bartender with a Duke shirt. Goose Island Green Line, *two* kinds of Budweiser Shock Top on tap, and lots of cheap bottles. No pretensions of being anything other than a bar.", "rating": "3", "date": [2014, 10, 31]}}, "neighborhoods": ["New City", "Canaryville"], "latitude": 41.8142509460449, "longitude": -87.6404571533203, "rating": "3.0", "times": {"Mon": ["11:00 pm", "2:00 am"], "Thu": ["11:00 pm", "2:00 am"], "Sat": ["11:00 pm", "3:00 am"], "Wed": ["11:00 pm", "2:00 am"], "Tue": ["11:00 pm", "2:00 am"], "Sun": ["11:00 pm", "2:00 am"], "Fri": ["11:00 pm", "2:00 am"]}, "price": "$", "categories": [["Pubs", "pubs"], ["Dive Bars", "divebars"]], "address": ["4403 S Wallace St"], "attributes": {"Parking": "Street", "Has TV": "Yes", "Accepts Credit Cards": "No", "Happy Hour": "Yes", "Outdoor Seating": "Yes", "Alcohol": "Full Bar", "Accepts Bitcoin": "No", "Wheelchair Accessible": "No", "Smoking": "Outdoor Area/ Patio Only", "Bike Parking": "No", "Good For Dancing": "Yes", "Dogs Allowed": "No", "Good for Groups": "Yes", "Coat Check": "No"}, "category": "Bars", "number_of_reviews": "1"}, "city-sports-chicago-2": {"comments": {"0": {"description": "This store is awesome. I was hooked the first time I came last Saturday. The clothes there are mostly to wear to the club, but anyone can find what they want eventually. I bought this cute white short-sleeved blouse that I am going to wear with some capris. The male worker there was very nice. He helped bring down some tops that was hard to reach, and gave great assistance when it was needed. No one there did not hound us, like some of these urban stores are know to do. The only thing was the racks were too close together, leaving too little space in the aisles to move through. It was sort of congested, and I constantly had to keep saying to people, \"Excuse me, please.\" That was annoying, but overall I would definitely go back again.", "rating": "4", "date": [2009, 5, 6]}}, "latitude": 41.8090852349997, "neighborhoods": ["New City", "Canaryville"], "categories": [["Shoe Stores", "shoes"]], "address": ["4666 S Halsted St"], "attributes": {"Wheelchair Accessible": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.6456058770418, "category": "Fashion", "rating": "4.0", "price": "$$", "number_of_reviews": "1"}, "kevins-hamburger-heaven-chicago": {"comments": {"28": {"description": "Up until I ate at Lou Mitchell's, this place served up the best breakfast I had eaten in Chicago. So Kevin's and Lou's are the upper echelon and everyone else is a class below. That's quite an honor to be bestowed upon such a greasy spoon.When you come here for breakfast, do yourself a favor and come hungry or you'll just end up wasting a feast fit for a king. I ordered pancakes and eggs and when the order was served, it came on two plates. The pancakes occupied one plate completely and the eggs and potatoes the other. Oh yeah, this place is DIRT CHEAP! If you've yet to eat here, do so immediately.", "rating": "5", "date": [2007, 2, 22]}, "1": {"description": "Pros : ample parking , security on weekends , Food : had chili cheese fries which comes with lettuce tomatoes Steak tocos , break food pancakes grits and ham  all the food was excellent They have placed bullet prof glass up know to protect the employees ( umm ok) I will go back really enjoyed myself !", "rating": "4", "date": [2015, 10, 11]}, "9": {"description": "This is a Bridgeport establishment not a Canaryville restaurant.  You have to go to the other side of Pershing to be in Canaryville, so that is an inaccuracy on yelp's part.  Anyway, this is no place to go nuts about but it is quite good fast food,  The burgers are pretty tasty and I was able to eat two of them.  I liked the fries, they so reminded me of Mcdonald's fries.  I had the chicken noodle soup but it was not good and left an aftertaste I did not like, like I just licked rust.  Come here for the burgers and fries and the friendly service, and this place is 24 hours a day.", "rating": "4", "date": [2014, 4, 28]}, "29": {"description": "You want greasy spoon, here you go.  Artery clogging burgers, greasy fries, and some of the best chili can be gotten right here. Also they have some pretty good breakfast sandwiches.  If you are dining in, I warn you that the atmosphere is not conducive to healthy dining.  You can actually smell the grease in the air.  But for take out, the short order service is very fast.", "rating": "3", "date": [2006, 4, 20]}, "23": {"description": "\"That's weird that the two egg special is $2.60 on the weekend and $1.30 on weeknights. Oh well\"Then we finished our plates and the waitress brought us two more.  We slapped five and couldn't finish the grits.Burgers are good as mentioned before.  Now I would easily rate this Kevin's higher, but I, on two separate occasions, smashed roaches scurrying across the damn counter.  Clearly I didn't learn my lesson with the first roach, but it would be criminal to withhold this information from you, the yelp review reader.", "rating": "2", "date": [2008, 7, 8]}, "5": {"description": "The place is a dump. I mean I asked to use the bathroom and when I walked in the toilet was over flowed, water was everywhere. I told the waitress and she says oh I forgot to do that a couple hours ago I'm sorry. I'm like so it's shit water on the floor-I had on sandals- and you haven't cleaned it up for two hours? Wtf! The food is ok I'd rather go to steak and egger! The quality of the food was tragic I ordered a meat lovers omelet and it wasn't seasoned nor did it have any omelet like texture it was like a loaf lol! One waitress was staring at me like I was going to rob the place I'm like wtf is going on in the universe right now. I will never go back to Kevin's hillbilly heaven.", "rating": "2", "date": [2015, 9, 15]}, "25": {"description": "There are 2 places in Chicagoland to eat great one of a kind burgers like these. Harlo's Grill on North ave, Melrose park and this gem!!", "rating": "5", "date": [2008, 3, 17]}, "12": {"description": "This place is boss. Open all the time with food that doesn't take long at all especially if you call in your order ahead. It does get wild around there in the late night, but come on this is Chicago not the suburbs. If you see it in Chicago and it scares you, you haven't been here long. The burgers and T-bones are great and are on special almost everyday starting around 5am til 9am. Place sometimes has security so stop being lame and eat some quick food.", "rating": "4", "date": [2013, 11, 19]}, "21": {"description": "How can you beat a complete breakfast for $2.00? You can't. Eggs, toast and hashbrowns for just $2. The patrons are a mix of everything and the staff is what you expect when you hear \"Truck stop\". The food is decent, very cheap but the place itself is a bit dirty.", "rating": "3", "date": [2008, 10, 15]}, "16": {"description": "What this place lacks in decor or perceived cleanliness, it more than makes up for in having one of the best burgers in Chicago. The burger is real ground beef (not a frozen patty), and is perfectly formed.", "rating": "5", "date": [2011, 5, 14]}, "17": {"description": "I've lived in Bridgeport for a while now, but had never ventured into Kevin's. Not because I'm afraid of a dive. Hell, I live for dives. I just lived a bit further away. As of exactly 32 days ago, I moved into a new place. It just happens to be a block and a half away from Kevin's. In that time span - I've had several cheeseburgers and two breakfasts. Both options are delicious. My only qualm is that a burger, fries, and a pop run just under $10. I don't mind spending $10 on a good meal, but with the potential risk involved (this joint is pretty dingy), I'm a little crabby about it. I've never had anything less than super friendly service, despite what the other reviews say. I even got told that I had \"star quality\" once. Granted, that dude was pretty hammered, but you know what they say - A drunk never lies.  :)", "rating": "4", "date": [2012, 3, 19]}, "10": {"description": "I had an ok time at this little place, good breakfast food with pancakes. Need to get back soon. Seating is bar style along the register. If you're willing to wait, seats become available. Thoroughly enjoyed the different stories I listened to.", "rating": "4", "date": [2014, 10, 4]}, "11": {"description": "Ummmmm hmmmm.... lets see here waitress no Gloves  ... cook no Gloves ... strange men coming from the restroom or their back room with rubber gardening gloves getting ice for a fountain drink (dirty gloves)  ... All the alley profane language you can stomach at wee hours of the A.M. ! ... A fold over to go full of grease and a high bill of $14 for a Egg & cheese  toast with a side of Bacon?  You do the Drop Dead Fred MATH o_O!", "rating": "2", "date": [2014, 5, 6]}, "26": {"description": "Something about a good greasy diner. There aren't too many of these types left. But come on in after a sox game and you'll see a staff that works a grill quickly and you can have breakfast/lunch/diner 24 hours a day!The burgers are awesome as it's a rarity to find a hand patted burger. It may cost a little more then a whopper or a big mac. But hey...do you want a frozen with sub-par ingredients. OR DO YOU WANT A FRESH MEAT BURGER!!! Come on in....and dig in!", "rating": "4", "date": [2007, 6, 7]}, "27": {"description": "This is a strange \"four star\"er for me. This place is an old school truck stop, right here in Chicago. They have $5.99 T-bone steaks to prove it too. Not that I would recommenda $5.99 T-bone to anyone. Nope the only thing I recommend is the burger. Quite possibly the best \"old school\" burger in the whole city. And by old school I mean fatty (as opposed to lean) ground beef fried on a griddle rather than charred on a grill, piles of mayo, american cheese and wonder bread buns. These are the burgers our parents ate at roller skate drive ins. These are the burgers that our grandparents fought the Nazi's in order to defend. Cause if you've ever had a German burger, it ain't nothin' like this....However, this place really is a 24-hour truck stop, and even in broad daylight there are some rough and tough clientele there. I'm also told that there is an armed security guard there at night. So if you want to try the burger that your grandfather fought for, be prepared to fight for it yourself. And stay away from the T-bone....", "rating": "4", "date": [2007, 3, 20]}, "0": {"description": "Kevin is my only go to spot for breakfast. When I first started going here, the waitresses would have me dying of laughter from their sassiness and sarcasm. Kind of ended or rather subsided. But these ladies are REAL Chicagoans. Now, I go because they make a KICK A$$$ breakfast.", "rating": "5", "date": [2015, 11, 4]}, "20": {"description": "Love love love their steak, egg, and pancake breakfast!! My boyfriend introduced me to this crappy looking dive 2 years ago and we dont go there often but when we decide to its a big treat! I've only had the food I mentioned above and I dont think I NEED to try anything else just to tell you that I love their food. The steak is super tender, well seasoned, and they give you loads of A-1 sauce to dress it. The pancakes are fluffy and delicious, and the eggs are lovely.Overall...I wouldnt be seen in this joint for long periods of time (ate there once and decided that carry-out was my best bet) but man...just try their steak & eggs breakfast. Keep the car running...LOL.", "rating": "5", "date": [2009, 2, 8]}, "19": {"description": "What a joke this place was. I ordered a simple ham and cheese sandwich. Not only did it take 10 minutes, it also didn't have cheese on it. It was very expensive for the location, and the menu didn't have prices on it.", "rating": "1", "date": [2012, 6, 13]}, "2": {"description": "I live practically within spitting distance of this old truck stop diner, and it definitely has its good and bad moments. During the day, Kevin's is a nice place to grab breakfast and coffee. The staff is generally nice and knows the area well. At night, this place is a hell hole. All orders have to be pre-paid from 9 PM to 5 AM, and they had to install bulletproof glass and a revolving window around the diner counter recently because of the horrible patrons at night. Every weekend there is a fight, and every couple of months there is a shooting or armed robbery. Owners of Kevin's, you've got a great place and I appreciate the armed security at night. But this neighborhood would patronize your diner a LOT more if you just closed for the night, especially after 12 AM. The clientele that emerges from Fuller Park and the projects ruins it for me, and I don't feel safe coming here any more, as I'm sure others in the area feel.", "rating": "3", "date": [2015, 9, 28]}, "18": {"description": "Yes, Kevins is a %*%^* Dive.  Don't go there looking for fancy place settings or clean silverware :) I have never had a Kevins burger, I only go for their breakfast, the steak, potatoes and pancakes are bananas!! Not only do they taste great but they are super cheap.  Although it's NOT the CLEANEST place in the best neighborhood, the food, and prices are worth the risks.  Its a popular late night spot, with the after nightclub crowd and you may encounter the loud, aggressive types, so if that scares you, go during the midday.  Breakfast for 2 is never more than 15 bucks.  Kevins I \"heart\" you.", "rating": "4", "date": [2012, 3, 7]}, "13": {"description": "I was jonesing extra mightily for a cheeseburger - nothing else would do.  I got the cheeseburger, complete with grilled onions, pickles, other decently non-lethal stuff, a shitty booth, one of the best milkshakes I've ever met, a fucking insane waitress (who I hugged before leaving), and extra grease.Holy God Damn, it was good.", "rating": "4", "date": [2010, 5, 5]}, "4": {"description": "I recommend the patty melt.", "rating": "4", "date": [2015, 8, 5]}, "24": {"description": "This joint ain't too shabby. My brother took me to Kevin's on Saturday so I could try their \"One of a kind\" burger. It was pretty tasty. Seasoned with what I think was Lawry's Seasoning Salt, cooked just right and topped with lettuce, onion and tomato and of course I added cheese. Probably not the best burger I've ever had but at that price it can't be beat. I can't say I would go out of my way to come here but if in the area I would definitely stop in again. Oh and the counter staff was very entertainng and only added to that gruff diner feel.", "rating": "3", "date": [2008, 3, 24]}, "6": {"description": "White trash is in the house place has my Catholic lent Friday breakfast just hoping I don't get shot", "rating": "1", "date": [2015, 3, 27]}, "22": {"description": "Why do people say this burger is so delicious?  It was fatty and on the thin side for my liking.  However it was well seasoned.  I liked the fact that I could order it on rye bread instead of a bun, but it was nothing special.  Although we were clearly out of place, the counter staff went out of their way to make us feel welcome.  They got an extra star for being so patient with patrons who couldn't figure out the side options with their breakfast plates.", "rating": "2", "date": [2008, 7, 16]}, "15": {"description": "Good and cheap. Nothing exceptional but everything is edible with no complaints from me. I liked the chocolate shake. It is probably the best dive diner I have been to in Chicago thus far. Kinda shady, yeah there is bootlegged DVD and CD sales but nothing scary.", "rating": "3", "date": [2013, 12, 30]}, "7": {"description": "Overpriced Bridgeport DinnerI mainly only go for there coffee with cream and sugar. It's delicious and you don't have to add anything extra cream or sugar. It's perfect coffee to me even though I'm no coffee specialist. But the food is ridiculously over priced. You can easily order two cheese burgers and fries and pay $20. They charge for extra everything. Just stick with the coffee.", "rating": "1", "date": [2014, 11, 1]}, "8": {"description": "just did take out & i appreciate when the food is ready when i get there. always tasty & affordable!", "rating": "4", "date": [2014, 12, 26]}, "3": {"description": "Restaurant is located in a very crummy neighborhood- would not walk around alone at night. However the staff was very welcoming and the food was decent for the money. There are many better burger places in Chicago but this place feels very welcoming. Fries were below average. Would recommend .", "rating": "4", "date": [2015, 12, 27]}, "14": {"description": "Love love love their steak, egg, and pancake breakfast!! My boyfriend introduced me to this crappy looking dive 2 years ago and we dont go there often but when we decide to its a big treat! I've only had the food I mentioned above and I dont think I NEED to try anything else just to tell you that I love their food. The steak is super tender, well seasoned, and they give you loads of A-1 sauce to dress it. The pancakes are fluffy and delicious, and the eggs are lovely.Overall...I wouldnt be seen in this joint for long periods of time (ate there once and decided that carry-out was my best bet) but man...just try their steak & eggs breakfast. Keep the car running...LOL.", "rating": "5", "date": [2009, 2, 8]}}, "neighborhoods": ["New City", "Canaryville"], "latitude": 41.823861, "longitude": -87.64026, "rating": "3.5", "times": {"Mon": [], "Thu": [], "Sat": [], "Wed": [], "Tue": [], "Sun": [], "Fri": []}, "price": "$", "categories": [["Diners", "diners"], ["Burgers", "burgers"]], "address": ["554 W Pershing Rd"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Very Loud", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Good For": "Breakfast", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Drive-Thru": "No", "Good for Kids": "No"}, "category": "Restaurants", "number_of_reviews": "30"}, "family-dollar-chicago-88": {"comments": {"1": {"description": "i was walking back to my car after going here recently on a hot day and i noticed 3 kids (i'd guesstimate 6 years old-ish) left in the backseat of a parked car next to mine. the windows were let down only slightly, i assume for air flow or whatever; parents no where to be found. they were looking at me so i smiled and waved at them to be friendly. one kid said to me, \"yo babe lemme suck on yo titties\". IM NOT SHITTING YOU. i can't believe the vocabulary of someone that young could be so brash! perhaps it has something to do with the absence of parenting!some days the cashiers are really nice to me. other days it's as if i am a ghost - and i feel it may partly have to do with me being white as a ghost. same goes for the other patrons. i've had friendly conversations with some folks while i've been shoved by others when being passed in an aisle. you never know what level of ignorance you will be dealing with in a day. it won't stop me from coming here yet, but it's a force to be contended with!it is right next to my local grocery store so i strolled in my first time curious to see what would be the best way to spend a dollar. now i come here once or twice a month. i typically get here:1) large garbage bags - varying quantities for $1, $3, or $5.... for 50-75% less than i'd typically pay2) toilet paper - a bit cheaper for the quality stuff but not jaw dropping cheap. qualities, quantities and prices vary so you can get a crappy 4-pk for $1 or a lil better for a lil more.3) reusable water bottles - ive got 3 different shapes and sizes for everyone in my household... 64 oz for the daily drinking, 32 oz for when going to the gym, 20 oz for smoothies/shakers which even has a filter all for $1 to $3 dollars each.4) cheap scented candles for $1. i light candles all the time around the house. i go through em fast so it's good to have some cheaper ones around for everyday aromas. besides i save the glasses when done for crafts.5) dishwasher pellets - a big box full of em. the same brand i get at Dominicks or Fairplay for a hellava lot cheaper.6) cleaning items - cheap mops, sponges, washcloths... sometimes even soaps and cleanersi'd like to see this place turnaround. but it takes a community to do that. i am sure i am not the only one waiting for the day they didn't have to loop the intercom message that we are being watched, keep all items of interest visible, and that there is a team of guards waiting to crack down on theft. REALLY? theft at a dollar store is a real LOW.", "rating": "1", "date": [2012, 5, 28]}, "0": {"description": "I've been to a few Family Dollar Stores since I moved to Chicago, and I frankly just don't care for the places.  Some of them are at least decent and cleaned-up and respectable in appearance, but this location was a bit shabbier than most I've been to.My first inkling that this isn't the best Family Dollar out there was when I couldn't get in because one of the employees was shouting halfway down the parking lot to someone she knew.  Could have been a co-worker or a friend, but all I know is that she chose to have the conversation while leaning out the open door and yelling, blocking the entrance and annoying me with her shrill screeching voice.  She noticed me standing there after 20 seconds and said, \"you coming in?\"  I nodded, but rather than leave the doorway, she squeezed two inches closer to the door frame and I had to pretty much push my way in-between just to attempt to be their customer.I sadly remained in the \"not their customer\" category at the end of it, since he only things that I was tempted to buy either 1) had no price tag in sight or 2) were just as expensive (if not more) than I could get at a more reputable store.That's what I don't get about \"Family Dollar Store\".  It's not like Dollar Tree where almost everything is $1.  It's not even like all things are priced to the dollar, since about 40% of the items have cents involved.  And 60% may be a majority, but it's not enough to consider yourself a dollar-based store.I can understand that the title may be implying that you can \"stretch your dollar\" to get what you need \"for your family\" - but if it's not a generic/FDS brand, you're usually paying pull price anyway.  At least that's the impression I got from this store in particular.", "rating": "2", "date": [2008, 9, 21]}}, "latitude": 41.8091408908367, "neighborhoods": ["New City", "Canaryville"], "categories": [["Discount Store", "discountstore"]], "address": ["4646 S Halsted St"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.6456072181463, "category": "Shopping", "rating": "1.5", "price": "$$", "number_of_reviews": "2"}, "bake-for-me-chicago-3": {"comments": {"28": {"description": "I've had birthday cakes from Bake from Me that were fantastic.   Really good cake.  Then I've had their coffee cakes and breads which are not very impressive.  The bread does not taste like bakery bread.  It's more like bread made in a bread factory.   It's just ok.  Their coffee cakes are bland and not very good.  It's llike they are from 2 different bakeries.", "rating": "3", "date": [2010, 10, 13]}, "1": {"description": "This is a great local bakery. They have a large assortment of pastries to choose from. During my visit I ordered a small coffee and apple fritter which was delicious. I purchased my items with my debit card. I was told that I need to purchase $5 minimum to use my card. My two items were a grand total of $2.24. I did not want to purchase anything else so the cashier offered to charge my card for $5. I was given the reminder of my change from $5. My main reason for stopping by the bakery on this particular day was the Paczki. Unfortunately for me they did not have any fresh Paczki in stock.", "rating": "4", "date": [2016, 2, 12]}, "9": {"description": "Great veggie sandwich, all the pastries I've tried are good.  Coffee nothing special, and Styrofoam cupped - real espresso machine though.  Lots of things for a nice quick lunch.  Nice outdoor patio and plenty of parking for cars and bikes.  Good service and the custom cakes look amazing.  Prices reasonable especially if ya can do with extra discounted day old.  4 stars for coffee and Styrofoam which is big deal to me,  everything else 5 or more :-)", "rating": "4", "date": [2014, 9, 9]}, "29": {"description": "We came for breakfast & I ordered a sandwich, which was just ok. I think their baked goods are supposed to be better. However, I heard that their cake is affordable & beautifully made.", "rating": "3", "date": [2010, 10, 11]}, "23": {"description": "I go to Bake for Me at least once or twice a week for lunch. Can't speak to the bakery side of things, but definitely a solid lunch at extremely reasonable prices. The soups are all homemade and I particularly like the chicken salad and meat chili. As there are really only a handful of lunch spots in the stockyards area, you may find yourself fighting for a seat, especially in winter when the few outdoor tables are unavailable. I wouldn't go out of your way, but a good choice if you find yourself nearby.", "rating": "3", "date": [2011, 12, 29]}, "5": {"description": "Happened upon this bakery and stopped in for lunch. I was pleasantly surprised about how delicious the Turkey club was and the fresh bread. I also had the carrot cake slice which was great but the frosting is okay, the cinnamon roll was much better. Overall great little hidden gem.", "rating": "5", "date": [2015, 10, 15]}, "31": {"description": "I love having a bakery with great coffee in the south side (Canaryville neighborhood)!  Finally!  Canaryville definitely needs a place like this.  I've had the cheese croissant, and a cheese/cherry danish from there, as well as a cup of coffee.  Sooooo good!The people that work there are really nice and helpful.  One time when I went there, they gave me a free box of bite sized pastries along with my order.  Yay, free food!  I have been to the establishment a few times since then, and I plan on being a loyal customer.", "rating": "5", "date": [2009, 4, 14]}, "25": {"description": "Made our wedding cake exactally as my bridge wanted.  It was elegant, delicious and beyond well priced.  Thanks you Bake for Me!", "rating": "5", "date": [2011, 10, 5]}, "12": {"description": "We have a donut rotation at my job and I've been trekking to a really good bakery *kind of* on the way to work.  Have been afraid to try a different bakery because my usual gets really good reviews... but BFM is 4 blocks from my house!  Decided today was the day I'd risk a new bakery.  Boy am I glad I risked it (the women at my job are scary about their Friday donuts!!!) These donuts were Delicious!!! And huge!  Same exact price as other bakery, much bigger, and I'd say much better!  I called ahead to make sure my 3 dozen were packed up and even though I got there 5 minutes earlier than I expected, my order was ready and I was out the door in minutes!  Love it!  Can't wait to try the lunch foods I'm reading about.", "rating": "5", "date": [2013, 3, 15]}, "21": {"description": "Great spot south on Halsted. The food is simple yet fresh and reasonably priced. Outdoor seating too.", "rating": "4", "date": [2012, 9, 5]}, "16": {"description": "A friend recommended this place for our wedding cake! It's a small little spot on the south west side of town. I had emailed Monika  a couple of times prior to our tasting , this included discussing my cake a picture was sent etc. I had asked for a red velvet and chocolate cake. For our tasting we met with her,she was very pleasant and helpful! We tasted the cakes Which were good not the best but for the price we would be good! We had to remind her we wanted red velvet too, which wasn't brought out with the initial selection. Shen they brought it out. The cakes were not moist as we liked but very tasty! We settled for the chocolate with raspberry. A day before the wedding Monika called me saying i forgot the ribbon on my cake and  could I bring some in! I couldn't due to timing . On my wedding day my cake looked great, alittle wrong but no one but me would know. I was supposed to have a square base and 2 round tiers, I had 3 rounds. The flowers were not exactly the design I asked for, but close. The taste however was great ! The cake was moist and tasted great! After speaking to Monika she said I asked for the rounds, and it was a miscommunication ! I know what I ordered! So why the 4 stars! The cake tasted great! It looked great even though not exactly what I wanted and a supplemental ribbon was added on the cake! So would I recommend them yes the price for the 3 tier cake was $233. Which included delivery!  The same cake at about 3 other places costed $1000. For my next use and anyone else's use , I would say be extremely specific, make sure u have many pics of your cake design and if you like a moist cake or a dry  cake let them know!", "rating": "4", "date": [2012, 6, 27]}, "17": {"description": "This location is clean, warm and friendly.  The parking lot is key so you can stop by and make a quick trip in, find your favorite pastries and get back on the road asap and sneak back into work!  The BFM Staff is very nice and helpful.  Kudos!", "rating": "4", "date": [2013, 3, 22]}, "10": {"description": "I ordered 10 muffins and a fruit tray for an important meeting at work. With a one hour delivery window of 9:00-10:00am, they arrived at 10:30am! It was half way through the meeting, so everyone was too involved to take advantage of the food. Basically, it was a waste of money, and it made me look like I wasn't doing my job. However, the staff was able to eat the food and said it was delicious. So, two stars for the food. Regardless, I will never order from them again because as a first time customer, I now think they are completely unreliable.", "rating": "2", "date": [2014, 6, 17]}, "11": {"description": "I work nearby and am a frequent lunch customer. The staff is friendly and quick.  The food is great! They have fresh salads and daily sandwich specials - I really like the mozzarella & tomato sandwich.  All of their daily soups are delicious.", "rating": "5", "date": [2014, 6, 26]}, "26": {"description": "On weekend mornings, it is not uncommon for me to walk to Dunkin' Donuts to grab some donuts.  It's only half a block away from where I live, but I'd really rather go anywhere else if there was something closer.  Bake for Me is not closer, but a few mornings ago, I finally made the trek out there, and not only are their donuts infinitely better and fresher than Dunkin' Donuts', but they're actually cheaper.  If you are on the south side and need to get some donuts and coffee, this place is perfect.  I hear good things about their lunch options as well, but I can't personally attest to that.", "rating": "5", "date": [2011, 9, 28]}, "27": {"description": "Been wanting to stop here forever because I have heard so many good things about it and I love to support local businesses...  Glad I did!  The bakery selection had a large variety, the restaurant itself was very clean and nicely decorated, and the staff was very pleasant.  I ordered a bran muffin, a cinnamon roll, and a large cup of coffee.  (They were all huge). My bill was $4 and some change (you can't beat that!).  Everything was delicious and fresh.  I would definitely recommend and I plan on returning to sample their lunch menu.  So glad Canaryville has a nice little place like this!", "rating": "4", "date": [2011, 7, 28]}, "0": {"description": "This bakery is awesome!!I ordered a  1/2 sheet cake for my mother's birthday to be delivered. The cake was decorated gorgeous, the cake arrived right on time, and best of all that cake was delicious!!", "rating": "5", "date": [2015, 12, 7]}, "20": {"description": "Well, I looked high and low for a place to do a ultrasound  cake reveal and came across BFM. Jose was helpful at understanding what I asked for. A basic cake on the outside with a baby message onthe out side and blue or pink icing inside based on the sex of our baby that was phoned in by a coworker who was to keep it a secret form us the parents. He took the info,  had the cake ready on time and I sent my husband to pick it up... The cake reciept listed all of the above with the instruction of blue icing for boy on the reciept!!! My husband was just crushed that a small detail ike that was overlooked. He didn't tell me until after the reveal but when I called Jose that monday, he merely said thats their policy to attach the reciept and they don't get that invovled with party planning anyway, so it happened. WOW. Cake reveals have been around for 2 years now. I didn't want a free cake, he could have at least been empathetic and said Oh Im so sorry weve never really done this before, My apologies, would have been fine, but he was so \"i don't care lady\" so what.   I understand accidents happen but Geez! Just on the customer service follow up , they get 1 star.", "rating": "1", "date": [2012, 9, 10]}, "19": {"description": "On weekend mornings, it is not uncommon for me to walk to Dunkin' Donuts to grab some donuts.  It's only half a block away from where I live, but I'd really rather go anywhere else if there was something closer.  Bake for Me is not closer, but a few mornings ago, I finally made the trek out there, and not only are their donuts infinitely better and fresher than Dunkin' Donuts', but they're actually cheaper.  If you are on the south side and need to get some donuts and coffee, this place is perfect.  I hear good things about their lunch options as well, but I can't personally attest to that.", "rating": "5", "date": [2011, 9, 28]}, "2": {"description": "I just had to post an update to a previous review because I was overwhelmed by how much care goes into each cake. I ordered three cakes for my family Christmas dinner and they did not disappoint. The cakes were decorated beautifully and I can't wait to dig in on tomorrow.", "rating": "5", "date": [2015, 12, 24]}, "18": {"description": "Bake For Me made a cake for an anniversary party at work, and I was in the right place at the right time when it came to leftovers. :)  One side of the cake was chocolate layer cake with real banana cream in the center (slices of banana included!) and the other side had vanilla cake with strawberries in the center - all covered with white icing an big blue and yellow flowers. Absolutely delicious!", "rating": "5", "date": [2013, 4, 1]}, "13": {"description": "I've had numerous pastries as well as sandwiches and soup and they are always amazing. The coffee and espresso are also great. It is near my work and I was seriously upset when I was on maternity leave and couldn't go there on a weekly basis anymore. I have to talk myself out of going there more than one or twice a week.", "rating": "5", "date": [2014, 5, 11]}, "4": {"description": "Love this little bakery !! They have 99 cents a day old donuts and 3 of them Just 99 cents crazy!!!! They taste perfect.", "rating": "5", "date": [2015, 9, 15]}, "24": {"description": "Ordered a birthday cake for my boyfriend's birthday. I paid a little over $10 for delivery and requested it get to me by 9aThe driver called me from outside at 8:59. The cake was exactly as I ordered. they event added curled ribbon decoration which i didn't ask for. the cake was delicious and not too sweet as most  buttercream cakes can be. I was very impressed with the level of service and promptness..Wouldn't go anywhere else.", "rating": "5", "date": [2011, 10, 9]}, "6": {"description": "Great place for breakfast or lunch. Sandwiches are delicious, and their prices are very reasonable.", "rating": "4", "date": [2015, 6, 14]}, "22": {"description": "A friend recommended this place for our wedding cake! It's a small little spot on the south west side of town. I had emailed Monika  a couple of times prior to our tasting , this included discussing my cake a picture was sent etc. I had asked for a red velvet and chocolate cake. For our tasting we met with her,she was very pleasant and helpful! We tasted the cakes Which were good not the best but for the price we would be good! We had to remind her we wanted red velvet too, which wasn't brought out with the initial selection. Shen they brought it out. The cakes were not moist as we liked but very tasty! We settled for the chocolate with raspberry. A day before the wedding Monika called me saying i forgot the ribbon on my cake and  could I bring some in! I couldn't due to timing . On my wedding day my cake looked great, alittle wrong but no one but me would know. I was supposed to have a square base and 2 round tiers, I had 3 rounds. The flowers were not exactly the design I asked for, but close. The taste however was great ! The cake was moist and tasted great! After speaking to Monika she said I asked for the rounds, and it was a miscommunication ! I know what I ordered! So why the 4 stars! The cake tasted great! It looked great even though not exactly what I wanted and a supplemental ribbon was added on the cake! So would I recommend them yes the price for the 3 tier cake was $233. Which included delivery!  The same cake at about 3 other places costed $1000. For my next use and anyone else's use , I would say be extremely specific, make sure u have many pics of your cake design and if you like a moist cake or a dry  cake let them know!", "rating": "4", "date": [2012, 6, 27]}, "15": {"description": "I want to like this place but being a foodie causes me to expect a little bit more. The food is good and fresh but I am not a big fan. I was satisfied with my sandwich and soup, but that was it. I will give it another shot. We shall see.", "rating": "3", "date": [2012, 12, 12]}, "7": {"description": "Alright... :) my Gucci cupcakes look so darling! Thank you so much for creating a masterpiece for me. My friend will be so happy. Smells DELICIOUS!! FROSTINGVery Sweet...PRICEPrice was perfect for cupcakes!! 6 logo cupcakes, 6 regular cupcakes. ~$22.78Will definitely be back!", "rating": "5", "date": [2014, 5, 2]}, "8": {"description": "I work right near Bake for me and am a frequent lunch customer.  The employees here are very helpful and nice and it seems like a family atmosphere.  They have great specials every day on sandwiches...$6 for a panini or bacon avocado wrap.  I usually get the half soup/sandwich combo, which is a great deal for $6.50.  The soups are fantastic, I personally have tried all of them and love them all except the garden vegetable.  The chicken noodle and chicken tortilla soups are probably the best.  The chili is also very good.If you're on the pickier side you are able to make your own sandwich (pick the bread, meat, cheese, veggies, and dressing) and that's what I usually end up doing.  If you come here right at noon, expect a lunch rush but it's usually not too bad.", "rating": "4", "date": [2014, 6, 6]}, "30": {"description": "I hate to have to do this, really I do. I mean, there aren't many bakeries around me if I'm not in the mood for packzis. I was so excited to try this place out. I woke up early on a midweek day off, started a pot of coffee, and headed over in my pj's to get some sweets for my morning. The place was busy. A good sign right? The lines were moving quickly and the staff was super nice. I stood perusing the pastry case and finally settled on an almond croissant and a cheese slice. As I gave the gal my order, she told me it was buy one get one for the croissants. Sweet! I'll take the chocolate croissant as well. She bagged up my goodies and forked over $2.73. Man, this place just kept getting better and better. Free sweets and cheap?!? I'm in. I got home, poured a cup of coffee, and sat down to watch \"Now, Voyager \"(for the millionth time). Sat down with my cheese slice that looked so pretty, and dug in. bleh! The crust was rubbery. RUBBERY! How the hell does that happen in a bakery? In my kitchen, yes. In a bakery, hellz to the naw! The cream cheese filling was alright but the top layer was some weird, gelatinous, lemony stuff. Just ick! Strike one. On the the chocolate croissant. The pastry wasn't as light and buttery as I expect croissants to be and the chocolate wasn't very, well, indulgent. Kind of tasted like a melted Hersey bar. It wasn't bad - but wasn't as good as I had hoped. I ate it though, but that's because there's a fat girl trapped inside of me that's dying to get out. Strike two. Lastly, the almond croissant. By this time, I wasn't expecting much. I was pleasantly surprised. The pastry was flaky and buttery. The almond filling was rich and tasty, and the sliced almonds on top gave it a nice crunch. I will give this joint another try. I mean, they only got two strikes, so they're still in the game. This time I'll try lunch. Maybe that's their forte.", "rating": "2", "date": [2009, 10, 17]}, "3": {"description": "I didn't realize there were two locations. I have passed this one for many years. This is a nice little spot. They have sandwiches, breads, salads, cakes, muffins, danishes, coffee and other items. The prices and portions are really good. I bought a turkey, cranberry and walnut salad with a vinaigrette, an avocado and black bean salad, a raspberry and cheese croissant, a muffin and a slice of chocolate mousse cake. I spent $11.38. Not bad at all. I enjoyed everything but the chocolate cake. It didn't really do it for me.  It wasn't bad but it was a tad bit dry and not exactly my idea of chocolate mousse. I'll always try mousse when the opportunity arises but I'm pretty picky about it so it's okay. There is a seating area as well. It's a great place to stop by.", "rating": "3", "date": [2015, 7, 17]}, "14": {"description": "I'm in charge of ordering the birthday and special event desserts for my office that's located in the loop. This place is pretty good. We've never had any negative experiences, and only stray to other bakeries for variety and flavor. If anything, my co-workers claim that the frosting is too thick and too sweet. I'm not sure how that happens though. .", "rating": "4", "date": [2013, 9, 25]}}, "latitude": 41.8159981, "neighborhoods": ["New City", "Canaryville"], "categories": [["Breakfast & Brunch", "breakfast_brunch"]], "address": ["4305 S Halsted"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Casual", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "longitude": -87.6455688, "category": "Restaurants", "rating": "4.0", "price": "$", "number_of_reviews": "32"}, "its-snack-time-restaurant-chicago": {"comments": {"0": {"description": "Uh-a cliche rinkie dink diner. Every time I have been there there has been a bunch of old men there watchin the news, drinkin coffee, etc. The service there is nearly non-existent.", "rating": "2", "date": [2009, 5, 17]}}, "latitude": 41.8238220214844, "neighborhoods": ["New City", "Canaryville"], "categories": [["Restaurants", "restaurants"]], "address": ["452 W Pershing Road"], "attributes": {"Attire": "Casual", "Waiter Service": "Yes", "Take-out": "Yes", "Accepts Credit Cards": "Yes", "Good for Groups": "Yes", "Outdoor Seating": "No", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.6382751464844, "rating": "2.0", "price": "$", "number_of_reviews": "1"}, "fairplay-foods-chicago-2": {"comments": {"12": {"description": "I've been going to the local Fairplay Foods ever since it opened. It used to be really ghetto and trashy but now they maintain it very well. The prices are pretty good and the customer service is excellent.", "rating": "5", "date": [2009, 9, 23]}, "3": {"description": "Wow, wished I knew to come here a lot earlier. I think the store is pretty clean and well stocked.They have lots of selections and good prices. They have some great weekly sales.It can seem a bit sketchy, but I think it's not bad at all.", "rating": "4", "date": [2013, 5, 24]}, "1": {"description": "I have driven past this place for a long time and never stopped in until I went shopping for a lady I work for and yeah I agree with one poster that they need to mop in the meat area since there's no reason for the stench. Also the sketchiness of the store is questionable because it seems right when the new month happens it never fails to see a gang of hoodrats and their family members tying up every department mainly the meat and deli with their orders to feed their idiot boyfriends and disrespectful army of children. Also they need to get in touch with the way other stores run by having self checkout lines to make things go faster. Also when they give out samples they need to have a trash can because the floor was littered with half eaten chicken tenders and I got sick of stepping on that crap and instead of using toothpicks they used pretzel sticks to serve the chicken tender samples. They do however have some good weekly sales. Their chicken nuggets are about the only thing I have taken a liking to since they taste better than McDonalds and does not taste like minced chicken but the actual tenderloin of the chicken. Park your car several spots away the hood idiots can't park for crap like they failed driver's ed so they're not up against your car and boxing it in.", "rating": "2", "date": [2015, 10, 9]}, "2": {"description": "Hit or miss with this place, but the last time was defo a miss. I brought some bagels. The Dutch brand o_O. Praise your Gods that I checked the bagel before eating it. Complete mold on the bottom of the bagels. Why keep moldy food on the shelves. Corporate greed at it's finest.I wish more grocery stories would take the time to mop and clean around the meat area. Walking into a store and the first thing you smell is the stench of meat is a turn off. I mean, yes meat has a smell, but not the smell of meat and blood caked up on the floor for days on end smell. Naw can't do it. On a side note I wish more people would use VINEGAR to clean with...moving along. Also, I do not trust buying my meat from here. It taste strange at times and sometimes it can be so tough. This is why I have to stop eating meat. \"It taste strange. It was tough.\" WTF type of life did this animal live and I am eating it.The produce department is not good at all. The few times I got in to this place, I can never buy produce because it's so bad. Either it's moldy, soft or there are flies everywhere. I do like this grocery store, because some of their items are discounted and those Doreen's mini-pizza's, Gingerbread Men and Yoplait Cherry and Pomegranate yogurt. I can't find them anywhere else, so I am forced to to trek here from time to time, but just be careful when you are shopping at this place, you are liable to get a couple of vaccinations with some of their products.SIDENOTE: Just wanted to add that this place does has many cab drivers if needed. Professional and non. Ask for Mr. G if you need a ride.", "rating": "2", "date": [2014, 1, 18]}, "9": {"description": "i can't quite give Fairplay four stars but it has inched it's way up from one to three in the matter of month of frequenting there.i migrated from a uber dutch town that was DRY as well as closed on Sundays. there was a Fairplay the next town over that we would go to for booze and for the sin of grocery shopping on Sundays. i strongly remember it smelling like rotting fish back then.i was warned by my neighbors, by my landlord \"DONT GO TO FAIRPLAY....unless you absolutely are in dire need of something fast\". coming here my first time i parked in between two cars: one blaring gospel music, the other gangsta rap... i'm not kidding - i couldn't even hear my phone ring it was so loud! there is a personal COP at the entry/exit: badge, gun, serious face, that scans every one that comes in the store - you must check your bags in as well upon entry. lastly cop cars (not just security, but CHICAGO COPS) circle the parking lot almost every time i go. just parking here i feel like i've entered a place of sin.... but now i just remind myself when i arrive the lyric from the lesbian duo \"indigo girls\" that \"every devil i meet is an angel in disguise\".and i dunno if its a corporate strategy to lure us with the smell of baiting rotted fish, but this Back of the Yards location smells EXACTLY the same as i remember from a different location in my childhood. enough to deter me from shopping here for 6 months despite being less than a mile away from my home. i would drive ALLLLL the way to south loop Whole Foods, Trader Joes, or Dominicks for groceries - which at times felt like a chore, especially if i only needed a few basic items. then i was in dire need of something.... i went from shopping here for emergency items, then just for the basics, now for almost anything packaged or most produce that can be found at any other grocery store. see my list of do's and don'ts for deets...I DO BUY HERE: 1) fresh produce: you may need to inspect some bunches but most has been good in my experiences. you can't beat the produce pricing here. they have cactus (not even some of the big three grocery stores have cactus), fresh ginger root, big bags of spinach, cilantro bundles for 50 cents (we eat cilantro every other day), good avocados... among many choices especially for vegetables2) packaged meat: the same packaged ground turkey, but for less money. more pounds of chicken packaged for significantly less money - just have to cut a lil more fat off in preparation. i don't eat pork and rarely eat beef so i can't vouch for those as i haven't purchased them from here yet.3) anything canned, jarred, or bottled: this place is canned goods king - almost every aisle has something canned in it (i know where to go when i want to stock my fall-out shelter). brand fruit juices for sometimes half the price of other stores or off-brand for even better pricing. 4) milk, eggs, packaged cheese: cheese is good and priced well but no variety besides standard packages of shredded cheeses. eggs and milk abundant, though not much variety and you MUST check the expiration date to get the most out a purchase!5) baked goods, bread and tortillas: fresh and inexpensive. i buy a large coffee cake to bring for breakfast and coffee at the rents for as low as $2.50! eat bakery breads soon or freeze as i don't think they have preservatives.  6) guilty snacks: they have this off brand flavored microwave popcorn for a dollar or two. i cannot refrain from putting it in my basket. i even bring it to my friends house and it's devoured in seconds. they have many brand name snacks for less or way cheaper alternatives. candy is way inexpensive - i just walk straight passed the aisle to resist! every once in awhile you can get a gallon of ice cream for under $3 if you spend over 20 dollars - i haven't said no to this deal and i still have ice cream sitting in my fridge.I DON\"T BUY HERE:1) SEAFOOD & FISH: it's smells like rotting fish here... i can't help but steer clear of it2) over-the-counter meats: absolutely no deli. i'm sure some of the meat is OK over-the-counter but i don't trust the handling and the packaged meats suffice.3) cigarettes: well they don't sell them... and i just recently quit so i guess it doesn't matter now! 4) yogurt: the selection is almost non-existent. i must drive all the way to south loop grocery stores, or even settle for the almost non-existent selection of Halsted Foods selection of yogurt down the street.", "rating": "3", "date": [2012, 5, 7]}, "10": {"description": "This store is great if you like meat, like me, and, like me, don't like paying a hefty price for it! Seriously how can one pass up four pounds of bone in chicken breasts for four dollars and fourteen cents? I think you'd have to be out of your gourd to do that. This store is huge and you can find a lot of random things that you can't find at a Jewel They also have very decent prices.", "rating": "4", "date": [2008, 8, 30]}, "4": {"description": "I don't like coming here because the quality of the food and fresh vegetables can be dubious sometimes. The neighborhood itself is sketchy but it's handy when you need a last minute ingredient!", "rating": "2", "date": [2013, 7, 20]}, "6": {"description": "I just want to apologize for shopping here and for bothering the cashiers with my groceries. Everytime I shop here I feel as if I'm a bother. The employees are extremely rude. A few days ago I got yelled at by Gertie the cashier because apparently I had a job to do... I thought I was a customer? Besides, who likes feeling like they're in the ghetto anyway.", "rating": "1", "date": [2013, 1, 11]}, "0": {"description": "I prefer this grocery store among many other local options. There is plenty of parking and shopping carts available . What I love the most about this store is the  produce section. There is an abundance amount of fresh produce to choose from. I can always find a good deal on the produce or mostly anything.", "rating": "4", "date": [2016, 2, 12]}, "5": {"description": "Been here countless times since I was a kid. They have a well-stocked place for foods. Their shopping carts have locks that refuses to leave the parking lot though. There's also a fresh deli and hot food section here. Not recommended to stop by during busy days (end of the month or beginning of the month) when most do the restocking. This place is similar to Cermak Produce (minus a lot of the ethnic foods, they carry a lot of cheap groceries though) and carries a lot of the items for cheap.", "rating": "4", "date": [2012, 8, 14]}, "13": {"description": "The sales at fairplay are awesome!!!! The gentlemen in the the meat department (butchers) are very nice and professional and aim to please their customers, and the prices are reasonable", "rating": "4", "date": [2011, 8, 13]}, "11": {"description": "I recently moved to the area and I was on the hunt for finding a good neighborhood store. Fairplay is a good place to go for great deals.  You can find everything and anything in this store.  The meat is reasonably priced and specials on cereal and produce are competitive. Their bakery offers a great selection of cakes and pies.  There is even a \"Day Old\" clearance rack that offer fresh rye bread loaves for 50 cents!  I was in heaven! The produce is fresh and I see Whites, Blacks, Hispanics and Asians in this store.  That says a lot about the place because it offers something for EVERYONE!  The meat is good quality and every week there is a new sale.  Check it out!!", "rating": "4", "date": [2009, 8, 29]}, "8": {"description": "This supermarket is like a combination of all good things - the brand variety of Jewel/Dominick's combined with the bargains of ALDI, complete with a butcher, bakery, hot foods, deli counter and fishmonger.People from all walks of life can be found in the store, but it's located in Back of the Yards next to a dollar store and it's open all night on the last day of every month.Most of their weekly bargains (the ones noted in their weekly ads) can be found huddled together at the store entrance, but also in the regular aisles.  If you're in there and you're hunting for the milk, it's hidden in the corner in a little niche with some soda machines.  Just head all the way to the right as soon as you get in.You'll also probably find cuts of meat and pieces of animals that you've never seen before and might be shocked to know that people actually buy.  I now know where to look if I wake up one morning with a craving for pig's feet, turkey necks or hog jowls.  Or need a 40-pound box o' chicken parts.  Cuz they sell 'em there!Other awesome hidden spots - the aisle full of things you wouldn't believe could cost a dollar.  Take special note of the jars of preserved fruits and various boxed and canned foods - all costing $1 apiece.  Also, this is the corporate location and posibly the biggest, so they've got room to include different flavors of certain foods.  I never knew some of my favorite brands of barbecue sauce had so many different flavors!  And the chips as well!A word of advice: they try to check all bags/backpacks when you come in.  The first time I shopped here, I was almost hunted down by this guy because I had a backpack with me.  It all seemed fine, because I watched him clip a clothespin on my backpack and gave me the matching one, but at the end of my shopping trip - the guy was nowhere to be found.  If this happens to you, just go to the checkout on the far right that's also a counter - your bags are stored there and if the bag-check guy has disappeared (which he has over 70% of the time I've been there), the person working that checkout will get you your bag back.All in all, it's rare that I give a location a 5-star rating, but the fact that you can get there on the #47, #8 or #44 bus (the last of which swings right by my apartment) make this one of the easiest grocery chain stores for me to get to, and one of the cheapest I've ever been to as well!", "rating": "5", "date": [2008, 9, 6]}, "14": {"description": "This is a long standing grocery store chain in Chicago. Fairplay has good produce, great meats and low prices. This store is located in the Back of the Yards \"hood\" area, but I have never had problems here. Black, whites and hispanics shop here. Its not upscale like some stores, but your dollar lasts longer here than at other stores. I like Fairplay!", "rating": "4", "date": [2007, 2, 4]}, "7": {"description": "My mother insists on shopping here. Just a question...... Why are the cashiers here always so angry with my groceries??", "rating": "2", "date": [2012, 10, 28]}}, "latitude": 41.8094258755445, "neighborhoods": ["New City", "Canaryville"], "categories": [["Grocery", "grocery"]], "address": ["4640 S Halsted St"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.6456145942211, "category": "Food", "rating": "3.5", "price": "$$", "number_of_reviews": "15"}, "louisiana-fried-chicken-chicago": {"comments": {"12": {"description": "I'd been hearing the reviews from a facebook food group so I decided to check them out. Parking is a little tight. We were greeted by an armed security guard that was friendly & inviting. The place was busy so that was a good sign. We browsed the menu & peeked in on the fried chicken they were boxing up for other customers. So we decided on shrimp & 8pc chicken. It was freshly dropped to order, so we waited about 10mins & our order was ready. Couldn't wait to get home to try it so we ate in the car. IT WAS DELICIOUS!!!!!! Smoking hot out the grease. We'll be back!", "rating": "4", "date": [2014, 10, 26]}, "7": {"description": "Awesome chicken, decent fish, you will wait for your order but why complain. It will always be fresh and hot. Glad i live close by , there is no where to eat there beside your car.", "rating": "4", "date": [2014, 12, 6]}, "3": {"description": "I went here about two weeks ago. And I'll never go again. I went thinking it was a black-owned business and it's not. Yes, that makes a difference as I'm trying to support this idea because I believe that black-owned businesses can increase stability in a neighborhood. Anyway, the management was rude, referring to me as \"honey\" \"baby\" and other sexist words. As a grown woman, I do not care for strange men to refer to me in such a manner. As I received my order, I got more patronizing comments such as \" I got your back, baby\". What did I need support for? When did picking up a bag of chicken become akin to \"the struggle is real\" slogan?!?! Also, the way the management talked to their employees was disgusting. Who wants to see folks being bossed around like they are dogs or arguing over  customers food? SMH. I'm not asking for Nirvana but how you treat others certainly says how you feel about people in general. The food was decent. The breading was a bit too dry, with too much black pepper. The okra was good. But the chicken wasn't too bad. Just average. I'll stick to my hometown favorite, Harold's.", "rating": "1", "date": [2015, 2, 2]}, "1": {"description": "The fried chicken here is ok. I'm kind of picky though. My favorite one in Chicago is The Roost which is located up north.The chicken here is kind of dry. It's not too greasy... So if it's you're cup of tea, I think you will really like it. The staff here is super nice though. They all seem to be proud of what they are a part of.", "rating": "3", "date": [2016, 2, 14]}, "2": {"description": "My hopes were high for an excellent fried chicken when I saw place on the map, especially when I travel to Louisiana frequent.  I ordered the 8 piece dark and literally waited 30 minutes for my chicken to be eaten, since they make every order fresh. Majority of the fried chicken consist of a heavy coat of batter with a spicy punch. After you tear past the heavy coat of batter, the chicken meat itself was bland. I can say that this is not a Louisiana fried chicken.", "rating": "2", "date": [2015, 7, 7]}, "9": {"description": "Worst customer service ever. I ordered the special and asked if it came with anything. The guy yells it says what it comes with on the poster. I then was told there were and will never be any biscuits. I also requested a side with my food and I was told all they had were fries. I looked at the menu and noticed they offered a lot of options. So I asked for mashed potatoes and the man yells I already gave you fries you should've said something. I hate nasty customer service it's the next best thing a restaurant can offer. The food is ok it's sort of spicy and it really doesn't have much flavor other than being spicy.", "rating": "3", "date": [2015, 8, 15]}, "18": {"description": "The chicken was VERY salty, the biscuit was DRY, the red beans & rice were NASTY. A waste of time and money.", "rating": "1", "date": [2014, 10, 20]}, "10": {"description": "Louisiana Fried Chicken was a restaurant that was referred to me by my older brother.  He complimented this establishment for their delicious fried chicken, so I had to find out for myself.I have to agree that Louisiana Fried Chicken has some of the best fried chicken that I have ever eaten!  The chicken is very juicy, crispy and not greasy at all.  The seasoning is excellent and makes my taste buds smile from ear to ear.  The wait time was was very short and the food very fresh and piping hot!  The cashier was very friendly and the restaurant was very clean.  They have a nice menu of other items and great side dishes to complement the entrees.  My brother was right for once, (wink) this restaurant does rock!  I will definitely come back and try some of their other items, on the menu, as well as have some more of that delicious fried chicken.I would definitely recommend this establishment with two thumbs up for the chicken and service.", "rating": "5", "date": [2014, 12, 14]}, "13": {"description": "I grew up in Los Angeles where Louisiana famous fried chicken originated and I was too happy to see one here. It has the same taste as the ones back home just need to find a way to keep the food hot for the ride home when you don't live across the street. Would love to have the option for the strawberry pop instead of the slushy as well. I will be back.", "rating": "4", "date": [2014, 10, 30]}, "16": {"description": "I'm so wanting this location of Louisiana Fried Chicken to be associated with the location that was a little past 127th and  Cicero?", "rating": "5", "date": [2015, 5, 24]}, "17": {"description": "the total lack of tables or counter space to even stand while eating will not deter me from enjoying the comestibles from here!  the jumbo shrimp was well-seasoned, maybe a little spicy for those with completely bland palates (sorry no offense!) the hush puppies were inhalable, too!  did not get any chicken on this visit but will fix that next time.  their packing boxes are retro-adorable.  the people behind the plexiglas wall were very nice, as were the other customers-in-waiting during our daytime sojourn.  I'm giving 5 stars but I would have preferred to take away 1/2 because I did think the prices were a little high or maybe I'm just getting really old and I'm used to cheaper food!", "rating": "5", "date": [2015, 6, 10]}, "15": {"description": "Jumbo shrimp? At a chicken joint? That was my first thought crossing my mind as I finally settled on what I was craving. But I figured why not,  I ordered the jumbo shrimp and chicken. The wait was short, service was great,  my food smelled so good my mouth watered before it got to my truck. I gotta say this is how chicken and shrimp should go together. I'll be back real soon.", "rating": "5", "date": [2015, 7, 5]}, "0": {"description": "This place is awesome!!!! It's as close to Louisiana deliciousness as I have found. The quality and accountability of the food and staff is absolutely phenomenal!!!! I LOVE THIS PLACE!!!!", "rating": "5", "date": [2015, 12, 14]}, "5": {"description": "I think I was being kind giving two stars. I've driven past many times so I decided to pop in. Wrong stop.  The place looked clean and the the people were nice.  I thought the chicken was not good. It was nice and crispy but hated the seasoning. The fries weren't good and even the dinner role was nasty. Lol.", "rating": "2", "date": [2015, 12, 11]}, "11": {"description": "This is the 3rd time we've had chicken from here and each time it's been delicious.  We've even had it delivered before and it was piping hot.  I can say it's been consistent.  No complaints with service or the food.  I highly recommend it...", "rating": "5", "date": [2015, 8, 9]}, "8": {"description": "Yea, Grand opening! I been waiting for them to open for 4 months. They really turn this place to into a good looking carry-out restaurant. Will try them soon.Fried Chickens are fresh fried to order. Portion is bigger than Popeyes. I am not sure about their fried rice.", "rating": "4", "date": [2014, 10, 13]}, "4": {"description": "This is not a place where you want to eat.When I pulled up - I took pictures of the sign outside and posted that I thought this was what Heaven might look like.I ordered a five drumstick dinner with fried okra. The staff was super nice.The okara was perfect. The first drumstick was good - perhaps a bit bland. The second drumstick was like the first. The third drumstick was the beginning of the problem.The bottom of the bone was coated in a chalky jet-black residue. That one goes in the garbage.The fourth drumstick had black veiny business running up one side and down the other. That is number two for the garbage.The fifth drumstick (I should have just stopped trying and pitched the whole nasty affair into the trash bin.) was raw on the inside with deep reds and blood present. So I paid for five drumsticks and was able to eat two.I will never unsee that chalky black residue. It may ruin my friend chicken love forever. Probably not - but they are not worth the risk. Shame.", "rating": "1", "date": [2015, 6, 14]}, "14": {"description": "BEST FRIED CHICKEN I've ever had! The food is made fresh to order and the service is fantastic! The Chicken legs and jumbo fried shrimp was so juicy and delicious. I could eat the jumbo fried shrimp all day. The strawberry slushy is so flavorful and and clenched my thirst even on a rainy day . I would definitely come here again.", "rating": "5", "date": [2014, 12, 15]}, "6": {"description": "THE SECOND TIME AROUND Well after I posted my review on yelpI got a email the next day from Mr. Omar (manager ) he was very nice and asked me to give Louisiana chicken restaurant a second chance. Well being the very nice person that I am I said sure. And today was my big day.  I guess I had  Ms. yelper all over my face This man greeted me with a smile and a warm hand shake. I have to say I felt so good he had me ready to taste it all. I started off with a fresh cooked wing. I was like what a BIG different from the other day. And then I washed it down with a strawberry slush. He was so happy because I was happy. LolI was just in love with the fact that he was taking orders and greeting everyone and making sure I was now have a good time tasting the Gumbo.OMG it was so full of flavor and I had big shrimp on top. It's a winner for sure. To top it all off Mr. Omar sent me out the door smiling even more with my dinner for the night.So yes I'm very pleased to give this place all my stars and Thank youFor believing in a second chance", "rating": "5", "date": [2014, 10, 25]}}, "latitude": 41.823364, "neighborhoods": ["New City", "Canaryville"], "categories": [["Chicken Wings", "chicken_wings"], ["American (Traditional)", "tradamerican"]], "address": ["215 W Pershing Rd"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "longitude": -87.632202, "category": "Restaurants", "rating": "3.5", "price": "$", "number_of_reviews": "19"}}