{"heavenly-visions-chicago": {"comments": {"0": {"description": "I really REALLY REALLLLLLLLLY wanted to like this place because I love to patronize Really Great businesses striving in Impovershed communities .. It's beautiful compared to the junk stores that are nearby (Ie.. Lemingtons foods etc) I haven't been here in a few years but the problem is this. .The barbers were EXCELLENT!! extremely professional and friendly ... Curteous..and their prices are Fantastic!! I would highly recommend them to anyone! My issue was with the Salon Part of the Place.. I took my daughter here to get her hair done by the salon owner.... My daughter was 11 at the time . The Stylist charged her Full price.. Never recommended that her ends needed to be trimmed or that there was breakage (Summer swimming and surgery may have contributed) .. and her hair only lasted maybe a day at most when I've just spent $50 on her hair.. Ouch!! I still attempted to let her go two more times.. thinking ok maybe there was a mishap. I explained to the Stylist that her hair was falling apart so the style wasn't working.. Neither time did she bother to mention trimming her ends or the breakage so that it wouldn't break anymore.. the final straw was when my daughter had a 3pm appointment.. her hair should've taken no longer than 2 hrs.. and she wasn't ready to go home until after 8:30 pm on a school night.. why ? because the stylist stopped to braid her boyfriend or whomevers hair. My daughter was 11.. She didn't need to be there 4+ hours just because some \"Dude\" needed his hair french braided.. not on my dollar. We've since found a fabulous person to do her hair  who makes recommendations.. for the price.. i just feel that people must be on their game. The barber was great until he left so i don't take my son there anymore but for hair cuts.. a great place for men to go. Hopefully the stylist has improved on her game.", "rating": "3", "date": [2010, 2, 6]}}, "latitude": 41.8735313, "neighborhoods": ["East Garfield Park"], "categories": [["Nail Salons", "othersalons"]], "address": ["3251 W Harrison St"], "attributes": {}, "longitude": -87.7071533, "category": "Beauty", "rating": "3.0", "price": "$$", "number_of_reviews": "1"}, "mcdonalds-chicago-172": {"comments": {"3": {"description": "Quite possibly the worst McDonalds on the planet. Absolutely vile and disgusting, food and service alike.", "rating": "1", "date": [2014, 3, 31]}, "1": {"description": "On my way to the local brewery not too far from here we decided to grab a bite to eat beforehand.  We pulled into the drive through because getting out just seemed like an unnecessary risk.  As we waited and finally got up to the menu, the order taker informed us that they were only accepting cash at the moment.  My driver decided to exit the line but I insisted on getting him a meal.  I risked life and limb to get that man dinner.  I agree with the other reviewers that this place is less that satisfactory.  The cashier was not even the slightest bit delightful in my ordering experience.  The restaurant did not look very clean.  The employees were arguing about something very loudly that made me a bit uncomfortable.  Anyway, I got the food and got out of there ASAP!  I will not be back unless it is the last place on earth to get food.", "rating": "1", "date": [2014, 11, 22]}, "2": {"description": "I swear the service with this mcdonalds is NO GOOD AT ALL!!! I don't like stopping at this McDonald's location cause I absolutely hate theirService but my girlfriend was hungry after work and she insisted weStop there so she can get a bite to eat so I went for it! BIG MISTAKE!! 1ST of all Once they speak it seems like they have an attitude. they dont even greetYou with good customer service and huff and puff as if they are in a rush to take your Order. 2nd when I ordered the wings for my girlfriend they said \"its gonna be A 20 minute wait after you pay\" are they serious they cant start on my orderRight away once I place it??!! There was 3 cars in front of me so I have to waitEven longer??? So I said no thank you we will just order something else and thereWe hear another deep breathe as if im taking very long to place my order. Then after I placed my order we stood in line with 3 cars still in front of us so we waited patiently.After waiting 15mins and no car has moved and 2 cars behind us left the line we decided to go to the McDonald's on cicero and 28th where they have great customer service, everything on the menu available and we dont have to wait 20-40Minutes for our food...the McDonald's on 3200 w Roosevelt is the worse place anyone can go to for food.. Before I left today the cashier at the window looked my way and of course I stopped and told her the I was going to write a review on yelp and she laughed and said \"yeah okay boo do you\" unbelievable I dont understand how these people still have their job!!! Please tell me which McDonald's allows their employees to play loud music while at work? This place was very very ghetto and I seriously dont recommend for anyone to stop at this location!!! I rather starve then to eat any food from this place!!! I really hope they bring in new employees that have good customer service, speak proper english, know how to clean and dont dress up so ghetto!!!", "rating": "1", "date": [2013, 10, 5]}, "0": {"description": "I've always been the type of girl who gives the benefit of the doubt. So when I saw this low rating, I figured ok so a few people have had a few bad experiences. I'm only going for a quick late night snack. How bad can it be?Let me first start by asking the yelp gods for forgiveness! Why oh why didn't I take the one-star rating and drive to another location?? It was just after 10pm. Though I'm sure the inside was still open at this 24-hour location, everyone seemed to have opted for the drive thru. Since I only wanted the most famous fries in the world, I figured two certainties about my trip: 1. It'd be quick, 2. They'd be great. WRONG! 6 cars in front of us and 20 minutes later, it wasn't quick and the fries were terrible. I mean 5-day old grease terrible! Not to mention, after waiting in line for 20 minutes, my money was counted and ready to be handed over for what I had convinced myself would be the greatest guilty pleasure trip to round out my weekend. When I pulled up to the window (they have two windows: the typical pay window and pickup window. Why they were only using one was beyond me), the cashier quoted a different amount. Maybe it seems like less of a big deal but after 20 minutes of unbearably loud music from the van behind us and what I'm almost positive was a drug deal in front of us, I now have to get out more change that I could have spent the last 20 minutes sorting through?!? I agree with the other reviews: terrible, slow service. They attract a questionable crowd of people. In a phrase: McDonalds would do itself a favor by tearing down locations like this. I'd starve myself before subjecting myself to the terrible food & ghetto service.", "rating": "1", "date": [2015, 3, 10]}, "4": {"description": "I stopped at this location with my boyfriend earlier this evening to grab a bite to eat after stopping off to pick up some things for his apartment and this was one of the most ghetto McD's I've been to. I've seen some pretty bad places, but this place took the cake in terms of filth and vagrancy because the place seemed to be a location for people to loiter around in and having people up in there begging for change and all while you're trying to order your food. I was waiting with my fiance for his food to come up and the guy behind the counter was banging his hand saying \"can I help the next customer\".....really you think you can get someone's attention banging your hand on the counter like some ignorant fool with no professional standards. Who would want to eat in this place with folks standing outside trying to sell you stuff and this one guy was begging for change to allegedly feed his baby sister.....that's so typical for them to sit there and lie because they want someone to give them money so they can feed their whatever habit they're trying to hide. This restaurant is situated in one of the most ghetto neighborhoods on the west side which says how the standards has gone down. If they really cared they would keep the restaurant clean inside and outside and I was glad that I didn't see the inside of the bathroom because if it's a ghetto McDonalds the bathrooms wouldnt exactly look like they were maintained well either. I wouldnt bother eating here unless you want to be harassed by goofy hoodrats and crack fiends looking for someone to give them change. I can think of at least 10 McDonalds locations that has staff that don't look like they were plucked from the ghetto garden because this McDonalds seems to employ hoodrats and ghetto snots to work at this particular location. I have gotten much better service elsewhere than this place I won't be coming here again and I want to be served by someone who can properly wear a hairnet that's not the length of the hairstyle and doesnt look like a hoodrat with multi colored dragon lady tips a mile long.", "rating": "1", "date": [2012, 11, 19]}}, "latitude": 41.866722, "neighborhoods": ["East Garfield Park"], "categories": [["Burgers", "burgers"], ["Fast Food", "hotdogs"]], "address": ["3200 W Roosevelt Rd"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.705994, "category": "Restaurants", "rating": "1.0", "price": "$", "number_of_reviews": "5"}, "jimmy-gs-restaurant-chicago": {"comments": {"3": {"description": "I ordered delivery from Jimmy G's as I was looking for a good local neighborhood BBQ place. I ordered a full slab of ribs. While they didn't knock my socks off, they were certainly decent by most standards but not the kind of thing that would work someone up into a frenzy and stand in line for hours (think Smoque). Regardless, if your in this neighborhood it's a far better option then the local convenient store or pharmacy!", "rating": "3", "date": [2012, 9, 20]}, "1": {"description": "It took an eternity for my perch dinner to arrive at this \"fast food\" joint, as I sat sweating like a rotisserie chicken in the afternoon sun. But my imagination says the wait was on account of them throwing the first 49 fried perch back into the sea so they could give me the 50th and most perfect fried perch ever perched on a styrofoam tray. Side of collard greens was pleasantly rustic and mac and cheese was just what I expected it'd be.", "rating": "4", "date": [2014, 8, 7]}, "2": {"description": "Made my stomach hurt and indigestion!! Same for My Wife .. will never go thERe ever again!!", "rating": "1", "date": [2014, 5, 18]}, "5": {"description": "EGP residents have few options for good restaurants.  Jimmy Gs' is a wonderful place to get fried chicken wings, smoked BBQ Tips and Ribs and Chicken, steamtable soul food.  Wings are CHEAP and DELICIOUS.  Wed has a $1 piece thigh and leg special!  Sometimes they run out before 6 or 7pm.   Nightly at 9pm a $1 package of food is sold to local homeless. (If you truly want to do something for someone down and out...go and buy someone a meal).  Jimmy and his wife are nice people who care about the community.  There is lots of carryout here.  Wings and Fries are a deal.", "rating": "4", "date": [2014, 1, 6]}, "6": {"description": "The food is awesome!  I had the turkey wing dinner.  The candied yams were soo tastee.  Greens and peach cobbler was delicious as well.The decor is lacking....but i guess the food is actually what counts!  Don't plan to eat there.  Best option is pickup.", "rating": "4", "date": [2012, 10, 14]}, "7": {"description": "THE BEST CHICKEN IN TOWN!!!!!  This chicken will beat Harold's anyday. You don't even have to have any sauce to make this chicken good because the seasoning on it is sooooooo delicious. Harold's please send one of your representatives to this restaurant, so they can teach you guys what chicken should taste like.", "rating": "5", "date": [2012, 1, 29]}, "8": {"description": "Yummy burgers on a toasted bun. The chicken looks good. I am going to have to order again for a better review because once again, one of the guys brought a surprise burger and all I know is that it is way yummy.", "rating": "4", "date": [2007, 5, 17]}, "0": {"description": "Jimmie G's has the best soul food in the City!!!Yesterday I had some Jimmie G's and I was extremely pleased. The chicken was absolutely perfect and it dropped right off of the bone. I couldn't have asked for a more perfect meal. Jimmie G's had some delicious macaroni and cheese and the corn bread taste just like I was down south. I will recommend this place to anyone on the westside.", "rating": "5", "date": [2014, 6, 26]}, "4": {"description": "Delicious and cheap home-cooked (by Mama G herself) soul food! Take it to go or eat there, but be warned, the neighborhood can be a little rough, so go in the daytime. Try the chicken tips (a healthier alternative to traditional rib tips). Comes with two sides. My vote is for the mac 'n cheese and candied yams. Comes with a free side of peach cobbler...yummy! I've heard the turkey hot links (another healthier choice) are also delicious...", "rating": "4", "date": [2012, 7, 28]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.87704436481, "longitude": -87.7059515565634, "rating": "4.0", "times": {"Mon": ["10:00 am", "10:00 pm"], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "10:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": ["10:00 am", "10:00 pm"], "Fri": ["10:00 am", "10:00 pm"]}, "price": "$", "categories": [["Chicken Shop", "chickenshop"]], "address": ["307 S Kedzie Ave"], "attributes": {"Take-out": "Yes", "Has TV": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Delivery": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "9"}, "j-and-j-fish-chicago": {"comments": {"1": {"description": "I know its J & J Fish but the wings are the damn bomb! They are always fresh! You know its good chicken when you can warm it up days later and its still good.", "rating": "4", "date": [2010, 5, 5]}, "0": {"description": "Adjacent to the -Kedzie/Holman blueLINE- (chi-west) hides the blue-print of ~flave~: \"class of the swim,\" fried to its roots chitown'z very own  daily catch. Dead bodies fill the green rivers here in Chicago. Nobody yelp... only death here be \"buh-bye\" hunger. Empty those pockets to this menued return, the cleanliness whirls a \"success\" that flirts with deep return. Although diet gods frown upon these -friedfoods- i conclude \"fit dishes\" (thanx to McDonald's, oil isn't the booty call of evil) servings here, give ya a flame bite that turn kid's righhht! My first pinch here carried me to some -newfound- tastebuds clubbed by the this darn joint. Grab the \"floaties\" this dining is nuth'n but good... .. \"pUdd'n.\"If I had a thumb for every violation here..~got munch~M@K..", "rating": "5", "date": [2014, 10, 2]}}, "latitude": 41.87531, "neighborhoods": ["East Garfield Park"], "categories": [["Seafood", "seafood"], ["American (Traditional)", "tradamerican"]], "address": ["411 S Kedzie Ave"], "attributes": {"Good for Groups": "Yes", "Take-out": "Yes", "Delivery": "Yes", "Accepts Credit Cards": "Yes", "Good for Kids": "Yes"}, "longitude": -87.70507, "category": "Restaurants", "rating": "4.5", "price": "$", "number_of_reviews": "2"}, "crazy-bird-chicken-chicago": {"comments": {"1": {"description": "This place is the spo5 for chicken.  The owner cooks it up himself and he really takes pride in what he's doing. From the wings, big old giant dinosaur wings to his buffalo chicken sandwiches to all the soul food style sides, Crazy Bird does it right. I always get a buffalo chicken sandwich with fries. The Chipotle sauce is really good too.If you're eating with a couple people get the truffle fries. They come in a giant pan and taste great.", "rating": "4", "date": [2016, 2, 25]}, "9": {"description": "This is a no frills carry out chicken restaurant. I called my order in. When I got there they were a  little busy. The lady helping me (I think it's the owner) was very friendly. She handed me my order. I noticed my receipt had the wrong meal on it. She discovered she made a mistake and she quickly took care of me. I had the 1/4 white with Mac n cheese with the honey chipotle sauce. The chicken was very moist. To me it could be seasoned more but when I added the sauce.....oooooweee it was good. The Mac n cheese was good too. For the price and to get fresh fried chicken, I'd go back.", "rating": "4", "date": [2014, 10, 3]}, "23": {"description": "Fantastic chicken. For a birthday treat, I got a family bucket of fried chicken, red beans & rice, collard greens, cornbread, and an order of Crazy Fries (poutine with chicken gravy, cheese, and DUCK BACON). Excellent food, and wonderful interaction with the owners. Definitely will be back.", "rating": "5", "date": [2014, 11, 20]}, "5": {"description": "I've been to this establishment so many times since they've opened, the owners know me by name. It a small restaurant and if you weren't actively looking for it, you'd miss it driving down South California Ave. But once you do find it and taste the food, you wont ever forget the location. This place does chicken sandwiches very well. I'd say it was the best chicken sandwich I've ever had.  But what keeps me coming back are the Crazy Bird Crazy Good Fries: Fries with truffle oil, gravy, cheese and duck bacon!!! I'm eating some right now and still cant believe how good they are. Their sides (especially the collard greens and macaroni) are delicious and the portions are generous. I highly recommend this establishment, it is a hidden gem on the West Side.", "rating": "5", "date": [2015, 8, 21]}, "25": {"description": "Chicken is Soooooooo juicy and tender, never, never dry, always juicy. The pound cake is to die for as well.  Clean, well lite place and owners Ruby and Larry are so fun to talk to and caring about your needs. Thank you Crazy Bird.", "rating": "5", "date": [2014, 10, 28]}, "12": {"description": "This was my second time here. The first time I got a great chicken sandwich and had the crazy good fries, which are true to their name. This time I got the rib tip/dark meat combo, both the bbq and the chicken were great. It's easily one of the best restaurants in the area. And like everybody, I'd recommend to take your food to go--as other people mentioned it's pretty warm in the dining area. I'd also recommend calling ahead since they make food to order.Apart from the food, the staff is incredibly friendly, and provide you with sweet tea while you wait for your take out. Great place.", "rating": "5", "date": [2015, 9, 17]}, "21": {"description": "The best chicken ever!  Generous portions of tender, juicy, tasty chicken.  Coating is (truly) amazing but the meat within is to die for.  Really good.  The soulful sides are all homemade and wonderful.  And, nothing beats the caramel pound cake except maybe Ruby's homemade lemon cake - mouth watering!! Rib tips offered once a week - call ahead, food is prepared on order. This is a quaint take out spot - a wonderful add to a growing vibrant community. Love Crazy Bird!", "rating": "5", "date": [2014, 12, 16]}, "16": {"description": "I did a take out for chicken wings and 1/4 chicken white with corn bread and coleslaw as sides. The chicken was very moist,a little bit too oily for me even though it's fried and quantity is huge. The owners are very friendly, they offered me sweet iced tea which was very fresh while I was waiting for my order, it's a small cozy place, has been featured on a television show and price is very cheap. I went after 8PM and there was a lot of free street parking.", "rating": "5", "date": [2015, 7, 14]}, "17": {"description": "The food and service was great the chicken was seasoned to perfection.The ice tea is delicious .Chef Larry is very nice and really seems to care about his customer satisfaction . I will be back there very soon!!!!!'", "rating": "4", "date": [2015, 7, 17]}, "10": {"description": "INCREDIBLE! Best fried chicken I've eaten in Chicago, hands down! And yes, I've been to all the \"famous\" places. If you ever feel lost, alone, like there's nobody in this world that you can talk to, then just pull yourself toward yourself and get ya ass down to crazy bird, and you'll find your reason to live inside a styrofoam box!", "rating": "5", "date": [2015, 10, 3]}, "11": {"description": "The best chicken ever!  Generous portions of tender, juicy, tasty chicken.  Coating is (truly) amazing but the meat within is to die for.  Really good.  The soulful sides are all homemade and wonderful.  And, nothing beats the caramel pound cake except maybe Ruby's homemade lemon cake - mouth watering!! Rib tips offered once a week - call ahead, food is prepared on order. This is a quaint take out spot - a wonderful add to a growing vibrant community. Love Crazy Bird!", "rating": "5", "date": [2014, 12, 16]}, "26": {"description": "Crispy juicy chicken (cook to order), fresh sides, amazing sweet potato pie and caramel pound cake, cute carryout store, fun owners.I need to try whatever comes out of the smoker next time ... the rib tips were not ready when I was there.Definitely going back!", "rating": "5", "date": [2014, 10, 18]}, "27": {"description": "This is a no frills carry out chicken restaurant. I called my order in. When I got there they were a  little busy. The lady helping me (I think it's the owner) was very friendly. She handed me my order. I noticed my receipt had the wrong meal on it. She discovered she made a mistake and she quickly took care of me. I had the 1/4 white with Mac n cheese with the honey chipotle sauce. The chicken was very moist. To me it could be seasoned more but when I added the sauce.....oooooweee it was good. The Mac n cheese was good too. For the price and to get fresh fried chicken, I'd go back.", "rating": "4", "date": [2014, 10, 3]}, "0": {"description": "The food at Crazy Bird Chicken can be described in two words: delicious and indulgent.  I went there specifically to try the Crazy Bird Fries.  I went there thinking that the fries were a side dish.  This is not the case.  The Crazy Bird Fries are the star of the show here.  Theres enough food for one order to feed four people comfortably.  They are the perfect french fries, with the combination of truffle oil duck bacon and white cheddar makes this a poutine-like dish that is just taken to a new level.THe food is cooked fresh to order, so you might have to wait a little bit, still you won't be disappointed because the food is well worth the wait.  The fried chicken itself, is everything you want from fried chicken being tender and juicy with a nice crispy exterior.  This place is definitely a diamond in the rough.", "rating": "5", "date": [2016, 1, 19]}, "20": {"description": "Best chicken in Chicago! The pot pies are amazing too. Chef Larry and his wife Ruby are the nicest people you'll ever meet. We love Crazybird!", "rating": "5", "date": [2015, 1, 29]}, "19": {"description": "I got the Groupon deal here where you get the half chicken and 3 sides (3 times). It's not generally a neighborhood that I get out to, but that's the thing I like about the deals is that I get to try and see things differently. It's not a real busy street or intersection so you could easily miss this place. It's a very tiny, hole in the wall place where it's mostly a carry-out type of place. Plus, you get your food and pay for it in a plastic/glass revolving window - which might speak a little bit over the safety of the neighborhood. I have picked up twice. I didn't like that I couldn't have the option of the greens as it doesn't state that as a non-option in the deal and have really 5 out of the 7 that you can choose from. I have had the mac and cheese, beans and rice, yams, and coleslaw. They were all very tasty,and the prices are reasonable. It's nice to have this option in the neighborhood.", "rating": "4", "date": [2015, 2, 22]}, "2": {"description": "A treasure on the Westside of Chicago, that's right. The ingredients and the way food is prepared you won't believe you are on California and Roosevelt...LOLTruffle oil? Duck bacon? Poutine? Ummm If you are in a rush don't go, wait until you have time for your meal to be made to order. This is one time you will be pleased with waiting. So I tried this place last night and it wasn't a bust but it also wasn't great. I had 1/4 fried chicken and mac n cheese and a side of string beans. The chicken was light moist and fried w/out flour (well done), the mac and cheese was different. I don't know if it was box or homemade, buttermilk or too much cheese but it was too heavy and stiff for me, the taste was ok. The muffin nope dry and weird tasting also the consistency was like corn meal and cake batter mix and the string beans had a red sauce to them still not sure what I was eating with the string beans. When I go back for my (fries) poutine which has gravy, cheese, duck bacon and truffle oil on them which looks amazing I'm going to ask about the string beans base, was it tomato sauce also the string beans has a kick so if you are not a fan of spicy this might not work for you. I don't like spicy but it wasn't a lot of heat...The team in the kitchen and wait staff husband and wife trying to give back to the community, which is why I will be back. They deserve a shot from me heck Steve Dolinsky rated the place well so let me try something different. The wife Ruby is very personable and has such a customer friendly personality. Give them a try and if you don't like what you get the first time try something else.", "rating": "3", "date": [2016, 1, 16]}, "18": {"description": "Actually been here twice already...Chipotle Chicken sandwich is really good and the rib tips are as well...", "rating": "5", "date": [2015, 3, 27]}, "13": {"description": "This is some of the best seasoned chicken I have ever had. It was not too heavy or too bland. I love the chicken and the sandwiches are tasty. The sides are just ok. The sides I had were red beans and rice, mac and cheese and cornbread, all of which were just ok not good just ok. I have heard that the yams were good though. The chicken is what receives the high rating.", "rating": "4", "date": [2015, 7, 14]}, "4": {"description": "Great place. Very simple and layout with excellent food. I love the sweet tea, and I don't even drink tea. I love the chicken sandwiches and the Mac and cheese. Support this great little spot!", "rating": "5", "date": [2015, 10, 5]}, "24": {"description": "Larry is back in business with the best BBQ in Chicago! If you miss his old Smoke House, get food from here! I love everything, but you have to especially try the Collard Greens, yams, coleslaw, and while you're at, get a few pieces of cornbread. Drink-wise, the sweet tea is great. The best deal out there is to get yourself half a chicken with his famously amazing BBQ sauce. You will not be disappointed when you come here.", "rating": "5", "date": [2014, 11, 2]}, "6": {"description": "I was highly disappointed in my visit today. For starters, the restaurant was extremely hot which made it impossible to eat within the establishment. The take out menu (that's also displayed in the restaurant) does not coincide with the menu that's taped in their window. I think that they should discard of those menus with the improper pricing. That's definitely a turn off. The chicken was mediocre. Probably won't return.", "rating": "2", "date": [2015, 7, 31]}, "22": {"description": "This place is beyond expectations the couple that work here are very kind. All the food is mouth watering with each bite!Must try this place!!", "rating": "5", "date": [2014, 12, 14]}, "15": {"description": "Larry & Ruth are great people, me & my girlfriend Shonda walked from downtown 5 miles to the crazy bird . I must say it was worth the trip . We a sample of all of the side & the chicken was amazing....can't wait to come back to Chi - town...Philly folks", "rating": "5", "date": [2015, 9, 7]}, "7": {"description": "This place is beyond expectations the couple that work here are very kind. All the food is mouth watering with each bite!Must try this place!!", "rating": "5", "date": [2014, 12, 14]}, "8": {"description": "Crispy juicy chicken (cook to order), fresh sides, amazing sweet potato pie and caramel pound cake, cute carryout store, fun owners.I need to try whatever comes out of the smoker next time ... the rib tips were not ready when I was there.Definitely going back!", "rating": "5", "date": [2014, 10, 18]}, "3": {"description": "We went on a early Sunday evening and phoned ahead. Our order was waiting for us. I had the wings and fries which were very good. Good seasoning and well done like I prefer. No rubbery chicken. The fries were also well done which were good which surprised me. I don't care for dark brown fries generally but these were good. I had the mild sauce on the side and it tasted like catsup with ground cloves. I didn't hate it. My husband had the rib tips and said they weren't meaty and had too much grizzle. I told him when I go to a chicken shack I don't order pork! We wanted the red beans and rice but they didn't have them. Maybe next time.", "rating": "3", "date": [2016, 1, 19]}, "14": {"description": "The food is great and cheap. the staff is kind and the owner is welcoming. My favorite lunch spot in the neighborhood.", "rating": "5", "date": [2015, 7, 1]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.86719, "longitude": -87.69624, "rating": "4.5", "times": {"Mon": ["11:30 am", "8:00 pm"], "Thu": ["11:30 am", "9:00 pm"], "Sat": ["12:00 pm", "9:00 pm"], "Wed": ["11:30 am", "3:00 pm", "5:00 pm", "9:00 pm"], "Tue": ["11:30 am", "3:00 pm", "5:00 pm", "9:00 pm"], "Sun": [], "Fri": ["11:30 am", "9:00 pm"]}, "price": "$", "categories": [["Chicken Wings", "chicken_wings"]], "address": ["1138 S California Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "No", "Ambience": "Casual", "Has TV": "Yes", "Accepts Apple Pay": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "28"}, "rubys-restaurant-chicago-2": {"comments": {"12": {"description": "Love Love Love This place My Family is in here once a week. The staff is the best..You Must stop in And you will feel like ur at home all the time!!", "rating": "5", "date": [2012, 1, 13]}, "7": {"description": "The food here was amazing. Short ribs, dressing, and Greens. Best I've had in years. Service was great everyone was cheerful. The dessert...I have to cut this review short.  I need to go back for seconds.", "rating": "5", "date": [2014, 3, 23]}, "19": {"description": "easter sunday i decided to give ruby's a chance since i never got a chance to eat it when it was edna's i knew there would be a wait for such famous dishes like the fried chicken but no one told me i would be made to feel as though i was invisible for nearly 20 mins no came to take my order i received a glass of water and that was it. i decided to leave and i ended up at wallace's which is further east of ruby's . i really wanted to try rubys dont sit at table #56 because none of the servers will help you. don't get me wrong though it was easter sunday it wasnt that crowded or busy there were atleast 3 tables open. if the waitstaff were that busy let the customer know ''we will be right with you .'' im truly disappointed im a westsider and i felt like an outsider.", "rating": "1", "date": [2012, 4, 8]}, "1": {"description": "I stopped in because I loved the old place Edna's. The new owners supposedly were cooks for Edna's. Well I wasn't pleased.. The place looks exactly how it was 20yrs ago. They haven't renovated or changed the furniture. NOT GOOD! My service was good & the servers", "rating": "1", "date": [2015, 2, 20]}, "2": {"description": "Sorry yall....this establishment is closed....they have been closed for about a month....began with a green closed by city sign...all of the window advertisements are down, along with the neon sign....", "rating": "2", "date": [2015, 7, 14]}, "9": {"description": "Note: Only giving four stars because I didn't dine-in.We decided to pick up our soul food Sunday meal today...Ruby's did NOT disappoint. Five star flavor.The fried catfish is perfect. I don't even like eating catfish! All of our sides were tasty, hot, not greasy. Mac n cheese, collards, dressing, yams. Go for it. I also recommend the short ribs.Oak Park isn't far from Ruby's, so I will be back. Take out makes it home HOT and crispy, but I'd love to make a dine in visit because the staff is so pleasant.", "rating": "4", "date": [2011, 7, 24]}, "6": {"description": "I grew up on the west side but this is my first time at Ruby's.  We ordered the chicken (tenders) and waffles, fried catfish, yams, mac & cheese, potato salad, and biscuits.  Everything was fantastic!  I have eaten mac & cheese before so I didn't try it until my friend told me it's thee best so....I tried it.  Very cheesy & tasty!  The catfish was seasoned perfectly.  The yams are always my fav so they were awesome here too.  The biscuits were buttery soft.  The potato salad was greeny good. Waffles were thick and good.Basically, everything was good.  Not too busy when we went on a Saturday afternoon.  Our waitress was Angela who was nice.  We didn't try dessert since I had to go but I saw 3 triple layer cakes that I'd love to try on my next visit.", "rating": "5", "date": [2012, 9, 23]}, "18": {"description": "Haven't been back in about 2 months.  The old lady order taker/waitress is so rude. I also think she has a hearing/understanding problem. She always seem to have an attitude no matter how nice you try to be to her.  The salmon croquettes are good but they are tiny.  This is the ONLY soul food place that I know charges extra for sweet potatoes- you have to order them separate and can't be a side for your dinner.  You would think theirs came with glitter or something!!! They are ok at best! Anyway, the last time I went there I ended up paying over $18 bucks for a short rib dinner because she didn't understand that I was saying I would pay the DIFFERENCE for sweet potatoes- not full price! I asked my 2 sides be greens and the sweet potatoes (for an up-charge).  I get to the office, she put my order in for double greens!!! SMH...Now yes I am the fool for not walking away but I was starving that day and my boss was waiting for his food.  All I could think of was how I could have been in a much better place for a price like that.  After that I vowed never would they get another dime from me!!!", "rating": "1", "date": [2013, 6, 20]}, "10": {"description": "Henry Henderson was a genius to hire manager Lillie Joiner and most of the staff when he decided to open Ruby's on the site of the west-side's soul food mecca and de facto living room, Edna's, which closed soon after Edna Stewart passed away.  A fresh coat of paint and minor menu additions are the only noticeable things.  My wife, brother, and I hadn't been here in a few years and while the place looked a little different, the food was the same outstanding southern cooking that we remembered.Of course, we had the fried chicken, 1/4 dark.  The entrees come with two sides and your choice of biscuits or corned bread.  Our table ordered 2 macaroni and cheeses, collard greens, creamed corn, mashed potatoes with gravy, and pinto beans. The biscuits?  Put jelly on one and butter on the other.  You're welcome.  They fry to order, so the chicken took every bit of the advertised 30 minutes.  If you order a drink when you order your food, it will come with your meal.  Tell the waitress if you want it now.Everything is high fat, high calorie, cooked with butter, and damn it, it tastes good.  Everything was great.  The fried chicken is the best I've tasted in the city, bar none.  The collard greens were the only relatively weak point.  I should have stopped and put a little salt on it but everything else was so good, I couldn't stop eating.  The creamed corn had a smoky flavor.  Most likely it was cooked in a pan with the same oil as something else but they were very good.  We didn't have room for dessert and it was almost heartbreaking.  We had our eyes on the apple and peach cobbler.A note about the location.  We went there at noon on a Saturday and yes, the west side doesn't seem to be the safest place in the world but we were treated just fine and nothing seemed dangerous.  Mr. Henderson came over and asked how we were and asked us to come back soon. The wait staff was friendly and the other patrons, shock surprise, treated us just like another bunch of hungry patrons.  Sure, it's odd to have the cashier in a bullet-proof booth but even she, and I think she was Lillie the manager, told me that she'd have the printed to-go menu for me the next time I came in.  Not, \"oh, I hope you come back\".  She said, \"when you come back.\"   We will.  Soon.To people scared to visit the west side, be respectful as you should be everywhere and you'll be just fine.  When the food comes and you taste it, you wouldn't care if you were sitting buck naked on the L tracks in rush hour.", "rating": "5", "date": [2011, 3, 26]}, "13": {"description": "The collard greens here are amazing!  Being a vegetarian finding good soul food can be trying.  Yet all the sides at Ruby's are prepared veg-friendly.  You can get a trio of 3 for only 7 dollars and I was definitely full when done devouring.  They have plenty of options, I got the collard greens, mac and cheese, and pickled beets which also came with a side of  corn bread.  The greens were my favorite but the mac and cheese was also very glutenous and amazing. It's not located in the safest of neighborhoods, but the staff was extremely welcoming and friendly.  They have a parking lot next door which is nice because it can be a little difficult to get to via public transport.  I never went to Edna's when it was around but I hear the menu hasn't really changed so I'm sure if you liked it then you will like it now.Overall great food, great service and great price!", "rating": "5", "date": [2011, 4, 13]}, "16": {"description": "I was so excited to try Ruby's due to the overwhelming review in the Chicago Tribune last week.   On top of that, the Yelpers gave the place outstanding reviews.   I went to the restaurant today filled with anticipation and excitement.  The place as described by the others really isn't in one of the safest neighborhoods, hence my decision to take out my order.  I ordered fried chicken, fried perch and a slab of ribs; and of course, for the sides, I ordered macaroni and cheese, collard greens, fried okra and mashed potatoes.  For desert, I ordered candied yams, red velvet chocolate cake, coconut cake and a peach cobbler.  I know I sound like a mad man ordering all of the treats mentioned above, but just want  you to know that I shared the feast with six of my friends.I was welcomed by a wonderful server (Jackie) and she delighted me with what was on the menu.  She served me water even if she knew I was just going to order everything \"to go\".  So, I'm sure that had I dined in, service would have been great!For my review, I was very disappointed with the fried chicken, it was seasoned well, but it just didn't reach my expectations.  For the baby back ribs, it was too dry and tough.  I don't know if it was a fluke since that was the only time I've been there but I was not happy with it.  The only good meal that came out was the fried perch - crispy, perfectly breaded and seasoned moist fish.As for the sides, the collard greens were amazing.  Mac and cheese were so-so.  Mashed potatoes were yummy.  Fried okra was bleh.  And last but not the least, the desserts were just so-so.  But then again, they're not a pastry or a dessert shop.", "rating": "2", "date": [2011, 8, 19]}, "17": {"description": "Ham and Egg omelette was good but their potatoes were mushy and the biscuits were average. Butter wasn't offered for the biscuits. In addition, I presented a group-on that I let the waitress know was expired. She said no problem to present it at checkout.  When I went to pay the woman charged me the full amount and then she said she had to check if they could accept it. She came back and told me that they couldn't accept it because it was over a year old. I pointed out that it had been only six months but she still denied it. I will never return.", "rating": "1", "date": [2013, 4, 27]}, "15": {"description": "Had a groupon as this is far from my home but wanted to try it.  Not thrilled with the food.  BTW restroom nice and clean. However I ordered a very traditional meal, roast chicken, greens, stuffing, Mac and cheese.  Sooooo lacking in love.  Food came from a buffet.  Chicken not fresh as it was cold next to the bone.  Greens must have been cut four inches square and did not bend to put in your mouth.  Mac and cheese ok.  Stuffing ok.  Wait staff very nice.  At least the lady That waited on me.  However I got the feeling there was a general lack of enthusiasm all round.   Very local place so I would not bring friends there.  By local I mean too laid back.  No snap.  However I bet their breakfast is great.  This is the sort of place I would go for breakfast.  Wish they were closer and I could try more.  The area is daunting for an old lady from the southside of Chicago. I am 70 and was born and raised in Chicago.  My knowledge of the Westside made me cautious about going there and I said a little prayer when I parked my car.  But, fear not.  Friendly clientele, love a man that smiles at an old lady, and there are real efforts towards neighborhood improvement.  Ruby' i so want you to succeed,bring on some loving care.", "rating": "2", "date": [2014, 8, 3]}, "0": {"description": "So...I have been wanting to try this place (also when it was Edna's) for the last ten years.  A Groupon was the push that I needed to make the trip happen.  I had hoped to bring my husband along, but his business travel made me a solo lunch goer today, on the final day for the Groupon.  My work schedule did not allow for the thirty minute wait for anything fried (specified on the menu), so I will be back to try the fried chicken.  Instead, I tried the blackened catfish, mac and cheese, mashed potatoes, biscuits, and cream of chicken soup.  Oh...I also got some peach cobbler which I will be trying later.  The catfish and sides were good.  I actually really, really enjoyed the mac and cheese, and the gravy on the  potatoes was fabulous.  Two fish filets made for a big meal!  My one disappointment was the biscuits, which I had read about (read that they were great).  Yikes.  They were small, slightly hard, and not fluffy or buttery.  Did I come on a bad day?  I will reassess when I come back for the fried chicken!  The soup was quite good, especially with some added pepper.My server was young but very friendly and thorough.  Every employee I encountered was nice and eager to make my experience nice.The room was basic and similar to a diner.  Many seniors/retirees but also young people and business people (in suits) were enjoying meals.  Several races of people were represented.The neighborhood is dangerous, so I recommend visiting during the day.  However, street parking made quick entry easy.I will be back for my chicken......", "rating": "4", "date": [2012, 10, 10]}, "5": {"description": "Hell naw. It's been 62 minutes since we ordered. Only supposed to take 30 mins for fried foods. Maybe that's what we get for eating fried foods. The waitress who seems somewhat competent said that another incompetent waitress grabbed our food and gave it to another table. Why didn't our waitress feel the need to communicate that with us sooner? The water is just Ok, I haven't tasted the food so I only comment on the water. They have the Lil dude from \"that's so raven  look a like bussin' tables (he literally 11)... He's maybe 11. Hmmmm... And don't ask for the restaurant history because they don't know.", "rating": "1", "date": [2013, 7, 21]}, "11": {"description": "How can you not like a restaurant where mac and cheese and homemade dressing are listed as Vegetables on the menu???  Stopped in to this historic location (formerly Edna's) with a friend for Sunday lunch and thoroughly enjoyed the braised beef short ribs with all the fixin's that the server recommended. Although it was busy with the after-church crowd, the staff was attentive and friendly. Easy street parking, although I would probably limit my visits to daylight hours.", "rating": "4", "date": [2012, 10, 9]}, "8": {"description": "Service is terribly slow, and the food is mediocre at best. I've given this place a few tries since it has remodeled and each visit gets worse. This is my last time wasting time here", "rating": "1", "date": [2014, 3, 9]}, "3": {"description": "I ordered the short ribs.  I told them I had a groupon before I ordered.  They told me the short ribs were $17.95!  I have to tell you this, I only got ONE short rib!  For $17.95?  Come on now folks!!  I asked the gentleman at the counter, if they gave me \"the special groupon rate\", he replied \"you know it!\"  I don't think he knew I was being sarcastic.  The food was good, but not great.  At that price, I have great expectations!If I did not have two more groupons to use, I would not return!On a positive note, the staff was pleasant.", "rating": "2", "date": [2014, 2, 1]}, "14": {"description": "Great catfish. Sides are southern-worthy.", "rating": "3", "date": [2012, 12, 10]}, "4": {"description": "What a glorious place! My partner and I are moving to the neighborhood, and we wanted to find some good soul food. Well, we came to the right place!  When you walk in, you are greeted very kindly and invited to come up and look at the buffet full of ready-to-go soul food: chicken, yams, mac & cheese, collard greens, veggies, potatoes---more that I'm forgetting.  Yum.  I wanted the catfish, but my partner was in a hurry, so we ordered sandwiches.  They were good, but the Cream of Chicken soup (with real pieces of shredded chicken) was my favorite, along with the cornbread.  The people working there are super nice and friendly, and they'll talk to you about the food.  To top it off, I took home a piece of lemon cake for dessert. It was the best lemon cake I have ever had.  I'll be back soon, Ruby's!", "rating": "5", "date": [2014, 4, 10]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.8808517, "longitude": -87.7054138, "rating": "3.0", "times": {"Mon": [], "Thu": ["6:00 am", "7:00 pm"], "Sat": ["6:00 am", "7:00 pm"], "Wed": ["6:00 am", "7:00 pm"], "Tue": ["6:00 am", "7:00 pm"], "Sun": ["6:00 am", "7:00 pm"], "Fri": ["6:00 am", "7:00 pm"]}, "price": "$$", "categories": [["Soul Food", "soulfood"]], "address": ["3175 W Madison St"], "attributes": {"Take-out": "Yes", "Has TV": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "20"}, "murry-fish-and-chicken-chicago": {"comments": {"0": {"description": "This is a little joint connected to a citgo gas station right off the homan Eisenhower exit. It's open 24 hours it's a classic west side chicken shack with bullet proof glass and turn table box to get your food. Their wings are nice and crispy not grease. They have great nuggets and tenders also haven't tried the fish yet will next time. Their hot and mild sauce is a classic chicago chicken shack. If you are stuck in traffic on the Ike stop and get some chicken for yourself while u sit in traffic.", "rating": "3", "date": [2014, 8, 2]}}, "latitude": 41.8733788, "neighborhoods": ["East Garfield Park"], "categories": [["Restaurants", "restaurants"]], "address": ["3357 W Harrison St"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Good for Groups": "No", "Delivery": "No", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.7105484, "rating": "3.0", "price": "$", "number_of_reviews": "1"}, "chinese-kitchen-chicago-7": {"comments": {"1": {"description": "payed for extra shrimp and chicken and as u can see I didn't get it. The rice was dry and orange chicken tasted cold. When u see this place run!", "rating": "1", "date": [2015, 2, 26]}, "2": {"description": "It's quick. It's pretty cheap (small bale 'o hay for 5-something). The food is at least OK.You should be hearing \"right down the middle.\" Strip-mall Chinese, basically.Make sure you take a close look at their sample containers to get a sense of portion size. Small should be plenty for reasonable people. On my first visit I accidentally ordered what is apparently the default (medium/large) size of ma po tofu. I was mildly shocked when I got the bill and strangely delighted when I saw the bucket of joy (easily enough to feed a horse).", "rating": "3", "date": [2012, 6, 6]}, "0": {"description": "This place is cheap and fast, and in my opinion, really good! I've paid much more for far worse food, so I think this place is a real find. I work nearby and have been going here for years on my lunch hour. I'm a big gal and I can eat, so when I tell you the \"lunch special\" is enough to last me three meals, you know you're getting bang for your buck. Their rice IS well done, as the other reviews imply, but I haven't experienced the dryness they mention. I prefer it to \"lightly\" fried rice, and everyone I've convinced to try this spot has agreed that the rice is great. The orange chicken is flavorless, but the sesame chicken is REALLY good- I get it every time. I also tried the egg foo young and Mongolian beef and both were decent.", "rating": "4", "date": [2015, 10, 15]}}, "latitude": 41.8666801452637, "neighborhoods": ["East Garfield Park"], "categories": [["Chinese", "chinese"]], "address": ["1114 S Kedzie Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Good for Groups": "No", "Takes Reservations": "No"}, "longitude": -87.705810546875, "category": "Restaurants", "rating": "2.5", "price": "$", "number_of_reviews": "3"}, "beauty-world-nail-salon-chicago": {"comments": {"1": {"description": "Horrible Went there today and the nail tech was so rough on my hands. I have several small open cuts from him filling my nails down. It was expensive and I was unsatisfied. My nails are cute but I'm in pain. I would not recommend", "rating": "1", "date": [2015, 6, 29]}, "0": {"description": "This is my go 2 spot for my gel nail, for the past 2 1/2 yrs and i ONLY let Bruce, with the grey eyes, do my nails. I dont wear polish, so I'm in & out in 30 mins for a gel fill. The best part is, he does such a wonderful job on my nails, I only need to go every 3 weeks!!!! Where they do THAT at??? I aint goin' nowhere.....as long as he's there, Im there!! Point Blank Period-", "rating": "5", "date": [2013, 3, 21]}}, "latitude": 41.86671, "neighborhoods": ["East Garfield Park"], "categories": [["Nail Salons", "othersalons"]], "address": ["3224 W Roosevelt Rd"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.70672, "category": "Beauty", "rating": "3.0", "price": "$", "number_of_reviews": "2"}, "petes-place-chicago": {"comments": {"3": {"description": "I've gone at least 5 times in the past two months. The portions are still huge and sometimes the food is not consistently the same, but it is good now. They also have decent coffee.", "rating": "4", "date": [2015, 12, 3]}, "1": {"description": "Horrible horrible customer service it almost brought me to tears. Over an hour wait with the rudest staff I've ever encountered", "rating": "1", "date": [2016, 2, 21]}, "2": {"description": "Pretty great steak, egg, and cheese breakfast sandwich. I stop by whenever I'm in Chicago. It's popular amongst locals. Pretty simple little breakfast spot you'd probably stop by on the way to work. I never eat in; always take my food to good.They don't use gloves when handling food though.", "rating": "4", "date": [2015, 7, 28]}, "5": {"description": "What I like about Pete's is the simple menu. Everything is homemade right in front of your eyes. Their famous chopped steak sandwich is a great lunch choice served on white toast. Have them add bacon and egg for the Super Steak sandwich breakfast experience. Try their full or short stack pancakes, they are fluffy! Pete's is open super early but closes during the week around 2pm, its a great spot for early morning commuters looking to grab a bite before work.The owners are always on site and when not busy will chat with you.", "rating": "4", "date": [2010, 3, 26]}, "0": {"description": "This review is for the great food.Service may matter but what matters most is the quality of the food, especially to me.Been here 3 times this month, consistent in the food taste and tried multiple options in the menu.All food served hot, fresh and perfectly cooked.Good place for lunch but I'm not really sure at breakfast, never tried.", "rating": "4", "date": [2016, 2, 22]}, "4": {"description": "Man the Supersteak Sandwhich.....that is it, that is all.....This is a neighborhood gem but be prepared to wait.", "rating": "4", "date": [2014, 7, 5]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.8757362, "longitude": -87.7049484, "rating": "3.5", "times": {"Mon": ["6:00 am", "2:00 pm"], "Thu": ["6:00 am", "2:00 pm"], "Sat": ["6:30 am", "3:00 pm"], "Wed": ["6:00 am", "2:00 pm"], "Tue": ["6:00 am", "2:00 pm"], "Sun": ["8:00 am", "2:00 pm"], "Fri": ["6:00 am", "2:00 pm"]}, "price": "$", "categories": [["Breakfast & Brunch", "breakfast_brunch"]], "address": ["3159 W Van Buren St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Loud", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Breakfast"}, "category": "Restaurants", "number_of_reviews": "6"}, "cvs-pharmacy-chicago-86": {"comments": {"1": {"description": "I am a fan of cvs, since they always have great deals(usually better than walgreens). But this location is very unorganized. I walked in here a couple of days ago, and was greeted by the manager with a really bad attitude. I continued to my shopping list and got the items I went to purchase. Many of the items I was looking for were out of stock, so I approached the manager for help and again I was given bad attitude. I grabbed what I found and continued to check out, the cashier was nice and courteous but the whole time I was at check out the manager was hovering over as if I had stolen something. Employees are nice and friendly but BEWARE of the mean manager!", "rating": "1", "date": [2014, 7, 8]}, "0": {"description": "CVS as a whole is just fine, but beware this location.  Poor, poor service. Incompetent people at the pharmacy counter.  Said they couldn't pull up insurance info (because pharmacist kept typing my info wrong) so my prescription was never filled, even though they said it'd be ready by 2pm.  Just a hassle overall.", "rating": "1", "date": [2015, 11, 15]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.8809805270396, "longitude": -87.7056368674542, "rating": "1.0", "times": {"Mon": ["7:00 am", "10:00 pm"], "Thu": ["7:00 am", "10:00 pm"], "Sat": ["7:00 am", "10:00 pm"], "Wed": ["7:00 am", "10:00 pm"], "Tue": ["7:00 am", "10:00 pm"], "Sun": ["7:00 am", "10:00 pm"], "Fri": ["7:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Drugstores", "drugstores"]], "address": ["3146 W Madison St"], "attributes": {"Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "2"}, "honky-tonk-bbq-chicago": {"comments": {"58": {"description": "To be fair, I have visited Honky Tonk on several occasions to try and conceive what is with all the hype that is built up for this establishment. As a disclosure, I am not a food critic nor a \"foodie,\" I'm just your average American girl with a respect for things well made. How do I begin... First of all, despite what many have claimed about Honky Tonk, I find the place to be rather grimy. Grease seems to linger in the air and when combined with unwashed floor grit, the whole restaurant feels stuffy and out-dated. Oddly, some people seem to care for this feel, I do not. Not in a place that serves food. I've tried several of their meats; I am unimpressed to say the least. Honky Tonk cold smokes their meats and oddly enough, serves the food cold. Like day old, stagnant, luke warm. Anyone that knows anything about true barbecue, knows that good barbecue does not need \"barbecue sauce.\" I have observed the majority of paying customers in this joint smothering their chicken and pulled pork sandwiches with barbecue sauce... And laughing, carrying on with their day. Shameful. Their prices are beyond ludicrous for their sub-par cooking-- 7$ for seven SLICES of fried tomatoes!! Ha! Just... Awful. Anyways, I did enjoy the bands  and ensembles that came through during my visits, and the guys behind the bar are great... Just not great enough for me to return. Ever. If you want decent barbecue try County BBQ, off Taylor street. That place gives you more bang for you buck with good food and less plaid shirts... Oh God, the sea of plaid shirts at Honky Tonk... I still have nightmares. (Hipsters, just remember that you are still in El Barrio).", "rating": "1", "date": [2015, 5, 2]}, "56": {"description": "I would give this restaurant a good rating but they keep running out of food. Don't rely on anything being on the menu.... And they cop an attitude when you question it.", "rating": "1", "date": [2015, 5, 9]}, "29": {"description": "Okay, so this is Chicago and not Texas, so I didn't walk in here expecting an actual Honky Tonk like some folks, but I was looking for good food.  We started off with the fried green tomatoes, which were lightly fried and delicious with the garlic mustard.  For our meals, my husband got one of the meat platters (brisket with mashed potatoes and cornbread) and I got the chili with mac and cheese.  We were both pleased with our meals.  The meat was moist and flavorful, the potatoes were creamy, and the mac and cheese complemented the chili well.  My husband tried all of the sauces (tangy tomato, sweet tomato, and garlic mustard) and liked them all.  So, we were looking for good food and we got it.  We'll definitely be back.", "rating": "4", "date": [2015, 9, 7]}, "42": {"description": "Honky tonk is my ride and die place in Pilsen. My dad and I stumbled upon it several years ago On Wednesday night and immediately when I walked in, I knew this place would be awesome. Since then, we have probably gone there 50+ times, celebrated birthdays and good company. The atmosphere is well worth the visit, and the food just makes everything right. Beware, they do not take reservations - only for groups of 10 or more. And boy this place gets crowded. The pulled pork and smoked chicken is absolutely fantastic. I feel that the servings are generous and if you're with a group, ordering a lot of sides can make it really fun. Love the whiskey drinks and I can't wait to make it back there soon.", "rating": "5", "date": [2015, 7, 20]}, "23": {"description": "I love that they play live music here. Service was great, we had empanadas and the girlfriend salad. They were off the charts specially the salad. I ordered the ribs since I'm regular at green street smoked meats that was hard to follow my ribs were too dry for my taste. The chicken was great though. Love the banana pudding, definitely a solid 4 stars and it's in Pilsen which is my neighborhood. Gotta love great food and great live music", "rating": "4", "date": [2015, 10, 15]}, "47": {"description": "Waitstaff grumpy, irritated, and poor drink menu. After returning to this favorite spot of mine where I love to listen to music, I was suprised by the waitstaff and poor training to maintain a professional attitude through the night.Not only would the bar staff bring out the incorrect drinks, they were upset when you didn't take the incorrect order. The food cam out quickly, but when we would try to enjoy the music dancing, the waitstaff was less than patient.The drink menu has two choices: sugary drinks or bitter drinks. They seem to not know how to balance any cocktail. I know it's a bbq themed bar with 'vintage' inspired drinks, but even bathtub gin didn't taste that bad.Finally trying to wrap up the evening trying to sort out the check, they refused to split the tab and put someone's bar tab on our tables tab after being asked not to. I will not be returning.", "rating": "1", "date": [2015, 7, 1]}, "8": {"description": "3.5 Came here on a Sunday around 4 pm. The place seems spacious. There weren't many customers when we were there but they were slowly strolling in as we ate. Loved the briskets and the huge candied bacon beer was definitely quite interesting. Food came super fast too.", "rating": "3", "date": [2015, 11, 19]}, "31": {"description": "Gentrification at its finest!!! If u want a real gentrification experience go to the honky tonk and u will surely get it! It's filled w hipsters who are taking over Pilsen and their wealthy parents who are visiting them. It was pretty sad to sit there and experience that when all we wanted was some barbecue, which by the way was mediocre at best. The food took about 30 minutes to reach us and when it did it was cold:( yes cold Mac n cheese how can that happen? Well maybe it was bc our waitress kept gazing out the window instead of checking to see if our food was ready. It was really disappointing,  if u want good barbecue I recommend husky hog on 31st st as it's delicious!!  The only good thing here was the candy bacon, but I would never go back again :(", "rating": "1", "date": [2015, 8, 26]}, "34": {"description": "I had high hopes, the smell outside is awesome.  I wandered in before concert at Thalia Hall. Asked my server if  the tips or the brisket was best, he suggested tips, which i love.....done correctly.  They were dry and tough...a bit overdone to say the least.  They wouldnt tear apart...very much like low grade jerky.  The sides of greens and garlic mashed were really good so i might suggest keeping the cook of those and getting a new meat chef. Overall, id say half the tips were edible, the rest, would be suitable for my pooch, if I had one, and i was mad at him.  Service was good..but I wont be back..my suggestion is the cook should travel the US to find the true potential of smoked meats, because this example was not it.  Pass", "rating": "2", "date": [2015, 8, 18]}, "16": {"description": "I love that they play live music here. Service was great, we had empanadas and the girlfriend salad. They were off the charts specially the salad. I ordered the ribs since I'm regular at green street smoked meats that was hard to follow my ribs were too dry for my taste. The chicken was great though. Love the banana pudding, definitely a solid 4 stars and it's in Pilsen which is my neighborhood. Gotta love great food and great live music", "rating": "4", "date": [2015, 10, 15]}, "13": {"description": "Bacon Candy- must get enough for at least half a piece for everyone, we had a piece for everyone and I was in love but felt like it was crazySampler- crazy huge. Wasn't crazy about the chicken but the ribs and hot links were delishOne of the salads- meh, could have passed on itI wanted all of the sweets but didn't have any space. We all left with some leftovers! The live music is cool but the service isn't that great. I don't think I'll be back but glad we checked it out.", "rating": "3", "date": [2015, 5, 28]}, "11": {"description": "Music good, service good.  Bbq was not top notch as I've had better from being from the south.  But ok for Chicago.  Good prices.  Drinks were the best!", "rating": "4", "date": [2016, 1, 17]}, "39": {"description": "I enjoyed our dining. The decor gave us lots to talk about. Our waitress was awesome. The food was good. My family member that is a vegetarian had things to choose from. Perfect fit for a chill/relaxing evening.", "rating": "3", "date": [2015, 8, 2]}, "37": {"description": "VERY NICE .... atmosphere was very enjoyable .... loved the music / band was great!  Dancing was added plus! FOOD WAS A+ .... a MUST TRY is the SUPER-SIZE SAMPLER PLATTER!  **Huge sampling of Dry-Rubbed Ribs / BBQ Chicken (loved the smoke) / Smoked Links / Cole Slaw / Sky-High Stacked Pulled Pork Sammies (they didn't last long on our table of 2 men 3 women). Corn-Muffin was to die for --- yummmmmm! ALSO TRIED .... RIB TIPS --- portion was more than enough to share --- loved them! *try sweet BBQ sauce as side splash!!  ....MAC & CHEEZZEEEE --- my grand-daughters favorite!! .... BRISKET --- was fabulous!!ONLY DISAPPOINTMENT .... the beans never showed up on our platter!! YES --- I'L BE BACK", "rating": "5", "date": [2015, 8, 14]}, "0": {"description": "Honky Tonk BBQ is definitely a restaurant that will not disappoint! I've had the pleasure to visit this place a couple times with a large group of friends - easy and oh so yummy! My Boyfriend and I were so fortunate to host Boston Globe Best Seller Kyle Darcy while he visited Chicago for the weekend. We thought, where can we take him??? It wasn't long for us to decide on Honky Tonk! This restaurant has never disappointed us and each time we've visited the live entertainment has always made our visit even more memorable!Parking in the area is a real BITCH, especially in the winter it's a COLD BITCH, prepare yourselves... It's so worth it!Upon entering we were greeted and quickly seated with no problem! Our drink orders taken and shortly after receiving the men were ready to order their meat platter! More than enough for two growing men!!! I went with the Fried Green Tomatoes and the Mac & Cheese, more than enough for little me!Everything was perfect! You'd expect to wait forever for your food but that's not the case when it comes to Honky Tonk! They really make it a point to keep their customers happy and most importantly fed! We waited no more than 10 minutes and everything came out fresh and tasty! We were very pleased with everything and our special guest enjoyed the food and entertainment! Definitely a highlight of his visit and we are surely going to bring him back the next time he visits. I should mention that being a VEGETARIAN, Yes that's right, I absolutely love this place! The fact that there are options for me is huge! Come in for the BBQ and definitely make it a point to try their sides, you will not be disappointed. The fact that Honky Tonk keeps me well fed and satisfied says a lot! Hard to believe a Vegetarian loving a BBQ joint, it's possible and especially when it comes to Honky Tonk. Check it out, groups, intimate date night... expect to enjoy yourselves and leave with a full and satisfied belly! ENJOY!", "rating": "5", "date": [2016, 2, 17]}, "38": {"description": "Came here a few months ago with a few friends. I just remember the bacon candy was the bomb dot com- seriously, so delicious. The sampler was huge and the ribs were on point. I even thought the salad was good the next day for lunch. If I'm in the area, I'd come back for some BBQ.", "rating": "4", "date": [2015, 8, 6]}, "51": {"description": "I sampled some rib tips from this restaurant at the Pilsen Food Truck Social. They were okay, but the meat didn't have much flavor to it. I did like the Carolina mustard sauce they had out. It made it a bit better, but I've honestly had better ribs and better sauces from other restaurants. I wouldn't go out of my way to eat here.", "rating": "3", "date": [2015, 6, 8]}, "27": {"description": "This place has such a cool feel with live music and I really liked the food. Worth a visit!", "rating": "4", "date": [2015, 9, 15]}, "32": {"description": "To me, walking in here felt like walking into a random local country joint on a road trip, which I kind of liked. There were an assortment of random photos on the walls, and it looks like there was live music on some days, but we didn't come on one of those days (or at the right time). Wanted to come to try the barbecue. We ended up getting the sampler platter, which includes ribs, 1/2 smoked chicken, 2 dinky dunkers (pork and brisket sliders), 2 hot links, beans, coleslaw, and corn muffins. I know, ambitious for 2 people. The hot links and the dunkers were delicious. I was a fan of the BBQ sauce as well. I usually don't like cornbread at all, but my boyfriend thought it was one of the most delicious things he had there. The ribs were a little dry and overdone, and I didn't enjoy they as much as I could have. The chicken was similar.The service was a little slow, but not too bad. For drinks, they had an Old Style beer that came with candied bacon which I was tempted to try, but ultimately decided against. Maybe next time.", "rating": "3", "date": [2015, 8, 20]}, "54": {"description": "We give up.", "rating": "1", "date": [2015, 5, 21]}, "48": {"description": "Honky Tonk is a solid bbq place in the Pilsen area. My coworkers come here every Wednesday for Trivia night, so I decided to come join them yesterday. The restaurant is dark and really long, with a center stage for live music and where trivia announcing takes place. I came here quite hungry and ordered a whole order of smoked chicken. The chicken was moist, and the skin was nice and crispy. Each half chicken was placed upon half a hamburger bun, which I though was kind of odd considering there would be no way to eat it like sandwich (bone and all).What was odd about their dishes is that none of the smoked meats or sandwiches come with a side. What??? And in order to get a side, you'd have to cough up 3.50 for the regular size which stinks. They should at least offer a side at discount if you order one of those meal plates. Sadly, this is not the case. Trivia was really fun though. They have some crazy hard questions that require knowledge of current events, with a pretty big focus on literature and geography. Bring your worldly friends and you might stand a chance!", "rating": "3", "date": [2015, 6, 25]}, "44": {"description": "Aye.. . Kinda disappointed.  Was recommended highly by my chef and food snob friends. Food cold . .all of it. Great taste to baby back.ribs just wish it was not cold. Even mac and cheese was cold how u mess that up beyond me. Waitress awesome Heather was her name. Great drinks great atmosphere.  .will give it one more shot other wise off my list and county bbq still #1.", "rating": "2", "date": [2015, 7, 11]}, "24": {"description": "As I literally sit in this place, for probably the 100th time, I realized I've never reviewed it! So here I am. Eating what I'm about to talk about...This is the one BBQ place in town that I keep going back to. The atmosphere, the food(!), and the service - will all keep you coming back. And the fact that there is great blues/jazz every Sunday (with The Fat Babies), and really good trivia every Wednesday, there's reason upon reason to make this a regular spot.There are a lot of ways I could approach talking about the food, so I'll just say what you should get when you come here - ideally with two people. First, both of you should have a Bacon & Brew. It's one of the \"not to be missed\" (NTBM). Next, one should get the Texas Brisket Chili + Mac & Cheese (aka ChiliMac, with extra/additional side of the Mac if you're really hungry); and the other should get The Delux with both meats. The Hot Link is also a NTBM, so you may want an extra one of those. For side, the coleslaw is a little different and good, or the beans (which has more meat, in case you wanna go with the theme of my review). Then I'd breathe, and prepare yourself for banana crack: The Banana Pudding (NTBM). Also the Blueberry Cobbler, if they have it. But for sure, the Banana.A word on the service, it can get busy, so sometimes you might need to be nice and patient. Other times, just nice. All depends on the day. Sometimes they do run out of the Bacon Candy and Hot Link on extra busy nights, so be prepared for temporary heartbreak. But that just means you'll have to come back again, and again, and again, and...", "rating": "5", "date": [2015, 10, 15]}, "7": {"description": "My husband and I tried their sampler platter and while it was definitely enough food we should have gotten an order of flavor as well because everything on that platter was bland.  Even a liberal application of their bbq sauces did not help as they were lacking in flavor as well.  Ribs and chicken were dry, pulled pork unremarkable, brisket the winner (and that's not saying much) and their beans tasted like a can of pinto beans dumped into a cup. Bacon candy was tasty and the service was good (hence the two stars instead of one).", "rating": "2", "date": [2016, 1, 30]}, "49": {"description": "They never disappoint. Food is terrific, had the girlfriend salad last night with brisket, great sauce. I have never experienced a nicer, friendlier, sincere wait staff/bartender crew. Been there several times, same consistent attitude. Crowd is eclectic which I love. Music always outstanding, last night the Fat Babies for father's day.Oh, almost forgot.....3 dollar PBRs VT 4 bucks...c'mon this place is the best", "rating": "5", "date": [2015, 6, 22]}, "40": {"description": "The girlfriend and I were in town from the Twin Cities for a little vacation and sightseeing. After a long and humid day, we were ready to end the night with a nice dinner.I used an app that finds restaurants that were featured on the Food Network and found Honky Tonk BBQ. After a longish bus ride from Willis Tower, we made it to the neighborhood. It's located in what seems to be an up and coming area. As we walked toward the restaurant, we were beckoned by the sound of live 1920s jazz music. The door was propped open and we could hear that a good time was to be had inside.We entered the bar which was packed and very loud with the music and customers. The bar is smallish with very loud acoustics. The large sound system could have definitely been turned down by 20%. Aside from the noise, the ambiance was excellent and very cool. The band was great. The bar was dimly lit, full of random photos and oil paintings, and a beautiful old wooden bar. Unfortunately, it was also swelteringly hot inside. It appeared that the bar was being cooled by window unit air conditioners that were clearly inadequate for the room. Everyone I saw in the bar, ourselves included, was noticeably sweaty.We were unable to find any staff initially but knew we wanted to stay despite the heat and noise. This was an authentically cool Chicago bar.Eventually we sat ourselves at an unbussed table and a friendly waitress later came to clear the table and serve us. We both ordered pulled pork sandwiches and an order of the garlic mashed potatoes. My girlfriend ordered a gin and tonic. When the food arrived we were very pleasantly surprised. While many other pulled pork sandwiches served at other restaurants tend to be greasy, runny, and sloppy to eat, this one was nice and tender but dry; perfect to add their house made BBQ sauce. They had both a sweet and tangy barbecue sauce. Both were excellent. I preferred the tangy even though I'm generally averse to spicy foods and sauces. The girlfriend enjoyed her G and T's though they were slow to be refilled. The garlic mashed potatoes were not runny like some restaurant mashed potatoes and they appeared to be made from scratch.We both thought the meal was delicious and particularly enjoyed their sauces.Even with the oppressive heat and loud noise and so-so service, the food and ambiance were both so great that we will definitely be back next time we're in town.", "rating": "4", "date": [2015, 7, 28]}, "53": {"description": "The restaurant is conveniently located in Pilsen and is easy to reach. The drinks were good but, watered. The BBQ was over cooked and rubbery. It didn't have much flavor and the baked beans were disgusting. The muffins were cold and the service was mediocre. I would pass if you are looking for real BBQ.", "rating": "2", "date": [2015, 5, 22]}, "30": {"description": "The Honky Tonk BBQ is a lively and colorful restaurant with good bbq, great sauces, and great entertainment. I recommend the sausage links which are flavorful and juicy,  as well as the bbq pork- melt in your mouth good. Avoid the baked beans which are regularly unercooked and served in a watery base, and the chicken/ribs are cooked long before the night shift so they can be dry. We ordered the sample platter and had enough food for 2 people for 3 meals :]", "rating": "4", "date": [2015, 8, 27]}, "46": {"description": "I looked to ddd for some spots to check out on my visit to chicago.....and i almost didn't try this one, but fortunately some friends wanted to eat and when I mentioned it ....they were in. WoW!! I'm so glad we did! Delicious bbq -  the garlic mustard was a nice addition to the savory food. I'M ALSO RECOMMENDING THE BANANA PUDDING....BEYOND Yummy!!!!...I'm not even a banana fan, but it was decadent and heavenly...truely.  the wait staff was matter of fact, but attentive and never left us looking around for them.  If you want good ol timey tunes and southern bbq charm with the savory food to back it up then come here on your visit or for a night out! Love you honky tonk!!....and of course your scrumptious bananna pudding ;)", "rating": "5", "date": [2015, 7, 1]}, "1": {"description": "Bacon candy....need I say more? No, but I will. The beau and I dined here on an extremely cold and rainy Tuesday evening. I thought to myself the place wouldn't be crowded because of the dismal weather, but I was wrong. Honky Tonk embodies all that bbq and Pilsen is, and should be. It's slightly hipster, but extremely authentic, down right, damn good barbecue.Naturally we ordered two old fashioneds. They were delicious and had a fun twist. There were orange bits on the bottom and a slightly cinnamon-y after taste. Of course we ordered the bacon candy...which is exactly what it sounds like: candied bacon. YUM...it paired perfectly with our drinks. For our mains we tried the brisket, pulled pork, a hot link, Mac n cheese, and the coleslaw. The brisket, hands down, is the best I've ever had. Tender is an understatement! If you come here and do not order the brisket then you are doing it all wrong. The pulled pork was also super yummy and flavorful....along with the juicy hot link. Ugh and the sauces...just heaven. Something for everyone: sweet, smokey, and a garlic (ish) one. The Mac and cheese was creamy and cheesy deliciousness and the slaw was good too...very vinegar based if that's your thing. Honkey Tonk is a legit bbq joint. There's even live music! 5 stars for service, food, and ambiance. I've already told all my coworkers we have to dine here for lunch....ASAP!", "rating": "5", "date": [2016, 2, 5]}, "55": {"description": "I went and had the ribs and chicken combo and was so surprised at how subpar the BBQ sauce an meat was. Thats it. Service was fine; beer and decor nice but food way overrated. Sorry to be a downer everyone!", "rating": "2", "date": [2015, 5, 20]}, "9": {"description": "Honky Tonk is a solid bbq place in the Pilsen area. My coworkers come here every Wednesday for Trivia night, so I decided to come join them yesterday. The restaurant is dark and really long, with a center stage for live music and where trivia announcing takes place. I came here quite hungry and ordered a whole order of smoked chicken. The chicken was moist, and the skin was nice and crispy. Each half chicken was placed upon half a hamburger bun, which I though was kind of odd considering there would be no way to eat it like sandwich (bone and all).What was odd about their dishes is that none of the smoked meats or sandwiches come with a side. What??? And in order to get a side, you'd have to cough up 3.50 for the regular size which stinks. They should at least offer a side at discount if you order one of those meal plates. Sadly, this is not the case. Trivia was really fun though. They have some crazy hard questions that require knowledge of current events, with a pretty big focus on literature and geography. Bring your worldly friends and you might stand a chance!", "rating": "3", "date": [2015, 6, 25]}, "26": {"description": "Stopped here on our way to downtown. Good food and great service and lots of outdoor seating. The portions are huge so plan on splitting a meal or taking some home. We had ribs and brisket and loved the Mac & Cheese.", "rating": "4", "date": [2015, 10, 4]}, "25": {"description": "I've come to the Honky Tonk a couple times, and let me say nothing pleases me more than the name.  Any place with vigor in it's name is worth a visit.  The food at the Honky Tonk is to be tried.  It's all BBQ and it's a great variety of meat to sample.  It's like BBQ and Southern and vintage decor all wrapped into one establishment.  The ribs are good, flavorful, and filling.  The corn muffins are a smart choice...right on point with flavor and texture.  A nice treat or an accompaniment to a meal. Wednesday nights there is Trivia; throughout the week there is live music as fun background to your meal and company or the main entertainment of your evening.  If the music doesn't draw your eye, step to the back and take a look at the walls; there is a lot of decor to be viewed as sheer kick to the evening.  Grab your partner and saunter on in!", "rating": "3", "date": [2015, 10, 5]}, "12": {"description": "Honky Tonk is a-okay--for average, not awesome. I got the green tomato BLT, which should actually be called the fried green BLT for \"fried green (bacon lettuce) tomato\" because it's two fried green tomato patties in slider buns! Genius, brilliant brilliant idea, but delivery fell just a little flat. The fry batter was average--on the onion ring batter spectrum rather than the country fried chicken spectrum. I think it should be the latter. The $2 extra goat cheese is goat cheese crumble in a little cup? Not a goat cheese spread on the actual sandwich, which I thought was a little strange and over-priced.The mac and cheese is unique. It definitely has a sour spank and spice that makes me think of \"buffalo mac and cheese,\" but I'm not sure it actually has buffalo sauce in it. It's definitely different. The maple syrup encrusted bacon is decent, too, but doesn't come out piping hot. It's a little cold and dry on presentation, more like a maple syrup glazed beef jerky.I'm also a sweet tea snob, and their sweet tea tastes like Nestea... not sure if they just need to buy some better tea or what. But definitely on the cheap tea side, which... come on, this ain't no honky tonk! Oh... wait...Overall, I would go back for late night dive food, but it's not like Green Street. Green Street is definitely on a different caliber of high quality, fresh preparation and presentation. Honky Tonk really is... maybe just more like a honky tonk.", "rating": "3", "date": [2015, 8, 15]}, "59": {"description": "The sides were great but all the meat was so dry. Also there was a hair in my mashed potatoes. I get it...sometimes it happens but the meat just killed it for me. First time they opened it was great and now not so much. Baby back ribs I literally broke apart and they sounded like styrofoam. I try to give everything a chance so I have gone back a few times but really every time after the first has sucked. I don't get it everyone else's pic looks juicy but then I order it and it as hard as a rock. The taste of the ribs were good but they were so hard and there was barely any meat on them. It's almost as if they had been sitting out then thrown into the microwave.  My kids had the pulled pork sandwich and no matter how much bbq they added they still said it was so dry. When we first walked in no one even acknowledged us and it was empty! The waiter was really nice and helpful but I really only enjoyed the appetizers and the sides. That sucks tremendously because it's a bbq place but...oh well.  Oh and as cute as the high Chairs are, they're not very safe. My kid just pushed the tray right off and there was no belt on it.  So disappointed I really wanted to take my godmother out to a good bbq before she left town again. I want to say I'll give it another try but this has been our third time there and no improvement. I do like to support local business so I am sad but this is the second time they serve me dry meat.", "rating": "2", "date": [2015, 4, 30]}, "21": {"description": "Food is actually pretty good. Service is extremely slow and waitresses seem to be having trouble handling their job, so I won't be coming back. After our already slow service, we were held hostage by our waitress for 20+ minutes waiting for our check. We asked her twice, and one of the other waitresses once as well before we finally were able to pay and leave. I don't think I've ever had so much trouble getting a check or leaving a restaurant. If you have somewhere to go at a specific time, say the 800 seat concert venue down the block, this is likely not a good option for you. They aren't prepared for the extra influx of customers coming to events in the neighborhood. Another thing to watch out for, sandwiches come with nothing, it's just a sandwich. Sides are about $3.50 extra. Strange for a seated restaurant, I expected fries or cole slaw or something...", "rating": "1", "date": [2015, 11, 4]}, "17": {"description": "There is live music some night. Drinks are excellent. Ribs were very tasty. I wanted all the side dishes!", "rating": "4", "date": [2016, 1, 27]}, "10": {"description": "Honky Tonk gets 4 stars overall. As a restaurant alone, they'd probably be in the 3 star range. As a music venue that serves food, definitely 5 stars compared to other venues I've been to. The trivia is great too.As a restaurant, the service is on the slow side, the food is a bit pricey, and the fact everything is a la cart is a bit annoying at the price point. The BBQ is not terrible, but also not anything to write home about. It's better than ab famous Dave's, but no where near Smoque. Only exception is the fried green tomatoe BLT. It is by far the best thing on their menu and can go toe to toe with any sandwich in the city and only $8.50. The pint and candied Bacon for $6 is also a steal.As a music venue or trivia pub, the food is much better than any other competing place. The prices are lower than most price gouging venues and much higher quality.Basically, if you're looking to spend a few hours with friends listening to music or playing trivia (free on Wednesdays 8:15 PM with prizes!) This place is perfect. They don't make you feel rushed and are infinitely better than the competition.If you want to grab a meal in 30 minutes and are looking for speedy service and best cost/quality, this isn't the place for you.", "rating": "4", "date": [2015, 11, 8]}, "5": {"description": "One of the best restaurants in town. Love the variety of their menu. Clean and organized. People are very nice and friendly. Reasonable price.", "rating": "5", "date": [2016, 2, 25]}, "3": {"description": "Ordered the ribs for delivery took 2 hours....  Tried the ribs...  Dry as if it was in a heated oven for a long period of time.  24 dollars for a full rack of low quality dried ribs makes me think twice before trusting this restaurant again.   You've been kindly warned.  Do not order delivery it's not worth the wait it's absolutely disgusting it's so bad that I would rather grab ribs from Mariano's....", "rating": "1", "date": [2016, 2, 24]}, "35": {"description": "after reading reviews this was on our must try list.  food was not good at all, brisket was mushy and fatty.  hubby had 1/2 slab baby back.  he felt they were a bit overdone but I liked.  the slaw was strong vinegar based and mac/chz was riotoni with cheese.  had chili for appetizrr, very tasty but served plain.  our drinks came with food.  server was pleasant but really slow", "rating": "3", "date": [2015, 8, 15]}, "19": {"description": "As I literally sit in this place, for probably the 100th time, I realized I've never reviewed it! So here I am. Eating what I'm about to talk about...This is the one BBQ place in town that I keep going back to. The atmosphere, the food(!), and the service - will all keep you coming back. And the fact that there is great blues/jazz every Sunday (with The Fat Babies), and really good trivia every Wednesday, there's reason upon reason to make this a regular spot.There are a lot of ways I could approach talking about the food, so I'll just say what you should get when you come here - ideally with two people. First, both of you should have a Bacon & Brew. It's one of the \"not to be missed\" (NTBM). Next, one should get the Texas Brisket Chili + Mac & Cheese (aka ChiliMac, with extra/additional side of the Mac if you're really hungry); and the other should get The Delux with both meats. The Hot Link is also a NTBM, so you may want an extra one of those. For side, the coleslaw is a little different and good, or the beans (which has more meat, in case you wanna go with the theme of my review). Then I'd breathe, and prepare yourself for banana crack: The Banana Pudding (NTBM). Also the Blueberry Cobbler, if they have it. But for sure, the Banana.A word on the service, it can get busy, so sometimes you might need to be nice and patient. Other times, just nice. All depends on the day. Sometimes they do run out of the Bacon Candy and Hot Link on extra busy nights, so be prepared for temporary heartbreak. But that just means you'll have to come back again, and again, and again, and...", "rating": "5", "date": [2015, 10, 15]}, "28": {"description": "Cool spot in Pilsen to unwind. I had some appetizers and a beer there one night Everything was excellent. They had some intresting videos rolling and plenty of space. I've been to some places where there is literally no elbow room. The Honky Tonk is a big comfortable hang out environment for all types. I had fun and the prices weren't outrageous. Bring your friends.", "rating": "5", "date": [2015, 9, 13]}, "45": {"description": "Well, I've given them a fair shake many times, and the experience and food just seems to be getting worse. I'm in the neighborhood, and I call in an order- the Fried Green Tomatoes, a large side of macaroni and cheese, and an order of the Dinky Dunkers, both of which I wished to be Brisket (Important fact for later). They tell me about fifteen to twenty minutes. Sure. I walk on over there, wander through to the back, and they get my bag together, put in a big ol shopping bag with handles. Total comes out, $35. Did I order something else and forget it? I don't know. I pay, check the bag, seems like everything's there, go home to eat. When I get home, I open the bag, and there were two orders of brisket sandwiches, which of course explains the extra upcharge. I'll eat them, whatever. It might have been my mistake in not articulating my order properly. I hand over the Fried green tomatoes to my lady friend, who looks at them, all burnt like, takes a bite, shakes her head, and tries another one. Just as bad. No seasoning, and they're using red tomatoes. Oh, what's that on the side? It comes with cocktail sauce? At a BBQ joint? What? Strike 2.If they're serving a large side of Macaroni in a pint container and filling it up 2/3 of the way, I'm not getting it again. I've been here before, and the food has been average, especially the meats. Smoke them correctly, slice your brisket thinner, pull the pork to order so it stays more moist, and either trim the gristle or learn how to make burnt ends. It's obscene.The entertainment is nice. I'm glad they have that going for them, because the drinks can't cover up for how poor the food is, and it's only getting worse. Sorry, guys. Gotta go.", "rating": "2", "date": [2015, 7, 2]}, "33": {"description": "This is a great option for a vegetarian and a meat eater seeking good BBQ.   The meat eater had the rib tips with vinegar based slaw and loved every bite.  He even said it was better than the BBQ that I brought back from the heart of Texas!  Wow!   The veggie eater had the Green tomato BLT with portobello mushroom substituting for the bacon with a side of Mac and cheese.  It was amazing and I loved it so much that I saved half of it to have again the next day.   A must for any veggie lover.   We concluded with peach cobbler and banana pudding. Both of which were fabulous.   Add this place as a mmajor local must do in the Pilsen area!  In a word- YUM!NOTE: They have live music most nights so be ready for some music while dining.  Also there are lots of meters street parking in the area.   Chitown Veg Gal", "rating": "4", "date": [2015, 8, 19]}, "43": {"description": "Honky Tonk created the best wedding weekend ever! Karie and Willie go above and beyond to ensure amazing customer service. All of our guests raved about the food!!! And when the day started out it with a crazy thunderstorm, Karie stepped up to help make sure our day was still perfect. Perfect venue, amazing food, and excellent waitstaff!!", "rating": "5", "date": [2015, 7, 20]}, "2": {"description": "Honky Tonk is a barbecue place in Pilsen. Came here for dinner before the Pilsen Art Walk and was pleasantly surprised. They had live music that night. I had the rib tips and they were moist and smokey. My friend had the viking beef short ribs. It was a giant chunk of meat on a bone and was perfectly tender. We both enjoyed the meal and will be coming back.Street parking wasn't too hard to find.", "rating": "5", "date": [2016, 2, 4]}, "18": {"description": "VERY NICE .... atmosphere was very enjoyable .... loved the music / band was great!  Dancing was added plus! FOOD WAS A+ .... a MUST TRY is the SUPER-SIZE SAMPLER PLATTER!  **Huge sampling of Dry-Rubbed Ribs / BBQ Chicken (loved the smoke) / Smoked Links / Cole Slaw / Sky-High Stacked Pulled Pork Sammies (they didn't last long on our table of 2 men 3 women). Corn-Muffin was to die for --- yummmmmm! ALSO TRIED .... RIB TIPS --- portion was more than enough to share --- loved them! *try sweet BBQ sauce as side splash!!  ....MAC & CHEEZZEEEE --- my grand-daughters favorite!! .... BRISKET --- was fabulous!!ONLY DISAPPOINTMENT .... the beans never showed up on our platter!! YES --- I'L BE BACK", "rating": "5", "date": [2015, 8, 14]}, "41": {"description": "This review is solely for their catering service- disregard if you're not planning a wedding or event. My two dear friends got married at Colby Barn in Grayslake and and asked me to coordinate their reception. Beth was the person I worked with most. In terms of professionalism, problem solving, and flexibility, I cannot say enough good things about the team they sent. Not only were they efficient and attentive, they went beyond the expectations of a caterer. When the car full of decorations arrived an hour late (leaving only an hour to decorate from scratch) they all pitched in to help. They decorated the tables, and Beth was in the kitchen cutting and arranging flowers with us. I wouldn't have survived without them. They were constantly asking what else they could do to help out. In terms of the food, I can't totally speak to the quality because I was the last table to eat, so the chicken was a little dried out. However, the BBQ sauce, candied bacon, and Mac and cheese were yummy.", "rating": "4", "date": [2015, 7, 26]}, "52": {"description": "Bacon Candy- must get enough for at least half a piece for everyone, we had a piece for everyone and I was in love but felt like it was crazySampler- crazy huge. Wasn't crazy about the chicken but the ribs and hot links were delishOne of the salads- meh, could have passed on itI wanted all of the sweets but didn't have any space. We all left with some leftovers! The live music is cool but the service isn't that great. I don't think I'll be back but glad we checked it out.", "rating": "3", "date": [2015, 5, 28]}, "50": {"description": "The food is amazing! Fried Green Tomatoes, candy bacon topped off with a mason jar of moonshine! It a gotta go place when we are in Chicago!", "rating": "5", "date": [2015, 6, 21]}, "4": {"description": "Full disclosure - as my profile states, I'm a transplanted Southern boy, raised 40+ years on pork barbecue, Carolina collards and Momma's 'nanna pudding. So, like a true North Carolina pig pickin', this might get a bit sloppy.The menu is pretty simple: an selection of sandwiches featuring pork, brisket or smoked chicken, or try a combination platter of the same, ranging from $14 -$33, depending on additional sides. There was a token, albeit very tasty, portobello mushroom sandwich topped with collard greens.Upon arrival, my beef brisket Delux Platter ($16) sent off as many mixed signals as the restaurant's décor - despite no visible smoke ring on the large mound of meat, the two top pieces were perfectly succulent and tender, glistening with just a touch of grease, and sprinkled with a dash of paprika-tinted rub. Unfortunately, the meat tucked below the trophy peak of goodness was gray and lifeless, impossible to tug apart and void of any discernible flavor, good or bad. The meat on the brisket sandwich our friend ordered looked much nicer, and was, enviously, more juicy. The pulled pork sandwich has subtle smoke flavors, a distinctive smoke ring, but the rock-hard roll was a simple throwaway.Unfortunately, not even the barbecue sauces could revive the monotone meats; a hat tip to South Carolina, the mustard-based sauce was tangy with a hint of honey, white vinegar and a queer note of raw garlic. The two ketchup-based sauces, while described by the waitress as \"one hot, one not\", tasted almost identical. I would guess the large squeeze bottle was a tad sweeter, maybe from a dollop of molasses - the second featured more vinegar and maybe a pinch of red pepper. The side dishes were also a conundrum - both bowls of macaroni and cheese were ice cold on the top, yet steaming hot on the bottom. I not sure what linear shift in the space-time continuum causes such a temperature inversion, but it made for a lively discussion at our table. Sadly, the béchamel cheese sauce was flour-y and bland. The coleslaw, however, had a definite tang and crispness. The bowl of collard greens brought the meal to a complete halt. The green's \"pot liquor\" had a distinct taste of tobacco, or \"bong water\", as described by one taster. And while a tobacco leaf in collard pot isn't completely unheard of, I seriously doubt that was the case.The service was unremarkable; our food was delivered in less than 20 minutes and the dirty utensils and half-eaten plates of barbecue were cleared without comment. We'll give the place another try just to make sure it simply wasn't an off night for the pit master.", "rating": "2", "date": [2015, 11, 6]}, "6": {"description": "My husband and I popped in here randomly last weekend to grab some dinner before a show at Thalia Hall, and THE STARS WERE ALIGNED THAT NIGHT, friends. We feasted like kings... Carnivorous kings. If there are three-to-four of you, order the Sampler Platter. If there are only two of you, order the Sampler Platter and brace yourselves. If there is only one of you, order the Sampler and bring a book and stay there all night if you have to in order to enjoy all of the meat blessings about to be bestowed upon you momentarily. This thing is huge, friends. It comes with:- Half of a chicken. HALF. That's a lot of meat!- A rack of ribs!- Two brisket sliders! (Don't let the word \"sliders\" throw you... They're pretty much full-sized sandwiches)- Two sausages! - Coleslaw!- Beans!- Two cornbread muffins with butter! And we stupidly ordered an extra side of mac 'n' cheese to go with this meaty bonanza. And we ate it too.At this point, I'd like to mention I'm from Texas. I approve of this BBQ. More importantly, I approve of their brisket. And their sauces. Their sauces are legit! And they pair nicely with a crisp Lone Star, WHICH THEY ALSO SERVE! In conclusion, Honky Tonk BBQ = meat heaven, and you should definitely go there and bring lots of friends. The End.", "rating": "5", "date": [2015, 12, 15]}, "22": {"description": "When Bad Service Ruins Good Food.I was walking by with a friend in the Holiday Inn downstairs lobby (by the Merchandise Mart) where sometimes they have local restaurants sell food during lunch time. This is when I noticed Honky Tonk BBQ had a stand up. Being a big fan of pulled pork I decided to give it a try, at first, the guy over the counter actually serving the food had excellent customer service, but it was then when I had to pay where it went sour. The female cashier (blonde short hair FYI) had a very rude tone when I asked her about the type of sauces they had. Ignoring the rudeness, I sat down and ate my delicious sandwich. While eating, and being a few feet away from the cashier I continued hearing the same rude tone towards other customers, that's when bad service ruined the food. It is amazing how one employee could not only ruin a meal, but how the rude service completely consumed the conversation. Being that, it is important to be clear, the food was excellent but the employees attitude created a tainted image for Honky Tonk BBQ. Overall, will never eat at one of the local stands or restaurants because of this experience.", "rating": "1", "date": [2015, 11, 3]}, "15": {"description": "I've come to the Honky Tonk a couple times, and let me say nothing pleases me more than the name.  Any place with vigor in it's name is worth a visit.  The food at the Honky Tonk is to be tried.  It's all BBQ and it's a great variety of meat to sample.  It's like BBQ and Southern and vintage decor all wrapped into one establishment.  The ribs are good, flavorful, and filling.  The corn muffins are a smart choice...right on point with flavor and texture.  A nice treat or an accompaniment to a meal. Wednesday nights there is Trivia; throughout the week there is live music as fun background to your meal and company or the main entertainment of your evening.  If the music doesn't draw your eye, step to the back and take a look at the walls; there is a lot of decor to be viewed as sheer kick to the evening.  Grab your partner and saunter on in!", "rating": "3", "date": [2015, 10, 5]}, "57": {"description": "spicy sausages were amazing, and i had the sampler. I would go back just for the sausage.", "rating": "4", "date": [2015, 5, 5]}, "20": {"description": "Full disclosure - as my profile states, I'm a transplanted Southern boy, raised 40+ years on pork barbecue, Carolina collards and Momma's 'nanna pudding. So, like a true North Carolina pig pickin', this might get a bit sloppy.The menu is pretty simple: an selection of sandwiches featuring pork, brisket or smoked chicken, or try a combination platter of the same, ranging from $14 -$33, depending on additional sides. There was a token, albeit very tasty, portobello mushroom sandwich topped with collard greens.Upon arrival, my beef brisket Delux Platter ($16) sent off as many mixed signals as the restaurant's décor - despite no visible smoke ring on the large mound of meat, the two top pieces were perfectly succulent and tender, glistening with just a touch of grease, and sprinkled with a dash of paprika-tinted rub. Unfortunately, the meat tucked below the trophy peak of goodness was gray and lifeless, impossible to tug apart and void of any discernible flavor, good or bad. The meat on the brisket sandwich our friend ordered looked much nicer, and was, enviously, more juicy. The pulled pork sandwich has subtle smoke flavors, a distinctive smoke ring, but the rock-hard roll was a simple throwaway.Unfortunately, not even the barbecue sauces could revive the monotone meats; a hat tip to South Carolina, the mustard-based sauce was tangy with a hint of honey, white vinegar and a queer note of raw garlic. The two ketchup-based sauces, while described by the waitress as \"one hot, one not\", tasted almost identical. I would guess the large squeeze bottle was a tad sweeter, maybe from a dollop of molasses - the second featured more vinegar and maybe a pinch of red pepper. The side dishes were also a conundrum - both bowls of macaroni and cheese were ice cold on the top, yet steaming hot on the bottom. I not sure what linear shift in the space-time continuum causes such a temperature inversion, but it made for a lively discussion at our table. Sadly, the béchamel cheese sauce was flour-y and bland. The coleslaw, however, had a definite tang and crispness. The bowl of collard greens brought the meal to a complete halt. The green's \"pot liquor\" had a distinct taste of tobacco, or \"bong water\", as described by one taster. And while a tobacco leaf in collard pot isn't completely unheard of, I seriously doubt that was the case.The service was unremarkable; our food was delivered in less than 20 minutes and the dirty utensils and half-eaten plates of barbecue were cleared without comment. We'll give the place another try just to make sure it simply wasn't an off night for the pit master.", "rating": "2", "date": [2015, 11, 6]}, "36": {"description": "Honky Tonk is a-okay--for average, not awesome. I got the green tomato BLT, which should actually be called the fried green BLT for \"fried green (bacon lettuce) tomato\" because it's two fried green tomato patties in slider buns! Genius, brilliant brilliant idea, but delivery fell just a little flat. The fry batter was average--on the onion ring batter spectrum rather than the country fried chicken spectrum. I think it should be the latter. The $2 extra goat cheese is goat cheese crumble in a little cup? Not a goat cheese spread on the actual sandwich, which I thought was a little strange and over-priced.The mac and cheese is unique. It definitely has a sour spank and spice that makes me think of \"buffalo mac and cheese,\" but I'm not sure it actually has buffalo sauce in it. It's definitely different. The maple syrup encrusted bacon is decent, too, but doesn't come out piping hot. It's a little cold and dry on presentation, more like a maple syrup glazed beef jerky.I'm also a sweet tea snob, and their sweet tea tastes like Nestea... not sure if they just need to buy some better tea or what. But definitely on the cheap tea side, which... come on, this ain't no honky tonk! Oh... wait...Overall, I would go back for late night dive food, but it's not like Green Street. Green Street is definitely on a different caliber of high quality, fresh preparation and presentation. Honky Tonk really is... maybe just more like a honky tonk.", "rating": "3", "date": [2015, 8, 15]}, "14": {"description": "Boot, Scoot & Boogie! If you're in the mood for some BBQ & country, saddle up & go to the Honkey Tonk BBQ in Chicago, IL. Honkey Tonk is a low-key, casual/divey, neighborhood bar that serves up an appetizing menu of BBQ, brews & specialty house drinks. I guess it has a more countryish theme than your average Chicago bar cuz it's called \"Honkey Tonk,\" serves Q & country-sounding, specialty drinks & plays music that's not hip-hop, pop, rock or alternative. But that's about as country as it gets at HT cuz you're more likely to find neighborhood locals & a crowd o'hipsters rather than any cowboys. HT is no-frills & is dark with a bar & wooden booths & has a small stage for live bands.Nothing at HT really screams \"honkey tonk\" to me but perhaps the menu gives it southern cred! HT has a whole gamut of traditional BBQ offerings: ribs, brisket, pulled pork, BBQ chicken, sausage & the like. BBQ is my least fave food group to be honest & I really only like ribs from 1 place in Chi & 1 place in Memphis. But I was hungry so I tried food here for the first time on my last visit & got the \"Girlfriend Salad.\" It's mixed greens with goat cheese, jicama, berries, walnuts, HT house dressing for $8 & I added BBQ chicken for $5. The salad was a big portion with ample fresh goodies & I think the chef placed a whole damn chicken on top! The chicky was very juicy & flavorful like a dry-smoked, BBQ seasoned kinda chick not drenched in BBQ sauce, thank goodness! Giddy-up! I'd eat this GF again, this was surprisingly one of the best chicken salads I've ate in awhile! The sides are a la carte so I got the small side of portobello mushrooms ($3.50) cuz I can't ever pass up a gemmy bowl o'shrooms! These guys were big & sautéed to a crisp literally, the edges were a lil too crunchy for my preference. Good flava but ease up on the char-effect perhaps?! I also added on 1 corn muffin for $1.50. Presentation was cute but muffie was kinda cold. Kudos for bakin' it with real corn pieces inside though, was probably betta/fresha earlier that night but still tasty. I can't vouch for the ribs or other Q options at HT but based on my gemmy, BBQ chick-GF salad, I'd wager the other stuff is good too.FYI: If you're a fan of all things bacon, you're in for a treat cuz HT is known for its specialty starter, bacon candy. For $11 ya get a plate o'cut-up, caramelized, fried, crunchy bacon strips. I've tried it & I'm not a fan but lotsa peeps go hog wild over this shit! HT has gotta a good selection of beer on tap & cool countryish, house drinks & lotsa liquor. I usually just go straight vodka but I did taste the \"Moonshine\" house cocktail ($8): It's bourbon, Veev Acai spirit, lemonade & house-made cherry. It's too sweet for my bitta blood, but I'm sure it'd only take a couple o'these & I'd be a Mello-Yello! Last HT provides free, live musical entertainment for its patrons. The time lapse between my previous visits to HT & my most recent one has been quite awhile but if my memory serves me right, I believe there were blues-country, hillbilly rock genre kinda bands performing on past occasions. I can't be 100% certain since every time I've been to HT it's been quite late & drinkin' straight vodka tends to blur the memory. But on my last to visit to HT, a jazz band was undeniably performing & not the cool, bluesy kinda jazz rather the \"I feel like I'm stuck on a GD, packed elevator & I wanna effin' hang myself kinda jazz!\" But ya can't always get what ya want! So if you're in the mood for something a lil off the beatin' path or are cravin' some Q & live music in a low-key/neighborhood kinda joint, I recommend boot-scootin' into the Honkey Tonk BBQ in Chicago! A lotta peeps are supes cray about HT & would prob give it a 4 or 5, but I'm not really into C&W & am usually just ridin' bitch when I wind up here. HT isn't really one of my fave watering holes in Chicago but y'all might FUC luv it & I still think it's a pretty cool place to get some Q, brews & if you're lucky hear a lil blues!", "rating": "3", "date": [2015, 4, 25]}}, "neighborhoods": ["Pilsen"], "latitude": 41.85779, "longitude": -87.65678, "rating": "3.5", "times": {"Mon": [], "Thu": ["4:00 pm", "2:00 am"], "Sat": ["4:00 pm", "3:00 am"], "Wed": ["4:00 pm", "2:00 am"], "Tue": ["4:00 pm", "2:00 am"], "Sun": ["4:00 pm", "2:00 am"], "Fri": ["4:00 pm", "2:00 am"]}, "price": "$$", "categories": [["Barbeque", "bbq"], ["Dive Bars", "divebars"]], "address": ["1800 S Racine Ave"], "attributes": {"Best Nights": "Fri, Sat, Sun", "Parking": "Street", "Has Pool Table": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Happy Hour": "Yes", "Delivery": "No", "Take-out": "Yes", "Music": "Live", "Has TV": "No", "Takes Reservations": "No", "Good for Kids": "Yes", "Wheelchair Accessible": "No", "Wi-Fi": "No", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Caters": "Yes", "Waiter Service": "Yes", "Coat Check": "No", "Attire": "Casual", "Ambience": "Casual", "Good For Dancing": "No", "Smoking": "No", "Good for Groups": "Yes", "Noise Level": "Loud", "Good For": "Dinner"}, "category": "Bars", "number_of_reviews": "663"}, "beehive-chicago-chicago": {"comments": {"3": {"description": "Mid century modern furniture, kitschy glassware, handmade jewelry, and clothing galore in a beautiful loft space.  They host a 3rd Thursday event where you can shop over 8 vendor spaces!  You won't find a collection like this anywhere in Chicago.  You simply must check them out!", "rating": "5", "date": [2014, 2, 4]}, "1": {"description": "Nine online and flea market vendors based in a beautiful sun-filled loft space. An amazing variety of vintage treasures including furniture, industrial, oddities, clothing and accessories, jewelry, art, decor, ephemera and housewares. By appointment and Saturdays from 11-5. Knowledgeable and helpful vendors with a staggering amount of inventory!", "rating": "5", "date": [2014, 4, 22]}, "2": {"description": "Fantastic hidden gem for vintage lovers. Sunny loft features the wares of a number of the city's vintage vendors. Everything from mid-century furniture to clothing, accessories and jewelry. Open by appointment and Saturdays. Beehive also hosts special events, like a recent vintage fashion show.", "rating": "5", "date": [2014, 5, 24]}, "0": {"description": "Nine veterans of the Chicago vintage market scene make their home in a light-filled industrial space on the near West side of Chicago. The vendors sell top notch merchandise by appointment or during their \"Open House\" hours every Saturday. Each vendor's space is arranged like a miniature store with eye catching displays and clean, organized merchandise. Five of the vendors specialize in clothing, jewelry, shoes, and accessories dating to the 1920s-1990s for men and women. All clothing is washed, ready to wear, and can be tried on in one of the two fitting rooms.Looking to outfit your apartment? There's scores of Mid Century Modern lamps, furniture, artwork, planters, and decor and they also offer delivery services for a fee. There's always fresh merchandise coming into the Beehive and vendors are happy to help you look for the perfect item for your wardrobe or home.", "rating": "5", "date": [2014, 4, 22]}, "4": {"description": "Need a sweet set of vintage glassware for a housewarming? Beehive Chicago. How about a kick-ass retro dress and coordinating jewelry for an upcoming wedding reception? Beehive Chicago. Decorating a new apartment in retro style? Beehive Chicago. So much killer stuff here - Check them out!", "rating": "5", "date": [2014, 4, 23]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.887986, "longitude": -87.700913, "rating": "5.0", "times": {"Mon": [], "Thu": [], "Sat": ["11:00 am", "5:00 pm"], "Wed": [], "Tue": [], "Sun": ["11:00 am", "5:00 pm"], "Fri": []}, "price": "$$", "categories": [["Antiques", "antiques"]], "address": ["2950 W Carroll Ave", "Ste 3S, 3rd Fl"], "attributes": {"By Appointment Only": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "5"}, "taco-bell-chicago-23": {"comments": {"3": {"description": "This Taco Bell is the cleanest and has very friendly employees, compared to a lot of Taco Bell's in the area.  It doesn't matter whether I order and go to drive thru or walk into the restaurant, the service is consistent.  My order comes out perfectly every time, I hope I don't jinx it.  I will come back to this dozens of times to feed my addiction.", "rating": "4", "date": [2013, 4, 15]}, "1": {"description": "Service was really slow. I was standing in line for over 10 minutes waiting to order, and there were only 2 people in front of me. A woman who already ordered and was waiting for her food decided she wanted something else, so rather than make her wait her turn,  the cashier moved to the next register to take her order instead of making her wait in line like everyone else. I still hadn't ordered yet, so it ticked me off that I had to wait longer so someone could cut in front of me. The tables were dirty. Overall not impressed, but the food was good, which is why I'll give it 2 stars.", "rating": "2", "date": [2015, 9, 28]}, "2": {"description": "I went here since I was in the area and was craving tacos and since it was the only Taco Bell in this area.  The place was clean and people were friendly.Food came out warm and on time...  I would and will definitely go here again.  Since its only been open for 3 months now...everything is new, from dining area to the bathroom.", "rating": "5", "date": [2012, 10, 29]}, "0": {"description": "I have been to this place a few times when I have been to Chicago.  I find this place to be good for a quick bite to eat but average overall.  I am a huge fan of tacos and burritos.The employees can do a lot better with the cleanliness issue.  Particularly, this applies to the parking lot and the lobby.  There have been times that I have been here, and the lobby had a lot of leftover food and clutter all over the place.  It was hard for me to sit down and enjoy my meal in those situations.  In their behalf, they appear to keep the work area clean, which helps a lot with sanitary issues.The employees are a hit and miss.  Some are friendly, and some are not.  I never know which one I am going to get.  The management needs to work a lot more on the ones who are not friendly because this has a negative impact on my visits.I find myself having better luck going through the drive-thru.  The employees are better from here, and my overall visit experience is better.  The food is served to me in a timely manner.  The food quality is fantastic.  When it is served to me, it is always hot and fresh.  It always tastes delicious.  This applies to whether or not I am dining in or going through the drive-thru.  I do not think that I have had to wait any longer than three minutes for my order, even when it is busy.Anytime I am in the area and in the mood for tacos and burritos, I will continue keeping this place in mind only for the drive-thru.  I am confident that I will continue getting better service this way than dining in.", "rating": "3", "date": [2015, 10, 12]}, "4": {"description": "the food was sloppy, But my Baby girl love it!", "rating": "1", "date": [2013, 3, 14]}}, "neighborhoods": ["Lawndale", "East Garfield Park"], "latitude": 41.86652, "longitude": -87.70963, "rating": "3.0", "times": {"Mon": ["7:00 am", "1:00 am"], "Thu": ["7:00 am", "1:00 am"], "Sat": ["7:00 am", "2:00 am"], "Wed": ["7:00 am", "1:00 am"], "Tue": ["7:00 am", "1:00 am"], "Sun": ["7:00 am", "1:00 am"], "Fri": ["7:00 am", "2:00 am"]}, "price": "$", "categories": [["Tex-Mex", "tex-mex"], ["Fast Food", "hotdogs"], ["Mexican", "mexican"]], "address": ["3350 W. Roosevelt Rd"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "5"}, "sweet-beginnings-chicago": {"comments": {"1": {"description": "I love their honey. It's light bodied but flavorful. I really support all of their initiatives.", "rating": "5", "date": [2012, 11, 15]}, "0": {"description": "Here is the buzz on a place that is all about wonderful products and super people! Perhaps this is a little known spot outside the area of Lawndale, for now, but I guarantee you the purveyors of this stuff have all ready given Chicago something to be sticky sweet and in love with.Oh honey! Sweet Beginnings is what you might call a business and charitable venture rolled up into one. Using happy, smiling, urban bees (plus local flora and fauna), they produce not only gorgeous but yummy honey. They also, I expect, could give 'Burts Bees', a set of well known and long standing products, a run for its money.Available for your enjoyment is a not too thick, beautifully golden honey which comes in 2 sizes. They couple these edibles with a creamy body care line that will leave you buzzing. I got a large jar of the SB honey off the comb and was happy to see the pair of lip balm sticks for under $4, as well as one of the small jars of shea butter nectar.What is also so great about this spot is that here is a business that not only puts people to work, but puts people back to work. Yep, you will be abuzz about this: SB is just as sweet as their honey in giving former inmates a place to thrive outside the hive.These products are extremely affordable and who doesn't love a come back story to bee jazzed about!", "rating": "5", "date": [2014, 5, 18]}}, "latitude": 41.872826, "neighborhoods": ["East Garfield Park"], "categories": [["Specialty Food", "gourmet"]], "address": ["3726 W Flournoy St"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.719185, "category": "Food", "rating": "5.0", "price": "$$", "number_of_reviews": "2"}, "farmers-pride-produce-chicago-2": {"comments": {"58": {"description": "Love this place and mad that I only just recently gave it a try.  For such a small store, they really cover the basics, produce, some organics, some health foods, bakery goods, and ethnic foods extremely well at a good price.  Combine Farmers Pride with a run to Rich's Deli up the street every once in a while, and you're covered for most of your regular grocery needs.Cermak Produce was my weekly produce/grocery shop before I gave Farmers Pride a try, but I always had to supplement Cermak Produce runs with shopping at other markets or grocery stores... Farmers Pride is now my one stop shop.  I do wish they stocked some of the local Middle Eastern pita breads, but I think they mainly carry Greek brands.", "rating": "5", "date": [2010, 2, 15]}, "56": {"description": "This is the kind of corner grocery that everyone wishes hey had in their neighborhood. The selection is big enough to never have to go anywhere else if you don't want to, the store is small enough that you never have to deal with the crowds major chains get, and the people are part of the local community. The prices have always been very good for what you get, and even after being a customer for 10 years, I'm still surprised from time to time at what I'm able to find there.", "rating": "4", "date": [2010, 3, 22]}, "29": {"description": "Cute little grocery store, appears to be family owned by a Greek family, which I really like.  They had papaya which was exciting for me and they had great avocados for $1.39 (cheaper than anywhere else right now) and lots of yogurt/almond milk/soy milk options.  And I wanted mozzarella cheese and they cut it for me in slices perfectly.  And they have fancy chocolates by the register, which is good and bad.  It's a little crowded (small space) and there's only street parking but it was easy to find.  I would never have come here had it not been for a groupon but I will definitely be back as it is between my work and home commute.  My new favorite shop!", "rating": "4", "date": [2011, 10, 6]}, "42": {"description": "I adore this corner market. They have a great selection of fresh, beautiful fruits and veggies, and their prices are extremely competitive and fair. Their meat selection is amazing, you gotta get your meat from these guys. I love their selection of breads, both from commercial and local bakeries. They also carry cans of San Marzano tomatoes - the only shop I've found in the area to do so!  I come here regularly for their produce, meat, Greek yogurt, and for hard to find things I just need to have in my kitchen:  giardinara of all levels of heat, anchovy paste, lox, healthy chips and snacks, spanakopita, barley and other grains, and juices. They're not a mega grocer so they don't carry \"everything\", but if you want to shop in a more \"European\" style, this is the market you could feasibly visit every day and make good meals.  I must come here at least three times a week.Everyone who works there is super nice too and will greet you and chat with you about your day. Love this place!", "rating": "4", "date": [2010, 12, 17]}, "23": {"description": "Go here for the deli, they carry fresh Boar's Head products which is nice. I wish there were hormone free, free range, or grass fed meat options though, but I'm not a regular meat eater so it's not a deal breaker for me. It's the produce that's the real disappointment. Sometimes it's fine if you eat it that very day, or if you happen to catch them on re-stock, but I'm not always so lucky. Today I bought a carton of raspberries that turned out to be mostly mold, the entire thing went in the trash. How can you even sell a product like that? How can you not know it's past prime? If Cermak on North can have quality, fresh produce, why can't you?", "rating": "2", "date": [2012, 8, 20]}, "47": {"description": "Wonderful little corner store with almost all of your necessities... I have a new baby and they don't have diapers and wipes, but they do have plenty of produce and meats including a butcher. The new deli and coffee shop is also a HUGE plus, and you can't beat the prices! Did I mention that they deliver?", "rating": "5", "date": [2010, 8, 4]}, "8": {"description": "Friendly people, great variety.  I consider this my no stress grocery shopping option and love it. I can get all of the vegetables and fruit I need, plus anything else that strikes my fancy. I recommend this place to anyone in the area.", "rating": "5", "date": [2015, 5, 2]}, "31": {"description": "I adore this place. I've been patronizing it for almost five years, and they have the best meat I've found in Chicago. Granted, after I found this place I stopped looking. :)", "rating": "4", "date": [2011, 9, 29]}, "34": {"description": "FU to big chain spots, and a milder bugger off to whole foods/trader joe's this is my go to store for groceries.", "rating": "5", "date": [2011, 7, 23]}, "16": {"description": "This review is just for the store and not the cafe ( I think the cafe is not in biz anymore ). I go here when I need to get some meat to grill and some sides. They have Boars head slice-able meat and your standard pot salad, tuna, pasta, etc.. The meat is always good looking and reasonably priced. The service is always good and friendly. They have fresh made guac and salsa at the register that I usually cant resist buying. Its nice easy spot to get too for a single BBQ meal and you dont have to worry about all the pains of a larger store.", "rating": "5", "date": [2014, 7, 21]}, "13": {"description": "Close to my house. The prices are good and they have a decent selection of vegetarian items. For such a little store, they cram almost everything you need inside: fresh produce, quick meals, deli items, and desserts.  The staff is also very friendly and helpful. Great neighborhood store.", "rating": "5", "date": [2014, 11, 5]}, "11": {"description": "This place rules.I was checking out some apartments for rent and stumbled into this store to grab a drink. What was supposed to be a quick stop turned into 15 minutes.  A cozy market with a huge variety of meats, cheeses, fruits/veggies and plenty of boxed/canned goods as well. Not to mention an incredible selection of root beers with NO HIGH FRUCTOSE CORN SYRUP or poison as I prefer to call it.I've been going back and forth between Ukrainian Village and Wicker Park. It's possible that Farmer's Pride just tipped the scales in favor of UK. The young man at the counter was great. He was polite and well spoken and thanked me for my purchase. Neighborhood gem. 5 stars all the way", "rating": "5", "date": [2014, 7, 30]}, "39": {"description": "Maybe I'm just not getting the right things, but people have told me that the produce here is supposed to be good, but it always looks terrible when I try to shop here and I usually leave empty handed.  They do, however, carry a ton of local products (bread, grass fed milk from WI, those awesome tortilla chips in the green bag).I try to stick to packaged items when shopping here, just because given the state of their produce I don't really trust their perishables.  Maybe I just need to keep trying.", "rating": "3", "date": [2011, 5, 4]}, "37": {"description": "I was meaning to stop here for quite a while and when I saw the groupon for Farmers pride it really gave me a reason to go out of my way to stop.The prices here are fantastic, the selection isn't too broad and the produce is a little hit and miss but the prices are about as good as Stanley's and the stuff doesn't seem to go bad as quickly.  I'll definitely stop back here sometime when I don't need to go shopping for the week and only need a few things.", "rating": "4", "date": [2011, 6, 6]}, "0": {"description": "Ever since the new owners took over at Farmers Pride Produce, a handful of years ago, the quality of their produce, deli, bakery goods and especially their employees have maintained high quality.Before the new owners, I was a huge advocate of Farmers Pride's products and people.  I continue to feel that way.", "rating": "5", "date": [2016, 2, 16]}, "38": {"description": "I came in here to use my Groupon and discovered it lived up to all the hype. Great place, nice ethnic choices, cheaper than Dominick's. The handmade dairy stuff was a nice plus. I didn't check out the meat counter, but it looked pretty solid. It's refreshing to see places like this exist as alternatives. I'll most definitely be back!", "rating": "4", "date": [2011, 5, 8]}, "51": {"description": "Love, love, love!This place just kicked Dominick's down to a last resort of places to shop for groceries. While Farmer's Pride is small, it has nearly everything you need for eating healthy.Plus, it's a mom and pop type store, so I'd MUCH rather give them my money over the conglomerates.", "rating": "5", "date": [2010, 7, 5]}, "27": {"description": "a great little market for everything fresh! really good selection of vegetables and fruits and a surprisingly well stocked meat counter.", "rating": "4", "date": [2011, 10, 31]}, "32": {"description": "My local standby. Free parking right on western.", "rating": "4", "date": [2011, 9, 7]}, "54": {"description": "You can buy boneless skinless chicken for $2 a lb. What else do you need to know?", "rating": "4", "date": [2010, 4, 18]}, "48": {"description": "Anyone else remember Edmar's? Well, Farmer's Pride is like a little Edmar's. All the basics- italian, mexican, greek, deli, and sweets plus some extra stuff, at fair prices, and much of it locally branded! Nothing exotic here, but hey, i aint no exotic chef. they dont have it? try Rich's or CVS...come on! you don't ever NEED to go to Dominick's.", "rating": "5", "date": [2010, 8, 4]}, "44": {"description": "Farmers Pride has added a small cafe with Edy's ice cream and coffee from Star Lounge.I usually go here for just a few items, but apparently they deliver for free in the neighborhood for orders over $40. Nice perk that I'll definitely have to try soon.", "rating": "5", "date": [2010, 10, 31]}, "24": {"description": "Looked promising.  Live in the neighborhood, thought to stop by for some fresh fruit.  We were undergoing a heat wave.  Went inside for some crisp, sweet, crunchy grapes and a refreshing watermelon.  Saw the grapes first.  Wrinkly and mushy and looked like it was sitting there for a few days.  I ditched the watermelon effort. Boo.I should have never betrayed Stanley's just a few blocks away.  Sorry, Stanley, never again.  You're my man.", "rating": "1", "date": [2012, 7, 7]}, "7": {"description": "Love this store! Staff is always amazing and friendly. Owner is great. Definitely cheaper than Mariano's. It's a neighborhood go to for quick in and out groceries and wine/beer.", "rating": "5", "date": [2015, 7, 26]}, "49": {"description": "We popped into Farmers Pride hoping to find a good deal on bananas while we were walking down Chicago towards Western - the store itself is small, but loaded with tons of fresh and cheap produce - those bananas? 49 cents a pound! Ended up grabbing nearly 4 pounds of bananas for under 2 bucks!Due to the size of the store, it was a bit crowded, but the staff were extremely friendly and willing to help us find whatever we would have needed. It's a bit out of the way from our own house (a good 25 minutes walking) but if we're over in this part of Humboldt, we'll be sure to pop in again for the produce.", "rating": "4", "date": [2010, 7, 28]}, "40": {"description": "I love my corner store! They have an amazing selection of organic, gluten free and ethnic food items. The prices are fantastic and the people who work here are great. I am in here several times a week, don't know what I would do without them!", "rating": "5", "date": [2011, 4, 24]}, "53": {"description": "I like this place, it has what you need for those things that you need in between larger food shopping trips. Pretty good selection of seasonal fruits, veggies, cheeses, and grains. The staff is really friendly and the Sunday homemade tamales are such a treat.", "rating": "4", "date": [2010, 5, 9]}, "30": {"description": "So I like to have fresh options to cook with. You can't make good food from produce that has been soaking in a bin for dog years. Boyfriend says he can survive on Ramen, Kraft boxes, popcorn  and cans of tuna... I know better- That processed, preserved crapola will kill him! Lucky him, I can cook. So when trying to find a new place to shop, he stumbled on this gem and dragged me in. I was skeptical because it is very small and the one single door is covered in lotto ads (No, I so do not ever play the lottery). It is such a welcome change for endless aisles of Jewel or Dominicks filled with crap you do not want or need!They have huge imported cans of San Marzano tomatoes, Authentic German mustard, really delicious produce options and some really funny guys behind the meat counter!Last Visit (Loosely translated from Spanish):Boyfriend: \"I need that, that and more of that.\"Counter Guy: \"What are you going to do with all of that?\"BF: \"Dunno. She (points at me) cooks it all.\"CG: \"Wha... She COOKS?!?\"BF: \"She's Italian. She cooks like an Italian, Man. It's nice.\"Sighs followed. I thought it was hysterical. I've got to bake some cookies for those guys.", "rating": "5", "date": [2011, 10, 3]}, "46": {"description": "There are some very positive things about Farmers Pride, the first and foremost thing being the low prices on what seems to be very good quality produce, meat and staples.The problem I have is that there aren't things offered that I am used to finding, notably: chayote, jicama, corn on the cob, heads of different types of greens, different kinds of mushrooms, coconut milk, radishes, and nopales.  While not having a lot of these Mexican ingredients is understandable, not seeing more than 2 ears of corn, no radishes and a very limited amount and selection of salad greens is a bit disappointing.Alas, I have something about Hyde Park that I really miss, specifically Hyde Park Produce Mart with their massive size and a ton of things on offer there (though Farmers Pride definitely have HPPM beat with their meat counter).I will for sure be back to Farmers Pride for their good meat section, cheap prices, and fresh produce (not to mention the fact that this is a locally-owned business which means my money stays away from Dominick's).  So yeah, I'll be back, at least until I can find a place that offers more.", "rating": "3", "date": [2010, 8, 11]}, "1": {"description": "Great market, big selection for fresh fruits,vegetables. Also great place to pick up burgers/steaks etc", "rating": "5", "date": [2016, 2, 14]}, "55": {"description": "Love this place. Will keep coming back. For such a small place, I always seem to find what I need to keep my kitchen stocked nicely. The meats, fruits, and veggies are always fresh. The service is always great. I ruptured my achilles tendon late in 2009 and they delivered food to me while I was laid up for 60 days. Continued loyalty and recommendations will be my repayment for this store. Way to go Nico.", "rating": "5", "date": [2010, 4, 4]}, "9": {"description": "Amazing variety of great products,  fresh produce,  super nice and knowledgeable butchers,  boar's head meats,  and a beer cave.", "rating": "5", "date": [2015, 6, 11]}, "26": {"description": "I remember stopping in this little hole in the wall back in 1999 when I started working in the area.  I never expected much from the place and truly imagined it would become a Starbucks or something in the not to distant future.  To my unexpected surprise Farmers Pride adapted to the changes in the community and provides a well rounded assortment of grocery items at much better than prices than Dominick's which is just down the street.  The people are always pleasant and shelves always stocked.  In this economy I'd much rather give my money to a small mom and pop than large corporate store.  Recently they added a small deli counter serving up sandwiches and the like.  Haven't tried these yet but it's a nice addition.  Thumbs up on this place.", "rating": "4", "date": [2012, 1, 20]}, "25": {"description": "I live down the street from FP, and refuse to buy my produce from any other store. They purchase most of their produce from local farmers, and it is generally pretty fresh and incredibly cheap! They also sell Boar's Head deli meat, which is a little more expensive but well worth the extra couple bucks. If you live in the Ukrainian Village, Humboldt Park, Wicker Park area and are  sick of overpaying for your produce from Jewel or Dominick's, I highly recommend you check this place out!", "rating": "5", "date": [2012, 2, 12]}, "12": {"description": "I love having this small grocery store in the neighborhood. It is so helpful to be able to park in their 15 minute parking, run in and get a handful of items when I need them. Their selection of organic/healthy pantry items is impressive, and their produce and meat almost always have what I'm looking for- without having to park on the roof at Mariano's and bottleneck into the elevator. They even have their own homemade Greek yogurt! Who can resist that!", "rating": "5", "date": [2015, 1, 12]}, "59": {"description": "Oh, how I love Farmer's Pride.It's not a big chain grocery (it's probably less a quarter of the size of the Dominic's down the street); but somehow Farmer's Pride manages to have everything I need.  I know the owner makes it a point of, well, pride; because he laughed and told me. 'We have EVERYTHING!' one time when he was able to point out the one obscure item on my list I was sure I'd have to look for elsewhere.A little while ago I heard someone on the radio recommending that, in order to maintain a healthy diet, shoppers should avoid the middle section of the grocery store, where all the frozen and processed foods are.  Ever since then, that's how I've thought of Farmer's Pride: as a grocery store that just eliminated the middle section.  You know, for our health.They've got your basic produce, snacks and dairy--and a lot of other treats like organic cereal, locally-roasted coffee, and heat and serve Indian entrees.  They've got the best butcher counter around, and have me cooking up animal-protein like a fiend (much to the chagrin of my vegetarian boyfriend).  So much to love about Farmer's Pride; but the best thing has to be the price.  I am always amazed how many bags of groceries I can fill for less than $20 at Farmer's Pride.  They always leave me with a little extra in my pocket for when I'm just too lazy to do the right thing and cook.", "rating": "4", "date": [2010, 1, 18]}, "21": {"description": "You need to spend a minimum of $5 to charge to your debit card.I like that they have fresh fruit/veggies and a deli section. They sell homemade tamales, which is a plus for my boyfriend and his roommates. This is definitely a neighborhood joint that competes with the Dominick's on Chicago.", "rating": "3", "date": [2012, 11, 3]}, "17": {"description": "I have been going to Farmers Pride for years.  I live across the street (Ukrainian Village) and its super convenient.  I also was on a budget and this place was a perfect change from going to the supermarkets ( Pete's or Mariano's).  Their produce, bread, and deli meat selections are great.  Additionally, they also have local items such as meat rubs, tamales, baked goods, ect.  I enjoy making my weekly stops here.  Not to mention the people who work there I have been seeing for years are very nice and helpful.", "rating": "5", "date": [2015, 2, 13]}, "10": {"description": "Been shopping here for years.  Great family run store that is very conscious of the items they put on their shelves and sell to their customers.  Lots of organic, natural options and everything is priced very friendly for the most part.  Great deli and friendly butchers.  Stop shopping at the big chains and support this local family owned spot.  You must try their homemade Greek soup too....it's to die for!", "rating": "5", "date": [2015, 3, 26]}, "5": {"description": "The positive = this place is within walking distance and carries a few items my wife and I enjoy and/or depend on as a conscientious vegan and vegetarian.The negative = the service is terrible. In just the past couple months, I've had these experiences:The guy who works there bagged two crates of eggs vertically with other things, which I didn't realize until it was too late. About half of both were broken by the time I got home (that's roughly $6 worth of eggs). I guess I can take partial blame because I didn't check, but I didn't think I would have to. Who puts a carton of eggs in the bag vertically?Just a few weeks ago, I was walking around the store with one of their baskets. A huge portion of one of the edges had worn through the protective plastic, and the very sharp and no doubt very dirty metal tore my palm open. I showed it to the girl and she basically said, \"wow,\" and offered me a paper towel. That was it.Against my better judgement, I went back today and bought a few things. It wasn't until a few hours later that I realized my old friend eggman had neglected to give me back the bag of apples he rang me up for. So, I'm out even more money but I guess I should be happy I'm not going to have to deal with my hand bleeding all week like last time.I'm all for helping the little guy, but only when the little guy can run something vaguely resembling a functioning operation. Every single time I go in there, something bad happens.", "rating": "2", "date": [2015, 11, 22]}, "3": {"description": "I almost hate to mention the tamales on the weekends out of selfishness because I want them all to myself, however, that's what brought me into the store at first. It's nice to roll out of bed and pick up fresh, hot tamales on the weekends. In addition, I'm really impressed with their organic and special diet (e.g. gluten free, vegan, etc.) selection. I didn't expect so much in a smaller grocery store. Everyone working in the store is super friendly and very helpful. I just need to figure out the delivery schedule, sometimes they're out of stock, which makes sense since it's a smaller grocery. Unfortunately that makes me supplement by going to Mariano's :(", "rating": "5", "date": [2015, 7, 29]}, "35": {"description": "It's called Farmer's Pride-- but I'm not sure anything in the store has been produced by local or regional farmers.  Most of the produce had large commercial produce stickers.", "rating": "2", "date": [2011, 7, 9]}, "19": {"description": "Do not make the mistake of grabbing a cart.  You will not be able to maneuver the thing throughout the store, so don't even try.  They don't have everything, but there is a good variety of produce and a surprising selection of cheese.  I've not gotten anything from the meat counter, but there appears to be a lot to choose from there as well.  I would, however, be hesitant to buy anything canned.  I get the sense that it may have been sitting there for a bit.", "rating": "3", "date": [2014, 2, 6]}, "28": {"description": "Mainly staples and a strong deli make this a solid place to run out and grab produce, meats, and other necessities.  I wouldn't go here for a full-on \"shopping for the week\" type experience, but for night-to-night shopping and picking up the couple items you forgot, it's pretty solid.", "rating": "4", "date": [2011, 10, 7]}, "45": {"description": "I need to toot the horn of Farmer's Pride one more time.  As we all know, Farmers Pride doesn't have EVERYTHING you are looking for, but for dinner staples, hell yeah.  The Carne Asada (ask them to put it through the \"flattening machine\" on the grill make mindblowing tacos, the chicken is super fresh, as is all their meat.  HANDS DOWN BEST GREEK YOGURT AND FETA - GET THE HAND PACKED STUFF.  My Tzatziki is way better with the handmade yogurt, and they have the best pita in the neighborhood.  Need Nann?  They have that, too!Always friendly and helpful, I go here as often as possible because as we all know, Dominicks blows.", "rating": "5", "date": [2010, 8, 12]}, "33": {"description": "I really wanted to love this market.  But for me it had the vibe of a Qwik Mart or 7-Eleven but with some produce and a deli.  I was shopping for produce...they didn't exactly the best variety, selection or quality for the price.  Street parking only...if you can find it.I'm pretty sure the deli is their bread and butter.", "rating": "2", "date": [2011, 8, 15]}, "43": {"description": "Quite possibly, the perfect neighborhood market.  I've lived in the 'hood for a year now and while I've stopped in once before, last night's visit reminded me what a great little place this is and the fact that I need to visit it much more often!  Great selection of items (many organic/local items) at very reasonable prices, fresh produce and friendly staff.  What more could you ask for?!  Star Lounge coffee?  Well, they have that, too!", "rating": "4", "date": [2010, 11, 4]}, "2": {"description": "I love the convenience of this store.. I mostly come here to pick up last minute items for dinner.. I could not shop here regularly as a main source for groceries. The quality of produce is atrocious. Meat is okay. Good beer selection - they have many craft beers. Fair selection of frozen munchies and assorted boxed/canned/jarred foods on the shelves.", "rating": "2", "date": [2016, 2, 15]}, "18": {"description": "I really wanted to love this market.  But for me it had the vibe of a Qwik Mart or 7-Eleven but with some produce and a deli.  I was shopping for produce...they didn't exactly the best variety, selection or quality for the price.  Street parking only...if you can find it.I'm pretty sure the deli is their bread and butter.", "rating": "2", "date": [2011, 8, 15]}, "41": {"description": "Close to the casa, cheap produce, good people. Anywhere I can go buy single items of produce for a meal that night and spend like $2-$4 is pretty legitimate.", "rating": "4", "date": [2011, 3, 9]}, "52": {"description": "OK, lets do this highlights style:- they sell deli meats at pretty good deals most of the time.- their fruit salad mixes are only $1.5 and thats some guilt free snacking. funny thing is though you are very likely to notice something nasty and delicious looking on that huge pile of baked goods right by the register and grab some 2 pounds of coconut cookies for 3 dollars or so. guarenteed! :)- nice bread selection, if they are fresh good croissants that are 3 for a dollar.- they sell cigarettes a tad cheaper then other general stores.- they carry puffins, which is happy making.- avocados are on the small side, but for the price and taste, justifiable.-everything is tagged with a price including Tax, so if you calculate as you go around shopping, that's neat to know.-cashiers are friendly, others not so much. I'm sure some of the staff has been there forever, but some awkward zombieing around with boxes of veggies thrown around can be noticed sometimes.Overall, I ignored this place for so long, but now I hardly go to Dominicks for the core stuff.", "rating": "4", "date": [2010, 6, 18]}, "50": {"description": "This place is smaller than I thought it would be but it got all the basics I need. They don't have much in terms of variety of vegetables but it has good prices (lime 10 cents apiece, leaf lettuce 99 cents, a dozen of eggs 79 cents etc). The place looks clean. The staffs are friendly too. The only drawback is that they don't have a parking lot. You have to park on the street.", "rating": "4", "date": [2010, 7, 15]}, "4": {"description": "The current addition of more brands and booze just put this shop front and center in the great grocery wars of UK village. It's quite fantastic, and so are the people working there/the owners. Farmers Pride... Get some organic meats in there and it'll be a sure-fire game changer. It'd be magical to never have to step foot in Mariano's again!", "rating": "5", "date": [2015, 7, 23]}, "6": {"description": "One of my favorite grocery stores in this city. As a lot of people mention, it is a great store in that you don't have to go through several aisles to get the bare necessities on a grocery list. I love their homemade greek yogurt, sausages, great selection of local coffee and everyone that works there is super friendly! The wine/beer addition have just amplified the awesomeness of this local gem. :)", "rating": "5", "date": [2015, 10, 31]}, "22": {"description": "It's not Dominick's and it has fresh tamales on the weekends.", "rating": "5", "date": [2012, 10, 9]}, "15": {"description": "You need to spend a minimum of $5 to charge to your debit card.I like that they have fresh fruit/veggies and a deli section. They sell homemade tamales, which is a plus for my boyfriend and his roommates. This is definitely a neighborhood joint that competes with the Dominick's on Chicago.", "rating": "3", "date": [2012, 11, 3]}, "57": {"description": "You're simply the best. The selection is wide for the footprint, and the value is strong. I'm constantly impressed by both the produce and the meat counter.There is 15 minute parking immediately out front, and there is usually a spot available.", "rating": "5", "date": [2010, 3, 5]}, "20": {"description": "I love this place. I especially love the little cafe, the sandwiches are delicious and cheap!", "rating": "5", "date": [2012, 11, 10]}, "36": {"description": "Farmer's Pride is a great place to shop!Great prices for quality items and I love old neighborhood grocery store feel to the place.  Wonderful selection of quality meats neatly displayed.Many European items available.What impressed me the most were the Mexican butchers and clerks that are able to communicate and speak in Ukrainian so very well. Remarkable!  ... It's almost comical to hear a Mexican speaking Ukrainian.  Great effort to make your base support feel welcome!  Good job! ........Very friendly, jovial and happy staff!  Their boss must treat his employess very well, as they seem to like working here!Love this place and it's real people atmosphere!..... Support your local grocery store and avoid the high prices of Dominick's!", "rating": "5", "date": [2011, 6, 15]}, "14": {"description": "Farmer's Price is a good local grocer and a mediocre cafe. The grocer is cheap and has a pretty good local selection. The produce is fine, as is the deli meats, although they are not exceptional. Specialty items range from excellent (Tamales on weekend mornings, Spinach Pies up front, and Damato's Bread) to old and stale (Gourmet Popcorn the one time I tried it). The cafe, while cheap, has mediocre food at best, and relatively slow service. The price point, and lack of other neighborhood options to get a breakfast sandwich (ex. bacon egg and cheese) make it an option if you are hankering for a hangover cure.", "rating": "4", "date": [2014, 1, 13]}}, "neighborhoods": ["Humboldt Park", "West Town"], "latitude": 41.895592815253, "longitude": -87.687105991689, "rating": "4.5", "times": {"Mon": ["7:30 am", "8:30 pm"], "Thu": ["7:30 am", "8:30 pm"], "Sat": ["7:30 am", "8:30 pm"], "Wed": ["7:30 am", "8:30 pm"], "Tue": ["7:30 am", "8:30 pm"], "Sun": ["7:30 am", "7:30 pm"], "Fri": ["7:30 am", "8:30 pm"]}, "price": "$", "categories": [["Grocery", "grocery"], ["Butcher", "butcher"], ["Beer, Wine & Spirits", "beer_and_wine"]], "address": ["756 N Western Ave"], "attributes": {"Parking": "Street", "Wheelchair Accessible": "Yes", "Take-out": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "102"}, "sharks-fish-and-chicken-chicago-15": {"comments": {"1": {"description": "Oh lord have mercy. This fried chicken is the best I've ever eaten, ever ever. The catfish isn't too shabby either. All other fried chicken pales in comparison.Some people claim its the lemon pepper they add to the batter, some claim its the way they fry it...I think its just magic. Don't be nervous about the neighborhood. Well, I guess you can be a little nervous, but its worth it.", "rating": "5", "date": [2008, 11, 13]}, "0": {"description": "This chicken is so good. Its rare to find a Sharks chicken that have really good fried chicken. Not to soft & not to hard but just right. I went to this location based off of the one review that was posted a few years ago and I must say I'm glad that I went. I recommend this Sharks to everyone! We ordered 50 wings for my church.", "rating": "5", "date": [2014, 11, 22]}}, "latitude": 41.8762189149857, "neighborhoods": ["East Garfield Park"], "categories": [["Seafood", "seafood"], ["Chicken Wings", "chicken_wings"], ["Seafood Markets", "seafoodmarkets"]], "address": ["338 S California Ave"], "attributes": {"Attire": "Casual", "Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Good for Groups": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Has TV": "No"}, "longitude": -87.69620642066, "category": "Restaurants", "rating": "5.0", "price": "$", "number_of_reviews": "2"}, "leamington-foods-chicago-2": {"comments": {"3": {"description": "My family lives nearby and they sent me for chicken wings. When I got back, we found that they were spoiled so I had to take them back and ask the meat counter for \"fresh\" wings. Why the HELL do i I have to ask for fresh meat and why was no one visibly upset by this at the store!!!! The other annoying is, they have steel barriers that prevent u from being able to get your cart to your car. You either have to have security watch your cart while u go pull you car up to the door or take someone to the store with u - lame as hell. Even aldi has a better solution then this.", "rating": "1", "date": [2012, 8, 18]}, "1": {"description": "This place is the worst. I don't know if I'd rather have an empty space causing a food desert in the neighborhood or this place. All along the isles you're going to find mostly junk food. Chips, flavored water called juice, snack cakes etc. When I go to get groceries I'm looking for meat and produce. Why I come here thinking things would be different? I felt like I was taking back an old boyfriend who was a jerk face but claims he's changed. True story: yesterday I was overcome with the urge to make the perfect homemade burger. I wanted everything. The fancy buns, the lean meat and all the fixins.  So, I walk my happy and very hungry ass to this store and carefully select just enough beef for around four burgers. I say carefully because this store is too expensive to be so crappy so you need to shop wisely. Then I go to the bread isle. Bro! There were like 5-6 packs of buns left and all of them. ALL of them had the expiration date of Dec. 1st. I kept looking at them like I had magical powers to scroll back time (I really love cheese burgers). Unbelievable. Produce isle had packs of green beans and other veggies with mold growing on them. Why in the hell do they sell produce all wrapped up in plastic and expect it to stay fresh? And why are you selling overpriced moldy food? I wanted veggies for a chicken soup. Nope! Nope!Anyway, yeah.. This is what its like in the poorer black neighborhoods in this city. If you're using WIC, you won't get far with what you're given here unless all you want to eat is garbage. And this store takes advantage of the fact that its the only grocer in the immediate neighborhood and that you might be coming in with food stamps.Dominick's used to be in this spot but we all know what happened with that chain. RIP. FCK this piece of crap store and it's owner.", "rating": "1", "date": [2014, 12, 4]}, "2": {"description": "This place is overpriced. Nothing really special. Not enthused to return. If they replaced Dominicks with this place, shame on them. This place is in the middle of a shopping center, its huge, but when you go inside you are a bit thrown off. No real staff to greet or speak to you. The fruit and vegetable section was not appealing at all.  The reviews mostly state that its an overpriced 99 cent store, and I have to agree.", "rating": "1", "date": [2014, 4, 12]}, "5": {"description": "I go to church down the street. They are a good grocery store for getting a few things but the produce is not fresh and there's typically not fresh fish. But if you need some chips or something in the can it can be a cool place to shop.", "rating": "3", "date": [2012, 10, 4]}, "6": {"description": "When Leamington's moved in to replace Dominick's, I was excited! I assumed that they would have amazing, fresh food. Why? Well, because I thought they owned another store in Oak Park, and I naively assumed that this store would be like shopping in the fancy end of Oak Park. That all ended when I walked in the store. Candy, juice, instant foods, and alcohol are all well- represented here. Real food ingredients, or nutritious options weren't. What a disappointment! With all the gentrification that's beginning over there, it seemed a good grocery was the next step. But instead more poverty profiteering. sigh.", "rating": "1", "date": [2010, 5, 30]}, "7": {"description": "'What an Insulting JOKE to this Already \"under\" served community. This owner takes over the old Dominicks Store attempting to \"Save the Day\"  but instead he does it with insults... Why are their HUGE rows full of Sylvia's GREENS ? and one HUGE ROW of SUNNY D Light ?? IS THAT ALL The African American Community Eat and Drink? Lets not stop there. Their Meat is 1 day from being discontinued but these owners don't care, they know that the majority of their funds come from the LINK CARDS that our tax dollars are paying for and many of their customers aren't knowledgable about healthy eating. The foods are Overly Priced. You will find a better selection in price and quality at your local jewels or dominicks.. Maybe even the guy standing on the corner who grew things in his dining room. This is a must not ever go to!", "rating": "1", "date": [2009, 11, 30]}, "0": {"description": "Old Dominicks site...interestingly enough they kept the aisle signage but installed their own shelving and racks.  It looks like a half-assed grocery store and that is really what it is.First, the meat and meat by products (i.e bologna and hot links and breakfast sausage) are all in the first cooler to the left when you walk in. On the right, logically, is the fruit and vegetables which are interestingly mixed up with the generic twinkies and 'fruit' pies. Just so you know, a fruit pie does not count as fruit. If you already didn't know that.....This store is typical of a neighborhood that is a food desert. It is the only real grocery store within a couple of miles and it does cater to the neighborhood as there were about 40 different versions of those stupid kids sugar drinks that look like plastic barrels. They come in all flavors....diabetes, heart disease, obesity.....I get the impression that if this store carried what a normal grocery store did then people would be forced to buy fresh fruit and chicken breast.(THE HORROR). Instead they have fallen into the Moo and Oink stereotype.What disturbs me about this store is the fact that it is less of a grocery store than a dollar store with food.  All kinds of tupperware and candy, with the personal care products behind the service desk??? Maybe they are just opening and in transition but this is sooo strange.I was also pretty horrified with the fact that I could not find any 'lady' products in the store at all......weird way to end this review but this is a weird place.", "rating": "2", "date": [2009, 7, 17]}, "4": {"description": "Oh my ghetto!!!I'm sorry but replacing the old Dominick's, which may have been a bit ahead of its time, with this horrible attempt at a grocery store is pathetic!  From the second you walk into the front door you're bombarded with processed juice drink, chips, and icing glazed honey buns.  A few steps further and you're greeted by the first cooler which is fully stocked with bologna, hot dogs and other various processed lunch meats.  Vegetables are available but aren't too plentiful or seemingly desirable.   Moving to the back you find yourself looking at an entire cooler of pork chitterlings and other nutrient free animal byproducts.  This is still the first aisle mind you!!  Round the corner and you encounter entire aisles of artificially colored juice drinks in plastic containers with foil tops and specials on soda.  Needless to say I have used this place for tin foil and hot dog buns which were both plentiful.  My question to society is this.  Do places like this promote the booming heart disease and diabetes within this community or are they the product of this societies demand.  Either way, I think if we dig deep we'll find that Leamington is likely funded by diabetes drug companies and heart doctors.  Just saying.", "rating": "1", "date": [2010, 7, 13]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.8675804138184, "longitude": -87.7072982788086, "rating": "1.5", "times": {"Mon": ["8:00 am", "9:00 pm"], "Thu": ["8:00 am", "9:00 pm"], "Sat": ["8:00 am", "9:00 pm"], "Wed": ["8:00 am", "9:00 pm"], "Tue": ["8:00 am", "9:00 pm"], "Sun": ["8:00 am", "8:00 pm"], "Fri": ["8:00 am", "9:00 pm"]}, "price": "$$", "categories": [["Grocery", "grocery"]], "address": ["3240 West Roosevelt"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "8"}, "j-and-r-express-shrimps-chicago": {"comments": {"1": {"description": "After a friend of mine suggested this place we tried it.  Bam! Out of this world!!  We had the scallops and jumbo shrimp.  They were huge and so delicious!!  Pretty busy place due to the delicious fish and well worth the wait!!", "rating": "5", "date": [2015, 6, 30]}, "2": {"description": "The shrimp here are sooooo good. They also have catfish strips (southern style) the best in Chicago....I like everything about this place-- it's clean, safe and the decor is excellent!!! Make sure to check out the custom made countertops... If you having a craving for shrimp, wings zings, perch and/or tilapia chips they got it...", "rating": "5", "date": [2014, 10, 20]}, "0": {"description": "The sign inside the restaurant says \"Best Fried Shrimp\" in Chicago!  Man they ain't never lied! (Translation: this place is the Truth)  I highly recommend the Jumbo pound shrimp, fried okra and some hush puppies!  Food taste great the shrimp taste like its fresh from the Gulf!  Now this is take out only spot so don't try and get comfortable..lol My cousins and I stood up and ate ate the counter it was so good, and the owners didn't seem to mind!I am telling all my peeps about this spot!", "rating": "5", "date": [2014, 12, 7]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.876266, "longitude": -87.700813, "rating": "5.0", "times": {"Mon": ["11:00 am", "10:00 pm"], "Thu": ["11:00 am", "12:00 am"], "Sat": ["11:00 am", "2:00 am"], "Wed": ["11:00 am", "12:00 am"], "Tue": ["11:00 am", "12:00 am"], "Sun": ["1:00 pm", "7:00 pm"], "Fri": ["11:00 am", "2:00 am"]}, "price": "$", "categories": [["Seafood", "seafood"]], "address": ["337 S Sacramento Blvd"], "attributes": {"Has TV": "Yes", "Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Dogs Allowed": "No", "Good for Groups": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "3"}, "jacks-fish-chicken-n-more-chicago": {"comments": {"3": {"description": "Good place to grab lunch.  Reasonable price and the food is not bad.  Always like their daily specials.", "rating": "4", "date": [2011, 1, 11]}, "1": {"description": "Should have found another place to order chicken just because of the way the woman tone of voice was when I called in my order. I mean I wasn't expecting stellar customer service but geesh she sounded so annoyed when responding to my questions. Ordered chicken and it would have been 4 stars if it wasn't drowned in lemon pepper. If I ever decide to go back I'll be sure to tell them LIGHT lemon pepper please!", "rating": "2", "date": [2015, 6, 16]}, "2": {"description": "Great fast food. The chicken on pita is great. The portions are huge and taste is great. Worked on July 4 and bought lunch for the staff. Food was great we were all happy with our meals. Went out to dinner that night on Taylor street and had dinner for $240 for 7 people that was nowhere near as good as jacks", "rating": "5", "date": [2014, 7, 22]}, "5": {"description": "I had a Philly cheesesteak here and my buddy had a cheeseburger, both which came with fries.  Prices are awesome, most stuff is under $5.  Food was decent.  The small fries is pretty small.  Not much seating inside, but the service was great and the food came out pretty quick.", "rating": "3", "date": [2009, 7, 16]}, "6": {"description": "The price to food ratio is pretty good here. $3.99 for 2 hot dogs, a pop and a decent sized fry. The hot dogs are your average beef hot dog. The fries are 'hit or miss', but they usually miss. They gyro melt is like a pizza buff but with beef, cheese, and onion. Tasty but small.The service is pretty slow at times. Calling in an order for pick up is recommended but even then it doesn't seem to alleviate the wait.", "rating": "3", "date": [2010, 2, 27]}, "7": {"description": "I stop here after work sometimes for a quick bite.  Price is good and the food is filling.", "rating": "3", "date": [2012, 6, 18]}, "0": {"description": "Very very very delicious and seasoned fish and chicken. They have a special 20 wings with fries for 1999 you cannot beat that. Also there catfish perch and shrimp are very crispy and lightly seasoned with lemon pepper", "rating": "5", "date": [2015, 7, 27]}, "4": {"description": "Working on the West side with a generous 30 minutes for lunch leaves very few options.  If I am not eating the questionable \"food\" they serve at work, then I will: brown bag it, Subway, choose a random selection of snacks from Jewel, some sort of fast food (BK, McD's, etc.), or Jacks.  The first time we tried it, we made the mistake of going to Jacks and waiting for our order.  After a good 30 minutes of listening to bad poppy, hip-hop and listening to people behind the counter bicker, our food was ready.  So having learned from experience, we would always place a call about a half and hour prior.  Alas, this did not alleviate the problem.  My the time we got our food, our lunch was over. Needless to say, the service is bad.  The food...meh.  It's not terrible, but it is NOT worth the hassle.  The menu is extensive, and it's cheap.  However, the quality is a bit below average, the portions are small, and the fries are shit.  Flavorless, sometimes hot, playdoughy potato strips.  I think I'll stick with Subway, thank you very much.", "rating": "2", "date": [2010, 5, 21]}}, "latitude": 41.8677015602589, "neighborhoods": ["East Garfield Park"], "categories": [["Fast Food", "hotdogs"]], "address": ["1116 S Kedzie Avenue"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Accepts Credit Cards": "Yes", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "Yes", "Drive-Thru": "No", "Good for Kids": "Yes"}, "longitude": -87.7057584375143, "category": "Restaurants", "rating": "3.5", "price": "$", "number_of_reviews": "8"}, "als-under-the-l-chicago": {"comments": {"3": {"description": "Great service. Friendly peeps. Try the polish. Parking free and attached. Really. Even in Chicago. Yelp is wrong. Open 10-10 Monday thru Saturday.", "rating": "5", "date": [2015, 9, 19]}, "1": {"description": "If you want meat cooked on a grill two feet from your face, this is the place! The burgers come off so sizzling hot that they practically eat themselves. The Vienna Beef dogs are practically barking from the buns!It is take-out only and parking is everywhere, so come here and experience a throw back in time to when food was food and frills were not what eating was all about. This experience is raw life with food as the portal.Believe it or not I am a vegan so I can only get a \"sleeve of fries\" which are made by Junior from actual potatoes (no 15 ingredients), while everyone around me feasts on their tube steaks with big grins on their faces.I highly recommend this lost piece of authentic neighborhood dining.", "rating": "5", "date": [2015, 12, 15]}, "2": {"description": "The woman who helped me at Al's Under the L was very nice and friendly. One of the men seemed to glare at me the whole time. The place's interior needs work. The ceiling is dirty, there is nowhere to sit, and it is not clear where to order and where to pay. The food service area were clean so I ordered anyway. I got a cheeseburger combo which comes with fries and a soda can. They wrapped the fries and burger together into a messy blob (see photo). The burger patties were from frozen and gray and unappetizing. They dress the burger the same as hotdogs: mustard, relish, onion, sport peppers. The fries were squishy with no crispness, though admittedly not entirely unpleasant tasting. I would not return.", "rating": "2", "date": [2015, 11, 10]}, "5": {"description": "I just moved around the corner from the establishment and I have ate here before the new management with no problems. Unfortunately I tried them out while waiting on my new stove to arrive and it made me violently ill. Will not be going back...beware!", "rating": "1", "date": [2015, 12, 3]}, "6": {"description": "I've driven from Detroit to Chicago just for Als. Swanky, this place ain't. But the best damned hot dogs you'll ever have, hands down. Polish's are great too. Man those home fries wrapped up with the hot dog--my mouth is watering just thinking about it!!Worth the trip. Just call to make sure they're open!", "rating": "5", "date": [2015, 2, 23]}, "7": {"description": "The original Al's Hot Dogs had been an institution on Chicago's west side since the 1953. After the passing of its owner the family eventually sold the store which in the late 2000 went through several transitions. It finally became \"Al's under the L\" and the food is (90%) what out was on its hey day. Specializing in hot dogs, polish sausages, and burgers is what Al's is known for (that includes high calories). They've added turkey burgers and sausage to their line up but why would I go to a neighborhood \"grease spot\" for that? Al's is what it is, great Chicago-style fast food that satisfies your unhealthy food urge.", "rating": "4", "date": [2014, 12, 4]}, "8": {"description": "Been going to Al's for 30 years! It's my favorite greasy hole!!! Get the double cheese burger or the polish! Yummy!", "rating": "5", "date": [2015, 6, 1]}, "9": {"description": "I go here often as it is close to work, good crew, good food. The polish are great!!", "rating": "5", "date": [2015, 8, 26]}, "0": {"description": "Wow I'm stuffed. Great conversation with real people and awesome food.  For real, find me a better steak burger than Al's! This place is great for a quick greasy bite.", "rating": "5", "date": [2015, 12, 16]}, "4": {"description": "do not go here. i repeat do not eat here. the service and management sucks. also the manager, a horrible lady with bad overbite provides horrible service. the food is under cooked and the fries be cold. also be aware that the ingredients used are not made fresh. i was disappointed and will not go back!", "rating": "1", "date": [2016, 2, 5]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.8842735886574, "longitude": -87.699266821146, "rating": "4.0", "times": {"Mon": ["10:00 am", "10:00 pm"], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "10:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": [], "Fri": ["10:00 am", "10:00 pm"]}, "price": "$", "categories": [["Polish", "polish"]], "address": ["2908 W Lake St"], "attributes": {"Take-out": "Yes", "Wheelchair Accessible": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Delivery": "No", "Outdoor Seating": "No", "Caters": "No", "Takes Reservations": "No", "Attire": "Casual", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "10"}, "leamington-foods-chicago-3": {"comments": {"0": {"description": "This place is an Artery Killing establishments. It contains tons of Genaric food items and overpriced foods. The last time I ventured into this store, a loaf of cheap bread was almost $3.. Its clear that this store caters to people they may think could careless about how much food cost due to their LINK suppliment. I highly doubt that the owners or upper staff would even purchase a gallon of milk here. They have rows full of Canned Greens amd tows Full of Sunny Delight.. Really? I understand owners like this go into neighborhoods to study how \"our\" people spend $$$ but they aren't serving the community with the lowest end of almost expired meats and generic goods at Whole Foods Prices.", "rating": "1", "date": [2013, 8, 13]}}, "latitude": 41.8675804138184, "neighborhoods": ["East Garfield Park"], "categories": [["Grocery", "grocery"]], "address": ["3240 W Roosevelt"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.7072982788086, "category": "Food", "rating": "1.0", "price": "$$", "number_of_reviews": "1"}, "wallaces-catfish-corners-chicago": {"comments": {"12": {"description": "Best fried catfish in Chicago", "rating": "5", "date": [2012, 10, 20]}, "3": {"description": "I always order the Chicken & Shrimp combo. They are one of the gems in the area. I gave 4 stars because each time I went in the credit card machine was down and I would have to leave out to go and find an ATM in order to pay for my food. The employees are very nice. They have a banquet hall next door in case you're thinking about hosting an event local.", "rating": "4", "date": [2014, 11, 22]}, "1": {"description": "For the past 2-3 months there is a sign on the door that says closed for remodeling.  I don't see any remodeling happening.  I'm guessing they are closed for good.", "rating": "3", "date": [2015, 12, 13]}, "2": {"description": "If you want a real, soulful experience with tasty catfish, definitely come to Wallace's Catfish Corner...! My friends and I wanted to get food late at night and randomly came across this place. The surrounding may be considered a bit taunting to some, but we decided to give it a try since we heard that it's one of the places in Chicago that serves fried catfish (with skin on and bone in). It was Friday night and when we came inside the place, there seemed to be some sort of party going on. There was a $5 cover to come in, which we didn't know about, but we were told that it was JAZZ/BLUES night so decided to stay.OMG... if you want to experience unbelievable, talented and authentic music sung by local blues/jazz artists, definitely come!! It's every Friday night. The people there were a bit shock to see us college kids but extremely welcoming and hospitable, nonetheless. Let me tell you.. This place was thriving with soul. We came half way through the show and the people were already drinking and having a good time. We ordered the catfish dinner. The catfish was great! It was served with hot sauce and what I come to think, their home-made ketchup (YUM), the crust was crispy and the catfish meat was hot and tender, and also with a side of fries, and either potato salad or coleslaw. Even got some free beer.. :)After a while, the owner of the restaurant, Mr. Wallace, invited me to come up front and we all started to dance. SO FUN and sudden but well worth our stay! The point of this entire long review is to say that this place was great, quite the experience and has delicious catfish. Definitely give it a try!", "rating": "4", "date": [2014, 4, 6]}, "9": {"description": "This place is in \" the hood\" and some might not be comfortable with being in an urban environment. Then this place is not for you. You should not walk from the L here.For the rest, THIS IS SOME GOOD FRIED CATFISH !!  We also got the candied yams ( good !) and the collard greens ( also good!)The \"star\" of the platter , the catfish was also crispy outside and tender inside. Dip in hot sauce ....and this becomes an outer body experience.This restaurant is one side take out and one side sit in. We got takeout which has no seats.If you want some good fried catfish , that's way off the tourist map , then Wallace's will hit the spot !!", "rating": "4", "date": [2011, 4, 22]}, "10": {"description": "My late grandmother used to always order her catfish from here and she loved it, and so did I, or what she would hand over to me. Now that I moved back to the area, I'm very willing to go inside this place and order some delicious catfish, when I have more money. Sorry, on a freakishly-strict budget, and who isn't these days?Anyway, I asked for a menu of this place a few weeks ago, and yes, this place is very unique, and let the take-out menu be a sign-it is laminated and never flat thanks to its lamination. You can roll it out and roll it back in, which is pretty cool.Another thing that makes this place so interesting is the area where you order food. On one side of the counter is seating with plants and large mounted TVs, and on the other side is nothing basically, and that's the carryout side of the restaurant.Yeah, this eatery is in the \"hood\" if you want to continue calling it that, but the area's much better than it was when I last lived there in 2002. Nevertheless, I wouldn't recommend coming to this restaurant or riding the Green Line to get here late on Friday-Sunday nights. There is a seriously high number of weird & wild drunks over here.", "rating": "4", "date": [2011, 5, 15]}, "4": {"description": "Tried this place for the First & Last time!! Ordered a LARGE Catfish dinner, was told 5 pieces. When I recieved my order, was wondering why the bag was soo small as if  I ordered a Mini Tip. Got to my car & opened the bag, 5 pieces alright.....the size of Catfish NUGGETS!!! And for $9!! Gtfoh!! NEVER EVER again will I go back here. Thats a Fact!!", "rating": "1", "date": [2014, 2, 25]}, "6": {"description": "Alright. This place doesn't really deserve more than 2 stars, because the service and food really isn't that great at all..despite all of the good reviews i have heard about it. They truly cater to veterans that have been going there for a few decades. It seems if they don't know you , or you aren't a veteran , you wont get very good service. Which is probably why the young people that do come here , do take out. We waited a very long time just for baked mac n cheese ( which didn't even have egg in it so i  don't understand why it took so long.) And as in long , i mean about 30-40 minutes. The waitress we did have had a little snappy sounding  attitude.(Dislike)So i get my food (finally) and i start digging in. I ordered Perch , Greens , and baked mac. Boy was i disappointed. That Mac and cheese was some of the worst i ever had, and their greens had absolutely no salt in them(i understand the greens because lots of people who are diabetic go there.) but come on! that mac n cheese was disgraceful. Now the perch...was very good. Some of the best i ever had...but you really should have decent sides with your main entree , because if not, the price you payed is not worth it at all.Overall , the location, service , and food basically sucked. I wont come here again. I would have been better off trying Priscilla's.", "rating": "2", "date": [2013, 2, 20]}, "15": {"description": "Rat infested hole in the wall. Crack head waitresses and bums standing outside. The city should close it DOWN. EEEWWW.", "rating": "1", "date": [2011, 8, 28]}, "0": {"description": "Headed to a hockey game with some Canadian friends in town to watch Ottawa take on the 'Hawks and found this place. It's not often you get to visit a place with such rich history AND great food!The history is documented on the walls with photos of celebrities and famous patrons of the past. From Muhammad Ali to President Obama, everyone has been there. We had the catfish, meatloaf and rib tips between us and not one complaint among our group- even the picky eaters loved everything; greens, black eyed peas, sweet potatoes, mac and cheese. We found out that the lovely proprietress was a Wilberforce grad and that just sparked off a great conversation about Ohio soul food that resulted in her bring out even more food, \"Here, try this, too!\" They could sell the hot sauce- it was that good. So was the BBQ sauce. To top it off, they had a variety of cakes for dessert- including a hard to find strawberry that was amazing. We met Wallace and saw a few other politicians while we were there.  Everyone friendly and a pleasant experience. We vowed to go to more hockey games if it meant getting to Wallace's more often.", "rating": "5", "date": [2014, 10, 27]}, "5": {"description": "Compliment sandwich....Something good: The food was very goodSomething to improve on:  I'm hoping the health inspector stickers are authentic because the place definitely wasn't the cleanest (ladies, do NOT use the restroom unless absolutely necessary). The table cloth looks like it gets washed once a week and the utensils were suspect (had to ask for replacements). Honestly, I got the shady alderman vibe a little bit too...Something good: But, all that being said, the food WAS good!", "rating": "3", "date": [2013, 4, 22]}, "13": {"description": "I'm takin' it!  Late on a Saturday, I wanted some srimp.  Been to Goose Island and its totally overrated.  This place, on the near west side might scare you if you're not one of the homies, but I've driven by there so many times and I finally had to get some.They also had rib tips and they were done pretty good too.  You have to love any place that puts Wonderbread on top of everything.  I mean, it keeps everything hot, right?The shrimp batter was great and they have good BBQ sauce.  Ribs were tender even for ordering so late at night when stuff might've been sitting out all day.  Fries, whatever - but they're covered in BBQ sauce.They've also got a pretty good menu: burgers, fish, oysters, chicken.  I'm down to go back.  I'm not scurred, and now the nice woman behind the counter knows me.You know what's sweet?  When the dude they let sit there asks if you're heading back toward the city, full well knowing that of course you are so he can ask for a ride and 4AM.  Yeah, and share my shrimp?  No thanks homie.  Catch you next Saturday though!", "rating": "5", "date": [2008, 4, 9]}, "11": {"description": "Yes, yes, a thousand times yes - eat it! I was here with a friend a couple weeks ago and sweetbabyjebus it's good food! We ate in the west side of the building - east side does deep fried fish and chicken, west side does soul food. I believe they're connected through the kitchen, but I could be wrong ...At any rate, I'm pretty sure I'll never love black-eyed peas from anywhere else ever again. I can't stop telling people about them either. \"Like black-eyed peas? I bet you never had any as good as Wallace's.\" When the gent behind the counter dished them up I saw chunks of ham and very nearly squealed right out loud. We had baked chicken - moist and the skin was perfect - and mac 'n' cheese, too (had better, but still good), and even the corn bread was fantastic.Side note: nothing to do with the food, but they had The Bachelor on the tv in the dining room. Almost everyone eating in there was a grown man, and yet, there's The Bachelor. Go figure.", "rating": "5", "date": [2010, 2, 28]}, "8": {"description": "Yes, this place is on the west side of Chicago and I stay in the 'burbs. But who doesn't travel for some good food? Well let me be honest, I was only over here because one of my nail techs was having a Support the Cure party in the area. They were having free drinks and appetizers. You know how that goes, not enough food and drinking too much. I figured I better get something to eat before I start drinking.I seen that Wallace's Catfish corner was directly across the street from the event. I wasn't really feeling any catfish but I figured I could go in and see what they have. I went in and asked for the jerk chicken and they didn't have any. The lady at the counter was very nice and told me they had soul food next door. So next door, I go.This place is like a major meeting place in this community. It is a very spacious place and plenty of seating. I must say that they had their group of retired men who are probably a staple there. They were very nice though and spoke to me. They were about to have a bid whist game in the back and had a DJ. It looks as though they were about to start partying (wish I could have stayed for the bid whist).I really didn't want anything too heavy so I opted for the veggie plate which was three sides and a muffin. I got the mac and cheese, greens and cabbage. I tasted the mac and cheese and I had to get up and look to see if my granny was back there. THAT MAC N CHEESE WAS FIRE! God Lord that food was good. The greens were well seasoned (not too much) and the cabbage was good also. Oh my, oh my the food was too good.The waitress was great also. She was very nice and speedy with her service even though it was crowded. (I sat in the bar area) I was  messed up by the food being so good, I didn't recognize that I was overcharged. But she did and she quickly apologized and corrected the problem. That right there warranted a tip. Now this is to all the people that think BJ's Market is good, go over to Wallace's and order their soul food. I bet your review will be longer than mine.", "rating": "5", "date": [2010, 10, 19]}, "14": {"description": "I hadn't been to this place in almost 5 years! Me being a Louisiana Girl, I'd like to first say that I know my way around the kitchen when it comes to Soul Food..  We have a Catfish Dinner, Jumbo Shrimp Dinner, Rib Tip Dinner and Fried Chicken Dinner (for 4 people) The meals came out to be about $42. .and yes there was plenty of Food! I give them 5 stars for that !! the food was Seasoned pretty good.  Nothing tasted like someone Stumbled over the food with an Open Salt Can.. I wouldn't ever sit and eat there.. It's a bit Crowded with \"All Walks Of Life\" in there but After you Hold your Bags close baby , this is place is a must go.", "rating": "4", "date": [2010, 3, 13]}, "7": {"description": "Although I'm still not used to eating fish with skin on (and on the bone) the catfish was tasty, the jack salmon was cornmeal dusted and even better than the catfish--though that may have been due to the work involved with the catfish!The corn muffin was tasty as were the black-eyed peas--you could taste that there was definitely a ham hock or two in the big pot those were dished from. The greens were the only really negative part to the meal, and that was kind of my fault. I was expecting vinegar on them to tone down the bitterness of the greens, but it wasn't there. Greens without it always taste bitter and a little dirty--must be my taste buds!One of my friends was shocked that I ate there alone, as they think of the west side as the \"bad part\" of town. I never felt ill-at-ease, and the patrons and servers treated me like I was a \"regular,\" talking about my day, the history of the place, and the pictures of famous visitors up around the walls.If you're looking for some tasty, authentic, soul food, then this is one place I can highly recommend! Scaredy cats can go to Popeyes and pretend--a lot!", "rating": "4", "date": [2011, 10, 22]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.88134, "longitude": -87.69645, "rating": "3.5", "times": {"Mon": ["11:00 am", "12:00 am"], "Thu": ["11:00 am", "12:00 am"], "Sat": ["11:00 am", "3:00 am"], "Wed": ["11:00 am", "12:00 am"], "Tue": ["11:00 am", "12:00 am"], "Sun": ["11:00 am", "10:00 pm"], "Fri": ["11:00 am", "3:00 am"]}, "price": "$", "categories": [["Cajun/Creole", "cajun"], ["American (Traditional)", "tradamerican"], ["Soul Food", "soulfood"]], "address": ["2800 W Madison St"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "No", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Dinner"}, "category": "Restaurants", "number_of_reviews": "16"}, "four-as-chicago-2": {"comments": {"0": {"description": "I'm sure the first thing you we're wondering is \"what the heck were you doing in that neighborhood?\"What?? A young, gay, white guy can't hang out on the west side? Lulz...Anyway, I was en-route to the Loop from St. Charles and stopped here because it was the first convenience store my phone's navigation found when I checked from I-290. I'm really not the type to get uncomfortable, even when I'm obviously out of place, but there are groups of people hanging out in front and around the building. In any area that can be uncomfortable.I was able to pop in, pick up a bottle of water (and an ice cream sandwich because it looked soooo good), and be back on my way relatively quickly. They apparently do a lot of lottery business here. If you get stuck behind a few of those customers be prepared to wait while they pick out their numbers and favorite scratch offs.Extra point because their sign about not being a currency exchange made me laugh out loud (literally).", "rating": "3", "date": [2012, 8, 15]}}, "latitude": 41.8736010789871, "neighborhoods": ["East Garfield Park"], "categories": [["Grocery", "grocery"]], "address": ["603 S Sacramento Boulevard"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.7009452134371, "category": "Food", "rating": "3.0", "price": "$", "number_of_reviews": "1"}, "inspiration-kitchens-chicago-4": {"comments": {"58": {"description": "Great well prepared, creative food served by cheerful waitresses. I loved my quiche and salad and my friends raved about their banana French toast in peanut butter batter and frittata. The chess pie with finished with was delectable as was the hot apple cider. Reasonable prices and free parking adjacent to the restaurant.Right by Garfield Park Conservatory.", "rating": "5", "date": [2014, 1, 17]}, "56": {"description": "I have been meaning to review this place for a a while now. It is a hidden gem for sure! We went there with some friends from out of town and they were amazed by the quality of the food. You can taste the freshness and every bite. What I remember most is the cucumber lemonade my boyfriend drank Also that the proceeds help the people in the neighborhood is an excellent way to spend your money! We went for breakfast and were overwhelmed by the quality of the ingredients,  the level of freshness, as well as the customer service! We will be back again and tell our friends about it as well!", "rating": "5", "date": [2014, 2, 25]}, "29": {"description": "Excellent food and service and right next to the Green Line train stop. Plan to visit again.", "rating": "4", "date": [2014, 12, 28]}, "42": {"description": "Some of the best food in Chicago!!  I couldn't love this place more.  The staff is super friendly and the place is beautiful.  I love that this restaurant is in East Garfield Park.  I HIGHLY recommend eating here!  Excellent vegetarian options too!", "rating": "5", "date": [2014, 6, 24]}, "23": {"description": "Recommend thiis restaurant.  Great atmosphere.  Great food.  Great story.  Great insoiration!", "rating": "4", "date": [2015, 4, 21]}, "47": {"description": "For those that understand the concept of this place - it really is a remarkable operation with a terrific mission.  A beautiful space across the street from a beautiful Chicago landmark park, mixed into a completely unjustified, under served community which is viewed by the general public as rough or whatever...  No matter what your take on the Garfiled Park neighborhood - this place is absolutely worthy of being a destination dining spot, and for all the right reasons.First, the ambiance was wonderful for a recent weekend brunch had by me and three others.  Great mixture of music, sun pouring in through the windows.  Clean, vibrant space that was both open, and yet offered our table enough space to not feel crammed in with the other patrons.Food was absolutely flawless.  Amazing, really.  The chefs/cooks in the kitchen make tremendous food.  Between the four of us (remember - brunch), we had three different dishes (two went for the same thing).  All three dishes were adored by everyone there.  Peach Pancakes were told to be nothing less than \"really good\" by everyone that tried (sadly, I missed out).  The Shrimp and Grits (one that I did get to try) were tremendous.  While the portion size may look to be a bit small, this dish is rich and fills you up quickly.  The grits portion comes as a lovely, delicate cake which is topped by luscious and perfectly cooked shrimp and a thick, buttery sauce - it's super satisfying.  Best shrimp and grits?  I'm no expert, but perhaps, and definitely something I've thought about going back for real soon over the last couple of days.But honestly, I can say with hardly any reservations that the Fried Chicken Sandwich was the single greatest fried chicken sandwich I've ever had.  Something I'm embarrassingly known for is my ridiculous love for fried chicken - in all forms.  Sandwich form is a good one, and while I've made great strides over the last year or so to cut more and more meat out of my diet, I still gravitate towards fried chicken when I'm out.  One of the reasons I've been able to cut more and more meat out of my eating habits is because I don't find meat eating while dining out as satisfying or necessary for a good experience as I used to.This sandwich though has flawed me and my plans to go full-on vegetarian.  It's perfectly balanced.  The chicken itself has a light, nicely seasoned breading and comes out piping hot and juicy.  A seasoned buttermilk dressing lightly slathered on a grilled bun.  A tart, slightly spicy red cabbage slaw and a side of pickled peppers add a good amount of tartness and spice.  The roll is buttery and light, yet fully holds up and contributes to the combinations of tart slaw and pickles, the smooth sauce and the chicken.I'm obsessed, and grateful that this is a lunch menu item, along with brunch on the weekends.  Comes with chips or a side salad.  $8.00.  Not that I want them to raise the price, but I'd easily pay double that for such a perfect meal.This sandwich, along with this place, and only being 1/2 block away from one of Chicago's most beautiful institutions in the conservatory is what sick days off of work are made for.  My wife and I frequently ride our bikes down Lake Street well beyond here, and we can state with certainty this specific area is nothing to be afraid of.  While I've gushed so far about the ambiance, the mission and of course the food - our service was a bit slow and labored, which is the only reason I haven't given five full stars.  We were sat at a table that was meant for a reservation, moved after being given water and so forth, and food took a long time to come out.  We didn't care in the least because our group was catching up and having a good time - but it was still something to note.For around $10/item, the food quality and experience cannot be beat anywhere in the city.  This spot is deserving of the praise and outperforms and over delivers even high expectations.  If they do half as good of a job on their mission to provide opportunities and training to the homeless and poverty-stricken as they do on their food - then this place needs to be supported to the maximum.  Something tells me they are, and for that I look forward to coming back many times over.", "rating": "4", "date": [2014, 4, 21]}, "8": {"description": "I had the shrimp and grits and my fiancé had chicken and gravy. The sauce on the shrimp and grits was an unexpected but delicious flavor. The grits are very soft and tasty, unlike your ordinary grits. My fiancé said that the gravy on his chicken and potatoes was the best gravy he's ever had. We had macaroni and cheese as an appetizer, and It was really cheesy and soft. I love that it's so easy and simple to support a great cause just by getting a meal there. My fiancé was happy to pay every dollar!", "rating": "5", "date": [2015, 12, 16]}, "31": {"description": "My husband and I have a brunch date each week and this place is hands down, the best place we've been in the city thus far. The price point is shocking (it's worth so much more), food is sublime and the story of the people beyond compare. I love going to a place that bit only leaves you with a full stomach, but great all around experience and desire to more for the community you live in. Thank you IK:)", "rating": "5", "date": [2014, 11, 23]}, "34": {"description": "Review number two for me at this place. I'm teetering between a 2 and 3 star rating now. After walking in we were absentmindedly asked to wait while they cleared some tables. They were not rude but they definitely did not have the demeanor I would expect from a full service restaurant. After being seated we were warned that they were fairly busy so the food may take a while. Which we were ok with. The problem with that is we waited at least 15+ minutes just for a drink order (we were ready to order food too but the waitress scurried away before we could). Another 10 minutes and we had our food order in. About this time a host asked us if we would move tables so they could fit a bigger group in at our table and the one next to it. Again not a big deal and we did so without problem.Then we waited about 20 more minutes for our food. And as usual the food was GREAT. Some of the best food I've tasted in Chicago. Except the tea my boyfriend ordered never showed up, nor did his toast. And we had to walk up to a host to get more water. After bringing us our food we were never checked on by the waitress... we had to walk up to the host stand where she was with everyone else working to ask for the toast. She talked to the kitchen and apologized, but the toast never actually came. Then we had to flag her down for the bill and wait another 5-10 minutes for that. And then we had to walk back up to the host stand to pay as she never came back for my card. So in short - The food was amazing. The service was beyond unacceptable. They were busy, but had empty tables and more than a few servers... who all appeared to be standing around at the register instead of checking on tables. We never got some of our food/drink, even after asking about it missing. And what should have been a 45 minute-ish dining experience at MOST turned into 70+ minutes. I'll give this place another chance before writing them off completely, but only because of the food. Next time I'll go we'll see if I'll ever recommend it to a friend again.", "rating": "2", "date": [2014, 10, 20]}, "16": {"description": "Disclaimer: This review doesn't include a Salmonella infection!When stormed out of this place the only regret I had in mind was the incessant question: \"Boy oh boy how did I forget to snap a picture...\" A picture of the absolutely RAW/ PINK RED disgusting chicken breast that came in the chicken sandwich. After about a 30 minute wait in this 4.5 stars awarded joint we received a plate of shrimp and grits so grossly salty it made us cringe followed by a plate of nicely crisped out this outside completely raw on the inside chicken breast. When we called the waitress to show her their product the first word that came out of her mouth wasn't \" I'm so sorry\" or \"I apologize\", nope it was \"AWE HeALL\". We had to just run for the hills before catching any septic doses of salmonella. All in all this was a horrid experience and we were still in shock when we got back home a few hours later. If a restaurant can successfully screw up frying a chicken breast then it is time to consider a different line of work. May i suggest musical instruments sales. On a separate but related note, it is a complete mystery as to how this place earned 4.5 stars. Now, after a few similar incidents I'm starting to doubt the integrity of reviewers on yelp.", "rating": "1", "date": [2015, 7, 13]}, "13": {"description": "My 7 year old declared this the home of the best pancakes ever. Light. Fluffy. Tasty. Out of this world. My shrimp and grits was divine. So much flavor with savory, cheesy goodness. The shrimp to grit ratio was a bit off (not enough shrimp for all the grits). But I was stuffed while leaving lots of grits left over. While the service is pretty basic, the food is top notch. We'll be back. Oh, and we finally have a good dining destination near Garfield Park Conservatory.", "rating": "4", "date": [2015, 8, 9]}, "11": {"description": "This was the best catfish po boy I've ever had outside of Louisiana.  You have to try the Brussel Sprouts the were the best I've ever had and wouldn't have an issue eating just them.", "rating": "5", "date": [2015, 11, 18]}, "39": {"description": "We first went to Inspiration Kitchens for a birthday party with a group of about 20 and had family style service. Everything was so good and we all had mounds to take home. I recommend thinking about this place for parties! So we went back with some friends and the food was just as good. Their take on southern style cooking apparently offends some dyed in the wool, my Mom's way or the highway traditionalists, but it is delicious, and every bit as authentic and tasty as Wishbone, Heaven on Seven or Dixie Kitchen (all places I like a lot). We have sampled a broad array of their dishes with nary a dud. The LEED certified setting is minimalist, but bright and cheerful, totally Chicago urban under the El, but brightened up by being across the street from a beautiful and lively park. Service has been crisp and friendly despite the fact that tips go not to the servers, but to a fund to provide meals to those unable to afford them. This is, despite being a well run, first rate restaurant, first and last, a social service institution worthy of support. Come for the food, bring your own booze and leave feeling well fed and ready to return.", "rating": "4", "date": [2014, 8, 29]}, "37": {"description": "The shrimp and grits were amazing!  Not your tradition version but oh so good.  Love that it's a BYOB as well.", "rating": "5", "date": [2014, 9, 7]}, "0": {"description": "I am thoroughly impressed by Inspiration Kitchens. According to one of the staff members, last night was the first time they had the prixe fixe meal--3 courses for $25. Before coming, I had browsed the menu , so I was slightly put off by the prixe fixe menu. However, they had thoughtful and delicious vegetarian options. For the first course, I had a spiced arugula salad. The cherries were a bit tart but not sweet, so it was well balanced. For the second course, I had the mushroom and farro risotto, which is actually made out of oats, I believe. The tofu was a tad sweet, but the flavors were excellent. The pecans and mushroom really added a hearty element. For my last course, I had the peach cobbler pound cake--also no complaints here. My dining companion had the crispy oysters, pepper vinegar short rib, and crunch cake. He said the short rib was better than similar dishes at more expensive restaurants. I would like to return either to this location or the one in Uptown for the regular menu. Inspiration Kitchens is a real hit. The mission behind the restaurant is awesome, the quality and quantity of the food is outstanding, and the staff are very nice people. Your heart and your belly will be full.", "rating": "5", "date": [2016, 1, 21]}, "38": {"description": "Seems like I caught them on an off day.  My friend, Erika A. opened my eyes into giving them another chance and I'm glad I did!  They are just what the community needs and should be a shining example for all of us who hope to inspire others.  Truly great food!  Thanks Erika A.!", "rating": "5", "date": [2014, 9, 2]}, "51": {"description": "After months & months of anticipation, I FINALLY tried it out. It was \"Mommy & Me\" Day w/my 2 daughters. Arrived@10am when the doors opened & quite naturally we were seated immediately. Loved the atmosphere but not impressed w/our Brunch items at all. I had the Shrimp & Grits(tasted quite fishy), grits were salty & I didnt like the consistency. My oldest daughter had the Peanut Butter Banana Bread & Bacon French Toast: Way Too much going on & EXTREMLY Rich. She LOVES sweets but took 2bites & said \"Im done!!\" Youngest daughter had Peach Pancakes w/Spiced Syrup, they looked light & fluffy & although she said they were good, she only ate 1/2 of 1 of 3 pancakes & didnt want it to take home. I REALLY wanted to like this place but I cant see me going back for Brunch again. Perhaps I'll try it out for Lunch or Dinner@a later date.", "rating": "3", "date": [2014, 4, 8]}, "27": {"description": "What a find! My husband, daughter & I had brunch at Inspiration Kitchen. We all ordered different menu items & all three were delicious! The atmosphere is immaculate & very cozy, the staff was knowledgable and friendly and the price was probably too reasonable! Can't wait to go back for lunch & dinner.", "rating": "5", "date": [2015, 1, 25]}, "32": {"description": "I loved the interior decorating of this place, it's fitting and is inviting to all who visit. I had a smokes fish sandwich (I forgot what type of fish), that was actually in the form of a slaw put between two scrumptious brioche buns that were amazing! Their sweet potato fries were pretty tasty as well. Their mac and cheese did not disappoint! You should definitely check this place out! Good food for an amazing cause! If you wanna help out your Chicago community while giving your tastebuds an awakening, RUN TO THE PLACE!", "rating": "4", "date": [2014, 10, 27]}, "54": {"description": "My group and I came here because we doing community assessments for a class and heard about the great community work Inspiration Kitchens are doing in East Garfield Park.  I didn't really know what to expect and I was met with an amazing meal! I saw someone at the table next to be getting the Shrimp and Girts and they looked so good that I had to order them.  I was not disappointed.  The sauce was very flavorful and the girts were crispy on the outside and creamy on the inside. Alicia, the FOH manager, was super pleasant and answered our questions with the energy of someone who really enjoyed their work.  I will definitely be taking more friends here asap!", "rating": "5", "date": [2014, 3, 11]}, "48": {"description": "Much like a lot of of reviews suggest, the quinoa burger was pretty great. We ordered the southern poutine, which was pretty delicious and the brisket was one of the best I've ever had. The apple crisp with sourgam ice cream was small but substantial to be shared by 3 people. They support a great cause and help the community and are a not for profit group. One of the chefs is in training while the head chef supervises. Certainly doesn't seem that way. They know what they're doing! Definitely a fan. Will certainly go back with friends and family. Also, this place is BYOB. Surely recommend.", "rating": "5", "date": [2014, 4, 19]}, "44": {"description": "Came here on a whim after work and wasn't sure what to expect.  Ambiance was nice and employees very friendly. The food is very good. I had the goat cheese as an app and was delighted with the sauce they use. Ended up asking for more bread and totally wiped the dish clean!The shrimp and grits is polenta style grits which was the first time I've had it. It was very tasty and had a great blend of flavors. I would definitely order it again!Definitely recommending this place and I like the concept as well of inspiration kitchens. I'll be back with coworkers and girlfriend.", "rating": "5", "date": [2014, 6, 21]}, "24": {"description": "Had A lunch Meeting @ Inspiration Kitchens. My BURGER WAS delicious ! I loved THE Brie CHEESE And bacon . The Pretzel Roll WAS. tasty too! I had Already Eaten most of the pickled Squash before I Realized they WERE Garnish for the BURGER! Crab CAKE Appetizer WAS decent. The basil Infused lemonade was awesome!!! unfortunately I WAS too full to Apprecia te the scrumptious Louisiana crunch CAKE.", "rating": "4", "date": [2015, 4, 1]}, "7": {"description": "This place is amazing! First the food is really good. They have gourmet quality food for great prices. I have gone here for lunch as well as breakfast and both dishes were great. I love the shrimp and grits, the duck skillet, the red velvet pancakes and the shrimp Po-boy I had there. In the summertime they even grown veggies in their gardedn which they use in their food and also can and sale. And not to mention that this place is a Non profit that helps teach culinary skills to people trying to get on their feet. Great cause, great food. Nothing bad to say about this place.", "rating": "5", "date": [2015, 10, 8]}, "49": {"description": "Love this place!! good food and good service!!! I live in the neighborhood so I also love how close it is!!", "rating": "5", "date": [2014, 4, 18]}, "40": {"description": "I dropped in for a late Lunch. Simple & clean decor. The menu was creative and my cray fish roll taste great. The customer service was exceptional and really affordable. Can't wait to go back for the amazing brunch I keep reading about. Walk off your food at the Garfield conservatory afterwards.", "rating": "5", "date": [2014, 7, 2]}, "53": {"description": "This is hands down, the best $10-$12 meal you are going to find in Chicago (and the only decent restaurant anywhere near the conservatory) it is also BYOB with no corckage fee, so bring your own wine and dine like the rich folk for only $25!Yes it is a rough neighborhood, but who cares. the ambiance is clean and modern, and the food is truly gourmet. It is a small menu, but they do it all to perfection. The Fried Chicken sandwich is to die for. The root beer braised brisket was also dynamite.As others have mentioned, the place is run by a non-profit with an outstanding cause, but that is not why I recommend this place, I am writing this strictly because the food is the bomb!Bottom line, give it a try....I have been back 3 times already", "rating": "5", "date": [2014, 3, 13]}, "30": {"description": "This place is right by my Art Studio, its such a find for this neighborhood.  Their mission is admirable too! The menu is exciting and executed really well!!! So bummed they are closed on Tues, since that is the day I am in the city mostly.  This place is worth going out of your way for to try!!!!! Thank goodness there's a parking lot on the premises, one that looks like an oasis in the summer no less!", "rating": "4", "date": [2014, 12, 15]}, "46": {"description": "Truly one of the best lunches I have ever had for the price! Everything was incredibly flavorful, very very fresh, and I loved a everything that I tasted. Due to the very large group I was with I was lucky enough to try most things on the menu! Delicious from beginning to end!", "rating": "5", "date": [2014, 5, 30]}, "1": {"description": "This is such a wonderful gem hidden on the west side inner city. There dishes are prepared with fresh ingredients. What they create is wonderfully made. Service is exceptional as well as their mission", "rating": "4", "date": [2016, 2, 4]}, "55": {"description": "DELICIOUS food, everything I've had there has been excellent.  Service is helpful and readily available to refill coffee, water, answer questions, etc.", "rating": "5", "date": [2014, 3, 5]}, "9": {"description": "There is nothing bad about this place at all. Cause, commitment, and excellence in food is no exceptionI always go for the Shrimp and grits.This has to be the Yummisest dish in the Chi hands down! I would have Shrimp and grits three times a  day if i couldThe pulled pork / Po-boy  is an excellent option as well.Please support Inspiration kitchen you will not regret it!", "rating": "5", "date": [2015, 8, 22]}, "26": {"description": "We had the Daily Pancake. It was a near perfect blueberry pancake. I tried both the catfish po' boy and the crawfish cake Benedict. Couldn't be happier with my choices. Have yourself a basil lemonade or BYOB!", "rating": "5", "date": [2015, 2, 7]}, "25": {"description": "What a disappointing Valentine's Day dinner!  We made reservations online and when we arrived at our dinner time, before we were even seated they said \"I'll need to get your order because the kitchen closes at 9\"....our reservation was at 8:45. I don't know why they bother giving the reservation time if it's basically impossible to accommodate. They were out of some pieces to the fish dish, and it was a set menu with only two options.... The asparagus salad was supposed to come with shaved fennel and the woman next to me had a nice serving, I had two tiny slivers of fennel. My fish was so over done it was inedible and since they were out of the risotto it was supposed to be served with it was just a very very very dry piece of fish on a plate next to salad. The beef short rib my husband got was delicious. The chowder was not tasty, and the dessert cake was very dry. My husband never complains and even he was disappointed... It was very obvious they were not prepared to serve us at 8:45..... So then don't offer the reservation slot, and you knew we were coming so don't run out of everything! We were really looking forward to a tasty meal with a great mission statement but this was a total bust. I do think we'll give it another try on a normal day but very sad about last night.", "rating": "3", "date": [2015, 2, 15]}, "12": {"description": "Wonderful food. Wonderful staff. Wonderful mission. This is a Chicago treasure. I encourage you to go, eat, and really learn about this amazing organization.", "rating": "5", "date": [2015, 12, 10]}, "59": {"description": "Went here last night with my friends for a birthday celebratory dinner. Place is BYOB, which was great. Everyone brought whatever they liked to drink and we shared. Everyone was super happy with their meals. I personally tried the bacon wrapped dates, the Southern Poutine (sweet potato fries w/ gravy and meat), the shredded beat salad and, for my entree, the root beer glazed brisket with grits. All really, really good.The actual restaurant is really cool. A very modern, open space. The server, Rianna, was very sweet and accommodating. This was a classy place. There were a few other tables occupied by either couples or groups of friends. Actually, we were a bit loud and rambunctious and I felt a little bad. We work in a heavy industrial workplace and our language can be quite colorful at times. However, the staff was cool and there were no complaints so I know next time that we likely need to dial it back a bit!This is located close to work so I'm excited to try it for lunch too once the weather is a bit nicer!", "rating": "4", "date": [2014, 1, 11]}, "21": {"description": "Looking for place to host an event (bridal shower, birthday party, etc)? This is it. The food is great, budget friendly, prompt service and all for a good cause.", "rating": "5", "date": [2015, 5, 16]}, "17": {"description": "We had an amazing time at inspiration kitchen. We got the whole experience from ordering literally everything on the menu to getting a full tour of the establishment. Their mission of helping those in need by not only giving them professional/ kitchen skills but placing them in actual jobs within a 13 week program is truly inspirational.  Btw everything is honestly delicious. My personal favorites were the shrimp and grits, pear salad and gumbo (it had just the right amount of spice).  Tell everyone you know...this is a secret you don't want to keep :)", "rating": "5", "date": [2015, 12, 10]}, "10": {"description": "I visited on a Saturday morning for brunch, and would now rank this among my favorite breakfasts in Chicago. I split the chicken and waffles and seasonal root vegetables with fried egg and onion gravy. Both were tasty. The flavors and texture of the chicken and waffles made for a delicious combo. The sweet options (rotating selections of pancakes and french toast) also sounded tasty. The service was great - friendly, helpful and attentive to coffee refills. The space is really lovely with lots of light and a pleasant atmosphere and plenty of room. I highly recommend a visit, this place is a gem!", "rating": "5", "date": [2016, 2, 1]}, "5": {"description": "Our second visit, the first was a fundraising brunch which was an extravaganza of delights.  This time, wifey and I celebrated her birthday with dinner after visiting the Garfield Park Conservatory during twilight which is not to be missed, if only for its pleasant alternative to the dead of winter.  The staff were warm but discreet, accommodating us heartily although we were the only patrons on this punishing night of a blizzard.  The three course prix fixe was tasty and generous, easily the bargain of the 21st century in Chicago when compared with a like establishment, and BYOB to boot.  The fact that it's a vocational development concern is somewhat irrelevant with regards to the quality of service and fare, but it deeply enhances the dining experience and reminds one that these skills are acquired through dedication and perseverance, and the proof is on the plate and in the hand that serves it.  The changing menu makes return visits compulsory for those who love fine dining in an uplifting, nurturing environment.", "rating": "4", "date": [2016, 2, 24]}, "3": {"description": "Wow! Amazing food, i had the gymb and chicken and waffles. I over ordered, but it was good. I will be back, i love this neighborhood and the conservatory.", "rating": "5", "date": [2016, 2, 18]}, "35": {"description": "Not to be missed and perfectly paired with the conservatory. The shrimp and grits and quinoa burger are absolutely mandatory. The staff is amazing. Wonderful and beautiful.", "rating": "5", "date": [2014, 9, 21]}, "19": {"description": "Review number two for me at this place. I'm teetering between a 2 and 3 star rating now. After walking in we were absentmindedly asked to wait while they cleared some tables. They were not rude but they definitely did not have the demeanor I would expect from a full service restaurant. After being seated we were warned that they were fairly busy so the food may take a while. Which we were ok with. The problem with that is we waited at least 15+ minutes just for a drink order (we were ready to order food too but the waitress scurried away before we could). Another 10 minutes and we had our food order in. About this time a host asked us if we would move tables so they could fit a bigger group in at our table and the one next to it. Again not a big deal and we did so without problem.Then we waited about 20 more minutes for our food. And as usual the food was GREAT. Some of the best food I've tasted in Chicago. Except the tea my boyfriend ordered never showed up, nor did his toast. And we had to walk up to a host to get more water. After bringing us our food we were never checked on by the waitress... we had to walk up to the host stand where she was with everyone else working to ask for the toast. She talked to the kitchen and apologized, but the toast never actually came. Then we had to flag her down for the bill and wait another 5-10 minutes for that. And then we had to walk back up to the host stand to pay as she never came back for my card. So in short - The food was amazing. The service was beyond unacceptable. They were busy, but had empty tables and more than a few servers... who all appeared to be standing around at the register instead of checking on tables. We never got some of our food/drink, even after asking about it missing. And what should have been a 45 minute-ish dining experience at MOST turned into 70+ minutes. I'll give this place another chance before writing them off completely, but only because of the food. Next time I'll go we'll see if I'll ever recommend it to a friend again.", "rating": "2", "date": [2014, 10, 20]}, "28": {"description": "After visiting the Garfield Park Conservatory (which I learned has a really cute children's area) we came here for lunch. I love the mission of this restaurant and fully intend on taking more friends here to support it. They provide training programs for those living in poverty so that they can find jobs in the food service industry. Our server was very sweet and was able to describe all the delicious food on the menu to us. She recommended the brussel sprouts, and they were amazing (also they were only $3 and served 4). We also had the shrimp po boy which was cooked well and seasoned nicely and only $8. The lyonnaise salad was perfection, just as good if not better than nice restaurants. Very impressed with the food and the price is unbeatable. So glad to have a place like this in the city.", "rating": "5", "date": [2015, 1, 10]}, "45": {"description": "The crowds of supercilious Yuppies that swarm the foodie establishments of certain neighborhoods of our fair city each evening - God's plague on the gluttonous - are not to be found at this Garfield Park oasis and I, if nothing else, am more than willing to capitalize on the good deeds of others. In terms of the type and quality of food, Inspiration Kitchens offers a unique good: a generous portion of fantastic food at a great price (~$10-12 a plate) served by people who genuinely seem to love their jobs: our server was genuinely friendly and unpretentious, admitting to his secret love for World of Warcraft while taking the orders. The dining area is uncrowded, with lots of natural light and a high ceiling.The food was... well, we drank sauce from its dipping vessel after the dippees were vanquished. Shortly afterwards, the shrimp came out sitting on a delicious, buttery duvet of grits as did the braised beef so tender you could cut it with a fork. I wish I could say that we demolished them, but as I savored each cushion-y bite, doused liberally with sauce americain, the duvet appeared to regenerate itself - miraculous indeed. In the end, I applauded myself for having eaten so well that I had no room remaining for dessert.Come heathen and patronize. Although I am a lolcat, and therefore questionably adherent to religion which may not offer heaven for cats, I expect to return with ritualistic frequency.", "rating": "5", "date": [2014, 6, 7]}, "33": {"description": "Awesome. One of the best meals I've had in a long time. Reasonably priced, BYOB, friendly staff, incredible food & a great cause. I highly recommend!", "rating": "5", "date": [2014, 10, 23]}, "43": {"description": "So I am a long time eater at IK EGP and everything has always been outstanding but their recent summer menu is truly impressive and should not be overlooked.   First, brunch on Sunday is a real treat.   I have fallen in love (yes, love)  with their pancakes.  It seems simple but it's an item restaurants seem to struggle  with.  Here it's like a fine piece of art.  I have had the Carmel pancakes and today I did the lemon zest with a Chantilly cream  and I think I blacked out at the table from pure joy.    If their cook Lisa is working the pancake station when you are there, you have to try them.   For lunch/dinner their southern theme is really on target with Nashville hot wings, oyster roast and summer watermelon salad.  If you have lived in the Carolinas or New Orleans, you must try.    This is a training program/restaurant so not open on Mondays and Tuesday and check for dinner service because they are often closed for private events.   Great little treasure on the west side of Chicago.", "rating": "5", "date": [2014, 6, 22]}, "2": {"description": "I've been back a few times since I wrote my first review and am a bit less enthused. The quality of some items has been a bit uneven. For example, the brisket was great the first time my husband got it, but rubbery the second. Also they serve their jar spreads with stale crackers that look like they came out the back of someone's cupboard. The pear salad was overwhelmingly sweet and the shrimp and grits were just OK.The catfish po boy, gumbo and banana bread pudding are superb. But I'm a little more reserved about Inspiration Kitchens than I was before. It is still the best restaurant in Garfield Park that I've been to, in terms of ambience.", "rating": "3", "date": [2015, 11, 11]}, "18": {"description": "Amazing lunch!! The food and staff was lovely and inspirational. Our group literally ordered everything on the menu and absolutely everything crushed it! I can't wait to come back. What a professional and friendly atmosphere.", "rating": "5", "date": [2015, 12, 10]}, "41": {"description": "Ate here for brunch today.  I wasn't sure what to expect, but we were looking to try something new out that was close.  This place is great!Let's start with the food.  I tried the brunch buffet.   Usually when you're dealing with buffets, the food suffers.  Considering when we went, they only had a few tables, but the buffet was fresh.  I saw several of the cooks bring out fresh food to replenish when I was eating.  The shrimp grits was very good.  I haven't had it like it was prepared which was almost like a quiche.  The chicken and waffles were very good especially with the spicy syrup.  I'd love to go back with friends to try this place out for dinner.I can't also help but review this place because it's a great service for the area.  The fact that they do free training for transitional people is really a fantastic thing.  Even your tip goes to help people that need meals.   I love the idea of this place, and the fact that the food was fantastic makes it even better.Check this place out!  I feel like it's a little gem that no one knows about that everyone should.  Get some great food, and help a worthy cause.", "rating": "4", "date": [2014, 6, 29]}, "52": {"description": "had an event here with 50+ people. food was great, staff was friendly and super helpful. the space is modern, bright and very nice. love the big windows that lets the sun shine in. they were very accommodating with some special requests/needs. very good experience.", "rating": "4", "date": [2014, 3, 29]}, "50": {"description": "Great food, and you're helping those who are less fortunate. How can you beat that? Don't forget to try the bacon-wrapped dates!", "rating": "5", "date": [2014, 4, 13]}, "4": {"description": "Went with some friends, feeling excited to try something new. The ambiance was casual, sort of a no frills urban feel, which we liked. The service was absolutely the worst service I've ever experienced, at any establishment, ever. The waitress had a serious attitude problem and I could not figure out whether her face was permanantly affixed in a deranged scowl, or if she just hated life and everyone in it. She was by far the most rude, disrespectful, inattentive service worker we could have encountered. She could not describe the menu items when asked, she could not remember what we ordered, she never offered drinks of any kind, and once we got water she never offerred to refill it for us. Our order came out incorrect, and our bill was also wrong. The only reason I left any tip at all is because I would have been embaressed not to while dining with friends. Shame on Inspiration Kitchen for allowing this person to be the face of the business and treat their customers this way. Disgraceful.", "rating": "1", "date": [2016, 2, 20]}, "6": {"description": "I really like how this place offers great food and a very good social mission. The prices are very reasonable, and it's conveniently located right next to the Garfield Conservatory. I didn't feel like eating something heavy so I got the beet and baby kale salad, which was satisfactory. There was sliced beets, baby kale, pecans, and bacon lardons (the best part but definitely not the healthiest). I tried my friends' gumbo and it was very delicious and so was their pancakes (buttery, light perfection!) I would definitely come back for the shrimp and grits next time, which is their best seller.Our server was super sweet! A wonderfully nice lady who took good care of us. Please come and support their mission! You'll get a great meal and a warm fuzzy feeling when you leave for supporting a good social cause.", "rating": "4", "date": [2015, 5, 25]}, "22": {"description": "Finally a brunch place where the food not only tastes worth it, but is cheaper than what you'd expect from one of the north side joints. Even more, it has a fantastic mission. Much to my Southern mother's dismay, my sister said that the shrimp and grits was the best she'd ever had. The vegetarian fare was plentiful and tasty. It's definitely a great spot to head to after checking out the conservatory across the way.", "rating": "5", "date": [2015, 5, 11]}, "15": {"description": "Looking for place to host an event (bridal shower, birthday party, etc)? This is it. The food is great, budget friendly, prompt service and all for a good cause.", "rating": "5", "date": [2015, 5, 16]}, "57": {"description": "Gourmet meal at diner price!! The pecan flavored catfish tasted like bacon. It was wonderful. The server was very nice and service was good. My girlfriend had the pimento grilled cheese and it was peppery, savory, on buttered bread. The grilled cheese was an experience in and of itself. Finally, tips support a good cause. Win-win for all involved.", "rating": "5", "date": [2014, 1, 25]}, "20": {"description": "I really like how this place offers great food and a very good social mission. The prices are very reasonable, and it's conveniently located right next to the Garfield Conservatory. I didn't feel like eating something heavy so I got the beet and baby kale salad, which was satisfactory. There was sliced beets, baby kale, pecans, and bacon lardons (the best part but definitely not the healthiest). I tried my friends' gumbo and it was very delicious and so was their pancakes (buttery, light perfection!) I would definitely come back for the shrimp and grits next time, which is their best seller.Our server was super sweet! A wonderfully nice lady who took good care of us. Please come and support their mission! You'll get a great meal and a warm fuzzy feeling when you leave for supporting a good social cause.", "rating": "4", "date": [2015, 5, 25]}, "36": {"description": "Wow! Was Completely speechless after leaving this place.. To say this is a hidden gem is an understatement. Words can not describe how Impressed we were . From the moment we pulled up the property has an outdoor garden that they pick fresh produce from to use in their dishes. The decor and ambience is super bright and welcoming. From the bright blue walls to the personalized wood. White linen napkins and a bottle of fresh cold water in glass bottles.  We were welcomed by the  Sweetest woman ever. Se was so natural and so happy that I wanted to her to sit and join us! She was super motherly  and She said I had to get the basil lemonade and the crab cake Benedict. \" holy smokes lady did I just hear you right.\"  Basil lovers be warned you will fall in love with this concoction . (Why hadn't I thought of this before. )I couldn't believe it was only $2 it went perfect with my champagne!! Oh did I say byob yet?? When my monster sized crab cake Benedict arrived I was speechless... How is this only $10 . My mom ordered the 2 egg special ( she's pretty simple.) For dessert we shared the French toast with blueberries and marscapone!! Wow, the batter was even better. When our bill came. It was less than $30 how is that possible I have no idea. So I saved the best for last. This restaurant is not just a place to eat it's an organization that trains people that are or near homelessness . Most of the money goes to support people in need and gives them a job they may not have had a chance at.  Their families also get a free meal at the restaurant. Why this place isn't packed every day is beyond me. I want to always go in and get a table but I want this place to succeed and stay open. I can only hope we have an elite yelp event here! Ps they also host weddings and other events.", "rating": "5", "date": [2014, 9, 8]}, "14": {"description": "Had A lunch Meeting @ Inspiration Kitchens. My BURGER WAS delicious ! I loved THE Brie CHEESE And bacon . The Pretzel Roll WAS. tasty too! I had Already Eaten most of the pickled Squash before I Realized they WERE Garnish for the BURGER! Crab CAKE Appetizer WAS decent. The basil Infused lemonade was awesome!!! unfortunately I WAS too full to Apprecia te the scrumptious Louisiana crunch CAKE.", "rating": "4", "date": [2015, 4, 1]}}, "neighborhoods": ["East Garfield Park"], "latitude": 41.8850212, "longitude": -87.7140198, "rating": "4.5", "times": {"Mon": [], "Thu": ["11:00 am", "9:00 pm"], "Sat": ["10:00 am", "9:00 pm"], "Wed": ["11:00 am", "9:00 pm"], "Tue": [], "Sun": ["10:00 am", "3:00 pm"], "Fri": ["11:00 am", "9:00 pm"]}, "price": "$$", "categories": [["American (New)", "newamerican"], ["Community Service/Non-Profit", "nonprofit"], ["Caterers", "catering"]], "address": ["3504 W Lake St"], "attributes": {"Parking": "Street, Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Casual", "Has TV": "No", "Takes Reservations": "Yes", "Good for Groups": "Yes", "Good For": "Brunch"}, "category": "Restaurants", "number_of_reviews": "135"}}