{"pullman-caf%C3%A9-chicago": {"comments": {"12": {"description": "5 stars for the bread pudding and the charming location! Good luck! Glad you're here.", "rating": "5", "date": [2015, 10, 11]}, "7": {"description": "Stopped in during Pullman Home tour. There are sandwiches,  amazing cookies and nice people.", "rating": "5", "date": [2015, 10, 10]}, "3": {"description": "Cool little spot in the west pullman area, we got coffee, and then free coffees to go! The staff were all very nice and friendly. It's a good place to stop at before Argus brewery tours, or after to sober up in our case haha, im sure their food is really good and I'd get some if I'm ever back there again, but I really liked the vibe and the people there", "rating": "5", "date": [2016, 1, 27]}, "1": {"description": "The Pullman Cafe is a cozy, relaxed neighborhood haven.I had some time to kill, so I happened in on a Wednesday afternoon to see if it had opened yet. I was pleasantly surprised to find that it had, and I had a chance to chat a bit with the owner and her daughter. The menu has the assortment of desserts and sandwiches you've come to know and love in a cafe at a reasonable cost. I ordered a toasted bagel and cream cheese, mmm.Their unlimited coffee was cafe quality, nice and fresh.  They told me they've been open for about two months so far.  I'm sure in time, this will become the go-to place in the area, and not just on weekend mornings. If i had one wish for them, I would hope that they could open a couple of hours earlier, and have the support of the community to make it worth their while.  The area McDonalds needs some early morning competition for people who want to have a more relaxing way to start the day. All in all, this is a welcoming place in the neighborhood worth visiting when you get a chance. .", "rating": "4", "date": [2015, 12, 15]}, "2": {"description": "Oh what an experience, an AWFUL one at that! I was excited to check out this new cafè in my old stomping grounds. I entered the cafè greeted everyone with a hello to receive nothing in return. Whelp, I chalked that up to midday blues. I sat down, pulled out my laptop and began working. I thought the café environment welcomed a working atmosphere, needless to say I was wrong. About 10 minutes later, I was given the menu and was told if I wanted to place an order, go to the counter. I glanced over the menu nothing grabbed my attention except the $10 min. for credit cards. I was torn because I only wanted tea and a dessert, which didn't quite equal $10. About 30 minutes later, I heard a camera snap and coincidently one of the employees was directly across from me. I didn't know if it she was taking a picture of me or of something random. However, how things unfolded it was obvious she took a picture of me.  The same employee approached me, and rudely asked was I going to order something. I said well, I am still uncertain but you can take the menu. I assumed she needed the menu for the customer who had just entered-whom btw she greeted nicely and warmly. Nope! She put the menu back in the holder. I was in shock that I was being treated like this!The icing on the cake! The owner approached me, which I was confused about because I was under the impression the café was owned by a gentleman.  Anyhoo, she introduced herself and asked was I was going to purchase something. I was completely flabbergasted at this point! I said if I was, I am not anymore! She asked me to LEAVE! She said is the expectation for me to purchase something, and I said I had every intention when I entered to place an order. However, your staff treated me poorly and I was on the fence if I wanted to patronize the business. She told me if I was going to sit there with my laptop and use her wifi (which I used my hotspot) I could go to McDonalds! She went on to say, this is a restaurant not a library, it is at her discretion how she wants to handle her policies regarding orders and credit cards fees. She went on to say I was being rude by explaining my experience and telling her I've never been treated like this. She told me her staff is family as if that made them exempt from being rude to a customer! Oh and I must not be from the area. I made it clear I work in the hospitality industry and by no means how I've been treated equates to customer service. She replied, she is sorry I feel that way! She humored me and said when I return I would have to purchase something after asking me to leave again! I am terribly disappointed, and it is unsettling how the owner handled the situation because her employees/family will think it is ok. As a golden nugget of advice for them, a purchasing policy means nothing to the customer if he or she is not aware. They may want to implement that along with a greeting policy for employees. I wish them luck, and am glad my intuition was indecisive.", "rating": "1", "date": [2015, 11, 3]}, "9": {"description": "Nice, friendly atmosphere and Cafe du Monde coffee! I'll be back.", "rating": "4", "date": [2016, 2, 24]}, "18": {"description": "Fresh, delicious sandwiches and warm atmosphere. So glad you're here!!!", "rating": "5", "date": [2015, 10, 20]}, "10": {"description": "Lovely little cafe in a perfect area.  I have daydreams about the lemon bars and bread pudding!", "rating": "5", "date": [2015, 12, 11]}, "13": {"description": "Terrific menu and great coffee. The atmosphere is warm and friendly - exactly what you want in a neighborhood spot, located in the most beautiful neighborhood in Chicago. Well Done!", "rating": "5", "date": [2015, 10, 11]}, "16": {"description": "Simply and tasty in a warm cozy space, like visiting family.", "rating": "5", "date": [2015, 10, 11]}, "17": {"description": "Cannot say enough about this establishment. Were more than courteous to my family upon our visit.  The view of the Greenstone Church is fabulous, and the interior was amazing.", "rating": "5", "date": [2015, 12, 14]}, "15": {"description": "Stopped in for a snack after the Pullman home tour. Yummy bread pudding and charming atmosphere. The perfect neighborhood spot! Best of luck!", "rating": "5", "date": [2015, 10, 11]}, "0": {"description": "Wonderful sweet spot in the Pullman area. Stopped in after grabbing some smoked salmon at Calumet Fisheries, and instead of kicking us out, they excitedly asked about our fish as we grabbed some delicious coffee to eat it with. Don't come expecting a full espresso bar or anything. But if you're looking for wonderful welcoming people and good coffee in west Pullman, this is the spot.", "rating": "5", "date": [2016, 2, 2]}, "5": {"description": "The cutest little café in the heart a hidden historic neighborhood. The staff were incredibly nice and welcoming. What I liked best about this place is that everything was fresh and home made. The flavors were evenly balanced and super delicious! I would definitely eat here again. My husband and I shared the Gotham Green salad and the Italian sandwich. We also tried the lemon bar, cream puff and the bread pudding. I can't decide which one I like best.", "rating": "5", "date": [2015, 11, 23]}, "11": {"description": "Very good food, excellent atmosphere. Plan a walk through Pullman, have lunch at the Pullman Cafe, then top it off with a tour of Argus Brewery.", "rating": "5", "date": [2015, 10, 11]}, "8": {"description": "I grew up near the Pullman area and decided to poke around one day before visiting my mom. I knew of the Pullman Cafe so having lunch there was on my agenda before I arrived in the neighborhood. I walked into a warm, inviting, nicely decorated space. I learned (overheard other customers talking) that the mother of the owner MADE the tables and chairs. Wow! Now to the food. The gentleman who took my order was lovely. The menu is limited but there's enough of a variety of salads and sandwiches to choose from. They had a nice selection of bag teas. I ordered the turkey sandwich and a tea. I was just expecting a standard fare sandwich but honestly, it was delicious!  The only unfortunate thing was somehow my order was not put in and it took some time before they (and I) realized that there was a problem. The gentleman was extremely apologetic and gave me an order of bread pudding on the house. I wasn't planning on eating dessert (trying to diet) but once it was in front of me, I couldn't resist. Ok, I could have taken it to my mom... Anyway, it was homemade and really good! All of the desserts are homemade and are very popular, according to the regulars that came in. It's a really sweet place and I will go back, especially in the summer when there is more activity in the neighborhood.", "rating": "4", "date": [2016, 3, 4]}, "4": {"description": "First time stopping by the Pullman cafe. I was greeted right away and offered a seat . I love the ambiance of the cafe, feels cozy and welcoming. The restaurant is beautifully decorated all around.  Staff is so friendly and fast. I tried the garlic sausage pizza. It was wonderful . I'll be coming back for that and the delicious bread pudding.", "rating": "5", "date": [2016, 1, 10]}, "14": {"description": "A very cute and cozy joint!", "rating": "5", "date": [2015, 10, 5]}, "6": {"description": "Pullman Cafe opened a few months ago, and I was quite impressed. We went for lunch before heading to the Argus Brewery for a tour. Pullman Cafe has a pretty limited menu, but the food was good and reasonably priced. The service was great and the place is really cute. I highly recommend the Gotham Greens Salad and the bread pudding.", "rating": "4", "date": [2015, 12, 20]}}, "categories": null, "attributes": {"Good for Working": "Yes", "Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Ambience": "Casual, Intimate", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch"}, "times": {"Mon": [], "Thu": ["10:00 am", "7:00 pm"], "Sat": ["10:00 am", "6:00 pm"], "Wed": ["10:00 am", "7:00 pm"], "Tue": ["10:00 am", "7:00 pm"], "Sun": ["10:00 am", "3:00 pm"], "Fri": ["10:00 am", "7:00 pm"]}, "rating": "4.5", "price": "$", "number_of_reviews": "19"}, "walmart-supercenter-chicago-7": {"comments": {"12": {"description": "This seems to be a great addition to this area. It's big and well stocked. I must say that I am really impressed with their cosmetic selection. It's much better than the other locations I have been too. The employee who was working this department was pretty nice too.", "rating": "3", "date": [2013, 10, 26]}, "3": {"description": "I don't normally write a review like this but the level of customer service at this Walmart has reached a new low. So I was heading into Walmart about 10:50 and mind you this Walmart closes at 11 and was told sorry sir we are closed. Technically they're not till 11 so I went to my car after questioning the time and getting treated rather rudely. I decided to call the store. After the phone rang for approximately 5 minutes the phone was answered by someone disguising their voice like a kid to let me know that Walmart was closed and then hung up. Are you serious are these the people who are asking for higher wages across the country? People who don't want to deliver customer service, don't want to help, want to close the story early so they can get home, and who obviously have not a single bit of professionalism about them. I mean really this is awful. Needless to say I hope I never have to shop at the Walmart again if I do it'll be way too soon.", "rating": "1", "date": [2016, 3, 4]}, "1": {"description": "I ventured to this Walmart or better known as \"Wally-World\" late at night. My goal was to avoid the day shoppers and traffic. My plan was to get in and get out, which was an EPIC FALL!The store was in middle of setting up their displays from Valentines day to Easter. I had a hard time locating my items since I usually do not come to this location. I also had a hard time locating any employee for assistance to locate these items. Oh by the way, you will definitely find the security before you spot a store employee. However I notice the aisle were pretty clean.Now time to talk about my checkout experience. As I approached the registers I noticed only a few checkout lanes were open. There were only a 2 people ahead of me in my checkout line. I did not know why my wait in line was so lengthy. The cashier was talking to another employee who was standing nearby. OH, I know where you can find all of the employees up front by the registers and door. The cashier made frequent trips away from the register. None of the customers ahead of me had large orders.  Whatever time you enter Wally-world be prepared to waste your precious time.", "rating": "2", "date": [2016, 2, 16]}, "2": {"description": "This has got to be the WORSE Walmart in America. Too many young employees who really don't care about customer service at all, although they are in a customer service business.Try going to the deli counter on a Saturday (a peak shopping day.) One person working, although there may be a line a mile long waiting for service. You can see in the back thru the window at least 5-6 other employees laughing and talking. They will even look and see the line of customers, yet no one comes out to assist. This place is a customer service nightmare!!! The floor managers are no better. Straight attitudes. Avoid this place at all costs!", "rating": "1", "date": [2016, 2, 5]}, "9": {"description": "I love this store because I work there and there store our very clean doing the daytime.", "rating": "5", "date": [2014, 1, 3]}, "10": {"description": "I received an iPad Mini vs. an iPad 2 from a layaway order back on 12.09.13. I was in a hurry and it was a gift to myself so I didn't even notice, (or take it out of the bag) until today. I take it back to the store and explain the mixup, and the employees in the Customer Service department seemed weary and nonchalant about this huge error. One casually calls back to the electronics department to see if there was an iPad 2 in stock.Meanwhile, a 2nd female employee takes my receipt and decides that she's going to walk back to electronics and check on things personally. She stays gone for about 10 minutes, walks back to the cust svc area w/my receipt still in hand and than goes back for another 10-15 minutes. I decide to go back and see whats going on (I was simply going to ask if I could go to another WalMart if the iPad was not in stock), and she's lounging against the counter casually talking to (an obviously busy) electronics employee. I ask her what's happening and she barely looks at me, stating that she's trying to find out if they have an iPad, and tosses out that \"its busy\". Turns out they DO have the device, but what happens next is pretty amazing, even for our neighborhood. She gets the iPad in her hand turns around without a word to me and heads BACK up to the Customer Service area along with the Merchandise supervisor and they are chatting with each other while, I, the customer (remember me?) trails behind them wondering how I've managed to stay in this store for 40 minutes and how on earth 20 of them were spent finding out if there was an iPad 2 on deck for an exchange.Back in the cust svc area, a couple of managers are consulted and the iPad Mini is taken OUT of the box in front of me, serial numbers are checked and my id and receipt are thoroughly audited, ONLY then does the merchandise supervisor present me with the iPad 2 and says \"I apologize\". Unreal. I explained to them that they were not doing me any favors and stated that I expected basic courtesy  since I'm the one who paid $400 for a device that an employee walks through the store with, thoroughly ignoring me like I'm a pesky fly or necessary evil she has to deal with. Bottom line: These employees need to be trained in common, basic, customer service. Just because Walmart is large, and successful, does not excuse this kind of behavior... I'm offended and wish I could boycott the establishment. Our area is so underserved though I won't be able to avoid going unless I want to drive longer distances to patronize others.", "rating": "1", "date": [2014, 1, 4]}, "4": {"description": "Terrible system. Do not come to this store. There is a lot of people that don't care at Walmart But not all of them. I wanna say that  DAVIDA in ( pick up here ) was very helpful she was reasonable and she was super nice.  I requested the help of a manager but they never arrived despite that they were called several times from the site and from the operator. They never arrived. How is that possible.If it was for DAVIDA I would've given 5 star but I can't because it was Walmart's fault.", "rating": "1", "date": [2016, 1, 6]}, "6": {"description": "Terrible, TERRIBLE customer service. Associates do not greet customers, rude & often just huddled amongst themselves. I actually heard an employee answer the phone & say \"hello\" as if he was at home. The associate then replied \"yes this is wal mart\"; because the caller was obviously taken aback by the employees casual phone etiquette.  I am all for hiring within the community but for Gods sake TRAIN YOUR EMPLOYEES.", "rating": "1", "date": [2015, 7, 5]}, "15": {"description": "Its Walmart! What do you expect?  Get back in your time machine to early 1900s and have an 8 year old cash you out. I've had my fair share of ignores and saw supervisors dig into employees but what do you expect in this neighborhood. No one speaks proper English. The grocery section is okay, there are little gems in the clothing section (jeggings, denim skirt, cardigans) and it's CLEAN. The employees need to be spoken to about wearing proper pants. The men are fine but GOD HELP THE WOMEN. Why are you wearing leggings, jeggings and tight chinos? Self check is at the entrance not the back of the store. The cosmetics and hair care sections are in the back after pharmacy. This Walmart has the 1st cashier in Cosmetics. If you have a few things and want to get out fast trot there and avoid the line at self check when it gets busy. Electronics needs sprucing up and employees need training on branding. Hire me if you want a memorable positive experience.", "rating": "4", "date": [2014, 8, 3]}, "0": {"description": "Inner city Walmart does exactly what it promises: one stop shop, everything you need in your own neighborhood. This store stays clean, I'll give the credit to good management. The staff is mostly young adults so come in with your research done on the products you're seeking, you won't get much info here.  I regret the lack of a tire shop at this location although the produce stats fresh and the aisles are usually fully stocked. Overall not bad.", "rating": "4", "date": [2014, 9, 14]}, "5": {"description": "This store is a joke. Walmart is already a terrible place, but this is over the top. There are never enough cashiers not to mention the workers never seem to want to do their jobs? They're always on their phones and goofing around with one another. I'd give zero stars if I could.", "rating": "1", "date": [2015, 10, 5]}, "13": {"description": "My experience on the first day was not a good first impression.Let me just say first in regards to the Chatham Walmart near by I had a preconceived impression before I even walked into the Walmart thinking the staff would be Ruder than most Walmart's and I would receive less then stellar service.I was wrong the Chatham location has THE BEST service I ever had at more stores and Walmart and the staff was extremely friendly.So I had high expectations on this Walmart in Pullman.....the perceived notions I had for the Chatham location were realized at this Walmart.The location looks great but the problem is there is not Security Company like at the other Walmart to bring order to the parking lot. Meaning you can park anywhere blocking traffic well a driver is waiting everyone and anywhere for the person to come out.The employees are lazy and many are literally grabbing themselves having same sex romances in front of the customers.In the kitchen it is full of gay teen boys who I literally saw making out and two more in the kitchen goofing off well two girls worked hard alone with customers on the deli and kitchen side.The gay guy helping people get to a line I witnessed another gay guy grab his rear end well the guy directing customers licked his lips.Worse yet the employees there really did not want to work there so I have to ask myself did someone higher up get all these people jobs who are family?I had guys all around the store talking about how they don't care about the place or customers and how they don't care if anyone over hears.Worse yet I saw a manager chiding an employee because she was eating crackers well working.....Stay away from this Walmart at all costs they need to fire everyone here and bring in more people who want jobs rather then bring in people who all the do is literally touch each other.Talk about a sexual harassment suit waiting to happen.", "rating": "1", "date": [2013, 9, 14]}, "11": {"description": "Great store..good customer service and always clean . Best in Chicago. I was shopping there plenty of times associates are always willing to help and welcome. And great leadership team.", "rating": "5", "date": [2014, 3, 21]}, "8": {"description": "I'll give them 2 stars ONLY because they are well stocked and clean. BUT customer service is everything! The way you treat customers will always be in their memory bank. That will determine whether a person wants to come back or not. I don't know who the hiring manager is but MAJORITY of their employees are not MATURE for the job. You see a lot of social gatherings, playfulness and laziness here. Sometimes you can't even find an employee because they are all huddled up having personal conversations. There are a FEW employees that I met that are well-mannered and do their job quite well but I honestly feel like this Walmart needs better employees.", "rating": "2", "date": [2015, 4, 29]}, "14": {"description": "Nice big walmart but the workers are not properly trained. A bunch of workers standing outside on smoke break and the girls in the electronic section is confused about how to handle customers. I will go back but please train the employees a little better.", "rating": "2", "date": [2013, 10, 6]}, "7": {"description": "I would have given it two stars since I just got home from a visit to this Wal Mart after a friend of mine had told me to go there when I got my transportation up and running. So today I decided to go over to that Wal Mart and sure enough what many posters said pretty much was self explanatory. I walked in and the greeter was busy playing on her phone and having a conversation with someone. I walked into the home and garden department to look at buying a sprinkler and I didnt see not one employee in that area. Then I notice that lines tend to be pretty long with the hood idiots tying up the register trying to get their money straight or having conversations with cashiers. It's bad enough you're trying to get out of the store without some kind of hold up. One poster stated the maturity level of it's workers and I do agree that Wal Mart is employing too many high school and early college age workers who don't seem too serious about their jobs. Customer service needs major work there's no reason why greeters should be having extended conversations with people when their job is to greet the customers that enter the store. I do give them props for the cleanliness of the store since I don't see that in many Wal Marts where the store and bathrooms arent clean. The proper training of employees is needed and also enforce that while on the clock conversation should be minimal only to find something for customers not standing around having personal group conversations when they could be assisting customers. Overall it's ok I'll come back since the cleanliness is what I liked about the store.", "rating": "2", "date": [2015, 8, 8]}}, "latitude": 41.6935043, "neighborhoods": ["Pullman"], "categories": [["Grocery", "grocery"], ["Department Stores", "deptstores"]], "address": ["10900 S. Doty Avenue"], "attributes": {"Parking": "Garage", "Take-out": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.598793, "category": "Shopping", "rating": "2.5", "price": "$$", "number_of_reviews": "16"}, "dollar-tree-chicago-37": {"comments": {"0": {"description": "I came here the other day after a friend told me to check out the stores in the strip mall. Out of many Dollar Tree locations I've been to this is one of two I'll come to and reason being is because I've gone to a few locations and the place looked like it was ransacked by hoodrats with stuff all over the floor and thrown everywhere even some things had been opened. Not to mention the level of cleanliness of the store is actually very good and that's what is a selling point for me when I come to Dollar Tree to shop for things in my home. I am going to come to this location if I feel like switching between the Cottage Grove location and the one Doty Rd since these are the only two on the south side that are actually decent and clean locations to shop in.", "rating": "4", "date": [2015, 8, 9]}}, "neighborhoods": ["Pullman"], "latitude": 41.6967597, "longitude": -87.5987884, "rating": "4.0", "times": {"Mon": ["9:00 am", "9:00 pm"], "Thu": ["9:00 am", "9:00 pm"], "Sat": ["9:00 am", "9:00 pm"], "Wed": ["9:00 am", "9:00 pm"], "Tue": ["9:00 am", "9:00 pm"], "Sun": ["9:00 am", "8:00 pm"], "Fri": ["9:00 am", "9:00 pm"]}, "price": "$", "categories": [["Discount Store", "discountstore"], ["Convenience Stores", "convenience"]], "address": ["10820 S Doty Rd"], "attributes": {"Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "1"}, "ross-dress-for-less-chicago-3": {"comments": {"0": {"description": "Ross is a run of the mill discount department store.  Unlike a Marshall's or TJ Maxx, which generally sell nicer stuff from prior seasons and the like, Ross is more of a mixed bag.  You get the occasional great find like a pair of DKNY jeans or Calvin Klein dress for virtually nothing but you have to sort through a whole lot of junk to do it.  If you just want cheap stuff even cheaper, Ross can be useful.  My issue with this particular Ross is the odd ratio of security to actual sales staff.  I have twice had to put things down and walk out because there was only one cashier to ring up purchases, a long line, and three security guards standing around the front of the store staring.  That gets on my nerves because while Ross as a chain seems freakishly preoccupied with theft prevention (God only knows why as they sell very little worth stealing), that kind of egregious nonsense seems to only be reserved for certain communities.", "rating": "2", "date": [2015, 1, 10]}}, "neighborhoods": ["Pullman"], "latitude": 41.6949983, "longitude": -87.5973954, "rating": "2.0", "times": {"Mon": ["9:30 am", "10:00 pm"], "Thu": ["9:30 am", "10:00 pm"], "Sat": ["9:00 am", "10:30 pm"], "Wed": ["9:30 am", "10:00 pm"], "Tue": ["9:30 am", "10:00 pm"], "Sun": ["9:30 am", "9:30 pm"], "Fri": ["9:00 am", "10:30 pm"]}, "price": "$$", "categories": [["Women's Clothing", "womenscloth"], ["Discount Store", "discountstore"], ["Men's Clothing", "menscloth"]], "address": ["10830 S. Doty Ave."], "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Fashion", "number_of_reviews": "1"}}