{"new-little-china-chicago": {"comments": {"3": {"description": "We ordered our food from grub hub on Friday March 6th, after 2 hours I called to check the status of delivery and a women told me the driver had been here. I was starving and on high alert for my food and no bells or phone calls were missed. After going back and forth it was discovered that the driver actually called the wrong number multiple times even though the correct number was in the delivery instructions. At this point the women offers no apology and has an attitude and says do u want your food or not. It was 10:40pm, I placed my order at 8:20. Of course I want my food cause everyone else was closed and I was hungry. (Hints why I ordered food in the first place) the women offered no compensation and still no apology. The 2nd driver comes to deliver the food. He calls the correct number and tells my boyfriend to come to his car....... Excuse me. Why would anyone walk outside of their home to a car to pick up food. So my boyfriends tells him that he will meet him at the door. The driver then starts to holler at him until finally my boyfriend says \"look Im coming downstairs to the door and u have to walk to the door and that's the end of it\". I look out the window to see the driver has parked down the street (even thought there was a park in front) he walks up and doesn't look at the address and proceeds to turn around back to the car. Since I was looking out the window I jollared out to tell him the right door. He then has a complete attitude with my boyfriend and tells him well next time don't order. Is that how I should be treated over some food that I already paid for by credit card over the food. Simply terrible service. The fried rice. wasn't bad except since it took 2 hours it was like warm and the wings were soft.  I will never order from them again.", "rating": "1", "date": [2015, 3, 7]}, "1": {"description": "Believe the other reviewers.", "rating": "1", "date": [2015, 8, 17]}, "2": {"description": "So far no problems with this place. Food is cooked fresh, only thing they are cheap about is charging for one hot sauce. Other then that keep it up! I seen the other issues about delivery issues. For the area of location I highly doubt anyone tips. As being the driving I wouldn't go an extra mile for the customer.", "rating": "5", "date": [2015, 9, 9]}, "5": {"description": "Statement from the White delivery driver, \"I am not bringing the food up to your office because \"you people\" don't tip!Yes, really.  Last week, I ordered $75 worth of food for a meeting and asked it to be delivered to the meeting location. I received a call from the delivery driver letting me know that I needed to come outside to his car to get the food. I let him know the room number and he stated that he was not coming up because \"you people \" don't tip! Ok, as you are referencing a primarily Black institution and speaking to a woman of color, I definitely take offense to that.I came downstairs and called the owner on the phone (Lilly?). There was no apology or anything... Just them arguing back and forth. The driver then shoved the bags in my hands and told me he was in college and didn't need this job. A few hours later, the driver began harassing me on my cell phone through text messages. Sigh... Block and tIme to cancel the credit card I used. Also, all of the items I ordered were not in the bag!I have placed several orders here but I promise you that this one was the very last!", "rating": "1", "date": [2014, 1, 13]}, "6": {"description": "WARNING! I repeat. WARNING! It took 2hrs for my order to be delivered. Apart from being cold the food was not tasty. No flavor and beef had weird texture. Never again. It was the first and last for me.", "rating": "1", "date": [2013, 1, 20]}, "7": {"description": "i've only ordered twice and both times were pretty bad.. the first time my sesame chicken arrived at my house, dried out, and old... it was very bad..also the delivery driver is late and filled with lame excuses. this second time, well i'm eating it now and my stomach is hurting from the mystery shrimp. also the food was very very cold and late... took over an hour and a half... i ordered with grubhub and paid with paypay... because of the terrible service i asked grubhub to retract my tip... the delivery guy just makes excuses that are clearly lies. and when i called him out he got an attitude and made up some more lies and the restaurant refused to take any fault when grubhub called them to tell them what happened!!! just dont order from this place... i would have given NO STARS if that was an option :(", "rating": "1", "date": [2013, 4, 14]}, "0": {"description": "Decided to get take out from here recently and used one of the online sites to order (and avoid a wait).I get there about 10 minutes after the time they suggested...waited for the cashier....who said she just got my order as the system is running slow.So I waited...about 20 min later she comes out and give me the total which was $6 more than what I saw online...it was then that I saw she had the wrong order.  I pointed out what I wanted to order from my online confirmation.  About 5 minutes later, she came out with the correct order.I will say the food wasn't too bad so that made up for the experience (a little)...but bottom line, next time I'll either call it in or order at the place itself....", "rating": "3", "date": [2015, 12, 12]}, "4": {"description": "Food was disgusting and it took them nearly 2hrs to delivered to me i dont recommend this place", "rating": "1", "date": [2014, 9, 26]}}, "latitude": 41.7223519831896, "neighborhoods": ["South Deering"], "categories": [["Chinese", "chinese"]], "address": ["1737 E 95th St"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Has TV": "No", "Good for Groups": "No", "Good for Kids": "No"}, "longitude": -87.5814990699291, "category": "Restaurants", "rating": "2.0", "price": "$$", "number_of_reviews": "8"}, "kfc-chicago-67": {"comments": {"1": {"description": "They don't deserve any stars. Ghetto as hell. And highly unprofessional. I drove in the drive thru area to spend over 30$ worth of food and when i got there, a women with no teeth commanded me to roll down my window as if she had an attitude. She then stated that she didn't have the food i requested and when i tried to change my order she rolled her eyes. I mean i didn't tell her to work at kfc, that old bat. So i said if theres a problem i could always go somewhere else and she stated in her own words. \"Thats Fine With Me, It Wont Hurt Me None\". Im like \"TF\" .. Steer clear of that place lbs..", "rating": "1", "date": [2013, 12, 26]}, "0": {"description": "After sitting at the drive thru at the Popeyes on 88th and Stony, only to be told chicken orders would be a 15 minute wait, I headed over to the KFC. I was greeted with a friendly order taker at the drive thru and was quickly presented with my order that was hot and fresh. There is clearly good management here who hires great staff. Thanks KFC for the pleasant experience.", "rating": "4", "date": [2013, 10, 6]}}, "neighborhoods": ["South Deering"], "latitude": 41.7222, "longitude": -87.5845, "rating": "2.5", "times": {"Mon": ["10:00 am", "10:00 pm"], "Thu": ["10:00 am", "10:00 pm"], "Sat": ["10:00 am", "11:00 pm"], "Wed": ["10:00 am", "10:00 pm"], "Tue": ["10:00 am", "10:00 pm"], "Sun": ["10:00 am", "10:00 pm"], "Fri": ["10:00 am", "11:00 pm"]}, "price": "$", "categories": [["Fast Food", "hotdogs"], ["Chicken Wings", "chicken_wings"]], "address": ["1617 E. 95th Street"], "attributes": {"Wi-Fi": "Free", "Caters": "Yes", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "2"}, "los-tres-amigos-mexican-grill-chicago": {"comments": {"1": {"description": "Usually come here for the steak burritos, which are pretty good. Today stopped for the burrito pastor. Have to say it was Better than expected. The burrito was huge, and not with filler, the pork seasoning is tasty. Would recommend to anyone looking for a fast take out. Can't wait to try other menu offerings.", "rating": "4", "date": [2013, 12, 21]}, "0": {"description": "Man these tacos our huge with 2 tacos your set no need for anything else. Great place to eat and very fast service", "rating": "5", "date": [2014, 12, 17]}}, "latitude": 41.706695, "neighborhoods": ["South Deering"], "categories": [["Mexican", "mexican"]], "address": ["10401 S Muskegon Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "Yes", "Alcohol": "No", "Delivery": "No", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch"}, "longitude": -87.550772, "category": "Restaurants", "rating": "4.5", "price": "$", "number_of_reviews": "2"}, "calumet-fisheries-chicago-4": {"comments": {"58": {"description": "Found this place courtesy of Mr. Anthony Bourdain. Ended up ordering a large amount of fried seafood and smoked shrimp which we consumed in a fairly rapid fashion in our automobile. Despite smelling like fish fry already, we proceed to order several pounds of smoked fish to take home in our long journey back to NY. While we luckily did not have any cats attacks our auto on the way, it was well worth the risk. Pros: Great smoked fish, shrimp, fairly inexpensiveCons: It is literally a shack in the middle of nowhere near the Illinois/ Indiana border. No tables, no restroom, nada", "rating": "5", "date": [2015, 4, 29]}, "56": {"description": "Wow. So, the bridge was up and we had time to kill so we decided to try this local legend out. So glad we did. We opted for the fried stuff because we were in the mood for it. The smelt and clams were amazing. Absolutely amazing. Definitely going back for the lemon pepper smoked fish. Fresh smoked fish on Fridays or Saturdays so plan accordingly. Honestly worth the short drive. Cash only but there's an atm there.", "rating": "5", "date": [2015, 5, 4]}, "29": {"description": "Great to go fish place, its just by the 95th street bridge, there's really only street parking so just be aware, (well there's a gravel lot just west, but idk if that's an actual parking lot) it's also real small and cramped inside, with just some picnic tables outside to sit at, but don't let that take away from the quality of the fish, it's a chicago staple, almost 70 years old, from the fried selection we got scallops, fish nuggets, calamari and stuffed shrimp, (scallops and shrimp were best imo) and then the smoked salmon, the smoked options are just more expensive so thats why we couldnt get much, tho it was def good, and then potato salad and french fries sides, which were standard, id for sure go back and try some of the more exotic fish on hand", "rating": "4", "date": [2015, 9, 1]}, "42": {"description": "We've been wanting to come here ever since seeing it on Anthony Bordain's show and it was great! I had the smoked salmon (very good) and fried catfish (excellent). It is a little pricy but the quality merits the price. 4 starts for a lot of not-homemade items like the coleslaw, potato salad, and sauces.I would happily go back!", "rating": "4", "date": [2015, 7, 18]}, "23": {"description": "This place is good!!! We got fried shrimp, smoked shrimp, fried oysters, fried scallops, and smoked salmon. My husband likes the fried shrimp, I'm not a big fried shrimp person so it as just okay to me! The fried oyster wasn't that good either, I think because it was kinda soggy I don't know. But like earlier reviews the smoked salmon and smoked shrimp is to die for! SERIOUSLY! It's that good! I want to try the black pepper and garlic smoked salmon now and other smoked stuff. The fried stuff is just okay but the smoked seafood here is where it's at!This place is just a little join on the side of the bridge. You order and you get out! But you need to try it, it's good!", "rating": "4", "date": [2015, 10, 17]}, "47": {"description": "Ordered the Catfish way too overpriced ( almost $13 for 4 grammar school lunch squares???!!) especially for the south side and I get Catfish briskets that were like the freezer kind that you get from the grocery store for like $2 a bag back in the 1990's and it tasted terrible! This is not fried fish it is Congolese torture! The fries were dry and unbelievably horrible! Complete and total ripoff! Avoid at all costs!!!!!", "rating": "1", "date": [2015, 6, 23]}, "8": {"description": "Yes and yes...I've made it to this place.  It has been a long wait for me.It was a bit difficult to trek all the way down from Albany Park during the winter season.  As I've announced publicly in one of my previous reviews, my \"foodie hours\" have been extended seasonally!  I had a quick nap in my hubby's work fleet, and I woke up with yummy fish and \"smokin'\" hotties in front of me.  You know fish can be just as hot as good-looking dudes or dudettes.  I consider them gender-free after being bathed in smoke.  Normally you would think a place like this that has won so many accolades from the big-foodie people (yeah I'm talking about Anthony Bourdain) wouldn't render a friendly service like I received this afternoon.  The young man immediately greeted us and was ready to take our order.  We chose the smoked shrimp dinner and fried fish dinner.  The total was $18.88 after tax.For a seafood fry place, the price we paid was reasonably fair.  Well, how were the tastes of our food?  I've never been that \"moved\" and \"agitated\" in my mind after tasting their smoked shrimps.  That 70-year-old smoker really is an excellent machine to deliver such aromatic smoke on these jumbo shrimps.  I believe I consumed five (5) or six (6) large, if not, jumbo shrimps.  Once again, the value for the quality of food I received wasn't a bad deal at all!  All dinner combos came with fries, coleslaw, crackers, a choice of sauce (hot or cocktail), and salt/pepper.  All other side dishes were solid.  Hubby also enjoyed his fish, but you all need to try other smoked products!  How many exclamation marks have I used in this review?  Well, here's one (1) more for you!  I also noticed that there are three (3) city of Chicago public trash cans in front of the Calumet Fisheries.  I guess that's where my taxation goes...my foodie trash.  We will be back when we do our summer weekend Metra trips around the far-end Chicago and nearby suburbs.  I know the Metra station isn't too awfully far away; I can walk as long as there is food to entice me!  There's an ATM onsite if you drop your cash in the river accidentally.", "rating": "5", "date": [2015, 4, 2]}, "31": {"description": "Great food and fast service. The fried shimps are to die for. I have neen going there for years and I was never disappointed.", "rating": "5", "date": [2015, 8, 25]}, "34": {"description": "It would be a 5 star review if it was food alone BUT the score got knocked down bc of the location (so far south), their cash only policy, and no place to eat (everyone in line at the same time also ate in their car).But we loved what we ordered:Fried scallops - the best and really hearty piecesCalamari - deliciousSmoked salmon with garlic and peppers - great flavorFried oysters - good to try but probably sticking with cold oysters", "rating": "4", "date": [2015, 8, 17]}, "16": {"description": "Awesome smoked salmon & smoked shrimps!!!Not a fan of their fried oysters, though! But overall, it was great food! :)", "rating": "5", "date": [2015, 7, 7]}, "13": {"description": "Remember this place when I was real young. My dad and his best friend next door neighbor and his son (my best friend), and my brothers and even mom, use to fish near here on Wolf Lake...fun times! Brought back memories! Best Fried shrimp that I have had in a long time! Just the right amount of breading and seasoning. Service is quick and food is always freshly hot. Be careful...parking just on the side of a busy road but worth it! During the summer time, it i nice place to just eat at the outdoor table and watch boats go by and view the river/lake! This place has been here for a long time and still doing it right! They are truly famous for their smoked fish...a must try! Many famous/television chefs have visited this spot and rave over it!", "rating": "5", "date": [2015, 11, 20]}, "11": {"description": "Worth driving out of your way for. Seriously. This was easily a half hour drive outside of Chicago, and I'd do it again. Smoked and fried fish aplenty, right on the water. It really doesn't get much better than this. If my endorsement isn't enough for you, the many awards on the walls should be. Anthony Bourdain is among their fans, too.Smoked is the way to go here. I'm sure their fried fish is fine, and the smelts we tried were tasty, but the smoked fish was by far the star of our meal. They sell by weight, so come hungry and plan to buy a couple of pounds to split with a group. There's some outdoor seating available or you can take it with you, but be sure to bring cash- I'm not a fan of cash-only businesses, but at least there's an ATM here.SMELTS: Grab a half order, available with a spicy or mild dipping sauce not unlike a buffalo wing sauce. They're hot and crispy, and plenty for sharing even with the half order. But I'd take these to go and make a garlic sauce to serve them with, as done in European cuisine.GARLIC PEPPER SMOKED SALMON: This was tasty, and by far the most recommended fish in the reviews. It was good, but not amazing. If your only knowledge of smoked fish is the lox on your bagel at a chain restaurant, you might really like this massive step up in quality.SMOKED TROUT: Go classic. The smoked trout is divine. No pepper or garlic needed, just simple, smoked fish. It's flavorful, with plenty of skin, and I could eat it for days.CRACKERS: Whatever you buy, grab a tube of crackers (they're 55 cents) to eat your fish with.  And don't forget to grab napkins, because you'll be eating all this tastiness with your hands.", "rating": "4", "date": [2015, 7, 17]}, "39": {"description": "great fesh fish no dine in but a chicago nessitity", "rating": "4", "date": [2015, 7, 22]}, "37": {"description": "I've been wanting to check out Calumet Fisheries FOREVER, so I was pretty excited to finally swing by!  This smokehouse has been family-owned and -operated by the Kotlick-Toll family since '48, where the fish is brined overnight and special oak logs are used for the smoking.  Fish, such as catfish, chubs, eel, rainbow trout, sable, salmon, sturgeon, white fish, and herring are some that are available.  They also have fried seafood (shrimp, fish, catfish, scallops, and crab cakes), as well as sides and salads.  I tried their Pepper & Garlic smoked salmon, a half order of the fried shrimp, and a half order of their fried smelts.  The smoked salmon was pretty good; just use a strong fork to flake it apart; they have packages of saltine crackers available, but you can bring you own.  It had a lovely smoked flavor, and the garlic and the peppercorn was not too overpowering.  Just having the fish with the crackers can be a little dry, so having some mayonnaise to spruce it up is a good idea.  The fried shrimp was forgettable, and the fried smelts were okay - the batter was more like ground cornmeal-like, rather than the crispy batter I was expecting.  Service was super friendly, and everything is made fresh-to-order (besides the smoked fish).  This is a cash only joint, so keep that in mind.  It is a carry-out only, but there are a couple of picnic tables in the front to enjoy your meal (I prefer to just chowing down in the car - that's how you do ittttttt) :P  I'd love to come back and try out their smoked sable, sturgeon, and the trout :D+Pepper & Garlic smoked salmon+friendly staff+cash only", "rating": "4", "date": [2015, 8, 9]}, "0": {"description": "Fantastic divey little fish stand on the far south side. Stellar smokey selection of pretty much anything that swims in the Great Lakes.  And somethings that don't.  I.e. my favorite: Smoked ShrimpBoating Tip: you can dock for free at Crowley's across the river and walk across the bridge.", "rating": "5", "date": [2016, 2, 24]}, "38": {"description": "Smoked shrimp and pepper garlic salmon was awesome.  Hard to find place but we'll worth the drive.", "rating": "5", "date": [2015, 8, 4]}, "51": {"description": "What can I say that hasn't already been said? Even my picky eater of a little sister thoroughly enjoyed the smoked trout, salmon, sturgeon and the fried shrimp. It's all great, delicious, high quality fish. Love this place. So worth the drive!", "rating": "5", "date": [2015, 6, 4]}, "27": {"description": "What do i say about a place that everything had been said. Gr8 food. Froglegs & smelt are a personal fav! Light breading, fast service. Place is a dump but who cares! Its got it baby! Ambience, the river & style! Cheap prices, i love them. Please go u wont be dissapointed! Its a chicago icon & a mom & pop place.  Shrimp is killer!", "rating": "5", "date": [2015, 9, 3]}, "32": {"description": "Cash only, does not take bills over 100, so I was extremely limited in what I could purchase w $10, so I got 1/2 order of fried shrimp, which was solid. Will have to come back soon for more...and with more cash.", "rating": "4", "date": [2015, 8, 23]}, "54": {"description": "Oh my, their smoked everything is awesome. The sable and sturgeon are more interesting but the good old fashioned smoked white fish and smoke salmon are still amazing. I also really liked the smoked shrimp!! I'm not that big into fried food bit the stuffed shrimp are really good. Everyone is friendly and easy to deal with. Small place so make your selections to keep things moving, no inside tables, quick service, cash only. So so good and wonderful to serve this smoked fish for Sunday morning brunch! Or a dinner appetizer! Or anytime!", "rating": "5", "date": [2015, 5, 10]}, "48": {"description": "I've just got back from Calumet Fisheries East 95th Chicago ILL.                        I ordered Stuffed Fried Shrimp/ Fried Frog Legs /Smoked Salmon/ Smoked Cat Fish/  Smoked  Shrimps.     It has been well over 14 years since I've eaten stuffed shrimps and it was well worth it and the drive I had three just sitting there in the car mum-mum mum good.....two or three frog legs there mum mum good.........on the drive back my hand was in the bag again for another stuffed shrimp..........................the smoked catfish/ salmon and shrimps were just as good......I'm out south from time to time and will be dropping in for more.  Maybe it's good I didn't know Calumets was there when I lived out south. But I know now.......yes yes yes ............... Boy the Stuffed Shrimps..............", "rating": "4", "date": [2015, 6, 21]}, "44": {"description": "The full order of fries shrimp was on point. I've also tried the smoked salmon, which was also very good.", "rating": "5", "date": [2015, 7, 12]}, "24": {"description": "The fried clam strips and smoked shrimp were awesome. The smoked salmon was good... but I much prefer it to be filleted with the bones removed instead of steak cut. It was quite the hike from the western suburbs so I don't see myself going back out there unless I'm super craving those awesome smoked shrimp.", "rating": "4", "date": [2015, 10, 15]}, "7": {"description": "Tried the smoked shrimp, & I loved it!! :) I cannot wait to come back and try the smoked salmon and lake perch!  Everyone should check Calumet Fisheries out. You won't be disappointed!", "rating": "5", "date": [2016, 2, 26]}, "49": {"description": "Yes yes yes. 100% love for this place.The service is excellent and family owned.The fish is QUALITY. Don't bother with the fried stuff, just get yourself a slab of the salmon with garlic and pepper. It is life changing.I honestly can't put this place into words, it became one of my favorite Chicago restaurants in the course of one meal.(Disclaimer: Ignore those people who are terrified of anything past Hyde Park. I'm all about safety, but sometimes I think people are too prejudiced against the South Side. This place is definitely worth the \"risk.\")", "rating": "5", "date": [2015, 6, 20]}, "40": {"description": "Simple yet most effective way to write this review, this place can be summed up five words and here we go, best shrimp in the city.  Whether you eat it in your car or lucky enough to get one of the picnic tables you will not be disappointed, this is easily a must have, the shrimp is so fresh lightly breaded and just plain awesome, the fries are the perfect complement and the choice of sauces just add to the perfect meal.", "rating": "5", "date": [2015, 7, 19]}, "53": {"description": "\"You guys are driving through the hood? Do you want to borrow my gun?\" Our friend in Chicago thought we were nuts to drive all the way there for some smoked fish, but we know it's gonna be so worth it.Salmon with garlic and pepper: so oily yet so tasty! Favorite!White fish: actually our second favorite. Really good flavor.Trout: pretty amazing fish, each section has its own distinct flavor and texture.Smoked Shrimp: awesome.Chubs: FAVORITE!!! But they are seasonal so we didn't have them this visit. We had it 5 years ago, amazing.", "rating": "5", "date": [2015, 5, 20]}, "30": {"description": "We dropped by last Friday afternoon and all the guys were very friendly. All were helpful and gave us a sample of the salmon. Boy, we were in for a treat! One of the guys (regret not asking his name) explained the sections of the salmon that taste best. He also suggested the eye but we declined; we're not that cool.  Since we had purchased other food before the sample, we did not buy the smoked fish. On Saturday afternoon, my man suggested smoked fish for dinner so here we go again. We ordered the pepper and garlic salmon and the smallest piece of sturgeon. Once we got home, we began with the sturgeon.  We regret buying the smallest sturgeon piece. The sturgeon was perfect! It was not flaky like other fish, it was very soft, flavorful and boneless (at least the section we bought). We bought a bigger piece of salmon and it was delightful. I expected to taste the garlic but I did not; however, we enjoyed it. Frankly, between the sturgeon and salmon, I prefer the sturgeon. The service during both visits was exceptional and we waited a few minutes to place our orders during both visits because there were several people ahead of us.   Knowing my man's eating habits, we will be frequent customers. We've already determined that when family visits in a few weeks, we will be having smoked sturgeon for dinner.", "rating": "5", "date": [2015, 8, 30]}, "46": {"description": "I had a really great experience at Calumet Fisheries.THE AMBIANCE:Calumet Fisheries is a small seafood shack with an outdoor smoke house. You walk in and pick your food off of a menu on the wall and from the glass counters. It is super small and the venue is meant for you to walk in and order. Outside by the smoke house there are long tables bleacher-style for you to sit and enjoy your pickings.THE FOOD:It was three (3) of us on this food trip and we ordered garlic smoked salmon, garlic smoked trout, fried scallops, fried catfish, and macaroni salad. A thing to note is that they don't have lemons (sigh) and they don't sell beer (double sigh). Lucky for us we had packed some brewskis. We set up food camp on the table and dug in. The seafood, especially the garlic smoked trout, was AMAZING. It was delicious! Calumet Fisheries provides a hot sauce that had a tangy-ness to it. Other than that you might want to bring your favorite hot sauce as well.   The macaroni salad was not good. It had so much mayo. None of us liked it/ate it. Carlos, who works there, came over and talked to us a bit about the history of Calumet Fisheries and he brought us some fresh cooked salmon, which he broke apart in front of us so we could taste some of the most buttery and juicy parts. He is awesome. We also got a tour of the smoke house. Super cool. During our trip the crew of Man Fire Food on the Cooking Channel was there and I got to meet the host, Roger Mooking. Super sweet and down to earth guy.THE TIPS:It can get really hot so wear sunscreen! I would pack some lemons/limes, cold beer, and your fave hot sauce!! Street parking.", "rating": "5", "date": [2015, 7, 5]}, "1": {"description": "If you're ever in Chicago and want to venture out from the city, this place is definitely worth the trip!! It's location is kind of random but not too hard to find. They only have 1 picnic table to sit at outside so either come prepared to possibly eat standing or come prepared to wait until you get home to eat.Smoked shrimp (10/10) - large shrimp, smoked perfectly with so much flavorSmoked salmon (10/10) - nicely cut, smoked the same way as the shrimpFried oysters (6/10) - I'm not a fan of the texture of fried oysters so this may not be completely accurate but I didn't feel like their fried oysters tasted any different from ones I've had in the pastFried shrimp (8/10) - if you're not a fan of smoked foods, then I would recommend to go with the fried shrimp, medium/large shrimp, fry batter was nice and crispy**They will give tartar sauce and cocktail sauce with your order", "rating": "5", "date": [2015, 12, 2]}, "55": {"description": "After reading about how Anthony Bourdaine has sponsored this place, I knew I had to stop by. This place is a 30 minute drive from downtown Chicago, so I would not suggest you take a taxi. If you decide to drive here, there is a $7 toll to get there and $7 to back into Chicago. The tolls can be pricey. I decided to stop by on my way home back to Michigan. You can park on the street or turn right into the fishery. Recently, Mark, the owner told me you do not need to take the skyway to get there. You can stay on 94 south.  When it splits with 57, get off on the first exit that will take you right to 95th street turn right and drive 3 miles and your at our door steps. Good tip for us tourist (;The food is completely delicious. I really can not tell you how good this place is. I am still drooling when I think about their smoked pepper garlic salmon & smoked shrimp. Prices can be a bit pricey at $15 per lb for smoked salmon & $22 per lb for smoked shrimp, but it was definitely worth it. The flavors were on point. It was the best smoked fish I have ever had. The shrimp was just amazing! You can truly taste the true flavor of the shrimp. You can even smell the smoke from the shrimp. They do not have cocktail sauce. They have hot sauce and have an amazing tartar sauce. A few flaws are that they do not have a restroom, only take cash, and have only two tables to eat outside. Overall, I cannot wait to come back!", "rating": "5", "date": [2015, 5, 5]}, "9": {"description": "I had been wanting to stop here when my wife and I flew into Chicago on our way to IN. Now we live in IL and I finally had an opportunity to stop.This place is simply perfect! Great prices for a super quality product! It really is hard deciding what to try when you first walk in. We tried the pepper salmon and the smoked shrimp. Both were heavenly. Next time I am bringing a six pack of good beer and a bigger appetite. Great job to all those that run this place!", "rating": "5", "date": [2015, 11, 2]}, "26": {"description": "Welp! Not what I was expecting. I have to stop putting faith in seafood that is located in the city and at a low cost. This is mediocre at best. The scallops are not fresh and very chewy. The shrimp are clearly store brought and not fresh. The smoked fish is good, but to be honest. I can get the same quality out of a can of tin fish from the grocery store. The best thing was the cheese bites and that is very sad. If I am in the area and craving some cheese bites and smoked trout. I will make the stop, but other then that. I will stick to Pappadeaux out in the burbs for quality seafood.", "rating": "2", "date": [2015, 9, 14]}, "25": {"description": "This place is awesome they have young kids working there that have the best attitudes i have ever encountered in a restaurant great food and great service it has such a home feeling.", "rating": "5", "date": [2015, 10, 13]}, "12": {"description": "This place is good!!! We got fried shrimp, smoked shrimp, fried oysters, fried scallops, and smoked salmon. My husband likes the fried shrimp, I'm not a big fried shrimp person so it as just okay to me! The fried oyster wasn't that good either, I think because it was kinda soggy I don't know. But like earlier reviews the smoked salmon and smoked shrimp is to die for! SERIOUSLY! It's that good! I want to try the black pepper and garlic smoked salmon now and other smoked stuff. The fried stuff is just okay but the smoked seafood here is where it's at!This place is just a little join on the side of the bridge. You order and you get out! But you need to try it, it's good!", "rating": "4", "date": [2015, 10, 17]}, "59": {"description": "Delicious smoked shrimp and fried scallops that melt in your mouth.", "rating": "5", "date": [2015, 4, 16]}, "21": {"description": "Get the whitefish you will not be disappointed. The peppered salmon was pretty tasty. The fried shrimp was just okay. The breading had a very course texture.", "rating": "4", "date": [2015, 10, 23]}, "17": {"description": "Solid 3.5 stars on Calumet fisheries. I stopped by here on the way back from a brewery voyage in Gary and stopped in really quick to grab some fried goodness for my trek back to the north burbs. Decided on the fried shrimp and asked for a recommendation on something else and got the catfish. Catfish was a wee bit too fishy for me, but the shrimp were $$$$. I need to come back and try the smoked salmon and trout, and perhaps the smelts as well. I also thought the cocktail sauce was a bit too sweet for my liking. Not enough bite (horseradish). I also didn't receive fries at all, and realized this as I was too far away to turn back. Oh well, next time, Gadget.", "rating": "3", "date": [2015, 8, 16]}, "10": {"description": "I've been wanting to check out Calumet Fisheries FOREVER, so I was pretty excited to finally swing by!  This smokehouse has been family-owned and -operated by the Kotlick-Toll family since '48, where the fish is brined overnight and special oak logs are used for the smoking.  Fish, such as catfish, chubs, eel, rainbow trout, sable, salmon, sturgeon, white fish, and herring are some that are available.  They also have fried seafood (shrimp, fish, catfish, scallops, and crab cakes), as well as sides and salads.  I tried their Pepper & Garlic smoked salmon, a half order of the fried shrimp, and a half order of their fried smelts.  The smoked salmon was pretty good; just use a strong fork to flake it apart; they have packages of saltine crackers available, but you can bring you own.  It had a lovely smoked flavor, and the garlic and the peppercorn was not too overpowering.  Just having the fish with the crackers can be a little dry, so having some mayonnaise to spruce it up is a good idea.  The fried shrimp was forgettable, and the fried smelts were okay - the batter was more like ground cornmeal-like, rather than the crispy batter I was expecting.  Service was super friendly, and everything is made fresh-to-order (besides the smoked fish).  This is a cash only joint, so keep that in mind.  It is a carry-out only, but there are a couple of picnic tables in the front to enjoy your meal (I prefer to just chowing down in the car - that's how you do ittttttt) :P  I'd love to come back and try out their smoked sable, sturgeon, and the trout :D+Pepper & Garlic smoked salmon+friendly staff+cash only", "rating": "4", "date": [2015, 8, 9]}, "5": {"description": "I made an hour trip and the Catfish was bland and tasteless. Also got the fried mac and cheese, it tastes like easy mac. Despite the other raving reviews, I would not recommend or go back", "rating": "1", "date": [2016, 2, 13]}, "3": {"description": "I came back here after not eating there for a long time, but I was in the middle of running errands and stopped through for a bite. My only issue with them is they don't accept credit cards and they have an ATM machine (strongly advise not using because the owners of the ATM will assess a fee and you'll get charged by you bank also for using the machine). They really do need to get with the the times in terms of how people pay for things. So until they get their payment methods updated where they accept credit cards is to bring cash. I ordered some fish chips and they were pretty good tasting almost identical to the way Lawrences makes their fish chips. Also this place has had the same owner and remained in the same location since 1948. Again they do need to come with the times because Lawrence's Fisheries used to look like Calumet Fisheries, but the family that owns Lawrence's have gotten a website with their menu and the restaurant's history on it and even going as far as taking orders via the site and  expanded by remodeling the restaurant and even expanding with a second location. It's a cute little divey place and will get crowded on certain days preferably Friday and Saturday nights. Everything is cooked fresh to order which is what I like because I like freshly prepared food and not some mess under a hot lamp. There is only one picnic table outside so prepare to eat standing up, in your car or wait until someone leaves to use the table (weather pending). Overall the food is pretty good :-)", "rating": "4", "date": [2016, 3, 7]}, "35": {"description": "Solid 3.5 stars on Calumet fisheries. I stopped by here on the way back from a brewery voyage in Gary and stopped in really quick to grab some fried goodness for my trek back to the north burbs. Decided on the fried shrimp and asked for a recommendation on something else and got the catfish. Catfish was a wee bit too fishy for me, but the shrimp were $$$$. I need to come back and try the smoked salmon and trout, and perhaps the smelts as well. I also thought the cocktail sauce was a bit too sweet for my liking. Not enough bite (horseradish). I also didn't receive fries at all, and realized this as I was too far away to turn back. Oh well, next time, Gadget.", "rating": "3", "date": [2015, 8, 16]}, "19": {"description": "It took me toooooooo long to get here and I am only kicking myself!! GREAT no the BEST.... smoked fish I have ever had : )!! YUM. Go now and try it all... bring a cooler and fill it up, trust me!!! Smoked salmon was my favorite. the peel and eat shrimp were also great! Bring Cash...", "rating": "5", "date": [2015, 11, 20]}, "28": {"description": "I don't recommend this place. The service was rude and the catfish tasted overly fishy and not very fresh.", "rating": "1", "date": [2015, 9, 1]}, "45": {"description": "Awesome smoked salmon & smoked shrimps!!!Not a fan of their fried oysters, though! But overall, it was great food! :)", "rating": "5", "date": [2015, 7, 7]}, "33": {"description": "Been going there since I was a kid. Love the fish and chips and shrimp. Don't forget the fries. Mix the hot and mild sauce for the best. They used to have a medium but got rid of it years ago.", "rating": "5", "date": [2015, 8, 22]}, "43": {"description": "Worth driving out of your way for. Seriously. This was easily a half hour drive outside of Chicago, and I'd do it again. Smoked and fried fish aplenty, right on the water. It really doesn't get much better than this. If my endorsement isn't enough for you, the many awards on the walls should be. Anthony Bourdain is among their fans, too.Smoked is the way to go here. I'm sure their fried fish is fine, and the smelts we tried were tasty, but the smoked fish was by far the star of our meal. They sell by weight, so come hungry and plan to buy a couple of pounds to split with a group. There's some outdoor seating available or you can take it with you, but be sure to bring cash- I'm not a fan of cash-only businesses, but at least there's an ATM here.SMELTS: Grab a half order, available with a spicy or mild dipping sauce not unlike a buffalo wing sauce. They're hot and crispy, and plenty for sharing even with the half order. But I'd take these to go and make a garlic sauce to serve them with, as done in European cuisine.GARLIC PEPPER SMOKED SALMON: This was tasty, and by far the most recommended fish in the reviews. It was good, but not amazing. If your only knowledge of smoked fish is the lox on your bagel at a chain restaurant, you might really like this massive step up in quality.SMOKED TROUT: Go classic. The smoked trout is divine. No pepper or garlic needed, just simple, smoked fish. It's flavorful, with plenty of skin, and I could eat it for days.CRACKERS: Whatever you buy, grab a tube of crackers (they're 55 cents) to eat your fish with.  And don't forget to grab napkins, because you'll be eating all this tastiness with your hands.", "rating": "4", "date": [2015, 7, 17]}, "2": {"description": "I watched Anthony Bourdain chow down on some seafood here and then found myself in Chicago for a wedding a couple of weeks later. My husband had been in the city shortly before this and demanded that we go to Calumet Fisheries--obviously I had no problem with this!We were all fairly full from brunch earlier in the morning and we were short on time, but we made sure to stop here for some smoked salmon. This. Salmon. It was rich and flavorful and absolutely amazing. I described it at the time as a sort of salmon jerky--kind of like beef jerky in the flavor profile, but obviously not a chewy strip of meat. I'm not acting out when I say this was life changing and I can't wait to go back and feast on more! Tips:Cash onlyKeep an eye out for bones in the fish", "rating": "5", "date": [2015, 11, 6]}, "18": {"description": "It's hard to go wrong here...the big thing was just committing to make the drive here, but once I got in, I could see why the reviews here are so great.Tried the fried perch, fried catfish, fried clam strips, and the fried shrimp, while others in my party also got the fried oysters.  Besides the fact that I'm surprised I'm still alive and able to write this review, the food was amazing and all of the dinners come with fries so you'll find a way to leave full here for sure.  The space is small and not sexy, and there's nowhere to sit, and it's cash only.  But if you are in the market for smoked fish of almost any type, this is the place to go and between Bourdain showing up here and Calumet being a Beard award finalist a few years ago for being an historic eatery, you know it's legit!", "rating": "5", "date": [2015, 6, 14]}, "41": {"description": "Happy I finally made a point to drive down here. What a unique place! My family did the smoked salmon, pepper and garlic smoked salmon, and smoked whitefish. The p&g salmon and the whitefish were both standout. We also did the smoked shrimp which were interesting to try (have never had) and were good as well. My brother likes slaw and wasn't impressed by theirs. Good experience though. Happy I've gone at least once and if am in the vicinity will definitely come back", "rating": "5", "date": [2015, 7, 18]}, "52": {"description": "Anthony Bourdain's show about Chicago prompted my interest in Calumet Fisheries. It turns out that my Southside mother (88th and Mackinaw then Lansing) used to go to this very same place on Fridays in the 1950s when the restaurant served shrimp in Chinese take-out cartons whose sides would become so greasy that people could see through them! Sixty years later on 5/29/2015 my mother ordered the shrimp dinner, which comes with slaw. According to her, the shrimp still have the same coating as back in the '50s! My fiancee and I ordered a large fry (nice thick square-cut fries served in a huge old-fashioned red and white paper ground-beef tray), the smoked trout, smoked salmon with pepper and garlic, and the normal smoked salmon, to which an employee said, \"There's nothing normal around here.\" :-) The salmon just came out of the smoker and had a pleasant oily and tender texture that lacked any trace of smokey flavor. The trout was fine. All three orders of fish came in triple-wrapped white paper, which adds to the great old-fashioned touch. The slaw was nice and tangy. The fries had a full and slightly oily favor that complemented the fish. Overall, there's nothing to criticize! Just enjoy this time-tested Southside treasure of great fishy goodness, especially if are a Chicagoan! Support the local economy, damn it!! PS Tip 1: Some people may be a bit apprehensive about the neighborhood, but they shouldn't worry too much. Just take the Bishop Ford to the Stoney Exit, which takes you on a very long exit ramp that deposits you at about 97th and Stoney. Go a couple blocks north to 95th, make a right, and go 2 short miles to Calumet Fisheries. Tip 2: We completed our Southeast-side tour by eating at some picnic tables at the William Powers State Recreation Area at 126th and Ave. O in the lesser-known Chicago neighborhood Hegewisch. Despite the Rahmfather's official tourist maps that end at 55th street, Chicago does have countless hidden gems south of Hype Park, such as Pullman, Argus Brewery, and Calumet Fisheries! Get in on the secret before the hipsters do!!", "rating": "5", "date": [2015, 5, 31]}, "50": {"description": "It's hard to go wrong here...the big thing was just committing to make the drive here, but once I got in, I could see why the reviews here are so great.Tried the fried perch, fried catfish, fried clam strips, and the fried shrimp, while others in my party also got the fried oysters.  Besides the fact that I'm surprised I'm still alive and able to write this review, the food was amazing and all of the dinners come with fries so you'll find a way to leave full here for sure.  The space is small and not sexy, and there's nowhere to sit, and it's cash only.  But if you are in the market for smoked fish of almost any type, this is the place to go and between Bourdain showing up here and Calumet being a Beard award finalist a few years ago for being an historic eatery, you know it's legit!", "rating": "5", "date": [2015, 6, 14]}, "4": {"description": "I had a really great experience at Calumet Fisheries.THE AMBIANCE:Calumet Fisheries is a small seafood shack with an outdoor smoke house. You walk in and pick your food off of a menu on the wall and from the glass counters. It is super small and the venue is meant for you to walk in and order. Outside by the smoke house there are long tables bleacher-style for you to sit and enjoy your pickings.THE FOOD:It was three (3) of us on this food trip and we ordered garlic smoked salmon, garlic smoked trout, fried scallops, fried catfish, and macaroni salad. A thing to note is that they don't have lemons (sigh) and they don't sell beer (double sigh). Lucky for us we had packed some brewskis. We set up food camp on the table and dug in. The seafood, especially the garlic smoked trout, was AMAZING. It was delicious! Calumet Fisheries provides a hot sauce that had a tangy-ness to it. Other than that you might want to bring your favorite hot sauce as well.   The macaroni salad was not good. It had so much mayo. None of us liked it/ate it. Carlos, who works there, came over and talked to us a bit about the history of Calumet Fisheries and he brought us some fresh cooked salmon, which he broke apart in front of us so we could taste some of the most buttery and juicy parts. He is awesome. We also got a tour of the smoke house. Super cool. During our trip the crew of Man Fire Food on the Cooking Channel was there and I got to meet the host, Roger Mooking. Super sweet and down to earth guy.THE TIPS:It can get really hot so wear sunscreen! I would pack some lemons/limes, cold beer, and your fave hot sauce!! Street parking.", "rating": "5", "date": [2015, 7, 5]}, "6": {"description": "Although the location is a bit odd and out of the way from most of downtown, it's well worth making your journey out. The smoked salmon was amazing and the place just feels like a historical and cultural gem. I can't fully recommend the fish dinner as it's not the salmon and the price was high for what it was. But if you're looking for the best smoked salmon in Chicago, look no further.", "rating": "5", "date": [2016, 2, 2]}, "22": {"description": "There is always a line in this little jewel but it is so worth the wait!  I remember eating from this restaurant when I was just a little girl - many, many years ago! The fish was always freshly prepared on the spot, hot & delicious. My mom would buy the smelts back then & it would be a special treat.  The food seldom made it home.  It is just as good now as I remember back then.Highly recommended!", "rating": "5", "date": [2015, 10, 20]}, "15": {"description": "Can someone who is a chicago native tell me if there is a way to get from downtown to this place without paying the toll? because we really didn't go on the bridge we passed the toll, drove like 3 steps ordered our food and U turned to get back to down town... such a waste of a toll. I did my research on yelp before coming here so i had an idea of what i wanted to order, there is no dining inside but there was a few seats outside (chicago is way too cold to eat outdoors in late october eary november imo) the fragrant of smoked fish consumes you as soon as you open the door, this is a small shop with lots of options. As per my fellow yelpers recommendations i ordered the fried scallops, the shrimp and the smoked salmon. The salmon was sooo good! you get a big portion for just a few bucks, i thought it was totally worth it! the smokiness is in every bite and i never had smoked fish before but i am now a fan! The scallops were small but juicy and they don't go cheap on it either, you get alot (they were a bit pricey if you asked me but i am glad i got to try it) the shrimps were HUGE i swear it was like they were on steroids but hey i am NOT complaining.... i am just amazed. There was so much meat in each of these delicious shrimp, i could eat these all day. If i had to come back i would definitely get MORE shrimp and try some of their other smoked pieces of fish... If i was only allowed to chose one item i'd go with SHRIMP!", "rating": "4", "date": [2015, 11, 10]}, "57": {"description": "nothing beats smoked fish like this place...a small hole in the wall in the middle of nowhere but my oh my, the fish is delicious and fresh.. I wish we had a place like this back home. I could buy by the pound for my weekly sandwiches. No more am I going to be able to enjoy store bought smoked salmon.. Calumet fisheries has raised the bar! By the way, no restrooms.. relieve your duties before coming here..", "rating": "5", "date": [2015, 4, 29]}, "20": {"description": "Great food, just pricey and doesn't take debit/credit. Smoked shrimp was amazing. Take out only.", "rating": "4", "date": [2015, 10, 25]}, "36": {"description": "Fried shrimp wasn't the greatest. Breading wasn't great and very greasy. The smoked fish and shrimp was super good! Would go back just don't have the deep fried shrimp, could've been better.", "rating": "4", "date": [2015, 8, 12]}, "14": {"description": "Yes yes yes. 100% love for this place.The service is excellent and family owned.The fish is QUALITY. Don't bother with the fried stuff, just get yourself a slab of the salmon with garlic and pepper. It is life changing.I honestly can't put this place into words, it became one of my favorite Chicago restaurants in the course of one meal.(Disclaimer: Ignore those people who are terrified of anything past Hyde Park. I'm all about safety, but sometimes I think people are too prejudiced against the South Side. This place is definitely worth the \"risk.\")", "rating": "5", "date": [2015, 6, 20]}}, "neighborhoods": ["South Deering"], "latitude": 41.7227204721714, "longitude": -87.5440155362309, "rating": "4.5", "times": {"Mon": ["10:00 am", "9:30 pm"], "Thu": ["9:00 am", "9:30 pm"], "Sat": ["9:00 am", "9:30 pm"], "Wed": ["10:00 am", "9:30 pm"], "Tue": ["10:00 am", "9:30 pm"], "Sun": ["10:00 am", "9:30 pm"], "Fri": ["9:00 am", "9:30 pm"]}, "price": "$$", "categories": [["Seafood", "seafood"]], "address": ["3259 E 95th St"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Wheelchair Accessible": "Yes", "Delivery": "No", "Outdoor Seating": "Yes", "Alcohol": "No", "Caters": "No", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Accepts Bitcoin": "No", "Ambience": "Divey", "Has TV": "No", "Accepts Apple Pay": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch"}, "category": "Restaurants", "number_of_reviews": "283"}, "leifs-no-2-chicago": {"comments": {"12": {"description": "I've also seen this place growing up (Hienie's is right across the street!) but considering it closes at 1pm, I never had the chance to check it out. But I heard many things about their epic breakfast omelettes and hamburgers. Actually, my sister is fan of their burgers. Mind you, my sister is the sweetest thing that ever graced the planet. And I'm not sayin' that just 'cuz she's my sister! She's got the voice of a butterfly and her kids are more scared of me than they are of her. So, if my sister has COJENES big enough to handle that burger, I figured why not finally give this place a shot....Man oh man, can the food at this place get you some serious hair on your chest! I ordered a Denver omelette (a mountain of what seemed like 6 eggs, cheddar cheese, onions, peppers, tomatoes, and juicy chunks of ham) with a side of some hearty hash browns. I am not lying when I tell you my plate could have easily served three people. I barely consumed a quarter of my plate before I threw in the towel!I can't wait to go back and try other stuff from their menu. I say this because, the crabby Asian lady who served as the cook, waitress, and cashier steered me a clear from ordering an order of french toast with my meal (she was like, \"No...No...No...TOO MUCH! You won't even finish it!). My sister says she won't even take custom orders (i.e. no onions, extra cheese, etc.) when people ask for it. She means business, and it shows in her food. p.s. This place gets for 3 stars just because the food was good, but the portions are waaaayy to much for me. I'm sure if I was a trucker, it would get 5 stars!Tip: This place is not good for groups. Don't go with more than three people.", "rating": "3", "date": [2010, 8, 27]}, "3": {"description": "Food portions are tremendously huge! However, I didn't know the steak was cooked with A1 steak sauce witch I don't eat and wasn't informed of. When I asked for another order, he seemed bothered and irritated. Staff not as friendly.", "rating": "3", "date": [2016, 2, 25]}, "1": {"description": "After reading the on-line reviews and checking out the pictures posted by Yelpers, me and my official 'Breakfast Hole in the Wall Club Member' ventured out to 103rd and Torrence to check out how Leif's stacks up against our other finds and let's just say it gets 4 thumbs up [mine and hers combined].  Let's start with the ambiance.Unlike the seating/waiting area of our previous visits to neighborhood dives, this one had to be the \"coziest.\"  In terms of space there are 4 booths and about 10 counter stools so don't bring a lot of people to sit down 'cause you might end up standing or taking it out.  But enough of that, let's get to the food.I ordered the Denver Omelette with breakfast potatoes [requested that onion be added to the mix] and my home girl ordered the steak plate with standard [plain] potatoes.  Verdict: Guilty of getting the Itis [both me AND my homie]When the hostess brought our food  we both looked like \"WHAT\"?  So much food!!  The omelette was phenomenal and she [the chef/cook/owner] cooked the veggies just right so that they weren't raw or mushy from overcooking.  CJ ordered the steak plate and was not disappointed.  We both agree that the potatoes were the best and mine had that extra kick of texture and flavor with the onions added [my Grandmother's style]All in all, go with an empty stomach because you wilt wish you will halfway through the meal.", "rating": "4", "date": [2016, 2, 20]}, "2": {"description": "If you want the best steak and eggs come down to South Deering! Portions are huge, so you'll get your breakfast and lunch all in one! Staff was so friendly despite some costumers ragging on them. It was a busy day for them and they stayed friendly the whole time. I had the steak and eggs- a must when you visit this restaurant.   enough for two. Boyfriend had French toast-super tasty. They serve you in stylophone plates, which helps you take your leftovers home!", "rating": "5", "date": [2015, 11, 29]}, "9": {"description": "I have been looking for this place for a few months, found it and I can't stay away. The steak, eggs and potatoes are so flavorful. It's like you cooked it at home with grilled onions. Pretty small place.", "rating": "5", "date": [2014, 4, 13]}, "10": {"description": "If you wanna walk straight into an early 1970's  \"Working Mans Lunch Counter\", this is your place!  Inside, it hasn't been TOUCHED in over 30 years, even a broken stool top has never been replaced.  The cast of characters?  Everything from Factory Workers, City Workers, Old People, Families, Pimps, Drug Dealers, Gang Members!  You get it all here and everyone is cool... On to the food--Keep in mind that ONE Woman \"Leif\" runs the whole joint!  Cooking, Waiting Tables, Register, Carry- Outs.  I can honestly say I've never seen anyone flip a bigger pancake in my life/ definitely an art.  I would venture to say that the flat top in back has probably cooked over 100,000 pancakes!  This place is all about breakfast, Huge portions of everything all made from scratch and loaded up with BUTTER!  Also known for Burgers which are huge (At Least 3/4 LB) and served on white bread?  Meat had great flavor but the condiments were horrible.  Served on a bun with good condiments and this could be mind blowing to say the least..  Definite stop if in this area!  GTFJD", "rating": "4", "date": [2013, 2, 17]}, "4": {"description": "Seriously really great spot the lady serves you so well I know most people rave about her meats but her pancakes are HUGE and soooooo good! Only thing that sucks is that there hours are hard to figure out but if you're lucky enough to catch them while they are there you'll always wanna come back", "rating": "4", "date": [2015, 9, 3]}, "6": {"description": "I've been working in the area for a couple weeks.  The proportions are huge and the taste is great.  I got the steak and egg breakfast plate.  The steak had a perfect sear, great flavor and juicy as hell.  Her hash browns were the best I've ever had.  For 14 dollars out the door I see this as a great value.  I am a big dude that loves to eat and I could not finish it.  I'll eat it for lunch as well.  Check it out for sure", "rating": "5", "date": [2015, 4, 2]}, "15": {"description": "like twista?  well, you might be able to see him eating his steak and eggs here!!  haha!  with his platinum grillz on!  this small diner offers yummy southern cooking without the hospitality.  the grumpy asian lady that owns the place is hilarious and will not hesitate to kick you out if you are out of line.  the prices are great for the amount of food she serves you.  also try her 5 lbs hamburger! just kidding, it's not 5 lbs but it's huge.  =D", "rating": "5", "date": [2006, 12, 1]}, "0": {"description": "When I say I love this place, I mean I LOVE THIS PLACE!!!! I only wish she was open longer", "rating": "5", "date": [2016, 1, 2]}, "5": {"description": "Waited months to come back to!  I forgot to mention in my last review don't be turned off by the looks of the place. Yes it's small and a lil cluttered but food is amazing you will not be disappointed. I've only seen the pancakes and they look as big as my head!  The breakfast plates are amazing.  She's closed on Sunday's. Early Saturday mornings aren't to busy. Get here if your in the area!!!!!", "rating": "4", "date": [2015, 3, 21]}, "13": {"description": "Good greasy spoon with HUGE portions. Mrs. Leif will scold you if you don't finish.", "rating": "3", "date": [2012, 4, 30]}, "11": {"description": "This place gives huge portions of food, but to say the food is good would be an overstatement. Without a doubt its single handedly contributing to the Chicago obesity problem.However, if you enjoy huge portions of mediocre food this is your place.", "rating": "2", "date": [2011, 11, 9]}, "8": {"description": "Don't let the crabby old Asian lady scare you away it is apart of her charm. The portions are huge, the food is good and the prices are cheap. You could split your breakfast with someone (the photos do not do it justice). The decor isn't amazing if your fussy but I don't care about that. Ill definitely go back next time I'm in Chicago", "rating": "4", "date": [2013, 5, 12]}, "14": {"description": "Leif's is a laid back trucking stop type of restaurant. Go there for the food, and leave with a smile. At first glance, the restaurant appears as a family home that was made into small restaurant, which is exactly what it is, but inside you will find some of the best food you have ever had, and they have the newspaper clippings to prove just that; being featured in the Suntimes and Tribune 3 times. The best items on the very small menu are the steak & eggs, and hamburgers, and both are of monstrous proportions. Even in this troubled economy you will find a good deal at Leif's.", "rating": "5", "date": [2010, 6, 22]}, "7": {"description": "Can't go wrong with a HUGE tasty omelette and some hash browns. At my work, we tend to order from Leif's almost every Saturday. Usually 2 omelettes feed 5 or 6 people. Definitely a great deal for the money.", "rating": "4", "date": [2015, 4, 22]}}, "latitude": 41.7066328972578, "neighborhoods": ["South Deering"], "categories": [["Diners", "diners"]], "address": ["10350 S Torrence Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Loud", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "No", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Accepts Apple Pay": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Breakfast, Brunch"}, "longitude": -87.5597202032804, "category": "Restaurants", "rating": "4.0", "price": "$$", "number_of_reviews": "16"}, "marshalls-chicago-15": {"comments": {"1": {"description": "This Marshalls is, shall we say, ghetto.  It's always very warm in the store and there's usually a mess near the accessories, toys, and home-wares.  It takes a very long time to check out, mostly because there's one cashier and one other person who could be ringing people up but stands around and distracts the one person who's doing it.  After all that, why do I go back?  Well, there's some gems there.  I've gotten some dress pants and a very nice Michael Kors blazer that I hadn't seen anywhere else.  It's pretty close to where I work, too, so I can squeeze in some lunch time shopping.  It's not the nicest place, but it's a good place to go when you have some flexibility in what you want to buy and you can't get to another neighborhood.", "rating": "3", "date": [2013, 1, 30]}, "0": {"description": "It's a nice store for emergencies and don't want to drive to the not so near malls.If you go early the place is picked up and  in some sort of order. I go once a month and after the sport season is over and you do get great deals on sports apparel.", "rating": "3", "date": [2014, 11, 22]}}, "latitude": 41.7205907093111, "neighborhoods": ["South Deering"], "categories": [["Department Stores", "deptstores"]], "address": ["1709 E 95th St"], "attributes": {"Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.5819880473185, "category": "Shopping", "rating": "3.0", "price": "$$", "number_of_reviews": "2"}, "jewel-osco-chicago-32": {"comments": {"3": {"description": "Decent selection... Prices are about average for a jewel... Font make the mistake and think the pricing is the same everywhere", "rating": "3", "date": [2010, 10, 3]}, "1": {"description": "I generally go to Aldi on 95th street, but the lateness of the hour dictated that I go Jewel which is open a little later.  Of course the food is a little pricey so would it be too much trouble to keep the sale items in stock or at least offer a rain check.  I know because this is a poor community, I can't expect exceptional customer service.  But to treated as poorly as I was this evening.  Bye Felecia.....they won't get me again.  When I got into the check out line, the first thing I noticed was the scowl on the very pretty young cashier's face.  She asked the woman in front of me, \"how are you\" with a robotic voice and no facial expression and of course no eye contact.  That was the last of the conversation until she asked, \"you playing Monopoly\", the woman said yes, and the cashier handed her the game tiles without at word.  Now it was my turn. \"How are you?\"  To which I responded fine, how are you?  No response, she began checking my items with no interaction at all, as if I wasn't there.  When she finished, I swiped my card.  She never looked at me directly,\"can I see your card and ID\", she looked at the items then dropped them on the belt.  \"Sign there\".  Still in the robotic voice, and no eye contact.  \"You playing Monopoly?\"  I responded no ma'am.  She turned and threw items that the bagger had not yet bagged and was on to the next customer.  If I am going to spend $80 on three small bags of groceries, the least I can get is a smile and a thank you for coming.  Can I help you with your bags, have a nice night....something.  As I left the store, only one young man spoke to me and smiled a Have A good Night.  Not enough. Aldi, I apologize for cheating on you.  See you on payday.", "rating": "1", "date": [2016, 2, 8]}, "2": {"description": "Probably won't be going back there anymore.  Today's event of bad service and attitude problems is the final straw that breaks the camel's back.  The store is always clean and in a very convenient location but the prices are nothing to call home about.  Even still a clean convenient store would have ensured my continual patronage.  Unfortunately the attitude of entitlement and self importance that permeates the staff is no longer tolerable.  In an age where jobs are precious I would think someone would be extra careful to keep their own.  I am the lowest maintenance customer anyone will ever get.  I don' need a greeter or free samples, parking isn't even high-up on my list.  What I will not stand for however is being treated like I should be grateful to be shopping in a Jewel.  The attitude that the store can \"take you or leave you\"  has cost bigger moguls than Jewel-Osco dearly.  I do not appreciate having a transaction repeatedly interrupted by individuals so that they can all discuss shopping at the local Wal-mart.  I do not wish to hear all about whoever the associates are dating at the time or where they will be hanging out after work. I don't care about baby-daddy issues  and I am most certainly not interested in viewing flirtations and multitudes of sexual harassment.  If you are a fan of housewives of Atlanta this may be a great shopping experience for you. If you like your drama kept inside the television then skip this trip.  The other main issue with this Jewel is that they have a gas station.  A station with less than half the pumps working with the others having credit card machine issues no receipts no credit card acceptance in the store.  Skip that also.  I love to shop local because I know it is my very own neighbors who are employed by local businesses but paying premium prices for sub premium service is unacceptable.", "rating": "1", "date": [2013, 5, 16]}, "0": {"description": "I use to shop at Jewel-Osco more but the prices is what usually keep me away not the store, service or staff!!I do go though when I see a deal I just can't resist like the .25 a pound potatoes, or the .25 an ear corn...Which was all great and very good!!!I also come to the location to get some of my seasoning that I may not be able to find at other grocery stores like Food for Less or Save-a-lot!!!If you are budget conscious like I am check their sales, bring a coupon and it will be worth the trip!", "rating": "4", "date": [2012, 10, 15]}}, "latitude": 41.720239, "neighborhoods": ["South Deering"], "categories": [["Grocery", "grocery"]], "address": ["1655 E 95th St"], "attributes": {"Parking": "Private Lot", "Wheelchair Accessible": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "longitude": -87.582845, "category": "Food", "rating": "2.5", "price": "$$", "number_of_reviews": "4"}, "taqueria-el-taconcito-chicago": {"comments": {"3": {"description": "Taqueria El Taconcito catered a party that I went to this weekend in Frankfort, IL.  The steak, chicken and pork tacos were excellent.  They grilled the steak on a grill in front of us right at the party and the food was seasoned well and tasty.  The fresh cilantro and pico de gallo was very good.  I took 4 tacos home and they were even good the next day.  I'm going back for more.", "rating": "5", "date": [2013, 11, 13]}, "1": {"description": "Delicious food and great service. If you're ever craving authentic Mexican food and you're in the area make a trip. The name has changed to La Casita.", "rating": "4", "date": [2016, 2, 25]}, "2": {"description": "The best Pastor! It cooked on a gyros machine with a pineapple on top!!!! The guacamolera sauce is  my favorite", "rating": "4", "date": [2012, 4, 27]}, "0": {"description": "The food is really good & authentic.   Prices aren't bad either.", "rating": "5", "date": [2014, 5, 10]}, "4": {"description": "This place just opened up a couple weeks ago, so I decided to give it a go; as we all know I love tacos.Whenever I try a new taco joint I always order three tacos.  One carne asada (steak), one Pastor (marinated pork), and one more of random meat; in this case barbacoa (steamed beef).It took me a while to get home, I was busy chit-chatting with the owner, so my taco's got a bit soggy, but that's my fault.  I started with the barbacoa taco.  The meat was nicely steamed and most.  I have two beefs with it though (yes pun intended).  The first is that it seemed as if I got the last bits of meat.  Some of the cuts had a lil too much fat on them, which I think could have been trimmed off better.  The second is that a dash of salt would have helped.I moved on to the carne asada.  The meat tasted really good, and the taco was stuffed with meat.  I really enjoyed this taco and it went well with the salsa verde (green hot sauce).Now when I entered, I first noticed that they were preparing a fresh spindle of pastor, so I knew I'd get re-heated meat, but I still decided to go for it because as I watched them preparing the spindle, it looked really tasty.  And let me tell you, it sure was tasty. This was the first time I was able to taste the pineapple (yes they season al pastor with pineapple); and for being reheated the mean was a lot better then I thought it would be.I'm going to give them 3 stars now, but I will be back and I'm sure this ranking will bump to a 4; and I sure hope so considering that they have the latest hours in the hood.  They are open until 11pm on Monday - Thrursday and 1am on Friday and Saturday!!! Awesome!!!Also they have a good variety of meats and foods, and the prices are great.  $1.50 for a taco, $3.50 for a torta, $4.50 for a burrito.  I should also mention that I was surprised to see that in my take-out bag they included limes and cebollitas (baby grilled onions) and a the traditional pickled carrots, onion, chili mix.  Limes are common, the carrot mix rare, but never have I ever seen cebollitas handed out as well.  It was a very pleasant surprise indeed.I'll talk to the owner and see if I can help mold them into a 4 or 5 star restaurant.", "rating": "3", "date": [2009, 7, 7]}}, "neighborhoods": ["South Deering"], "latitude": 41.7035168590245, "longitude": -87.5599665976372, "rating": "4.0", "times": {"Mon": ["8:00 am", "11:00 pm"], "Thu": ["8:00 am", "11:00 pm"], "Sat": ["8:00 am", "1:00 am"], "Wed": ["8:00 am", "11:00 pm"], "Tue": ["8:00 am", "11:00 pm"], "Sun": ["8:00 am", "8:00 pm"], "Fri": ["8:00 am", "1:00 am"]}, "price": "$", "categories": [["Mexican", "mexican"]], "address": ["10536 S Torrence Ave"], "attributes": {"Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "5"}, "chatham-beauty-supply-chicago-2": {"comments": {"1": {"description": "They carry a variety of products from Mizani to Mixed Chicks.  So I'm a fan of that. I usually buy synthetic hair to help spice up my life.  I need to have some variety.  Staff can be hit-or -miss when it comes to helpfulness, knowledge & friendliness.  But I pretty much know what I'm looking for when I get there.", "rating": "3", "date": [2010, 11, 13]}, "0": {"description": "This is a big blank beauty supply store. I think it has everything that a girl could ever need in here and more. I guess the prices are reasonable for the products and they carry a variety of them. The staff is OK i guess, nothing to be impressed by. I usually go in for what I need and leave.", "rating": "3", "date": [2015, 11, 10]}}, "latitude": 41.7222185, "neighborhoods": ["South Deering"], "categories": [["Cosmetics & Beauty Supply", "cosmetics"]], "address": ["1637 E 95th St"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.5840686, "category": "Shopping", "rating": "3.0", "price": "$$", "number_of_reviews": "2"}, "cosmo-chicago": {"comments": {"0": {"description": "Lot of stuff in here, selection is good. If you are a person who requires a lot of assistance, this isn't the store for you. It's kind of self service and for me it works", "rating": "4", "date": [2013, 5, 23]}}, "latitude": 41.7212850057915, "neighborhoods": ["South Deering"], "categories": [["Cosmetics & Beauty Supply", "cosmetics"]], "address": ["1617 E 95th St"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.5841728970408, "category": "Shopping", "rating": "4.0", "price": "$$", "number_of_reviews": "1"}, "mcdonalds-chicago-154": {"comments": {"0": {"description": "This is a very clean and friendly McDonald's!!!I received my food hot and fast...the young lady that took my order greeted me with a smile!I will go out of my way to go this location even though they aren't the closes one to me!", "rating": "4", "date": [2012, 10, 15]}}, "latitude": 41.7223358, "neighborhoods": ["South Deering"], "categories": [["Fast Food", "hotdogs"], ["Burgers", "burgers"]], "address": ["1951 E 95th St"], "attributes": {"Take-out": "Yes", "Has TV": "Yes", "Wi-Fi": "Free", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "No", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.5762024, "category": "Restaurants", "rating": "4.0", "price": "$", "number_of_reviews": "1"}, "happy-nails-and-air-brushing-chicago": {"comments": {"3": {"description": "Nails were crooked and popped off after a week. When i walked in I was skeptical because of the amount of people in there. The pedicure is the only reason they have 2 stars. They quoted me a higher price then someone that was next to me and the man that did my nails was annoyed when I told him that the nail was crooked. I asked him to fix it and he rolled his eyes and took a deep breath like i was inconveniencing him. Not a place I would return to", "rating": "2", "date": [2015, 8, 31]}, "1": {"description": "It's all about who services you. The place is nice as a whole but certain ppl are bringing down their stock. Whatever you do, dont let \"Henry\" do your nails. I went in for a no chip mani, instead of him soaking off the old no chip polish he began drilling it off making my nails thin and brittle, then actually drilling to the point of blood. He filed them down and now every single nail is shaped differently...one even looks like Gumby.Then the very next day my polish was chipped. I went in and complained and he told me he'd fix ONE nail...wtf is ONE nail sposed 2do?! Then once he finally fixed the 3 that had chipped, that same night 2 diff nails chipped. Then all of the nails on my right hand broke due to the thinning. Now both of my hands look a fool and it hasn't even been a full 5 days. Complete waste of money bcuz now I have to get both hands redone. Nvr again", "rating": "3", "date": [2015, 9, 22]}, "2": {"description": "This nail salon is REALLY GREAT! The staff is very friendly and they do a fabulous job. You can get it all nails,pedicure, no chip, brows, lashes, waxing and much more! It's pretty big, which is good, they can get you in and out fast! If you want a nail tech that knows her craft, ask for Annie, she is amazing. She will take her time and make sure your nails are perfect. She is also very creative so if you like designs she's definitely your tech. Well check it out,you won't be sorry!", "rating": "5", "date": [2015, 6, 29]}, "0": {"description": "Hannah is the BEST‼ I've been coming to her here for years. She's very attentive, professional, and has an excellent work product. My no chip always last more than two weeks. Note: she's off on Tuesdays.", "rating": "4", "date": [2015, 7, 31]}, "4": {"description": "Got the no chip and it didn't turn out to look as clean as most other places (I.e smudges of polish). Also, not too sure about the quality of the polishes used. Likely won't be coming back.", "rating": "2", "date": [2014, 2, 23]}}, "neighborhoods": ["South Deering"], "latitude": 41.7223077267408, "longitude": -87.5842805206776, "rating": "3.0", "times": {"Mon": ["10:00 am", "8:00 pm"], "Thu": ["10:00 am", "8:00 pm"], "Sat": ["9:30 am", "8:00 pm"], "Wed": ["10:00 am", "8:00 pm"], "Tue": ["10:00 am", "8:00 pm"], "Sun": ["11:00 am", "5:30 pm"], "Fri": ["9:30 am", "8:00 pm"]}, "price": "$$", "categories": [["Nail Salons", "othersalons"]], "address": ["1631 E 95th Street"], "attributes": {"Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes"}, "category": "Beauty", "number_of_reviews": "5"}, "jovial-club-chicago": {"comments": {"3": {"description": "As a local I must say this is the best bar in the area. I absolutely love the old timey feel and how you can just sit at the bar, grab a drink and talk it up with the bartenders. They're so friendly and chances are they'll know you or someone in your family. Prices are great and the shape of the bar is something you rarely see. It's like a big snake!I've been here for events in the little banquet hall and in the bar area for dinner with the family and just to grab a drink with friends. The food is delicious and the music always keeps me entertained. I can't wait to stop in soon on a Friday night to hear some oldies!", "rating": "4", "date": [2009, 5, 11]}, "1": {"description": "Nice place for a small family party.  I've rented the hall a couple of times already always satisfied.  Carol is great and she takes care of her customers.  I've had the catering from here and the chicken, salad,  Mostacholli,  sausage and bread are delicious. Definitely nice for kids too!", "rating": "5", "date": [2014, 11, 22]}, "2": {"description": "Came here for the Drina Tamburasi Orchestra concert, which I thoroughly enjoyed. The same cannot be said for the actual Jovial Club.No one greets you when you enter. We had reservations primarily to see the concert and they sat us away from most of the people, which meant that half the night we were twisting in our seats to watch them play to the other area. But that pain doesn't even compare to waiting, and waiting, and waiting for the servers.The tables are numbered and waitresses are divided up to serve their specific numbers. Maybe the memo didn't get through. Our server never came to ask us if she could get us anything, only to snatch up plates/cups and dash away. Any time we wanted to order we had to try and do something to catch her attention. There was another server who kept coming by so we would just tell her what we wanted and she kept telling us she wasn't our server. I guess if we could have seen our server then we wouldn't bug the one who seems to be free.Because everything took so long to be delivered to our table I went up to the bar to order a White Russian. You cut out the middle man, right? Nope. My order was taken and I waited for them to go back to the kitchen and get milk/cream. Another asked me what I wanted and I told them I had ordered already. The milk was found and brought back, sat down on the bar. Another person asked me for my order. Then the first server proceeded to talk with the other bartender and pour drinks for other people. I waited at the bar for at least 5 minutes to get a simple drink when there were only 3 or 4 other people at the bar.The drinks are decent, the food is decent. Everything in decently priced; however, I don't plan on coming here again unless it's for another event like the one I came for. Also, I'm going to vocalize in advance where I'd like to be seated and then order a half dozen drinks at the beginning so I won't have to wait.", "rating": "2", "date": [2009, 4, 30]}, "5": {"description": "Jovial Club is a great local bar where everyone knows everyone, if not by name, at least by a familar face.  Owner, Helen Spelich, is a feisty 90 year old, still sharp as a tack and knows everything about everyone in the neighborhood, and still walks around to great patrons. The service is relatively slow and the food is expensive for the area, but plentiful and good. The banquet rooms are large enough for private parties and a local Croatian band plays seemingly every month. Good time, even if you don't speak/understand the language.", "rating": "4", "date": [2012, 1, 13]}, "0": {"description": "I love this tavern, live in downtown chicago but enjoy this small town divey bar. Very cozy!", "rating": "5", "date": [2015, 10, 10]}, "4": {"description": "I felt like it was 1974 when I was at the Jovial Club and that's not a bad thing. The décor and feel of the place combined with EVERYTHING that played on the jukebox made me feel this way. Feeling like I was in the decade before I was born was....cool and good for a change. I will take pictures the next time I visit.If you're not from the neighborhood you will get stared at as you enter--not in a mean way, just a \"huh, people were not used to seeing are here\" way. A group of regulars sat at the circular bar and everyone seemed to know each other. I got the shrimp/perch dinner and it was $15 which is expensive for the neighborhood. I'm not sure how much the drinks were since a nice, older gentlemen picked up the tab on those (but I think they are reasonable). Food was plentiful and good.Yep, I like Jovial Club.", "rating": "4", "date": [2008, 11, 9]}}, "latitude": 41.72068, "neighborhoods": ["South Deering"], "categories": [["Bars", "bars"]], "address": ["9615 S Commercial Ave"], "attributes": {"Has TV": "Yes", "Bike Parking": "Yes", "Good For Dancing": "Yes", "Noise Level": "Average", "Good for Groups": "Yes", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Music": "DJ", "Coat Check": "No", "Accepts Credit Cards": "Yes"}, "longitude": -87.55086, "category": "Nightlife", "rating": "4.0", "price": "$$", "number_of_reviews": "6"}, "taqueria-hacienda-chicago": {"comments": {"3": {"description": "I hate that they close early but ever since I was little I would come here and order my tacos and cheesefries . It's really good !", "rating": "4", "date": [2015, 2, 19]}, "1": {"description": "Great steak tacos! The meat didn't have much (or any) salt , BUT when you get the cheese, it takes it up several notches, because it's a little sharp. The steak and the chicken torta were just  okay. The extra star comes for the fast service. I was in and out of there in less than 5 minutes, so you can't beat that.", "rating": "4", "date": [2015, 9, 19]}, "2": {"description": "These were the best tacos I've had in 2015 so far. I came here on a cold winter day because of a craving for authentic Mexican food. When I arrived, the service was friendly, attentive and most importantly fast! The horchata was divine! It definitely had a friendly/family vibe there. Since it's right around the corner, I will be visiting more often!", "rating": "4", "date": [2015, 1, 8]}, "5": {"description": "I am addicted to their horchata. This is the BEST horchata I have ever had, and I KNOW my horchata, Ive had many.  They should bottle this up right now! The bottled up chemical mess labeled \"horchata\" sold at Mexican grocery strores is something I wouldnt even offer to my worst enemy.  I have only eaten here once and the food was decent, but I keep on coming back just for horchata.", "rating": "5", "date": [2013, 1, 21]}, "6": {"description": "Good food at great prices, if you order off the breakfast menu almost everything is 5 or 6 bucks and comes with rice and beans, very nice. Not only is it affordable, the waitresses are friendly and the food is good. Oh yeah they have a grilled chicken they do here that is phenomenal, it is served family style in the middle of the table along with tortillas rice and beans.", "rating": "4", "date": [2012, 11, 11]}, "7": {"description": "Super great tacos, at a very affordable price.  I came here one day during a teacher institute lunch break, and was really surprised with the quality of food!  It was fairly packed at lunch time, and it was very clean inside.  I will be back here many times during the school year!  Worth the trip down south!", "rating": "4", "date": [2008, 10, 7]}, "0": {"description": "This place has never let me down!When I'm cold, tired and hungry walking home from the train, I always think to stop here.  They are so inexpensive and FAST it's hard to walk past without getting a quick bite to eat.  And when I say FAST, I mean I order, pay and walk out with my food (usually 3 tacos) in under 10 mins.I started coming here because my dad liked the Al Pastor and he got along with the owners.  He took me here the first week I moved back into the hood.  This is a lil mom and pop shop, so it's nice to keep the money in the community.Since my first visit, they have relocated to the larger building next door which they used rent as a hall, so they have a lot more sitting area, a full bar, and the ambiance is a lot nicer.  I don't know if they still have the ice cream cooler though.No matter what time of day - prime lunch time or off peak right before they close - I get consistently good food.  Which goes to say a lot!  I don't know how they do it, but the meat is always fresh and has that just cooked taste to it.I know a lot of other taqueria's leave the meat in a warming pan or pushed off to the side, which they reheat on order, leaving the meat tuff or dry, but not this place.  The meat is always nice and juicy and hot and doesn't have the reheated taste to it.  Including the Al Pastor (pork & onions), which is another great feat in itself!I'd have to be honest and say that wasn't always the case... at least in the smaller location, but since they've moved I have been completely satisfied.The tacos are average size, with nice generous portions of meat, and of course lettuce, onions and cilantro.  (I actually don't like lettuce on my tacos).Today I had a milanesa (breaded steak) torta.  It was really good.  Not at all greasy.  It was a good cut of meat with just a little bit of fat I couldn't chew.  The breading had a good flavor to it and I think it was a bit crispy on the edges, and the bread was nice and fresh and tasty as well.  I dined in rather the doing take out because I really wanted the chips and salsa.They have a red and green salsa.  They both have a good taste to them and I usually mix them on the chips.I only have two complaints, which don't effect the rating at all.  The first is that they don't serve you the salsas in a bowl, so you have to squeeze it from the bottle onto the chips.  Obviously they are saving money by doing this, because they'd otherwise have to discard any unused salsa in the bowl, but I'm just a big fan of dipping and scooping.Second is that the limes always seem to be a little on the older side; that is they don't seem that juicy.  I don't always use limes, so it's not a big deal, and you can always ask for more if necessary.", "rating": "5", "date": [2009, 2, 17]}, "4": {"description": "I use to live just a block away from here so it was my place to go when cooking wasn't in my playbook for the day. This place has the best Mexican food (aside from El Guero). I love the enchiladas, burritos and milanesa bistec mmmmmmm.  I have not had a burrito as good as Hacienda's and the enchilads de pollo..... You know what I need to stop.. I'm getting hungry....", "rating": "5", "date": [2014, 9, 23]}}, "latitude": 41.7187843, "neighborhoods": ["South Deering"], "categories": [["Mexican", "mexican"]], "address": ["9710 S Commercial Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Has TV": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "Full Bar", "Caters": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Wheelchair Accessible": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Lunch, Dinner"}, "longitude": -87.5511475, "category": "Restaurants", "rating": "4.5", "price": "$", "number_of_reviews": "8"}, "burger-king-chicago-41": {"comments": {"3": {"description": "Somebody is playing a joke right? They have got to be kidding putting a BK in the dead smack middle of an already congested parking lot. Somebody forgot to do customer-training seminars with the employees before they opened for business. First, they have the double line drive through which was a total nightmare within itself. Second they person who receives my order was very ghetto and unprofessional, i.e. \"Huh, what you say\"? It took forever just to receive a simple #2 combo. I think I will gladly pass this establishment up from now on. As they say, you never get another chance to make a first impression. And they blew their first impression for me.", "rating": "1", "date": [2009, 2, 23]}, "1": {"description": "These people need more than CSR training, food prep training, or a course in product brand dlivery. They seriously need a Health Department Inspection. Even McDonald's 1976 green shamrock shake (better known as the spoiled milk malted), at least looked the part.", "rating": "1", "date": [2015, 12, 30]}, "2": {"description": "On 4/7/13 I like many others drove though the drive thru.Since 1992 I order the same thing at every Burger King. I ordered a Bacon Double Cheese Burger no pickles and the lady responded back \"This isn't Wendy's\" keep in mind I've been ordering the same thing for years and though the names have changed for many items they never stopped selling Bacon Double Cheeseburgers.As many of the reviewers have pointed out those who work here are very \"ghetto\" and need retraining. This is no reason EVER for anyone to be condescending to their customers. Your paid by your employer to do said work but again this is why people refuse to move businesses in the hood or go to a location with a lot of hood employees.This Burger King is owned by the Heartland as a franchise. Ill be looking for a phone number to voice my displeasure with coming to this location.Again, I could have took my money anywhere but I decided to stop in this area.", "rating": "1", "date": [2013, 5, 7]}, "0": {"description": "I know what you're thinking.  '5 stars? Relax its BK' right? Yes, it's just another BK as far as food goes. I went in for some coffee, today. I left in shock at how cool the staff was. The manager knew customers by name, the entire staff was polite and friendly, and the manager introduced himself. (And not in a weird way, either.lol) This kinda stuff goes a long way in my book. Thanks guys, keep up the good stuff.", "rating": "5", "date": [2013, 10, 24]}, "4": {"description": "While I agree with Matt Y's comment about putting a BK in the middle of a busy parking lot, overall my experience wasn't that bad.   (the traffic is kinda a bitch though!)  I didn't use the drive thru, and opted to eat inside.  It was clean, and service was much more prompt than I expected.  Inside, they have a plasma TV with the news on, so that was nice to watch before heading back to work!", "rating": "3", "date": [2009, 3, 9]}}, "latitude": 41.721905, "neighborhoods": ["South Deering"], "categories": [["Fast Food", "hotdogs"], ["Burgers", "burgers"]], "address": ["1701 E 95th St"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Accepts Credit Cards": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Wheelchair Accessible": "Yes", "Good for Groups": "Yes", "Drive-Thru": "Yes", "Good for Kids": "Yes"}, "longitude": -87.582451, "category": "Restaurants", "rating": "2.0", "price": "$", "number_of_reviews": "5"}, "l-and-g-family-restaurant-chicago": {"comments": {"3": {"description": "Brutal. I'll blame myself for the 3rd try, but it's on the way home & maybe the last time was an aberration.Nope. 2 out of 3 times, I walked out. The busboys do a better job greeting customers. Wasn't busy today, but I sat for an easy 5 min. No one ever came to take my order. I got up and no one noticed. I'm embarrassed I've gotten bamboozled into giving this place a shot. The one time I was able to have a meal, the food was mediocre at best. Customer Service is taken for granted. Surprisingly, it's usually packed when I drive by. Bizarre. It's a shame people have such low standards that they feel they have to eat there. Won't be getting my $ for their overpriced menu. Basura!Take the drive to Tom's. Food is much better & you are treated well. Shame on me for giving this place a chance. Judge a book by its cover in this case.", "rating": "1", "date": [2015, 2, 7]}, "1": {"description": "All things being considered equal this place has an extremely rude staff across the board ( I didn't interact with the cooks), I've been coming here for years and the decline has been consistent. They managed to get two stars because the food was prepared quickly and was good. Be prepared for some attitude from the staff but a decent meal and price.", "rating": "2", "date": [2016, 1, 20]}, "2": {"description": "Terrible from the phone call to place the order to the finished product.  Called to order a pick up breakfast.  Wanted a bacon and cheese skillet but was told I have to order a meat skillet.  I don't want the ham and sausage and so I asked if I could sub mushrooms... No I will have to pay an extra charge of $1 if I want to add this item... It ended up costing 10.50 for a bacon mushroom and cheese skillet.  I asked for over medium eggs and got crispy fried hard eggs.  I ordered two other breakfasts as well and since it was boxed as to go I guess the cooks felt as though it could be slopped into a box and hurry to the next order... Terrible... I called to speak to the manager and I am still awaiting a return call... On day 2 of waiting!!", "rating": "1", "date": [2015, 6, 25]}, "9": {"description": "nothing against cops but they tend to act like big shot A**holes when they're in a group & they're ALWAYS eating here. It may serve in the restaurant favor however because it is in an extremely dangerous area if south Chicago. Would not suggest anyone to bring a family here. service is also very mediocre.", "rating": "1", "date": [2013, 12, 23]}, "10": {"description": "Great restaurant in an unlikely spot!  Excellent coffee (also available at the 75th and Exchange location) and excellent food.  We really enjoy the huge omelets - especially the Mexican omelet which is served with superb homemade salsa!  The quality is excellent and the food is consistent.", "rating": "5", "date": [2013, 6, 24]}, "4": {"description": "good breakfast, everything else is hit or miss. Try it for yourself, you may like it.", "rating": "3", "date": [2015, 5, 29]}, "6": {"description": "Me and my hubby stop by this Resturant sometimes before he takes me too work they have the best breakfast. And it opens at 5am that's the best.", "rating": "4", "date": [2014, 8, 12]}, "11": {"description": "This is a fantastic restuarant.  Its a small diner in the Hegwesch area of South Chicago. They have a convenient parking lot. The service is excellent. I went there for breakfast on a Sunday morning. Lots of customers there, but I did not have to wait long at all.  The delicious coffee refills were endless. The menu was excellent with breakfast and lunch!  My sister had the meat lovers omelet.  I had one of the skillet entrees.  The food was in ample portions and delicious!  With all the delicious food and neverending coffee, the check was less than $20!  If you are out in this area, I highly recommend this restaurant.  You will love it!", "rating": "5", "date": [2007, 11, 25]}, "5": {"description": "Breakfast here is amazing I have tried several places around this area and I haven't found anything better than this one. The food is great the service is even better as soon as you cup is empty you'll get hot coffee right of way. Only downside is parties of 5+ will have a hard time trying to get a table but the wait is worth it.", "rating": "4", "date": [2015, 3, 29]}, "7": {"description": "Has potential, lots of choices, like purple steer, big menu, very much like a wild west kind of place. Seems like at any moment a person will walk in and try to hold it up though, don't really like that vibe. Lots of food for the amount you pay but some of the soups are gross. And they have this annoying bus boy who laughs fairly often in a high pitched squeal. But all the waitresses are really sweethearts, so it balances.But that is what is fun about diners, and going to them. You can never tell what kind of person will walk in the door. There isn't really any place around like it for miles so you get a \"last stop\" kind of vibe. So, in conclusion, lots of vibes going on here. I don't like: Tuna melt - ugh dont get this unless you have had a murderous week, or day and need to instantly gain 4lbs, they use American cheese on it, gag. Large uncut brocolli, steamed - got this with a chicken that I would call a C+, but this unseasoned steaming tree knocked it down further. At least a little salt? Lemon? Annoying bus boy laughing like he's a ferret on meth. I do like:Breakfast all dayLarge parking lotHealthy menu that I have not explored.Waitresses are really friendly. Cost effective.", "rating": "3", "date": [2013, 7, 28]}, "8": {"description": "I only went into this place because Lief doesn't accept anything but cash. It was too nasty out to keep driving around looking for food so we took our chances. I WAS NOT impressed at all and can't say that I will return willingly.", "rating": "3", "date": [2014, 3, 18]}, "0": {"description": "Food is great. Pancakes are delicious. Chicken Skillet always goes home in doggie bag. Only negative would be wait times for a booth.", "rating": "5", "date": [2015, 8, 12]}}, "neighborhoods": ["South Deering"], "latitude": 41.7062252, "longitude": -87.5595112, "rating": "3.0", "times": {"Mon": ["5:00 am", "10:00 pm"], "Thu": ["5:00 am", "10:00 pm"], "Sat": ["5:00 am", "10:00 pm"], "Wed": ["5:00 am", "10:00 pm"], "Tue": ["5:00 am", "10:00 pm"], "Sun": ["5:00 am", "10:00 pm"], "Fri": ["5:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Desserts", "desserts"], ["Seafood", "seafood"], ["Breakfast & Brunch", "breakfast_brunch"]], "address": ["10401 S Torrence Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Average", "Caters": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Breakfast"}, "category": "Restaurants", "number_of_reviews": "12"}, "taco-mex-chicago": {"comments": {"12": {"description": "Ok sooooo, been searching high & low for some bomb shredded pork tamales and was told about this spot so I gave it a try. Clean spot on ghetto torrence ave. get in there, order a dozen tamales, $10, not bad. stopped taking credit cards over the holidays but will be restarting it again....... Dont understand that logic but ok. So get the piping hot tamales, asked 4 a plate & got a bowl like container. Break out one in the car and let's just say my search 4 shredded pork tamales in chicago WILL CONTINUE. they lacked flavor as if the pork was overcooked or not seasoned well, it was more sauce & masa than pork, just not up 2 par 4 me. If anyone knows where I can find AUTHENTIC, FLAVORFUL, MOIST, SHREDDED PORK TAMALES, PLEASE LET ME KNOW.", "rating": "2", "date": [2012, 1, 6]}, "3": {"description": "Excellent deep fried ground beef tacos, always fresh and usually piping hot tamales. Will some day try other stuff but the only way that would happen is if they didn't have either of those items.", "rating": "5", "date": [2015, 8, 19]}, "1": {"description": "Crispy beef tacos are very, very tasty. Steak tacos are good too. First time. Will return often", "rating": "4", "date": [2016, 3, 3]}, "2": {"description": "Love this place, but I'm from the neighborhood.  Tamales (pork/red) in high demand on weekends. Try the combination dinner for a taste of a few things. Lengua in salsa verde, excellent. Service is not the fastest but very friendly.", "rating": "4", "date": [2015, 2, 19]}, "9": {"description": "DAMN..I LOVE THIS PLACE!! Everything is good at a reasonable price. (Crispy Beef Tacos)", "rating": "5", "date": [2014, 4, 12]}, "10": {"description": "The best tamales in all  the land.  The rojo are moist and flavorful and packed with seasoned beef.  The verde are tender pork with just right amount of heat.  The other items on the menu are just as delicious.  If you live in Evanston it's worth the trip.  Buy two dozen tamales because if there are two of you a dozen will be inhaled on the way home and then you will have some left for later.", "rating": "5", "date": [2014, 8, 1]}, "4": {"description": "Great Tamales, never ate there before, never tried anything else.  5 stars based only on the tamales.  Green pork and chicken are my favorites.", "rating": "5", "date": [2015, 3, 1]}, "6": {"description": "I read the reviews and was looking forward to eating lunch from here. I was on hold for 9:51secs. I was on a delivery and had just enough time to pick up. I tried placing an order for pick up, but they seemed to have forgot I was on the phone?  I hope I get a chance to eat here, so that I can give them the 5 stars they seem to deserve.", "rating": "3", "date": [2015, 2, 3]}, "0": {"description": "This place is definately not closed anymore, reopened at some point, I know because I was just in here Saturday 4/5/14.  I must say I was very impressed because Taco Mex has a unique item that you will not anywhere else, the deep fried taco.  As you will see in my picture below, I ordered 5 tacos, and the three at the bottom of the picture with all the crumbly cheese are three fried tacos, two ground beef ones and a chicken one.  The chicken one is not so great because the meat got dry from the frier, but the beef ones are to die for.  They stick these tacos in frying oil for a short time and they come out tasting like a fried Taquito, then they are topped crumbly Mexican cheese, and are so addictvley good!I also had a steak taco and a steak and cherizo mixed together taco and man was that one good.  The steak taco was boring though, their steak is not that great, but mixed with Cherizo it is bomb!My friend ordered the carnitas with eggs, I had the pleasure of trying his carnitas and they were really really good and juicy.  They do not chop up their carnitas it is a slab of it and really damn good!  The chips and salsa is spicey and pretty good.  I am glad this place reopened because I will be back for more fried tacos and carnitas!", "rating": "5", "date": [2014, 4, 7]}, "5": {"description": "There deep fried tacos are awesome best around. Only wish you could get there spicy pork in deep fried shells. But very good food.", "rating": "5", "date": [2015, 8, 21]}, "13": {"description": "Authentic Mexican food. You will feel right at home at Taco Mex.  The owner is very personable, the food is excellent and is prepared fresh daily by the owner himself.  My favorites are Crispy Chicken Tacos, Steak Sopes and Steak Taquitoes.", "rating": "5", "date": [2010, 8, 5]}, "11": {"description": "Taco Mex, how I love coming here almost every weekend and, when I get the chance to work from home for lunch. The ambiance is non-existent, that is not why I come here. They have the best Mexican around. I always try new restaurants but always complain that we should have went to TM for mexican. Top food choices are: Tamales, crispy taco's, carnita's, workers breakfast, and by far my favorite and the best dish they have.....Chilaquiles you can never go wrong with red or green depending on the hotness you prefer. They only take cash, great coffee with cinnamon, no chips on Sunday. You can bring your own beer in. Overall great food at both locations.", "rating": "5", "date": [2012, 2, 6]}, "8": {"description": "This restaurant has reviews that make me wonder if I went to the correct restaurant.  So I saw a best of list which had this place on it.  I also hit the yelp page and saw all of the 5-star reviews.  Needless to say I was under the impression that I would have a good meal.  I couldn't have been more wrong.  From the inattentive service to the bland steak taco I thought it couldn't get much worse.  I had two tamales the cheese and jalapeño was just ok and the hot pork was delicious.  It was the ONLY thing good about this restaurant.  We waited at least 10-15 minutes for water and our food took around 40 minutes to come from the kitchen.  We didn't order anything special just tamales and a taco and a burrito.  Now for the reason I absolutely wont return to this restaurant.  Late in our meal our server went to the table next to us which had not been cleaned.  She took a water carafe off the table filled it with ice leaving the water that was left and took it to a new table.  Yuck", "rating": "1", "date": [2014, 8, 16]}, "14": {"description": "OK, Now you got me started on Mexican food.  Two Items to bring up are both found at Taco-Mex.  Naturally the tacos are outstanding, as is all the other dishes.  But two standout, very distinctly; Tamales and Menudo.  Tamales are excellent. And as many of you already know, they are often filled with different ingrediants.  My two Favorites are the Shredded Pork with Red Chili Sauce and Chihauhau Queso with slices of HOT Jalepeno.  Matter of Fact, there is another Dish my Kids really enjoy its called a Tamale Boat.  Tamale with a Ladle of Hot Carne con Chili and a dollop of Sour Cream.  Oooh!  I'm getting Hungry.  These tamales are INTERNATIONALLY KNOWN.  Some of the Neighborhood  boys are in the Army and the owner made sure they got some in Iraq.My other Favorite Dish is the Sunday Menudo.  If you got drunk the night before, this is the Antidote.  This is a Soup of Cow's stomach cooked in a mixer of Peppers and served with a Large spoonful of Hominy (Crushed they're called  \"Grits\").  Lime Juice, Onion, and chopped Jalepeno are used as a Garnish.  Have Menudo with a couple of Tamales and you'll kiss away that Hangover in no time.", "rating": "5", "date": [2009, 8, 4]}, "7": {"description": "Really delicious Tex-Mex Restaurant!  Finally a place in Chicago I can check out.  They've been around for thirty years. They have these crispy beef tacos.", "rating": "5", "date": [2014, 7, 31]}}, "neighborhoods": ["South Deering"], "latitude": 41.701588, "longitude": -87.5597349, "rating": "4.5", "times": {"Mon": [], "Thu": ["9:00 am", "7:00 pm"], "Sat": ["9:00 am", "6:00 pm"], "Wed": ["9:00 am", "7:00 pm"], "Tue": ["9:00 am", "7:00 pm"], "Sun": ["9:00 am", "2:00 pm"], "Fri": ["9:00 am", "7:00 pm"]}, "price": "$$", "categories": [["Mexican", "mexican"]], "address": ["10658 S Torrence Ave"], "attributes": {"Parking": "Street", "Take-out": "Yes", "Bike Parking": "Yes", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Average", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Wheelchair Accessible": "Yes", "Good for Kids": "Yes", "Attire": "Casual", "Waiter Service": "Yes", "Has TV": "Yes", "Takes Reservations": "No", "Good for Groups": "Yes", "Good For": "Brunch, Lunch"}, "category": "Restaurants", "number_of_reviews": "15"}, "tacos-nietos-chicago": {"comments": {"3": {"description": "Their tacos are the best around!!! Once you try them you will only want tacos Nietos! I honestly think there location on 95th street have the best tacos. It's a very small place but don't let that deceive you. The place on 106th street that place has a very tasty caldo de camaron. Good food.", "rating": "5", "date": [2014, 8, 15]}, "1": {"description": "The tacos are ok but the Gorditas are the best in the area.  Don't forget the avocado salsa, it is the best!  The only thing I didn't like is the fact that it's cash only!", "rating": "4", "date": [2014, 8, 19]}, "2": {"description": "I will not be going there again. While I was waiting for my take out order, I saw a waitress take a used salsa bowl from a customer's table and transferred the salsa into a new bowl.  All she did was add more salsa in the new bowl. In any case, that is unsanitary. People can get sick. If they reuse salsa, who knows what else have they been doing over there.", "rating": "1", "date": [2014, 12, 26]}, "5": {"description": "I discovered this place a few months ago. I had driven past a few times and never even noticed the place, but my stepdad told me the place had amazing tacos and took me. I had carne asada tacos, and they instantly became the best steak tacos Ive had around a 50 mile radius (with the exception of the steak tacos in Harry's Long Bar in Blue Island, which are just as good as these). The meat is cooked to perfection, and it is some of the most flavorful, juicy, no nerves beef Ive ever tasted. This is something I cant describe, its something you have to try for yourself. Since then Ive had the following: milanesa torta, (is good), the enchiladas (are ok), the al pastor tacos (are ok) and the chicken flauta dinner, which is delicious because the beans and rice are good, and the flautas are generous and they dont scrimp on toppings, they pile on the sour cream, garnishing cheese and avocado on top. A big plus is that they provide you with lots of pickled carrots n peppers as well as grilled cebollitas or scallions, and the latter is something all other restaurants charge separately for. People think that Pilsen/Little Village area has the best Mexican food in the Chicago area, but thats not true, the only place that can compete, but still dosent come close is El Milagro, which serves up good generous steak tacos.Tacos Nietos is one of my fave spots to eat, it has been consistent every time and the staff is always friendly and accomodating.", "rating": "5", "date": [2013, 1, 21]}, "6": {"description": "As a world traveler (I've been to Canada three times and Maine once), I'd have to say that this place has the most authentic tacos I've ever had in my life.  I've been to Big Star.  I've been to Antique Taco, La Pasadita, Taco Joint, etc...  Tacos Nietos is my favorite.  I've been to Tacos Nietos close to ten times.  I have six of their business cards.  I have one in my jacket pocket as I type this.  I've also been to Taco Bell.  My favorite thing at Taco Bell is the Baha Beef Chalupa.  It should be yours, too.  Needless to say, Tacos Nietos is my favorite taco spot in Chicago.  Having said that, I'll go ahead and say this: I went there twice in one day once.  Anthony Bourdain would love this place.  Coincidentally, it's on the same street as Calumet Fisheries.  How'd you miss this place Tony?  Come on.  You're better than that.  Please come back to Chicago and check this place out before Guy Fieri does and ruins it for everybody.  Thanks so much.  Shout out to JR, ER and MR for puttin' me on.  One.", "rating": "5", "date": [2013, 2, 4]}, "7": {"description": "Loved this place.  From what I can tell, this place is in a gas station, but delivers on the taste.", "rating": "4", "date": [2012, 8, 25]}, "8": {"description": "My very favorite taco place in the whole area. I go here for lunch at least twice a week. They're usually pretty busy, but they're fast!  GREAT tacos, chilaquiles, tortas all in a bunch of varieties. Worth a try! And yep, it's next to a gas station.", "rating": "5", "date": [2012, 1, 22]}, "0": {"description": "When you walk by, it looks like a taco place attached to a gas station. And when you get closer, you realize, IT IS a taco place attached to a gas station. But this neighborhood teaches you not to judge a book by its cover. The scary guy with a face tattoo is actually a born again Christian youth preacher, trying to pull young gang bangers off the street. A few people I work with rave about this place, so I had to try it.It is really good. Up there with Paco's Tacos. Quick service, delish green salsa, 3 seats facing the pumps. What more do you want, gringo? Come try it. It won't rob you, it just wants to tell you about Jesus.", "rating": "5", "date": [2013, 10, 21]}, "4": {"description": "Wow what is up with the good reviews?  This place was just ok and nothing better.  It seriously does not meet the standards for excellent CHICAGO Mexican food, and I am shocked because their location on 106th street is some of the most incredible Mexican food I have ever eaten and is on the top of my list, but this location on 95th is bland and just average and a huge yawn.  If you look at my reviews you will see I reviewed the 106th street location today as well and I show pics, now that is some bomb Mexican food here it's just another taco place.This place is attached to a ghetto gas station and thugs, not bums, but thugs beg for change.  this is a rough area to be in but I do not care about that shit, I just wanted you as the reader to get a feel of how the place is, but it does not effect my review.What does effect my review is the food, and the bland and completely tastless Barbacoa taco I had, it just sucked and all I tasted was the other stuff on it and not the meat.  The steak burrito was good but not above average like their other location.  My brother said his 4 tacos blew ass, so yea, we will not be back to this spot, but we adore Tacos Nietos on 106th!", "rating": "3", "date": [2014, 4, 21]}}, "neighborhoods": ["South Deering"], "latitude": 41.7226751893759, "longitude": -87.5545676797628, "rating": "4.0", "times": {"Mon": ["8:00 am", "9:00 pm"], "Thu": ["8:00 am", "9:00 pm"], "Sat": ["8:00 am", "9:00 pm"], "Wed": ["8:00 am", "9:00 pm"], "Tue": ["8:00 am", "9:00 pm"], "Sun": ["8:00 am", "9:00 pm"], "Fri": ["8:00 am", "9:00 pm"]}, "price": "$", "categories": [["Mexican", "mexican"]], "address": ["2863 E 95th St"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Wi-Fi": "No", "Accepts Credit Cards": "No", "Noise Level": "Loud", "Delivery": "No", "Outdoor Seating": "No", "Alcohol": "No", "Caters": "Yes", "Takes Reservations": "No", "Attire": "Casual", "Waiter Service": "No", "Good for Groups": "No", "Good for Kids": "Yes"}, "category": "Restaurants", "number_of_reviews": "9"}, "momax-zac-grocery-store-and-meat-market-chicago": {"comments": {"0": {"description": "The other day I took a different route on my way to get gas in Indiana.  Rather then taking the 100th st bridge, I decided to take the 106th st bridge.  On my way I saw a sign advertising tacos two blocks away.  I was pretty excited and took note to try and pay them a visit.Today was that day!  I love tacos and I'm always happy to try a new place.  I stopped by for lunch since I was working from home for a bit and had an empty fridge.It was a short walk to the spot.  When I arrived I was a bit confused.  I then realized that this was a grocery store that sold tacos.  I also noticed that it under new management; I never even knew they where there under old management ;pSo I entered and looked around, and was confused again.  This really is a small place, and there weren't any patrons.  I pretended like I was grocery shopping until I realized the meat counter in the back.  Still pretending to shop I picked up a fresh package of El Milagro tortillas.  Good sign... the best tortillas, and they were fresh.The shop keepers were busying doing thing, so they didn't really pay me much mind.  It was then that I saw the \"Se Hace\" sign with a list of foods they prepared.  So I asked if they made tacos and placed my order.I ordered two asada (steak) tacos and one pastor (seasoned pork); they didn't have any lengua (beef tongue) even though it was advertised. :(  They they didn't have any lengua I was happy to see that the cook was pulling fresh meat from the meat counter.  I waited as my tacos were freshly prepared for me; which did take some time.Since this is a grocery store there isn't any seating, but I wasn't planning on eating there. I rushed home to enjoy my lunch.  The tortillas were doubled up and the tacos varied in proportions.  I think the asada wasn't measured out equally; that's all.  I ordered my tacos with everything which meant lettuce, tomatoes, onions and cilantro.  All of the ingredients were very fresh!At a glance, on the grocer end of things, they stock your basic staples along with vegetables and dry beans.  The meat counter has asada, pastor, chicharones, chicken and beef milanesa, and possibly more.  They also sell many of the Mexican spices and candies and snacks, along with pan dulce and churros.Overall, I enjoyed the tacos. They had that homemade feeling to them.  I didn't quite care for the cuts of meat; that is they were a bit 'chunky' for my taste... I like my asada and pastor cut in smaller chunks.  I'd definitely go back... for tacos and the occasional corner store grocery run.", "rating": "3", "date": [2010, 5, 6]}}, "neighborhoods": ["South Deering"], "latitude": 41.709763, "longitude": -87.551895, "rating": "3.0", "times": {"Mon": ["7:30 am", "9:00 pm"], "Thu": ["7:30 am", "9:00 pm"], "Sat": ["7:30 am", "9:00 pm"], "Wed": ["7:30 am", "9:00 pm"], "Tue": ["7:30 am", "9:00 pm"], "Sun": ["7:30 am", "9:00 pm"], "Fri": ["7:30 am", "9:00 pm"]}, "price": "$", "categories": [["Mexican", "mexican"], ["Grocery", "grocery"]], "address": ["10203 S Commercial Ave"], "attributes": {"Attire": "Casual", "Waiter Service": "No", "Take-out": "Yes", "Good for Groups": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "No", "Good for Kids": "Yes", "Takes Reservations": "No"}, "category": "Food", "number_of_reviews": "1"}, "hienies-shrimp-house-chicago": {"comments": {"29": {"description": "Kick A** chicken here, unless your familiar with the east side I wouldn't recommend coming here at night. That being said the chicken rocks and the sauce has a cult following on this side of town. I buy it by the gallon and put it on EVERYTHING. If your not a chicken kind of guy I feel sorry for you but there are other things on the menu which are still very tasty, the fried shrimp is one of them although make no mistake this place is all about the pollo, so get some and don't forget the sauce!!!!", "rating": "4", "date": [2012, 7, 20]}, "42": {"description": "Kind of gross fries, interesting sauce and kick-ass chicken. Really kick ass chicken, maybe even the best in the city. Yuuup. And I have certainly partaken in a piece or two of fried chicken.... The chicken is screaming just-fried hot, moist and juicy and the crust/skin is salty, crunchy and great. And the secret to their secret is no secret, it's posted on a handwritten sign on the wall: \"To whom it may concern: All Hienie's food is cooked in an animal + vegetable blend of grease. Thank you.\" No Hienie's - thank you. The sauce is what people usually really go crazy about here - it tastes kind of like a mixture of Frank's Red Hot and mustard, which might be an acquired taste admittedly, but it is pretty tasty - honestly though, the chicken needs very little on it other than my mouth - people buy the sauce here literally by the gallon jug. The fried shrimp is pretty decent, too, and there are always a bunch of people there getting their fix. Basically it's just one of the best things in the whole wide world - a crappy little divey place that is really good at doing what they do. AND that takes cards, too.  Tip o'the day - buy more than you think you could ever eat and eat it there - screaming hot out of the fryer stuff can get soggy on the ride home otherwise.A little side story if you will:I was at a little farmer's market in Schererville, Indiana a few weeks ago (yes, sometimes that is the way I roll...) and there was a stand selling something called something like \"Chicago style hot sauce\", or something like that, and they pretty much admitted that they basically jacked Hienie's sauce. Admitted it proudly too.  So basically this is some junk on the undercover food-likers dl radar and now I'm telling you too, so enjoy yourselves.", "rating": "5", "date": [2009, 9, 22]}, "23": {"description": "Ethereal fried chicken quick fried from an angry-looking vat of boiling oil and topped with safety-cone orange colored hot sauce. Try it.", "rating": "5", "date": [2013, 11, 25]}, "47": {"description": "Big meaty shrimp.....*drools*  These are the best.  I could eat them every day.  One of my favorite places.The place is always busy.  Everything else on the menu is great too.", "rating": "5", "date": [2007, 4, 15]}, "8": {"description": "Absolutely ridiculous!  The fried chicken is the best I've ever had. Absolutely incredible.  I can't speak for the service as I had these wings at a party but wow. Completely blown away.  I didn't even have any of the sauces on the wings.  I highly recommend!!", "rating": "5", "date": [2015, 6, 6]}, "31": {"description": "I may have to wear dark glasses to hide would-be attackers after this review but I've got to speak the truth. Ewwww - the chicken was not crispy and super greasy! The fries were soft and flavorless. I tried their shrimp once before and while it was 'fine', I would much rather head over to Calumet Fisheries for my fix. For yummy delicious chicken, pack an overnight bag and trek ALL the way up North (lakeview I think) to Crisp.", "rating": "1", "date": [2011, 12, 30]}, "34": {"description": "My mom's family is from the South East Side so like many here growing up with Hienie's was a big part of our life.  I still love this place. The chicken and the ocean perch are so good.  If I were to pick a last meal, hienie's chicken and perch would definitely be it!!  I love the orange sauce.  I can drink this sauce straight.", "rating": "5", "date": [2011, 6, 16]}, "16": {"description": "Sketchy location, but the food is so good.  Who doesn't love some fried chicken and the best hot sauce EVER?!", "rating": "4", "date": [2014, 8, 25]}, "13": {"description": "This place use to me really good, but it has gone down hill in the last 2 years.  I have gotten sick twice from their food, and I have had to throw it away all together.  The fish was sour and smelled rancid, and the fries were moldy.   I ordered a chicken breast dinner, and the meat tasted freezer burn and old.  I believe they are defrosting it and refreezing it a few times.   I used to love Hienie's.  Unfortunately, I do not enjoy getting food poisoning so I will no longer be going here.  I would advise anyone to smell and check over their food thoroughly before consuming.  Otherwise, you are going to face one horrible stomach ache.", "rating": "1", "date": [2015, 9, 7]}, "11": {"description": "The fried chicken is freakin amazing!  Crisp delicious skin, and juicy dark meat (if you order dark meat).  Some of the best fried chicken I ever had!  The shrimp is large, crunchy, and fresh.  The sauce is really good and they make it in house.  The downside is the cole slaw is just Kraft.  The fries are alright nothing special but Mcdonalds like.  The biscuits are just Turano buscuits, you can even see them remove them from a Turano package, butter is not included with the dry biscuit.  I really wish this place had home made cole slaw, and at least used pillsbury biscuits that are soft.  O well the main attraction is the chicken and shrimp and that is all they need to blow me away, the side items are just filler items, don't focus on those.", "rating": "5", "date": [2013, 12, 15]}, "39": {"description": "I was surprised that there were no reviews for Heinie's and that it didn't appear to exist to yelp. This place is a staple on the south east side and it's got to have some of the best chicken. They fry when you order so it's nice and hot. The sauce is great and the fries are pretty good to. You can also get a slice of pizza. It's not bad and I usually get one while I wait for my chicken to get done. They also have daily specials. They're open nice and late so I can make it there after I get off from my second job. Be sure to check them out next time you're that far south.", "rating": "5", "date": [2010, 1, 17]}, "37": {"description": "Made the drive again.  My previous review stands.  Good chicken, but not necessarily worth the drive.Don't forget to ask for your chicken \"old style.\"", "rating": "4", "date": [2010, 3, 31]}, "0": {"description": "The chicken and perch is the best in the area.The place might look a little rough but the food is great. I would recommend it to anyone.", "rating": "5", "date": [2016, 1, 8]}, "38": {"description": "What better place to make my first review for than good ol' Hienie's! Since moving to the East Side, this has become a staple for fried chicken at my house. As it's been noted on here already, as for it \"Old Style\" and get the staple for hot sauce in the East Side commonly known as \"Hienie's hot sauce.\" The chicken is nicely seasoned and breaded like great fried chicken should be. Well the fries aren't \"all-that\" but they make a good complement. Oh, and you may want to invest in getting a gallon of that Hienie's hot sauce, it's perfect with their chicken just as it's awesome on pizza and of course chips! All in all, this place is awesome.", "rating": "4", "date": [2010, 2, 8]}, "27": {"description": "Where can I find something fried in this hood? Answer : \"everywhere\". Pretty good food though. I just started a new job down the street so I am sure I will be back, but man I wish they had something fresh on the menu. This area is really a food wasteland with mainly trucks driving though and gangbangers running around pulling their pants up. It's a lot like a Harold's chicken type place. Inside, there is an ENORMOUS counter to take your order at and 3 booths to sit in. I got the 1/2 lb of fried shrimp and fries with their hot sauce. I did not know a half lb of shrimp is 5 shrimp. Also, pretty sure their sauce is hot sauce, mayo and mustard. But I ain't tellin. It wasn't bad, the fries were actually pretty good, but just know, every time I check in here, I am gaining 4 lbs of cholesterol in my aorta.", "rating": "3", "date": [2013, 1, 27]}, "32": {"description": "I'm going to go ahead and get the embarrassing and frightful thing out of the way right now...  I'm not all that big of a fan of Hienie's hot sauce.It's without a doubt unique, flavorful, and probably well-balanced to be considered great- but the mustard flavor of it makes me long for other hot sauces.Let's be clear though- I'm for sure in the minority when it comes to my opinion, because everyone that I've ever talked to about Hienie's hot sauce loves the stuff.*Supposedly Depeche Mode tried out Hienie's chicken and signature hot sauce back in the late '80's and was instantly inspired to write \"I Just Can't Get Enough.\"Despite my 'meh' attitude with their sizzauce, there's no denying Hienie's can fry up a bird with the best of them.  Their dry chicken (unsauced) is about as good as it gets.  Nice crispy crust.  Beautifully tender and juicy flesh.  Comes out piping hot to order.  Just delicious!I implore you all to go ahead and try out this unique sauce of theirs.  You'll probably love the stuff, like the majority of people out there.  One thing's for sure though- even if you don't like the sauce, you'll love the chicken on its own.*This may, or may not be factual.", "rating": "4", "date": [2011, 11, 5]}, "44": {"description": "Yep Hienie's. 5 stars all the way! I even have one of your tshirts. I'm a huge fan. So unless you've had their hot sauce you'll never understand. I know that Harold's is how Chicago rolls for cheap fried chicken, but that's because Hienie's hasn't whored themselves out to every other street corner. You have to go aaaaalllll the way to the east side. It's worth it. Trust. The chicken is crispy and juicy all at once. I know you're sayin 'Emily, that's to be expected. Why the hell do I have to drive all the way to bufu for some chicken?' Well, it's because of the sauce. The hot sauce here is ridiculous! It's a south east staple that is also killer on Doritos. I'm just sayin. Make sure you also get some scrimps and a slice. All wonderful. OOH - and if you go on Wednesday - it's half price shrimp. HOLLA!Ooh, and Tina B., if you're reading this? This joint should be on the fried chicken crawl.", "rating": "5", "date": [2009, 5, 28]}, "24": {"description": "I must admit chicken was pretty good. Mild sauce was great. Hit the spot. Will go again.", "rating": "4", "date": [2013, 4, 17]}, "7": {"description": "Great place for chicken and shrimp. The location itself is not in a good area but the food is outstanding. You can dine in or carry-out. They also offer delivery and have catering as well. The specials they run on a daily basis are very reasonable regarding price. Their delivery service is always on point as well. They take pymt by phone if needed as long as you show your card upon delivery. Tip: not a good place for dining in", "rating": "4", "date": [2014, 11, 5]}, "40": {"description": "What can I say about the chicken that hasn't already been said?  BUT do get the chicken \"Old-Style\" and I don't mean the beer. And of course hot sauce too.  Their regular chicken is OK but sometimes can be disappointing.Good shrimp and perch. They now have chicken tenders.They have pizza by the slice or whole. It's pretty decent.On a down note they USED to have some pretty good sandwiches (beef, chicken, fish, etc ...).  But they have disappointed lately.We order from here about twice a month for our fix.  They do deliver too.", "rating": "4", "date": [2009, 12, 3]}, "30": {"description": "Amazingly Crispy chicken, good pizza, and outstanding hot sauce.  Where's the straw? I can drink the hot sauce by itself.  If your order is large little bit of a wait, but worth it.", "rating": "4", "date": [2012, 3, 18]}, "46": {"description": "Well what can I say... first of all I can't believe no one has yelped about this place yet.  It is truly a gem of the Eastside.  I grew up on this Hienie's Chicken and hot sauce.  It is a staple to everyone in area.We always order the 'Old Style' whole chicken which is battered and deep fried and served with fries, your choice of potato salad, coleslaw, or macaroni salad, a side of rolls and of course what many of us have renamed \"Hienie's Hot Sauce\" (Quality Brand Hot Sauce).One of my good friends was in the mood for fried chicken and I knew exactly where to take him. From the minute we called in the order I was excited, I don't know if it was because I was getting Hienie's Chicken or if it was because I was spreading the word about this amazing place.Along with our chicken we purchased a gallon of Quality Brand Hot Sauce for $7 and a 1 liter of Grape Crush.  After equally dividing the food I showed him how we do it.  I poured the hot sauce over a hot crispy drum stick and dug in.  From there it was silence as we smothered our chicken and dipped our fries with the hot sauce washing it down with our cold grape soda.  No chicken I've ever had (except my Abuelita's Puerto Rican Fried Chicken) has ever tasted so good.In a nutshell, get the chicken \"Old Style\" and be sure to allow about 20 mins for them to cook it.  We made the mistake forgetting to ask for \"Old Style\" once and weren't too happy.  I'll have to try it again.  The potato salad is probably the best choice of the sides.  And don't forget to call ahead as, they are always busy since everyone loves their chicken.Oh, and get a bottle of hot sauce. It's great on Jay's Potato chips... another South Side/East Side tradition.", "rating": "5", "date": [2008, 12, 8]}, "1": {"description": "Chicago is a big city!  Today we were in...far south side of the Chi-town, but it's in a freak' remote part of Chicago that I rarely touch her footprint.  In the middle of nowhere, we saw an \"angry bird\" graffiti.  Yes, it's the logo for Hienie's Shrimp House.  Honestly, whatever we saw really resembled the famous angry bird (lol).  The entire location is very hole-in-the-wall, with a doubled-caged entrance.  Nevertheless, we were hungry, so as much \"hood\" we were witnessing it wouldn't stop us.  Hubby kindly inquired the young man behind the counter if a credit card would be accepted.  The answer was positive.  Thank you, Lord, because there was no other decent place nearby in the South Deering neighborhood, and I would like to continue my life...We both ordered the Perch dinner ($5.50, Monday's special).  The food came out very fast, within five (5) minutes.  We soon \"fled\" the area and were well on our way home (I exaggerated...it is an industrial \"hood\".  Hey, this is Chicago...don't let Al Capone ridicule me, please),  The combo came with about half-pound worth of fried perch, fries, one (1) dinner roll, and coleslaw.  The fried perch was delicious.  They utilized the \"blue-collar\" breading, meaning that nothing was special about the breading but the taste was down-to-earth yummy.  Ladies and gentlemen, I just made that term up.  Thank you very much.  The hot sauce was very, very spot on!  They offered an abundant amount of food for $5.50.  I know the Big Mac combo in a McDonald's will cost more.  The only minor complaint was the dinner had an awfully large amount of fries and I was mighty thirsty afterward.  Well, that was ok though.  I'm a big kid, and I could bear with that tiny discomfort.  Other than the shadiness I mentioned in the first couple of paragraphs in my review, there was nothing wrong with the joint.  If you're coming from the Indiana and experiencing some sort of hunger on the way back to the city, stop here if you dare.", "rating": "4", "date": [2014, 12, 8]}, "9": {"description": "I grew up on this place and drive out of my way to come here from Indiana.  Best chicken I've ever had!  I make sure to get it \"old style\" with hot sauce.  I also buy their \"Quality Brand\" hot sauce by the gallon from the local Mexican stores and put it on virtually everything.  If I could say 1 thing, their Orland location has much better French fries.  The pizza is also surprisingly above average.  Good job!", "rating": "5", "date": [2014, 8, 17]}, "26": {"description": "Food is good , workers are polite, Will return and put the word out nice fast food spot.", "rating": "4", "date": [2013, 3, 18]}, "25": {"description": "Fire! And relatively inexpensive ..the chicken and skrimp are good than a mugg.", "rating": "5", "date": [2013, 4, 8]}, "12": {"description": "how this crap hole stays in business is beyond me...It would appear that they take extreme pride in employing functional illiterates to service their valued customers....it is now on my official list of places that I will never patronize again.I was shorted on one half of my order and when I brought it to their attention, the kid behind the counter said \" I dunno what happened to your food, maybe I give it to someone else\"..after searching for my order, it was remade but not without attitude...Well never really liked the place anyway.", "rating": "2", "date": [2015, 4, 2]}, "21": {"description": "The fried chicken is freakin amazing!  Crisp delicious skin, and juicy dark meat (if you order dark meat).  Some of the best fried chicken I ever had!  The shrimp is large, crunchy, and fresh.  The sauce is really good and they make it in house.  The downside is the cole slaw is just Kraft.  The fries are alright nothing special but Mcdonalds like.  The biscuits are just Turano buscuits, you can even see them remove them from a Turano package, butter is not included with the dry biscuit.  I really wish this place had home made cole slaw, and at least used pillsbury biscuits that are soft.  O well the main attraction is the chicken and shrimp and that is all they need to blow me away, the side items are just filler items, don't focus on those.", "rating": "5", "date": [2013, 12, 15]}, "17": {"description": "Great chicken.  The old school orange sauce is a must.  An oasis in the neighborhood.", "rating": "4", "date": [2015, 4, 20]}, "10": {"description": "It was my favorite place to get seafood especially the shrimp. I don't know what they did but it is God-awful. Tried it a few more times only to be disappointed. They lost a long time customer , now I just get my seafood from Calumet Fisheries and Capri's.", "rating": "1", "date": [2014, 11, 6]}, "5": {"description": "Have not eaten here in a while, due to my move to Dallas.  It came up on my feed.  I love this place.", "rating": "5", "date": [2015, 10, 3]}, "3": {"description": "I'm from South Deering and I grew up eating here. The chicken is by far the best thing on the menu. It's crispy on the outside and tender and juicy on the inside. Whatever you order, you must try it with the heinies hotsauce. Talk about delicious. This place is small and not the nicest restaurant in the world, but the food is always fresh and yummy.", "rating": "5", "date": [2015, 11, 23]}, "35": {"description": "Okay, so I grew up eating Hienie's Chicken -- and that is what is was called in the 1970s.I've lived in Cali on and off for around 20 years. A friend of mine used to take a gallon jug of the hot sauce to his family in Cali which they relished like a pot of gold. He'd save some for me - and everyone I let try it thought it was the best they ever had.Now I live north, but when I'm around the south side, I think of ordering Hienie's when I can.A couple of month's ago, I found myself staying with friends on the South/East side who did not have a stocked fridge. So I was gonna order some Hienie's, but I really wanted a salad with my meal. Call me crazy.So I have my friend's teen call and see if they have salad. They hung up on him! I don't know if they thought it was a prank - but how rude! Guess it's funny -- but how rude!I didn't order from them -- because apparently they didn't have any salad to go with the chicken.I just wish that I could find that sauce without having to take a road trip to the south side! Closest thing I can find to it is a hot wings sauce, but it's never quite the same.Still, their chicken rocks -- in any case. But for God's sake, don't ask if they have any salad!", "rating": "4", "date": [2010, 12, 13]}, "19": {"description": "Shrimp are great !! Hands down! On Wednesday 's they have a shrimp special.. One of the best shrimp I had tasted in a long time !! ENJOY!!", "rating": "4", "date": [2014, 9, 23]}, "28": {"description": "I hadn't been to this place for years and years. So it was like trying it again for the first time.  It reminds me of your regular Harold's chicken.  I saw this place on TV in which they focused on the shimp. So I decided to check them out based on the TV show.  But after reading the reviews here on Yelp, it seemed that the chicken was the way to go.  I ordered a 2 piece white with the sauce on the side. (my motto: If you can't fry good chicken without putting sauce on it, then it ain't good chicken.)  The chicken didn't taste anything different than what I would get at Harolds. After reading the reviews I thought I was in for a real taste explosion. NOT!  The fries werent all that great. They don't salt the fries after they come out of the fryer. So they were kinda bland.  The thing I do agree with is the mild sauce. It's pretty tasty, and I can see where the affection comes from when the sauce comes into play.  Oh wait a minute, I forgot about the hard ass roll that came with it. Yuk! Gimme Harolds with a couple slices of plain ole white bread.5 wings, mild sauce, salt and pepper please.  Harolds all day long.", "rating": "3", "date": [2012, 11, 15]}, "45": {"description": "My friend took me here for the first time.  I've never heard of the place, but I guess it is legendary on the east side (been around since 1947). Everything is cooked to order so call ahead!  The chicken out of this place is spec-fricking-tacular.  I guess the way to order it is 'Old Style' (which we did).  The meat was super juicy and awesome and the skin was crisp and tasty (even after sitting in the bag on the drive home!).  Another great reason to go there is the hot sauce!  I had never had it before but it is great!  We had four 1 oz cups with our whole chicken and it was plenty!I'm sure everyone on the south side knows about this place, the place was bustling!  Almost everyone had called ahead the order so there wasn't much waiting.This place is out in the boonies, but if you are in the area, and want to try some of the best fried chicken you've ever had, please don't hesitate to stop by this place, you won't be disappointed!I'm sitting here salivating, remembering the chicken and hot sauce writing this review!", "rating": "5", "date": [2008, 12, 8]}, "33": {"description": "I. Love. Hienie's! They have the best chicken... dare i say its better than Harold's? The mild sauce is amazing, the chicken is flavorful, the fries are great. Can't go wrong with this place at all!", "rating": "5", "date": [2011, 10, 18]}, "43": {"description": "Boy this Yelp.com has really made my day.  For many years I always wanted to tell the world about this eatery.  I've seen the 4 reviews and I totally agree.  Hienie's is a well kept Secret on the South and East Side.  The Chavez family is rather huge and grew up in the South Chicago/East Side/South Deering/ Hegewisch Neighborhoods.  I'm the oldest and Hienie's has been around for as long as I've been alive.  At least since 1947.  My Grandfather's restaurant used to be Hienie's competition on Mackinaw.  Hienie's is a stable of LIFE in South Deering, and their Hienie's Hot Sauce has made them famous.  Lent Season is always busy for them.  But then again, it's seems always busy.  The different Fried Fish, Catfish, Lake Perch, Ocean Perch and I think Walleye are also very good.  Try the Fish Combo Dinner, 1/2 lb. of Ocean Perch and 1/2 lb. Shrimp.  Hot sauce comes \"ON\" or \"On the side\".  Grab a six-pack from a Liquor Store and head for Calumet Park, due East about 1 1/2 miles, catch a Soccer Game and you will understand what heaven really is.", "rating": "5", "date": [2009, 7, 25]}, "2": {"description": "Don't get nervous when you see them grab your chicken out of the warmer which looks like a refrigerator. It's the most juiciest, freshes chicken around.", "rating": "4", "date": [2015, 11, 21]}, "18": {"description": "I grew up on this food as a Sunday after church treat. My personal advice:  buy a jar of thier hot sauce and every once in a while grab some Cool Ranch Doritos and squirt some hot sauce on it.", "rating": "5", "date": [2014, 7, 13]}, "41": {"description": "I've never heard this place referred to as hienie's shrimp house, only hienie's chicken. Because the chicken is awesome. The neon orange hot sauce is a southside staple. Many a family get together has been fueled by trays, nay, crates of chicken, tasty crinkle fries, a little breaded shrimp and lake perch. If you're ever down here, make this place a priority stop.", "rating": "5", "date": [2009, 10, 31]}, "4": {"description": "This is a childhood favorite.   I have had a large number of the menu items, never a disappointment.  The signature sauce is the standout here.  It goes well with the seasoning on chicken, fish or any of the other fried treats. A must have!", "rating": "5", "date": [2015, 4, 15]}, "6": {"description": "This is the best chicken I've ever had in my life. If you like heralds this beat it try their South Chicago mild or hot sauce it is the best. Although it looks ratchet in there its still beats any chicken I have ever had I take all my friends here and they say it is better than Harolds.", "rating": "5", "date": [2015, 5, 27]}, "22": {"description": "Great Chicken! Great Hot Sauce!Fries? Cold & SoggyInside? A total dump Prices? A bit steep for areaI would def go back just for the chicken & hot sauce/ take it TO GO! Get Dat Did", "rating": "3", "date": [2013, 12, 10]}, "15": {"description": "Never in my life will I go back here...took almost a half hour till I had to ask where my food was. They said 'we are waiting on your pizza slice'...but gave out 5 to customers after me...then I get the 'well it's busy' & 'I didn't take care of you'...let's put the blame on our co workers shall we? It's nice to know that when you have a half hour for lunch you'll need to spend it waiting for your food here...Zero stars", "rating": "1", "date": [2015, 9, 16]}, "20": {"description": "I have been here twice to partake in the chicken wings. I must say the batter is nice and crunchy. The chicken was cooked quickly and still hot when I arrived at home. I enjoyed the chicken and the mild sauce was very tangy. The only complaint I have is the chicken could have been fried a little harder. On my second visit, I ordered a slice of pizza as well. The pizza was average. It appears they could have seasoned the pie a bit more. There was an ingredient I could not identify that made the pie slightly bitter.  This establishment offers quick eats at an affordable price. I think the chicken is worth the trip.", "rating": "4", "date": [2014, 7, 2]}, "36": {"description": "First off. Let me start by saying that Hienie's Shrimp is an INSTITUTION on the Southeast side of Chicago. If you grew up and live here, you think HIENIE'S when you want some good fried chicken or shrimp. Anyone from this area can recall hangout sessions with family or birthday showers or babyshowers all catered by HIENIE'S.The chicken: moist, fresh, and piping hot and fresh out the fryer homemade deliciousness. Golden brown, crisped to perfection, slightly season skin that hugs the tender, juicy meat! A heavenly piece of chicken carcass. The shrimp: plump, crispy shrimp that's battered and fried to PERFECTION. Each piece is ready to be dunked to one of their savory sauces. Another piece of cholesterol heaven. THE PIZZA BY THE SLICE: So delicious. Huge slice. But DEFINITELY get when it's fresh out of the oven. If not, and I quote my co-worker when I say this, \"your toilet seat will never forgive you.\" Don't let them trick you into buying two old slices for the price of one.THE INFAMOUS HIENIE'S HOT SAUCE: Don't be alarmed. It's SUPPOSED to be orange. Just like Hienie's..this sauce is also an institution on the Southeast side! We put it on EVERYTHING: french fries, chips, chicken, pizza, etc. You cannot eat Hienie's without giving your food a bath in Hienie's Hot Sauce. Yummm...(p.s. I'm the creator of a MySpace page that pays homage to Hienie's Hot Sauce...lol)Try this place...IT'S A SOUTH CHICAGO CLASSIC!!", "rating": "4", "date": [2010, 7, 21]}, "14": {"description": "Great Chicken! Great Hot Sauce!Fries? Cold & SoggyInside? A total dump Prices? A bit steep for areaI would def go back just for the chicken & hot sauce/ take it TO GO! Get Dat Did", "rating": "3", "date": [2013, 12, 10]}}, "neighborhoods": ["South Deering"], "latitude": 41.7066100984812, "longitude": -87.5595995038748, "rating": "4.0", "times": {"Mon": ["10:00 am", "11:30 pm"], "Thu": ["10:00 am", "11:30 pm"], "Sat": ["10:00 am", "12:30 am"], "Wed": ["10:00 am", "11:30 pm"], "Tue": ["10:00 am", "11:30 pm"], "Sun": ["10:00 am", "11:30 pm"], "Fri": ["10:00 am", "12:30 am"]}, "price": "$", "categories": [["Seafood", "seafood"], ["Chicken Wings", "chicken_wings"]], "address": ["10359 S Torrence Ave"], "attributes": {"Parking": "Private Lot", "Take-out": "Yes", "Bike Parking": "No", "Wi-Fi": "No", "Accepts Credit Cards": "Yes", "Noise Level": "Quiet", "Caters": "Yes", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Waiter Service": "No", "Good for Kids": "Yes", "Attire": "Casual", "Wheelchair Accessible": "Yes", "Ambience": "Casual", "Has TV": "No", "Takes Reservations": "No", "Good for Groups": "No", "Good For": "Lunch, Dinner"}, "category": "Restaurants", "number_of_reviews": "48"}, "americas-best-contacts-and-eyeglasses-chicago-13": {"comments": {"1": {"description": "So, I get 2 pairs of glasses plus the exam for $69.95, huh?  Damn, that's too good to be true!  I'm thinking, this has to be bait and switch, bigtime.  And yes, it was.   The catch, you ask?  Well, they will give you 2 pair + the exam for $69.95 but your prescription has to fall into their set of terms.  First off, for the $69.95, you must  be willing to accept single vision with plastic lens.  And get this, the lens will protrude out of the frame, making you look like a classic 1980's nerd if you were to purchase them.   Now, if you want to \"modernize\" your look, this is where the extra moolah comes in.   Of course they don't mention all of this on the phone, it's all a ploy to get you into the store.   There's also a \"protection plan\" that you're advised to purchase, geared at separating you from even more money.  Lastly, there's a optional $15.00 special exam fee that supposedly will tell you if you're at risk for diseases and blah blah blah...   Long story short, don't go into this place expecting you'll get 2 pair of glasses for $69.95.  All told, expect to spend over $200.00 - $300.00 in this place.Oh, and the store on 95th street in Chicago is ok.  Very clean and modern with most of the employees being professional.  It was just the bait and switch tactics and the attempted additional add-on fees that turned me off.", "rating": "2", "date": [2012, 4, 13]}, "0": {"description": "Very professional location!", "rating": "3", "date": [2010, 10, 3]}}, "neighborhoods": ["South Deering"], "latitude": 41.7223869068393, "longitude": -87.5810962711639, "rating": "2.5", "times": {"Mon": ["9:00 am", "7:00 pm"], "Thu": ["9:00 am", "7:00 pm"], "Sat": ["9:00 am", "6:00 pm"], "Wed": ["9:00 am", "7:00 pm"], "Tue": ["9:00 am", "7:00 pm"], "Sun": [], "Fri": ["9:00 am", "7:00 pm"]}, "price": "$$", "categories": [["Eyewear & Opticians", "opticians"], ["Optometrists", "optometrists"], ["Ophthalmologists", "opthamalogists"]], "address": ["1753 E 95th St", "Suite B-100"], "attributes": {"By Appointment Only": "No", "Accepts Credit Cards": "Yes"}, "category": "Shopping", "number_of_reviews": "2"}, "chans-chinese-kitchen-chicago": {"comments": {"3": {"description": "Veggie lo mein was awesome but the owner did not give us coke can's coz he did not want to take credit card. Small place", "rating": "3", "date": [2013, 12, 26]}, "1": {"description": "I think I been to this location at least five times and I can honestly say that some of there foods are a hit or miss. The people at the counter is always a friendly. Its a decent place to go for fast Chinese food.", "rating": "3", "date": [2016, 2, 27]}, "2": {"description": "This was a pick up order. The chicken fried rice is phenomenal. Pad thai is 7/10 and curry chicken 6/10. Even though I am not giving a very high rating to the food because of my taste I do think it is good quality, it's just that if you compare the curry chicken with a place like golden tai, there is no competition. Would aim for the shrimp fried rice next time!!!!!!!", "rating": "4", "date": [2015, 8, 16]}, "0": {"description": "Friendly owners and pretty funny! Food is amazing for the price you pay. They had no potstickers but they explained why. Funny reason but I had a smile and left content. I will be back as soon as possible.", "rating": "5", "date": [2015, 2, 22]}, "4": {"description": "A great place to come for decent Chinese food for lunch time.  All of the lunch specials are about $5 and the portion size is rather large.  Plenty of left overs.Everything is made pretty fresh to order, and because of that, I would recommend calling ahead to put in your order if you are carrying out.  While there are little tables set up so you can dine there, it can get quite cold, since the space is cold, and the door is opening and closing so much (it's busy here during lunch!).", "rating": "3", "date": [2009, 10, 29]}}, "latitude": 41.7225176095963, "neighborhoods": ["South Deering"], "categories": [["Chinese", "chinese"]], "address": ["1934 E. 95th Street"], "attributes": {"Take-out": "Yes", "Has TV": "No", "Accepts Credit Cards": "Yes", "Caters": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.5769875943661, "category": "Restaurants", "rating": "3.5", "price": "$", "number_of_reviews": "5"}, "dots-chicago-8": {"comments": {"0": {"description": "I really enjoyed this dots the way they had it set up and the customer service was great!!!They greet you when you enter the store!  They ask if there is anything they can do to help you find what you are looking for and that should be a given but all stores don't do that and this one does!This is another one of those disposable clothing stores with a great price point for trends.I mean really who wants to invest their money in trendy clothes that will go out of style in a month or two!!!", "rating": "4", "date": [2012, 10, 15]}}, "latitude": 41.7223077267408, "neighborhoods": ["South Deering"], "categories": [["Women's Clothing", "womenscloth"], ["Accessories", "accessories"]], "address": ["1631 E 95th St"], "attributes": {"Accepts Credit Cards": "Yes"}, "longitude": -87.5842805206776, "category": "Fashion", "rating": "4.0", "price": "$", "number_of_reviews": "1"}, "gusis-pizza-chicago": {"comments": {"1": {"description": "I tried Gusi's today in hopes of finding a replacement to another local pizzeria that has closed a couple years ago. I've heard many rumors that one of the cooks is now working here. I ordered a spinach stuffed pizza for delivery. The pizza got to me fast and warm. The initial presentation of the pizza was nice.  There was a generous layer of red sauce being held in place by a high wall of thick crust.When I served myself a slice I realized that the pizza wasn't as 'stuffed' as I thought it would be for a stuffed pizza.  I actually think that the non-stuffed pizza from all of the other local joints are thicker then their 'stuffed' pizza.The taste of the pizza was overall good, but it was far from the other place.  The taste of the crust was a bit off.  Taste almost like stale crackers.  I think it needed to be a bit thicker or perhaps made with more liquid ingredients.I'll definitely give them another try.  Next time I'll go for the thin crust, which I'm sure will be good.  My advise would be be to ask for double ingredients.  It really seemed about 1/3 the thickness of other stuffed/deep dish pizzas I've had.Oh and for those of you trying to find a replacement for you-know-whose, don't expect too much from this place.  They are different pizzas.", "rating": "3", "date": [2009, 2, 15]}, "2": {"description": "I ordered the deep dish from this place once and ill probly would never do it agian. Basically it was just a regular thin crust pizza with the crust drastically raised. The taste wasn't great either.  Other than that the regular pizza and the fries were pretty good, nothing to dance about.", "rating": "2", "date": [2010, 7, 18]}, "0": {"description": "I really enjoyed the pizza at Gusi's! The coupons came last week in the mail and we decided to give them a try. I called and ordered their \"Wednesday Special\" of 2 Large pizzas  with 1 topping for $13.99! I ordered a pepperoni and a sausage. It came in 30 minutes. That was pretty fast. The cheese was still oozing and the pepperoni was crispy on top just the way I like it. The crust was like a pan style but a little thinner. The sausage my husband says was  \"tasty\". The nice thing about Gusi's is that if you order a Large you get a FREE 2 liter!!! They also have chicken, buffalo wings, fries and rib tips.Another special is a Medium Pizza with 1 topping, 1 lb. Rib tips and Lg Fries for 15.99!The hours are M - Th 3 pm - 10 pm.Fridays and Saturdays until 11 pm.They take all major credit cards and tip the delivery guy $1 every time to make sure you get a timely response.", "rating": "4", "date": [2010, 10, 28]}}, "latitude": 41.70247, "neighborhoods": ["South Deering"], "categories": [["Pizza", "pizza"]], "address": ["10606 S Torrence Avenue"], "attributes": {"Attire": "Casual", "Waiter Service": "No", "Take-out": "Yes", "Wheelchair Accessible": "No", "Accepts Credit Cards": "Yes", "Good for Groups": "No", "Outdoor Seating": "No", "Alcohol": "No", "Delivery": "Yes", "Good for Kids": "Yes", "Takes Reservations": "No"}, "longitude": -87.55995, "category": "Restaurants", "rating": "3.0", "price": "$", "number_of_reviews": "3"}, "walgreens-chicago-61": {"comments": {"0": {"description": "It's an OK store... The store is clean and organized, but there needs to be more than one check out person at lunch time.  The line was over eight people long.", "rating": "3", "date": [2009, 3, 9]}}, "neighborhoods": ["South Deering"], "latitude": 41.7223396, "longitude": -87.5750885, "rating": "3.0", "times": {"Mon": ["8:00 am", "10:00 pm"], "Thu": ["7:00 am", "10:00 pm"], "Sat": ["7:00 am", "10:00 pm"], "Wed": ["7:00 am", "10:00 pm"], "Tue": ["7:00 am", "10:00 pm"], "Sun": ["8:00 am", "10:00 pm"], "Fri": ["7:00 am", "10:00 pm"]}, "price": "$$", "categories": [["Drugstores", "drugstores"], ["Cosmetics & Beauty Supply", "cosmetics"], ["Convenience Stores", "convenience"]], "address": ["2011 E 95Th St"], "attributes": {"Wheelchair Accessible": "Yes", "By Appointment Only": "No", "Bike Parking": "No", "Accepts Credit Cards": "Yes"}, "category": "Food", "number_of_reviews": "1"}, "sharks-fish-and-chicken-chicago-3": {"comments": {"1": {"description": "They have some of the saddest, most pathetic \"chicken\" wings I have ever seen.  Could they be pigeon or Cornish hen wings.  Who knows.", "rating": "1", "date": [2015, 12, 31]}, "2": {"description": "It's a shame.  I don't know what's up with this location, but I've been to other Shark's and haven't had such bad service.First, there's only two guys working.  Which normaly wouldn't be a problem, however, when you have a line of 7 people waiting on their order.  You might want to get off of your butt and start putting more food down.  Then, the order taker, which I assume is the owner, was not friendly at all.  It seemed as if he was doing me a favor by placing my order.  The young kid in back making the orders seemed to be decent.Apparently, they only make one order at a time.  7 tickets up to be made, several call ins, and they are COOKING 1 order at a time!  I ordered a 3pc wing dinner on my way to play Poker.  Thought I'd be in and out.  WRONG.  It took 30 minutes to leave with my order.  Mind you, there was only one person ahead of me when I placed my order!CHECK YOUR ORDER BEFORE YOU LEAVE!  Ok, we get back in the car heading to the Casino, girlfriend's driving of course, and open up my order and to my suprise there aren't 3 wings but 4 wings.  Ordinarily this would be a pleasant suprise.  Not so, these were 4 of the smallest wings I have ever seen in life!  They looked like chick wings!  No Joke!  The drumstick part had to be no longer than about 1 1/2 in.  My girlfriend wanted to turn around and take them back.  I didn't have the patience to wait another 30 minutes for more subpar cuisine.Never again!", "rating": "1", "date": [2012, 2, 1]}, "0": {"description": "This place is the reason the south side sucks. All fried crap that tastes the same, terrible. Gross hot sauce. White bread underneath it all. The owner is nice. They have every flavor of Faygo soda, and that is it. Quite gross.", "rating": "2", "date": [2013, 5, 21]}}, "latitude": 41.7224512249231, "neighborhoods": ["South Deering"], "categories": [["Seafood", "seafood"]], "address": ["2027 E 95th Street"], "attributes": {"Waiter Service": "No", "Has TV": "No", "Noise Level": "Quiet"}, "longitude": -87.574500516057, "category": "Restaurants", "rating": "1.5", "price": "$", "number_of_reviews": "3"}}